{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5199","title":"A Comprehensive Guide for Voiceover Artists","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Make money with your voice with this free online course that explains how to market yourself and your voiceover skills.","description":"Voiceover artists are usually heard but not seen. This course teaches you how to record high-quality professional voice clips to accompany audiobooks, video games, animation, commercial adverts and radio. We explain the difference between voiceover and voice acting and the roles of voiceover performers. We then show you how to plan your demo content and provide the best techniques used to promote your voice and impress more clients.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you ever wondered how voice actors can command the attention of a crowd for hours without losing their voice? This free online voiceover training course teaches you the skills and techniques used to motivate the audience in any recording context. We introduce you to the basics of voiceover performance and identify the qualities that define a successful voice actor. Learn how to turn your voiceover skills into a career.</p><p>The course breaks down the steps taken to understand your audience as you read and interpret scripts to make sure you deliver the copy effectively. We help you discover your unique voice and explain how to use it to create engaging and unique characters. We demonstrate how to breathe correctly to create a powerful voice and capture emotional expression. Do you ever feel like no one wants to listen to you? We cover voice training exercises designed to improve your ability to deliver quality performances. We root out bad vocal habits and speech problems and show you how to eliminate them.</p><p>We provide crucial tips for maintaining a healthy voice and explain how to set up your recording studio. We go over the steps used to set up the recording process and define relevant technical terms. Finally, we explore the UK’s voice acting industry to help you find rewarding opportunities to allow you to showcase your newfound skills. This voiceover course has no prerequisites and improves your resume and chance of establishing your professional value. Sign up to turn your voice into an asset and explore the exciting world of spoken performance.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}