{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5155","title":"A Comprehensive Guide to Creative Writing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the craft of storytelling to find your voice and become a creative writer with this free online course.","description":"Do you enjoy writing but find it difficult to structure your ideas into a compelling piece? This course takes you through the fundamental concepts and practices that separate creative and technical writing. We explain how to write engaging fiction and nonfiction across many genres and forms by developing a writing process that works for you and keeps you motivated and productive. Sign up to learn how to turn your ideas into published content.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Creative writing is the process-oriented form of writing that combines imagination and innovation to tell a story. The element of creativity sets your story apart from its counterparts in the same genre. Writing requires more than telling tales of fantastical settings thronged with unique creatures: it expresses your thoughts and feelings via a compelling and memorable story that engages your readers through character, language and plot. This course teaches you how to use your creativity to think a little outside the box and put a unique twist on things. Creative writing has many genres and subgenres and a set of established rules and practices that can help writers develop their own distinctive voices. We introduce you to these elements to help you get started with writing.</p><p>The most challenging element of storytelling is often the plot, which is in turn driven by engaging characters. We show you how to create plots with suspense, sentiment and sensation and explain how to keep them moving through interesting, tangible settings. The course then explains how to build complex, vivid and unforgettable characters with compelling dialogue and action. We also examine the tools used by poets to write verse. We compare creative fiction and nonfiction writing and lay out the techniques used to create novels, short stories, dramas, screenplays and memoirs. Are you familiar with the term ‘writer’s block’? It is something that all writers face while struggling to create new work during a creative slowdown. We will demonstrate how to overcome writer's block and come up with original ideas when creativity seems elusive.</p><p>The course then establishes the role of critical thinking to help you understand how technical writing differs from creative writing. We explain how to structure business proposals, letters, emails and meeting agendas. Writing is never complete unless published. The course walks you through the process of editing and evaluating text to meet publishing requirements and finally get your work out there. If you wish to explore your creativity and realise your dreams of becoming a writer, this course is for you. We provide the technical skills you need to turn your talent into published text using a unique writing process that breaks through writer’s block. Whether you have an idea for a novel or even a half-finished manuscript in a drawer, this course helps you to find your voice as a storyteller.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}