{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3823","title":"A Guide to Creating Stronger Melodies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Level-up your music compositions by learning about creating melodies and building tension with this free online course.","description":"This free online Guide to Creating Stronger Melodies course teaches you how melodies resonate deeply with the natural world. It delves into many lesser known aspects of music as it relates to nature and you will learn about the distinctive patterns in both trees and melodies, elements of rhythm, characteristics of smoke, types of muscle fibres, the concepts of consonance and dissonance and the differences between counterpoint and harmony.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A Guide to Creating Stronger Melodies is a free online music course that has been carefully crafted to teach you about different ways to pique your interest in music composition or improve your melody development skills. An analogy between the natural world and concepts of melodies will be examined in detail to give you a better understanding of this course. Some melodies have a long-lasting effect in our memories. You will be introduced to the relationship between rhythms and the human heartbeat and that the distinctive patterns on tree branches are similar to the pulmonary veins in our lungs. Prepare yourself to learn about the concepts and patterns of melodies. Just like legos are building toys, motifs are building blocks from which melodies are made. You will learn about the definition of motifs by famous composer, Arnold Schoenberg, as well as how motifs are combined together to create a phrase. Did you know that there are two elements of a motif? To give you better insights on these elements, you will learn about Beethoven’s motif style.</p><p>Turbulence is the most defining characteristic of smoke. Similar to smoke, melodies have turbulence and laminar flow. You will acquire knowledge on how they work when developing motifs and phrases. Are you aware that there are high and low melodies? You will be able to discuss the concepts of melodic turbulence, along with the differences between these melody lines in a simple way once you have finished this section of this music composition course. Muscles play an important role in every movement and action we take and muscles and music employ the same way of working in terms of how it exists between tension and relaxation. Unlike a muscle which has one way of building tension, are you aware that there are several ways of building tensions in a melody line? You will learn about the differences and features of these elements and others such as dissonance, consonance and the differences between major and minor chords. With the previous content forming a solid base of understanding, you will delve further into more complex concepts such as harmonic dissonance, the relationship between chord progressions and dissonant notes and an all-important theme known as syncopation. The next two similarities you will gain a deep understanding about is how muscles and muscle fibres relate to melody composition including how to create mild and strong dissonant tones, and how ocean waves and their overlapping nature are similar to the concepts of counterpoint and harmony.&nbsp;</p><p>If you have always had a penchant for music and want to learn some more music technicalities and theory to enhance your knowledge, appreciation and ability to apply this in composition, then this course is the perfect place to start. Whether you are studying music, in music production or composition, or simply a music enthusiast wanting to learn more about how music is systematically put together, then you should enrol for this comprehensive music theory course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}