{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/2930","title":"Advanced Diploma in Film Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the key concepts of cinema and analyze the work of major filmmakers in this free online advanced diploma course.","description":"Get a historical overview of cinema and study the work of major filmmakers and their contributions to movies in this free online course. The material covers the fundamental principles and practices in film-editing techniques, colour theory and canonical texts. You will study French, Italian, Japanese and American cinema and learn about auteur theory, expressionism and key concepts of different genres in cinema.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you ready to be introduced to film techniques, theories and movements in global cinema? You will study the different types of, and myths in, plots present in films, and how characters work as plot elements in cinema. The material then covers the great contributions of Soviet filmmakers Lev Kuleshov and Sergei Eisenstein in the field of montage editing. This course will cover critical theories about realism, such as the ideology from Marx’s theory of economics, and naturalism, such as Darwin’s ideas about nature. The course then describes the work done by important theoreticians of colour such as Rudolf Arnheim, David Bordwell and Raymond Edward Turner.</p><p>In addition, you will learn the key features of intertextuality, modernism and expressionism in cinema by studying popular movies such as ‘Citizen Kane’, ‘The Matrix’, ‘Casablanca’ and ‘Blade Runner’. This course will also give you an overview of the French, Italian and Japanese masters, and their contributions to cinema. Finally, you will learn about auteur theory, postmodern cinema, and the New Hollywood wave (also known as American New Wave or the Hollywood Renaissance).</p><p>This course is aimed at meeting the interests and needs of young career professionals who want to develop a deeper understanding of different genres and theories of cinema, and for arts students who wish to improve their knowledge of film theory. If you start this course now, you can improve your understanding of key elements of cinema today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}