{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/2227","title":"Advanced Human Behavior - Personality and Cognition","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study aspects of the human behavior from cognitive processes of personality and cognition from this free online course.","description":"Advanced Human Behavior - Personality and Cognition is a free online course that will enable you to understand some important aspects of the patterns of human behavior. Learn about advanced cognitive processes from personality theories, cognitive dissonance, and patterns of human behavior in social influence and cognition. Start this course today and improve your knowledge of advanced psychological processes.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Advanced Human Behavior - Personality and Cognition is a free online course that will expose you to important details in the science of human behavior from some advanced human cognitive processes. This course will help you discover requisite theories and models of the human behavioral system. First, you will learn about opposing perspectives on personality such as the interactionist perspective and Freud's psychoanalytic theory of personality.</p><p>Then, you will study various theories of personality including the humanistic theories and trait theories. You will also discuss the scientific methods of measuring personality. Next, you will learn about social psychology, social thought, and the effects of counterfactual thinking. You will also study the elements of attribution and the sources of bias. Finally, you will discuss the cognitive approaches to persuasion, social behavior, and various forms of social influence in understanding patterns of human interaction.</p><p>This free online course offers an extensive guide of the advanced processes of personality, social influence, and social cognition in human behavior, including the mechanisms of these human cognitive processes. This course will be of immense interest to students, researchers, health professionals, psychologists, and anyone with an interest in understanding advanced human psychological processes. Start this course today and improve your knowledge of advanced cognitive processes.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}