{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3358","title":"Anti-Bullying Training","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the roles and responsibilities parents and teachers have in identifying and preventing bullying.","description":"This course will provide useful information and basic tools for parents and teachers to address bullying. You will understand why it is such a pertinent issue and recognize that all children involved need help – those who are bullied and those who bully. You will also learn about cyberbullying and the relevant legislation. In this course you will learn how to protect children from self doubt and suffering in the context of incidents of bullying.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Why is bullying such a complex issue? What happens in the mind of a child who is being bullied - or is a bully - and how does it affect their future behavior? How do you know if your child is a bully? How do we address this issue? Such questions are likely to arise in the minds of both parents and teachers. This course will introduce you to various forms of bullying that occur in primary and secondary schools. You will learn about the relevance and severity of bullying and cyberbullying (online harassment). Children who are bullies exhibit certain distinctive behavioural characteristics, which will be discussed to provide you with more clarity on how to recognize the problem. The causes of bullying will be explained and you can reflect on many thought-provoking questions as every topic in this course has important reflection activities.</p><p>The second module explains the long- and short-term effects of bullying– both on the victim and the perpetrator. It is possible to identify the signs of bullying and this course will show you some of the key things to look out for. Teachers and parents can prevent bullying to some extent and this module guides you on how to react when incidents happen. You will also learn how parents can take timely action to help their child – who could either be a bully or is being bullied. Step-by-step action points will guide you on how to talk to various parties involved so parents can understand this issue from a teacher’s perspective, too. Realistic examples will help you to identify bullying prevention and coping strategies, either as a parent or a teacher.</p><p>Finally, you will get an overview of the UK’s Equality Act 2010 and some other laws and regulations that help in defining different forms of discriminations that cause bullying. In the last module, you will get familiar with some special cases of bullying and certain governmental requirements for eliminating discrimination in British schools. This section will help you to perceive the larger picture within which an anti-bullying policy needs to be implemented. You will grasp the meaning and nature of anti-bullying policies in school to get the confidence to raise the issue for yourself or for others, whenever the need arises. This course will be of benefit to a school counsellor, a parent or a teacher or to anyone who wants to work in education administration. So, you can enrol today for this free course and become a key component of an anti-bullying guidance system.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}