{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5030","title":"Automotive Starting System Diagnosis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course delivers the foundation information necessary to recognize and analyze starting system faults.","description":"Welcome to this Alison course on 'Automotive Starting System Diagnosis’, where we demonstrate schematic diagnostic procedures step by step to teach you the possible causes of starting system malfunctions. You will therefore learn to understand the starting system's purpose and operation. In addition, you'll learn to work like a detective to quickly narrow down the possible causes of electrical faults. Register today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>We have designed this automotive starting system diagnosis course to help those of all levels understand how the starting system works and how to troubleshoot potential problems. Using clear examples and concise language, Steve Liguori breaks down complex concepts into understandable pieces. He explains a process that promotes quick and accurate diagnostic results. Accordingly, those who take this course will be able to accurately diagnose problems with the starting system, narrowing down the potential causes.</p><p>While the course focuses mainly on starting system schematics, you can apply the diagnostic principles and procedures taught here to other automotive electrical systems. So, although not required to benefit from this course, and depending on your experience, we recommend that before starting this course, you first complete the 'Diagnose Basic Car Electrical Problems Using Wiring Diagrams' course.</p><p>If you are doing any work on a car, ensure you are comfortable and have hands-on skills. The course explains the foundation material necessary to understand and diagnose many basic and intermediate starting system schematics. The more you practice what we introduce in this course and apply the process to different wiring diagrams on your car, the more comfortable and proficient you will become. Let's get started!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}