{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5147","title":"Basics of Sewing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to sew in this free online course that covers basic hand-stitching and explains how to use a sewing machine.","description":"Are you ready to take up the needle and thread for the first time? Is it finally time to take that new sewing machine out of its box? This sewing course gets you started by taking you through the basics to lay a solid foundation in this craft. We go through the essentials of sewing step by step to help you master the necessary skills. We provide a range of sewing techniques and describe the equipment you can use at home to become your own tailor.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course lays out each stage of the sewing process in depth. It starts with an introduction to the various parts of a sewing machine as we examine its accessories and features. Knowing the different types of sewing machines gives you an extra edge and we compare various models available on the market.</p><p>We then describe the various tools needed for the sewing process, starting with hand-stitching. Any aspiring sewing enthusiast requires a thorough understanding of thread functions and we lay out the different types of threads. To help you become an expert at sewing and embroidery, we explore the fundamental factors of fabrics and various stitches.</p><p>The course then covers employing patterns, pattern envelopes and their usage. We outline the cutting and marking process and its role as part of your final preparations before sewing. You will then learn how to sew seams, hand stitches and hems. Finally, we explain how to maintain a sewing machine to keep it working properly. Sewing is an ancient skill that never goes out of style and changes with shifts in new technology. So sign up to unleash your creative skills and become your own tailor.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}