{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5157","title":"Basics of Counselling and Psychotherapy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to treat mental disorders with counselling and psychotherapy in this free online psychology training course.","description":"Do you have the aptitude required to become a counsellor or psychotherapist but seek the skills? This course on the basics of counselling and psychotherapy delves into the world of mental health and the evolution of treatment options since the early days of the ‘talking cure’. We trace the relationship between counselling and psychotherapy and explore the works of renowned psychologists like Sigmund Freud to train you in the use of both methods.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you want to pursue a career in the field of mental health? If so, you have come to the right place. This psychology training course explains how to treat mental health disorders through counselling and psychotherapy. Both terms shall be defined as we trace the relationship between them. We go through the various types of treatment options associated with both.</p><p>Are you curious about the mental health writings of renowned psychologists like Sigmund Freud or Carl Jung? We outline their key findings and principles and examine the contribution of many others in the field. We then study the evolution of treatment options from their origin to their current state and examine current trends in mental health care. The course breaks down the concept of psychodynamic (or psychoanalytic) psychotherapy, which probes the patient’s subconscious through ongoing conversation.</p><p>The mental health industry has developed effective treatment options for a plethora of mental disorders. We match a wide range of mental health disorders to their psychotherapeutic treatment options while identifying key symptoms associated with each. The importance of mental health is gaining attention and openly talking about mental health is no longer considered the social taboo it once was. This psychology training course provides treatment options for a range of psychological disorders so sign up to learn how to use counselling and psychotherapy to guide patients towards improved mental health.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}