{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3865","title":"Basics of Sociology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of sociology and learn about social movements, structures and change with this free online course.","description":"There are a variety of topics that span the entire sociological spectrum, and in this free online introduction to sociology course, you will discuss the basics as well as more advanced sociological themes. Learn topics such as deviance in human behaviours, social movements, social change, the impact different cultures have on society, leadership sociology, the key differences between mental illness and mental disorders and the roles they play.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online sociology course has been designed to help you build a well-rounded understanding of sociological concepts. The course begins with an introduction to the field of sociology including the definition of sociology, its history, the sociological process and culture, aspects such as norms, values, and beliefs, and the need for socialization in today’s society. What are your opinions on sexual orientation? Do you consider it part of the gradual process of human development or just a constant at birth? The psychoanalytic theories of Sigmund Freud and other theorists discussed in this course shed some light on this and provide you with possible answers and points of debate. This section concludes by discussing groups and organizations as sociological elements, structures and forms of leadership, deviance as a phenomenon in society and the use of media and technology.</p><p>The following important concept delves deep into a very important aspect of society; the healthcare system. You will explore the health systems provided in the U.S., compare it to others and get to understand the effects of social constructions on healthcare systems. Next up for discussion are the terms “mental health” and “mental disability”. Many consider mental illness and mental disorders to mean the same. Are they truly different, or would you consider it just a thing of semantics? This is covered in the context of topics such as urbanization, population, the environment, and many aspects affecting social structure. This serves as a foundation for the next bit of content where you will cover social movements and social change and their respective impacts.</p><p>The study of human interactions and society has so much to offer you because it studies the transformation of society over time, social movements and structures, human behavioural patterns, among many others. If you are keen on understanding this exciting field and want to expand your knowledge on sociological theories or if you are hoping to become a sociology professional, then this in-depth course will set you up for success.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}