{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5379","title":"Basics of Carpet Cleaning","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains how to safely and professionally clean carpets and restore them to their former glory.","description":"Carpet cleaning removes stains, dirt and allergens from carpets to protect both your home and the health of your family. This course establishes the importance of professional carpet cleaning and examines various methods used to provide it. We then go through the steps taken to set up a successful carpet-cleaning business. Sign up to become an expert in carpets and acquire the skills required to clean and restore them as a professional.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The process of carpet cleaning removes stains, grime and allergens from indoor carpets to improve their appearance and boost the health of those who walk on them. We begin this course by establishing the importance of professional carpet cleaning. We lay out the responsibilities of a carpet-cleaning technician and explain how to get into the business. We answer questions like ‘what are the different elements of a carpet?’ and ‘what is the difference between a carpet stain, spot and soiling’?</p><p>This course explains how to harness improved modern carpet cleaning methods, including hot water extraction (HWE). We compare offsite and onsite cleaning processes before going through safe cleaning procedures. We discuss a safety checklist used by cleaning technicians to ensure that the job goes smoothly. Finally, we explore some factors that can affect carpet restoration and examine the scientific principles that drive effective restorative cleaning.</p><p>This course unpacks the concepts you need to understand to succeed in the carpet-cleaning business. We provide the training you need to professionally identify and clean various types of carpet. Sign up to become an expert in carpets and the methods employed to keep them clean and free of health hazards. Whether you are looking to start your own cleaning service or want to restore your own carpets, this course is for you!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}