{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1210","title":"Beginner Digital Photography","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your basic digital photography skills using the manual settings on the camera and by making subtle changes post production in Adobe apps.","description":"This free online beginner's photography course will introduce you to the most important functions and techniques of digital photography and your digital camera. Lots of people have digital cameras but few know how to use them. This course will teach you how to operate the various features of your digital camera, and how to take the right shot for every occasion. Take this free online course today to supercharge your digital photography skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you are a photographer who wants to go beyond the Automatic Mode on your camera then Beginner Digital Photography is the ideal course for you. The course begins by teaching you about the function of each of the command modes found on most DSLR cameras. You will learn about the relationship between Shutter Speed, Aperture and ISO and how to use them to get your optimum shot.</p><p>The course will then introduce you to the structure of lenses and what the different types of lenses are used for. You will also learn about light - how both the eye and camera see it, the different types of light and why it needs to be balanced using the white balance function. Using non-technical language the course will introduce you to Photoshop and Lightroom, and you will learn how to navigate and manage images, and set your basic preferences when using these software programs. In Photoshop you will learn how to identify when an image has been obviously photoshopped and how to make more subtle changes. In Lightroom you will learn how to create a catalogue and use the main modules to prepare your images for export.</p><p>This course in digital photography will be of great interest to all learners who want go beyond the automatic setting on the camera and learn how to apply the basic techniques of digital photography that will turn snapshots into great photographs.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}