{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4261","title":"Bridal Makeup Workshop","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the skills, tools and business strategies used by professionals in this free online bridal makeup course.","description":"This course explores the professional skills, tools and products used to apply bridal makeup. You will learn skin preparation methods, techniques for eye makeup and the romantic bridal look. Customer care service is also discussed so you can grow your client base. To ensure the success of your freelance business, we explain how to set up your business structure, meet legal requirements and master the strategies to market your brand for success.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>When a bride makes her grand entrance, everyone turns to look at her. She may feel a little bit nervous but no one can tell because she looks exquisite. Her beauty should appear effortless, supported by her hairstyle, makeup and dress. As a makeup artist, you can take pride in the skills and effort you put into creating such wonderful memories for the bride. The first topic of this makeup tutorial introduces the equipment and products you will need to work with and recommends some brands. You will learn about skin preparation and the importance of completing makeup trials before the wedding day.</p><p>The next topic goes into detail on how to apply eyeshadow to the bride's eyes, including a step-by-step tutorial on creating the perfect ‘smokey’ look for an autumn wedding. We explain how to best prepare the eyelid for a smokey look and how to create that look using a variety of different colours and brushes. We then move on to complete the rest of the bridal look. This involves learning all you can about the products used, including brands we recommend and those we suggest you avoid.&nbsp;&nbsp;</p><p>The second module in the course begins with lessons on customer service. Being the best makeup artist in your area can only take you so far: you need to hone your customer service skills to attract clients, retain them and earn referrals. Lastly, we discuss the practical side of running your own freelance business and outline the relevant including legal, tax and marketing considerations. We also provide tips and techniques to use when trying to fill out your kit without breaking the bank or going into debt. Running your own freelance bridal makeup business can be an incredibly rewarding career. Like any freelance job, once you earn a reputation as an amazing stylist with highly sought-after skills, you can become incredibly successful. Sign up to become a key part of someone’s special day!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}