{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4249","title":"Cello Course for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basic techniques of the cello with the help of award-winning cellist Maxim Kozlov in this free online course.","description":"Are you aware that the cello is commonly associated with classical music but has also been used in songs by musical icons like The Beatles and Nirvana? So whether your dream is to join an orchestra or you want to play popular songs for friends and family, you came to the right place. Maxim Kozlov, runner-up in the Russian National Cello Competition, takes you through the basics of playing this beautiful instrument in this free online course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The cello might be a somewhat underappreciated sibling of the violin but you can change that! Maxim Kozlov, an award-winning Russian-born cellist, is your guide through the basic techniques of playing the cello. This free online course begins by examining the different parts of the cello and showing you how to hold it properly. We then demonstrate the ‘pizzicato’, a traditional playing technique that utilizes the fingers. We also introduce you to the bow and the proper way to hold it.</p><p>The course then provides exercises to help you become confident using the bow, focusing on the techniques required to make beautiful sounds. You will be glad to have an expert like Kozlov for this part of the course. We then establish the importance of maintenance before explaining how to position your fingers on the cello.</p><p>The course then moves on to tuning and playing scales. Tuning is not optional if you want the proper sound from your cello - it is essential. Last but certainly not least, the course shows you how to produce sequences of notes. The playing of scales will also test your understanding of material covered in the course. So don't doubt that you could play the cello: with our expert guidance, you can master this versatile instrument.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}