{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5181","title":"Choosing a Career Based on Passion","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to find a career that makes the most of your personality and skills in this free online job search course.","description":"Finding a career you are passionate about is good for your mental and emotional health. This course teaches you how to find the ideal profession that complements your personal interests and abilities. We explain how to make the right career decisions, build beneficial professional relationships and employ self-improvement strategies. We break down the ‘passion pyramid’ and Simon Sinek's ‘Golden Circle’ to help you choose and pursue work you love.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you ever wondered what career is right for you? This job search course explains how to choose the right profession that complements your personal passions and talents. We lay out the factors to consider when choosing a career and provide tools you can use to identify your interests and reach your full potential. We lay out methods such as ‘learning styles’, ‘deliberate practice’ and ‘self-monitoring’ for improving your performance. Learn how to overcome fear of risk and acquire the entrepreneurial required to start your own business.</p><p>The course then shows you how to maintain a positive attitude to attract success through the ‘mindset mastering’ exercise. We go over the guidelines used to make sure you are prepared for interviews and present yourself professionally. We establish the advantages of drawing up an impressive career portfolio and demonstrate how to do so. We explain how to write various types of resume and CV and compare good and bad cover letters. The course then examines application tracking systems and shows you how to set up a LinkedIn profile to network with other professionals in your field. Study the techniques used to ensure a quick and successful job search.</p><p>Finally, the course explores the process of hunting for jobs online. We describe the dangers you will encounter while searching for potential employers and identify pitfalls to avoid. We also explain how to choose the best references and testimonials. Decision-making is a skill like any other and can be learned. The decisions you make regarding your career are likely to impact your life and wellbeing so it’s worth learning how to make sure they are the right ones. This job search course gives you the confidence required to pursue your passions and find work that brings out your best. Sign up to find ways to monetise your skills and interests and be inspired!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}