{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4596","title":"Clarity in Calling With Robbie Osenga","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to improve your self-awareness, determine your destiny and your life's purpose in this free online course.","description":"You experience self-improvement, personal development and growth when you understand who you are, know strengths and weaknesses, and determine your life’s purpose. When you know yourself better, you build positive self-esteem and confidence. This exciting free course will give you tools to explore who you are, find direction in your life, and confidently communicate your story. Are you ready for clarity in your calling?","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Your life’s purpose is the reason you wake up every morning, and it is unique for everyone. It guides you on life decisions, influences your behaviour, and offers a sense of direction and meaning. Do you find yourself struggling to discover your purpose? This course will give you the tools to explore who you are to become more self-aware and find direction in your life. You will start with a pre-assessment activity to help you better determine your current position in life. Then, delve deeper into your life to identify the positive turning points that made you feel joy and happiness. Understand your low moments and how they have shaped you to help you create boundaries and move forward in life.</p><p>Next, uncover the negative and positive turning points in your life to help you determine who you were and your life’s purpose. Gain an understanding of the Myers-Briggs Personality Test and Gallup Strengths Finder Results to become more self aware. You will also learn to comfortably and confidently communicate what you want out of life, identify your true strengths and admit your legitimate weaknesses. Discover how comparison can lead to better things when done well, and learn how to surround yourself with people who want you to be the best version of yourself.</p><p>Becoming self-aware is vital to our personal growth and development. Self-awareness helps you to know your shortcomings and to work towards fixing the mistakes quickly. This course will help you discover your strengths, weaknesses, core values, priorities, passions, and desires to find clarity in your calling. Anyone looking to find direction, who feels stuck in life, and who is seeking to more sustainably align their passions with their capacity will benefit from this fascinating free online course. Start learning more about self-improvement today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}