{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4414","title":"Cognitive Behavioural Therapy for Anxiety","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how cognitive behavioural therapy can improve mental health in this free online psychology course.","description":"Does someone around you need help with a mental illness? Do you want to get help for anxiety symptoms yourself? This course on cognitive behavioural therapy will cater to all your needs. Develop a sound understanding of the various techniques that have evolved over the years to treat patients with mental health disorders. This CBT course addresses all these specializations, from anxiety and depression to OCD and PTSD. So don't delay! Start now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you find yourself constantly washing hands out of a fear of germs? Does someone you know have difficulty traveling because of their fear of flying? All these and many more symptoms are part of underlying problems relating to anxiety. Anxiety, depression, post-traumatic stress and many other mental health concerns have become extremely common in today’s world. The number of people who check into hospitals for mental health concerns is quite staggering. This course on cognitive behaviour therapy will address these issues in detail. The use of numerous techniques and methods to alleviate or, in some cases, altogether remove mental health symptoms will be the center of our attention. We begin by explaining the various mental disorders and their typical symptoms. We will define anxiety, depression and post-traumatic stress disorder (PTSD). We then analyze the theoretical and practical methods that have been developed over the years to address these major health concerns.</p><p>Are you looking to recommend a loved one to a therapist for their anxiety? Or are you looking to study and diagnose the symptoms you face yourself? This course has got all these areas covered. Explore the background of various authors and analysts and examine their development of cognitive techniques over the years. We discuss the studies made by these analysts and their impact on mental health treatments. Explore other mental health disorders such as obsessive-compulsive disorder, generalized anxiety disorder and panic disorder. Learn all about the practical techniques used by therapists to treat these disorders. You will investigate ‘in vivo exposure’, imaginal exposure, cognitive-based techniques and various other forms of therapy. We will discuss therapy sessions, their efficacy and the administration of multiple drugs.</p><p>Do you need to develop a coping technique yourself for your OCD? The course covers psychoeducation and behavioural strategies that you can teach to patients or use yourself. These approaches help the patient become more present ‘in the moment’ and stop taking their fear and panic seriously. Whether it is breathing techniques or going through simulated situations to get over the anxiety and panic, we will demonstrate all these techniques in detail. Finally, we discuss the relationship between the therapist and the patient to overcome these problems. This coordination is paramount for a successful recovery. Mental health concerns have increased considerably over the last few years. Added to the pressure of coping with these distressing symptoms is the taboo and stigma attached to these diseases, making them even more challenging to diagnose and cure. This course will provide you with all the necessary terms, techniques and methods available in today’s world to make your own life and the lives of those around you better. So don’t waste any more time. Start your learning journey today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}