{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4188","title":"Creating Quality Thumbnails Using CorelDRAW","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create great thumbnails for various platforms using CorelDRAW with this easy-to-follow free course.","description":"Are you a creative or artist interested in creating good thumbnails for various platforms? Sign up for this course to learn new techniques for creating thumbnails via CorelDRAW by using a variety of tools found in its toolbox. This course teaches you when and how to use each tool, and you will be taken through the best fonts and frames to use for your thumbnails.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course illustrates various techniques of creating great thumbnails. It is specifically designed for art teachers, creative minds, content creators and graphic or web design students to cover all aspects of thumbnails. Teachers and experienced users who enrol will refresh their knowledge with improved CorelDRAW content. You will learn about the key elements for creating quality thumbnails and be exposed to different solutions to problems around both contrast and lighting edits. A ‘thumbnail’ is a small image representation of a larger image. In this course, you will learn about the characteristics of good thumbnails. They are often the first impression of the product we get from the product preview that influences our decision to buy or not. This course also outlines the advantages of thumbnails. You will see how to create quality thumbnails for Facebook, YouTube and other platforms.</p><p>Depending on your photo-editing expertise, creating custom thumbnails can either be quick and simple or quite complex. It can sometimes be a struggle to choose both the right format and template as well as the appropriate types of images. This course covers in detail the major difference between vectors and JPEGs. Have you tried to resize JPEGs and vectors respectively? The ability to enlarge them without distortion is a huge benefit. Though vector graphics are not perfect, they have some advantages over JPEGs.&nbsp; You will learn about resizing and editing pictures by pushing up the contrast. You will also learn how to choose layout frames, and use intersect tools as well as mirror images in ways that allow spaces for time stamps and fonts on thumbnails. Your goal is to create a clear thumbnail that stands out. This course helps you achieve that by taking you through some image-editing techniques like drop shadows.</p><p>It is important that you use the right kind of font along with modes during your design creation process. CorelDRAW includes pattern fills, texture fills and curve tools that make it easy to manipulate thumbnails. The material discusses the most appropriate ways to name and save thumbnails for search engine optimization (SEO). This enables potential users to easily find your thumbnail among others on the Internet. The sections that follow cover in detail exporting thumbnails to JPEG and creating separate vectors while using them to assemble the font. Upon successful completion of the required modules, you will be conversant with CorelDRAW along with its functions.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}