{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/2910","title":"Film Editing Techniques, Plots and Narratives","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the key features of film-editing techniques, and creating plots and narratives in this free online cinema course.","description":"Do you know the difference between the plot of a film and its narrative? Do you know how enigma codes and cultural codes can be used in the editing process? This free online course in cinema studies covers film-editing techniques, plots, narrative and colour theory. You will also analyze the incorporation of myths into film plots and uncover some key notions of creating different characters.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>You will immerse yourself in the concepts of film techniques, theories and movements in cinema during this free online course. Analyze the different types of, and myths in, movie plots, and the key ideas around creating characters in cinema. Then move onto the great contribution of iconic Soviet filmmakers Lev Kuleshov and Sergei Eisenstein in the field of montage editing.</p><p>This will lead to the introduction of French literary theorist Gerard Genette’s concept of an unreliable narrator and how it reveals an interesting gap between appearance and reality. The course will cover critical theories of realism and naturalism, such as Charles Darwin’s idea about nature and the ideology from Karl Marx’s theory of economics. It then describes the work done by important colour theoreticians such as Rudolf Arnheim, David Bordwell, Eisenstein, Derek Jarman, and Edward Raymond Turner.</p><p>This course is aimed at meeting the interests and needs of young career professionals who want to develop a deeper understanding of different theories of film editing and colours in cinema, and for cinema studies students who want to build their theoretical knowledge of film artistry.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}