{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3954","title":"Diploma in Exploring Adobe Lightroom Interface","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course studies how to use the many powerful functions, features, and working panels in Adobe Lightroom.","description":"Get the most out of Adobe Lightroom with this Diploma in Exploring Adobe Lightroom Interface. This Adobe Lightroom tutorial teaches you a whole host of important features you may not have known about such as how to create collections and collection sets, the various fundamental settings you need to master in order to export for print and web, the uses of the book module, and steps to create custom online photo galleries.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you are in a creative area such as graphic design for photography or aspire to be in these fields, then you no doubt know about Adobe Lightroom. This Adobe certification will help you navigate this powerful software’s many applications so you can master advanced Lightroom skills in no time. The course kicks off by teaching you about the importance of investing in an external hard drive to store your images and artwork, what RAW and JPEG files have in common, the concept of colour spaces, and how Lightroom allows you to personalize additional interface components through the identity plate.</p><p>Flags are a vital means of highlighting specific images. Did you know that there are two types of flags? You will be introduced to their distinct functions and features before learning about the importance of creating collections and how to administer both collections and collection sets. This Adobe Lightroom course then covers the five color label types that you can apply to images, what white balance is and its features, light sources with their respective temperatures and what is included in the ‘develop’ module that makes it different from the ‘library’ module and ‘loop’ view.&nbsp;</p><p>Maps help you geotag images and this is very useful for sorting images with and without GPS coordinates. There are multiple types of views for maps and you will learn about their functions and features and how to change them as well. Towards the end of this Adobe training, the content covers all about slideshows. Using the slideshows feature in Adobe Lightroom allows you to present photos to friends and family or even in a professional capacity during your work in photography. Enrol in this creative free online course and learn Adobe Lightroom essentials as a creative student, professional photographer or photo enthusiast so you can use your newfound skills to create beautiful images for applications on social media, design and much more.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}