{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3676","title":"Drawing Characters in Adobe Illustrator","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn, design, and create stunning flat vector characters in Adobe Illustrator with this free online course.","description":"Ever wondered how those fantastic characters or images you saw on a logo or website were created. Do you also want to design such stunning images or characters all by yourself? If yes, then this free online course is perfect for you. The step by step tutorial guides you to easily learn all the essential tools and techniques of Adobe Illustrator. It will help you quickly design and create impressive flat vector characters or images of your own.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Adobe Illustrator is a software program used for designing stunning vector graphics, illustrations, shapes, characters, or other related items for print, web, and other mediums. It is the preferred choice for designers, illustrators, artists, or creative amateurs around the globe. The best thing about Illustrator is that it is easy to learn and navigate. This free online course by Alison is designed to teach you to create three distinct characters using simple vector shapes. You will be familiarized with all the basic menus, tools, and techniques of Adobe Illustrator to help you with the job.</p><p>The course is divided into three different modules. Each module is further divided into various topics to help you easily understand all the processes. The first module teaches you to use simple vector shapes to draw three different body-type characters. The second module will help you create an imposing vector knight. And once your vector knight is completed, the third and the last module will guide you through designing and creating a magnificent Orc character, all using simple vector shapes.</p><p>So if you are somebody who would like to create different vector characters or art on print, signboards or web, this course is best suited for you. This course is also perfect for illustrators, graphic designers or digital game artists who want to revise and update their skills on Adobe Illustrator for more creative opportunities. Enrol now and have fun by learning to create stunning flat characters by modifying simple vector shapes and drawings in Adobe Illustrator.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}