{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3967","title":"Drawing Anime Characters – The Head, Face & Eyes","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn techniques that will make it easy to draw the facial features of an anime character in this free online course.","description":"This free online course will demonstrate the steps and techniques needed to draw stunning facial features for anime characters. Specifically, you will learn to draw the head, hair, face, mouth, and eyes. You will also learn to draw these elements from different perspectives, differences between male and female characters' facial features, and how to distinguish them yourself in your drawings.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This short, free online course will introduce you to drawing anime characters and show you how to draw the head, eyes, ears, and other facial features. We will start with an introduction to the tools used and the basics of drawing a character's face from various viewpoints. We will then proceed to introduce different anime face and eye shapes and the basics of drawing the eyes of an anime character. The first half of the course concludes by outlining the differences between boys' and girls' eyes and the techniques for drawing symmetrical eye pairs.</p><p>The second half of the course covers drawing the mouth, nose, and hair of anime characters. You will learn about nose and mouth shapes and how to draw different mouth positions. This half of the course also covers the basics of drawing the hair of a character. We'll show you the techniques of drawing braids, pigtails, short and long hair in female characters. The course concludes with demonstrations on drawing curly hair for female characters and how to draw the hairstyles for male characters.</p><p>This course will teach you and skills needed to draw and accentuate the facial features of anime characters, such as their eyes, noses, ears, hair, and mouth. You will learn trusted techniques that greatly simplify the character drawing process and improve your drawing skills overall. If you are an animator, prospective animator, an anime fan, or someone looking to pick up a fun new skill, this course will be perfect for you. Start now and be on your way to drawing detailed anime faces in less than 3 hours.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}