{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3622","title":"Energy Healing and Meditation through the IAM Healing Program","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course on energy healing and meditation for teachers and practitioners through the IAM Healing Program.","description":"This free online course on energy healing and meditation is a part of the Inner Awakening Meditation and Healing Program, also known as the IAM Healing program. This course equips you to heal anyone from any distance without the need for physical touch or any equipment. You can even perform healing therapy for the earth. However, to perform the therapy, you need to prepare yourself through dynamic mediation, which is explained in the course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you keen to explore your inner healing powers? Are you ready to tap into the universal energy available to all of us? This course will empower you to do just that. The Inner Awakening Meditation and Healing Programme, also known as the IAM Healing programme, is based on two fundamental models: Energy Healing and Meditation. This program is straightforward, gentle, and non-invasive. It eliminates the need for physical touch during energy healing on others. With this system of healing, there's no need for expensive equipment or a massage table. Healing is twice as effective as anyone method because it combines the principles of meditation and energy. This dual therapy increases the intensity, vibration, and power of healing to a very high level. It combines techniques from various holistic therapies to enhance its effectiveness. These include meditation, Reiki, use of Chakras, relaxation therapy and guided visualizations.</p><p>This method encourages you to do a simple dynamic meditation before you send energy therapy to others. The reason for this is to make sure that your energy centres, known as chakras, are open and flowing freely, without any blockages. All of us, including healers, yoga teachers, medical practitioners, or anyone in the complementary therapy field or any other, can experience energy blocks at any time. Therefore, before offering healing and energy therapy to others, we must prepare ourselves in raising our vibrations to the highest level. We do this by doing a short and quick dynamic meditation, which allows us to balance our emotional, mental and energy bodies. The simple and powerful techniques used in this program are subtle hand positions to connect with your aura, chakras and spirit. It's a potent combination of meditation and universal energy that makes it a unique dual therapy for personal transformation and sending energy therapy to others.</p><p>Another great feature of this program is learning how to do distant healing on friends, family members, animals and clients. You'll also discover how to do healing on a group of people. One of the most exciting and powerful methods that you will learn is the healing of the planet. It's called universal healing. This course is designed for individuals of all levels, from beginners to intermediate to advanced levels. It's an excellent programme for Reiki practitioners, energy healers, meditation teachers, clairvoyants, psychics and anyone in the complementary therapy field. The simple methods used in this programme can offer you a unique perspective and approach to universal energy. This programme also focuses on Eastern philosophies. The course will explain spiritual concepts such as the Law of Karma, age of the soul, and life after death to help expand your knowledge.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}