{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5367","title":"How to Become a TV Presenter","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course draws on the principles of journalism and acting to help you become a successful TV presenter.","description":"Do you dream of hosting a show on television? This course teaches you the ins and outs of the TV industry and explains how to develop a relationship with the camera and handle stress on and off the screen. We show you how to write the perfect script, create a unique showreel that showcases your presentation skills, conduct interviews and more. Sign up to take the first step in your journey towards becoming a successful TV personality.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Television is one of the world’s most popular forms of entertainment and sources of information and caters to a wide range of interests by offering content that ranges from daily news and cooking to travel and children's shows. The demand for talented TV presenters is thus high and competition for these positions can be fierce. A great presenter can be the face of a show that makes the difference between staying on the air and swift cancellation. However, becoming a great TV anchor takes more than just showing up in front of the camera. Anchoring or hosting a show on television is an art that requires that you master the ability to talk into the cameras, conduct engaging interviews and read from an autocue while maintaining your poise under any situation. Are you ready to take your first step towards becoming a successful TV presenter? This course takes you through the steps taken to launch a career on the small screen.</p><p>The first step to becoming a television presenter is to acquire the relevant qualifications and experience. We introduce you to the different fields of Media Studies and describe the kind of internships that can help you get your foot in the door via entry-level jobs in broadcasting. TV presenters also need to understand their responsibilities and the course covers the roles, attributes and daily duties of a presenter. We cover all aspects of on-camera presentation, including speaking techniques, wardrobe and colour selection, nonverbal communication and how to apply makeup to ensure a polished and professional appearance. Interviewing is one of the most common responsibilities of a TV presenter so knowing how to prepare for interviews is vital. The course explains how to prepare for and conduct engaging interviews that captivate your audience. We show you how to choose interview questions, conduct research and prepare scripts for a show.</p><p>The course then takes you through the steps of making a fantastic showreel that demonstrates your talent and skills to prospective employers. We then examine the role of the equipment used in the broadcast industry, including the in-ear talkback, teleprompter and different cameras and teach you basic camera techniques. Working in television is very exciting but demanding and suits people who are driven, charismatic and passionate and who thrive while working under pressure in high-energy environments. All you need is determination, persistence and practice in front of the camera. Are you still wondering if you’re cut out for the profession? Do you think you can succeed on camera and become a TV personality? Take this course and learn everything you need to know to become a television presenter.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}