{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4169","title":"Essentials of Pattern Construction for Tattoo Art","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about basic pattern construction and manipulating designs for body tattoos in this free online course.","description":"This course provides a guide to basic pattern construction and shows you how to change or merge designs to make a completely new one. You will study the concepts, methods and adjustments used in the creation of patterns for great tattoos. You will also see how to manipulate cross and hexagon patterns (and get secret tips!). Sign up for this course now and improve your tattoo art today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course lays out a modern approach to understanding basic pattern construction and designs for tattoo art. You will learn various methods of drawing different types of patterns and study the rudiments of vectors, dots and lines in pattern making using CorelDraw. Get to grips with the tools, interface, hacks, shortcuts and fundamentals of CorelDraw. The advantages of vectors for illustrations as well as a comparison to JPG will be outlined. Study the conversion of scripts to vector graphics and the application of effects to vectors using tools in CorelDraw. See how to export vector graphics and the various formats that files can be saved in CorelDraw. The difference between pixel and vector-based graphics will be covered.</p><p>Next, learn about the tools and commands used to make a cross pattern. Study cross pattern outlines, conversion to object and other stylings that can be applied to it. You examine the numerous manipulations of lines, strokes and colours in making adjustments to your cross pattern. You will also be taught how making a few adjustments to a pattern completely changes the design. Study the functions of grids, guidelines, and helplines in the construction of a pattern. Learn about the application of the mirror and weld tools in addition to playing with degrees using the rotation tool. You will gain an understanding of outlines, line weights and how to resolve issues involving opened knots. Then, discuss the conversion of outlines to objects and the concept of break-to-curve.</p><p>Lastly, the procedures used in creating hexagonal patterns will be elaborated on. Analyse the application of grids and the tools used in the step-by-step construction of hexagons. This course also looks at other tools used for drawing, deformation, transformation and general manoeuvre of the patterns. Find out how to identify the angles and special effects used in the construction of hexagonal patterns. Study how to single out vectors from patterns for special modification. Learn to properly use the dialogue of the types of fills in the application of various effects to patterns. This course will greatly benefit new tattoo artists and those who want a refresher in graphic design for stunning tattoo art.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}