{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5037","title":"Exam Preparation for PTCB Certification - Pharmacy Technician (CPhT)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about components of the revised syllabus for the PTCB exam and prepare accordingly in this free online course.","description":"We have designed this course to help you grasp the basic concepts concerning the new syllabus of the PTCB exams. After completing this course, you will be able to adequately handle each of the four areas of the PTCB pharmacy technician exam. The course also contains a list of essential drugs and their pharmacological uses. Moreover, you will also learn to interpret the DEA numbers through the methods described in this course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The field of healthcare is very versatile. It is not dependent on doctors only and requires the contribution of many different professions. Among these, pharmacy technicians play a vital role as they help patients guide and dispense their medications. Without pharmacy technicians, it will become challenging for pharmacists to manage and control the influx of patients alone. A pharmacy technician thus plays a crucial role in maintaining the balance of a pharmacy’s operations.</p><p>The Pharmacy Technician Certification Board (PTCB) is a reputable U.S. organization that examines the potential candidate seeking to pursue their careers as pharmacy technicians. Recently, PTCB announced some changes in its examination syllabus. Now they will assess candidates in four areas: medications, federal requirements, patient safety and quality assurance and order entry and processing. Each area covers 40%, 12.5%, 26.25% and 21.25% of the examination syllabus respectively.</p><p>Keeping this new examination pattern in mind, Exoexcellence Consultants prepared this particular course covering all these areas, thus providing you with the opportunity to prepare for the upcoming PTCB exams in the best possible manner. You will cover various aspects, such as the steps of order processing, health and hygiene requirements and federal and pharmaceutical laws. You will also learn to interpret the Drug Enforcement Agency (DEA) codes. By completing this course, you will be able to prepare yourself for the upcoming PTCB exam.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}