{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4316","title":"Family Counselling, Marriage and Couples Therapy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about counselling and its applications in resolving emotional and psychological issues in this free online course.","description":"Ever wondered why emotional and psychological issues arise and how one can overcome them for an improved and fulfilling life? Satisfy your curiosity by learning about the fundamental counselling theories that will help you understand common mental health issues and their solutions. In addition, you will explore different emotional and relationship problems faced by couples, children and adults and techniques to solve those problems.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Counselling is a technique that aims at preventing mental health matters from impacting someone's life by employing education and short-term treatments. You will learn about counselling and its theories, history and the role of counsellors in helping clients with their emotional and psychological wellbeing. Counselling adults requires a different approach to that employed with children due to children's inability to communicate their feelings accurately. We illustrate the techniques used to counsel both and treat them according to their respective mental capabilities.&nbsp;</p><p>Making a marriage work is one of the most challenging tasks in an individual's personal life. Discover the importance of seeking couple therapy, the communication barriers couples face and various techniques of resolving relationship issues to living an emotionally fulfilled life. Investigate the importance and role conflicts play in a couple's life and ways to resolve and improve their relationships. You will also learn how to cultivate and maintain intimacy as a couple by understanding your partner's needs and values. We demonstrate how to apologise and forgive if one partner has done something wrong. Understand the characteristics of a secure and stable relationship, the significance of managing finances and methods to strengthen a secure base as a couple. Infidelity is one of the major causes of divorce and it is often challenging for a cheating partner to regain trust after an affair. Know how to open conversations about the issue and ways to promote healing and rebuild the relationship.</p><p>This course will give you a thorough grasp of the legal, cultural and ethical challenges in professional counselling, allowing you to work effectively while overcoming them. In addition, you'll gain exceptional and empathic communication skills for providing influential family, marriage and couple counselling. This course is for beginners, those in the field of psychology and counselling or anyone wanting to improve their own emotional and psychological health. Do you want your counsel to be the force behind the success of marriages, families and couples? Don't miss out on the opportunity to enhance your knowledge of counselling. Join the course now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}