{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5318","title":"Fingerstyle Guitar for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to pluck guitar strings to produce distinctive fingerstyle sounds in this free online beginner guitar course.","description":"This beginner guitar course explores how music and musical instruments work to provide insight into the methods and talents of some of your favourite musicians. We explain the basics of fingerstyle techniques used to form advanced guitar chords. Learning how to play guitar requires patience and plenty of practice but this course adds fingerstyle to your skills and sets you on the path towards musical mastery. Sign up to unleash your talent.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Would you like to entertain audiences with your expert guitar-playing skills? This course from Stay Curious Media helps you to master the fingerpicking technique. Our lessons begin with an overview of the history of the fingerstyle guitar technique in which we examine the work of famous artists to immerse you in this musical genre. We then identify the parts of guitars and lay out their different types, components and unique features.</p><p>Proper posture is important when it comes to playing the guitar as you need to be able to play for long periods while avoiding any adverse physical side effects. These guitar lessons explain how to form basic chords in the open position before examining simple strumming and fingerpicking patterns. We then explore other chord positions and cover scales and arpeggios. Simple strumming and fingerpicking patterns can become tedious so we introduce you to advanced guitar techniques like sliding, bending, hammer-ons and more.</p><p>Finally, the course delves into music theory to widen your understanding of how the guitar works as you learn how to quickly move around its fretboard. Ample practice sessions are included in the ‘Resources’ section of the course and include songs from popular artists to help you develop new skills, techniques and styles that you can apply in your performances. Learning to play the guitar may appear daunting at first but this course is designed to help you master fingerstyle techniques as you develop your own sound.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}