{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3672","title":"Frequently Asked Media Training Questions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how how to become an eloquent, confident and engaging speaker in media interviews in this free online course.","description":"This free online course will teach you how to speak to the media confidently and professionally by guiding you on how to relate with reporters, shape your messages, answer interview questions and get the exact sound bites you want in an interview. How to identify and avoid common interview mistakes will be explored. You will learn about reporting terms such as 'Off the record', 'On background' and how you can use them to speak to reporters.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Communicating with the media can be a daunting and stressful experience for many people. This can sometimes affect the reputation of your company or organization negatively if it is not well managed. Every media outlet, no matter how big or small can have a great impact on your career as a spokesperson. That is why every interaction with the media should be taken very seriously by preparing and training for media interviews ahead of time. This course focuses on providing answers to frequently asked media training questions and presents guidelines that would guide you on how to predict questions, avoid common mistakes and focus on delivering your quotes during media interviews. The course begins by introducing you to media training and its concepts. You will be taught how media training differs from public speaking and presentation training. You will learn how to answer interview questions confidently and comfortably. Thereafter, you will gain an understanding of how to plan an ad-lib and how to communicate with your audiences. Remote interviews require the use of specialized and expensive equipment. The act of putting in an earpiece and answering questions while facing a camera needs special training. This course will show you how to deal with such interviews by presenting you with guidelines that would enable you handle the technicalities involved in remote interviews.</p><p>Many people have a low level of comfort when dealing with the media. Low comfort level means that potential key messages and quotes will not be delivered and may lead to the non-accomplishment of your personal or organisational goal. For instance, during an interview, what would be the best time to scratch an itching body part? This course will teach you how to compose yourself during an interview and how to answer questions confidently. You will be taught when not to say 'No comment' ‘during interviews, what to do when a reporter misquotes you and how to deliver clear-cut messages using the concept of sound bites. Understanding how reporters think is vital during interviews. This can be used as leverage during interviews in order to deliver exactly what you want to say. You will learn about terms used by reporters during interviews and how to use them to speak to reporters. On top of that, you will be taught how to get questions from reporters in advance, establish ground rules with reporters, stall reporters and more.</p><p>Are you a spokesperson for your company, organization or group? Are you a streamer or a video blogger who wants to improve their media skills? Then this course is for you. You will be precisely shown how to use a microphone and lighting systems to improve the lighting of your medium. This course will also increase your ability to speak to video cameras and make your own videos effectively. Interviews on TV are different from phone interviews and are also in turn different from radio interviews. You will be given guidelines on how to leverage these mediums to your advantage. This course is important for learners who wants to gain the confidence to supply good answers and convey their messages clearly to their audience during media interviews. No matter your experience, practising how to answer all potential interview questions using the guidelines from this course will make you sound professional. So enrol now and start practising.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}