{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4287","title":"Basics of Ear Training","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online music theory course teaches you how to play music by ear and recognise pitch, chords and melodies.","description":"Do you know that you can play music by ear without relying on a music sheet? By studying this course, you will learn the basic concept of ear training: listening to music and playing notes by ear. In this course, we explore the concepts of higher and lower sounds to help you sing along while listening to notes on the piano. You will also be taught the difference between minor and major chords and chord progressions.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>How is your singing? Do you wish to learn how to play your favourite songs just by hearing them? Are you envious of others’ ability to pick out an entire song perfectly? Do you want to perfect your musical skills? The first step is to train your ear or develop your aural skills. ‘Ear training’ is the process of learning to connect music theory and interpret notes, chords, scales, melodies and more using only sound. It is like building a bridge between the language of music and its sounds. Training your ears is not very difficult. This music theory course with Michael Emenau focuses on training your ears to identify sounds, name them, play them back and even sing along to them. In this course, Michael introduces musical concepts with examples. He then asks questions and you answer them after listening. He also explains the answers to each quiz so you can gauge your progress and improve.</p><p>This course starts at the absolute beginning. We explain how to recognise and understand the concepts of higher and lower sounds. We then explore simple pitches of a sound, looking at examples of ‘high’, ‘relatively high’ or ‘low’ notes played in a sequence. You will also get used to singing while listening to piano notes. This helps you to harmonise with the sound you hear and sing. This course helps you to identify the note that is being played either singly or in a sequence. Furthermore, we explain how note names are assigned to the pitches as you learn how to listen, sing and name the sequence of the notes. The course also introduces the concept of major and minor chords played on the piano and other musical instruments. Once you’ve familiarised yourself with chords, we outline chord progressions and chord tones.</p><p>Do you feel overwhelmed by the phrase ‘play it by ear’? Do you want to develop a better musical ear? Then this course is for you. Once you begin to train your ears, your musical skills will increase by leaps and bounds. All musicians need ear training and there are no prerequisites for taking this course. Both beginners and veterans can benefit from this course to keep their ears in shape in order to recognise the notes of the musical system. The best way to develop a deeper relationship with music is to practise. The trick is to follow through with dedication and consistent effort. Practising ear training exercises or quizzes in this course will increase all aspects of your musical skills. So why wait? Start training your ears and sing and play music like a pro as musical theory meets its practice.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}