{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5369","title":"Fundamentals of Parapsychology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the mysteries of life in this free online parapsychology course that examines the science behind the paranormal.","description":"Are you interested in ghosts and UFOs? Have you ever had a paranormal experience? This fascinating parapsychology course studies people who have experienced the inexplicable. We investigate the science of phenomena like telepathy, clairvoyance, out-of-body experiences and psychokinesis. We then describe common misconceptions and investigate the emergence of laboratory-based investigations to explain myths surrounding the placebo effect.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>One in every four people believes they have experienced some form of paranormal activity. There are many stories of contacts with the spirit world, dream telepathy, clairvoyance and near-death experiences. This parapsychology course delves into the relationship between science, belief and truth as it introduces you to organisations that conduct scientific investigations of paranormal occurrences. We demonstrate the importance of addressing unusual and mysterious human experiences and trace the relationship between science and morality. We discuss randomness and conditional probabilities to explain how something can happen by chance.</p><p>The course then explores the mathematics of probability and establishes the importance of base rates when determining conditional probabilities. We then compare the laws of large and small numbers before moving on to the placebo effect and its ability to ‘trick’ our brains. We explain how to investigate unusual and extrasensory perception (ESP) experiences like hallucinations. The course examines the different forms of spirit healing, psychic photography and psychokinesis. We then explain how psychic fraud works and go through the strategies used by charlatans to fake psychic abilities before we cover mediumship and the ‘survival hypothesis’.</p><p>In the final section, we lay out the stages of near-death experiences and describe the circumstances under which out-of-body incidents occur. The course compares the mediumistic and environmental approaches to hauntings and explains what equipment is used for ghost hunting. We then cover laboratory-based research into telepathy and clairvoyance. Our investigation of the paranormal then moves on to UFOs as we examine collections of debris and sightings like the Roswell and Rendlesham Forest incidents. Finally, the course explains how to assess personality in terms of astrology. Whether you are merely interested in the mysterious side of life or want to participate in formal research, this course offers a fascinating introduction to parapsychology and opens doors into unseen worlds.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}