{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4732","title":"Garden Design Fundamentals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the art of designing and creating fabulous landscapes and gardens in this free online gardening course.","description":"Gardens are essential because they represent a natural environment. In addition, a well-thought-out and carefully planned design can benefit an individual's physical health and emotional well-being. Why design a garden when you can get some plants fixed in the space you want? Discover the significance of a well-maintained garden, its benefits and the techniques for planning and creating a garden. Don't miss out and enrol today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you fascinated by the aesthetic appeal of a park or a garden? These areas are specially designed as outdoor places dedicated to blossoming plants and flowers. The prime motive for establishing them is either for food or aesthetic purposes. They are environmentally friendly because they assist in mitigating climate change in various ways. Growing your own food helps make your diet more sustainable because your food will only have to move a few metres to reach your plate. Do you dream of having a beautiful garden? We’ll show you how to prepare one that will meet your needs. We’ll analyse the essential factors to consider during the planning and the skills required to perform the roles of a garden designer.</p><p>We must follow certain principles to achieve the desired garden layout. Investigate the basic design principles that can serve as a guide. Explore the components of colours, factors that affect colour choices, texture patterns and rhythms that will aid in organising eye-catching outdoor areas. A crucial aspect of this field is a site survey involving several site measurements and collecting data to produce a perfect arrangement. We’ll show you the equipment involved in a site survey and the patterns that can make a garden reflect a sense of peacefulness and excitement. Explore the shapes used on all plan drawings to represent objects and elements in the site.</p><p>Water is essential for life forms, including vegetation. We’ll teach you the importance of watering, building rain gardens and their benefits and maintenance. Do you marvel at beautiful flower beds? Gain insights into the different kinds of flowers and their structures, and colours. We’ll examine selecting trees and shrubs, controlling pests, weeds and diseases and the drainage and irrigation process. The last section of this course will consider the cost associated with key stages of garden design. This course doesn’t require any prerequisite knowledge and anyone can enrol. Do you wish to create your dream garden? Why wait? Hurry and start this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}