{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/2604","title":"Gothic Terror and Grotesque in the Gothic Novel","totalEnrolled":"772","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the nature of Dark Narratives, Gothic Sexuality, Tradition, and Metaphors.","description":"This free online course discusses two significant novels of the nineteenth century namely ‘A Christmas Carol’ and ‘Dracula’. You will learn about the nature of Dark Narrative, Gothic Settings and the characteristics of Ghostly Children in the novel ‘A Christmas Carol’. Further, the plot of ‘Dracula’, literary contexts, the relationship between Vampirism and Residue and the nature of Gothic Sexuality, Tradition, and Metaphors are also discussed.","courseOutcomes":["Outline the early life of Charles Di...","Discuss the plot of the novel ‘A Chr...","Define the term ‘Commodity Gothic’ i...","Explain the nature of Gothic Setting...","Outline the early life of Charles Dickens","Discuss the plot of the novel ‘A Christmas Carol’","Define the term ‘Commodity Gothic’ in the context of literature","Explain the nature of Gothic Settings and Ghostly Children discussed in the narratives","Outline the early life of Bram Stoker","Discuss the plot of the novel ‘Dracula’","Explain the various literary contexts discussed in the narratives of ‘Dracula’","Identify the various Gothic Metaphors used in the narratives of ‘Dracula’","Describe the various Gothic Transformations and the nature of narrative roles","Explain the relationship between Vampirism and Residue","Discuss the issues related to the new woman and the Gothic Monsters","Outline the early life of Charles Di...","Discuss the plot of the novel ‘A Chr...","Define the term ‘Commodity Gothic’ i...","Explain the nature of Gothic Setting...","Outline the early life of Charles Dickens","Discuss the plot of the novel ‘A Christmas Carol’","Define the term ‘Commodity Gothic’ in the context of literature","Explain the nature of Gothic Settings and Ghostly Children discussed in the narratives","Outline the early life of Bram Stoker","Discuss the plot of the novel ‘Dracula’","Explain the various literary contexts discussed in the narratives of ‘Dracula’","Identify the various Gothic Metaphors used in the narratives of ‘Dracula’","Describe the various Gothic Transformations and the nature of narrative roles","Explain the relationship between Vampirism and Residue","Discuss the issues related to the new woman and the Gothic Monsters"],"courseDescription":"<p>This free online course highlights the Gothic imagination of Charles Dickens and the context of the Christmas Ghost Story. You will learn about the idea of Gothic Commodity where the Spectral and the Economics are combined to produce particular effects in the Christmas Ghost Story. This course is arranged systematically and presented clearly so you will easily be able to understand the given concepts.</p><p>Next, the course will cover the nature of Dark Narrative, Gothic Settings and the Characteristics of Ghostly Children. The course then goes on to explain how the aspects of structure and time consciousness relate to the notion of the Gothic. The course emphasizes the nature of the plot of ‘Dracula, the various literary contexts and the various Gothic Metaphors used in the narratives of ‘Dracula’.</p><p>Finally, you will learn about the relationship between Vampirism and Residue and the association of Gothic and Femininity. The concept of the Urban Gothic and the issues related to the new woman and the Gothic Monsters are also covered. Gothic Terror and Grotesque in the Gothic Novel is an informative course which will interest students of English Literature, Researchers in Gothic Studies or those who have an interest in these topics. Why wait? Sign up for this course and start learning today!</p><a href=\"https://alison.com/resume/courses/2604\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2604\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Grotesque Gothic","description":"This module discusses the novel ‘A Christmas Carol’ authored by Charles Dickens. You will learn about the nature of Dark Narrative, Gothic Settings, and the characteristics of Ghostly Children in this novella.","topics":["Grotesque Gothic  – Learning Outcomes","Introduction to the Christmas Ghost Story and Charles Dickens","The Gothic Plot, Spectrality and Commodity","The Dark Narrative and The Ghostly Children","Gothic City: The City of Spectres","Gothic Structure and Time Consciousness","Grotesque Gothic  – Lesson Summary"]},{"name":"Module","details":"Vampires, Moral Degeneration and Late-Victorian Anxieties","description":"This module discusses the novel ‘Dracula’ authored by Bram Stoker. You will learn about the plot of the novel, literary contexts, the relationship between Vampirism and Residue and the nature of Gothic Sexuality, Tradition, and Metaphors.","topics":["Vampires, Moral Degeneration and Late-Victorian Anxieties – Learning Outcomes","Introduction to Dracula, Literary Contexts and Gothic Monsters","Gothic Sexuality, Tradition, and Metaphors","Gothic Transformations and Narrative Roles","Gothic Symbolisms: Vampirism and Residuum","The Urban Gothic, New Woman and Gothic Monsters","Vampires, Moral Degeneration and Late-Victorian Anxieties – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Gothic Terror and Grotesque in the Gothic Novel - Course Assessment"]}]}