{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1926","title":"Graphic Design","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the theory, principles and practices involved in graphic design with this free online Graphic Design course.","description":"This course teaches you the art of graphic design from the ground up and suits novices and those looking to polish their creative skills. We explore the history of graphic design and examine its theory, practices and principles. We then show you how text and images can be effectively used to create an impact and convey a message to a specific audience. These tools can make you a successful graphic designer so sign up to gain a valuable new skill.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Often referred to as ‘graphic design’, communication design uses messages and images to convey information to a specific targeted audience. This course establishes design as a form of problem-solving that creates a system in which to communicate. A good designer breaks the problem up into separate creative activities to find effective solutions and convincing messaging.</p><p>This course begins by navigating the history of graphic design and font development and tracing its use in books and advertizing. The study of semiotics (the science of symbolism and visual messages) allowed design students in the twentieth century to establish coherent parameters of communication. We delve into their work to help you to maintain visual cleanliness and readability while you employ techniques like the dynamic use of negative space, asymmetrical composition and full background photography.</p><p>We explain how the ‘Attention - Interest - Desire - Action’ (AIDA) marketing process works and guide you through the use of the elements of composition: point, line, color, plane and focal point. These techniques are used to create contrast and emphasis and combine with typography to create organizational communication systems. We also teach you how to develop design projects in collaboration with others. Graphic design is a valuable skill and this course suits anyone wishing to work as one, whether you’re just starting out or want to refresh your skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}