{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4906","title":"House Cleaning Fundamentals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the art of keeping your house clean with natural, safe homemade cleaning materials in this free online course.","description":"House cleaning can be time-consuming and is probably not everyone's favourite activity. However, it is a part of our life and ignoring the cleaning chores will not make the mess go away. This course shows how setting up a cleaning routine and having the necessary tools can make house cleaning easier. In addition, you will explore recipes for natural cleansers and sanitisers that will keep your home clean, safe and germ-free.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Everyone likes a spotlessly clean and fresh-smelling house. But, when you consider the size of your home or the number of your belongings, does it seem like a daunting task to keep everything neat, tidy and clean? Maintaining a house is not an easy job. However, daily tasks make cleaning more manageable and less daunting. Dividing the chores into daily, weekly, monthly and yearly habits can go a long way in keeping your home in order. In this course, we will teach you how to care for your home and make the cleaning routine quicker and easier. Do you pay attention to what chemicals you use to clean your house or worry about whether your cleaning products are safe for your children? Learn how to make your own cleaning products that are all-natural, safe and simple to use.</p><p>The first step to cleaning is to have the necessary equipment. Discover how to use different tools for various cleaning purposes, for example: cleaning your computer or removing dust from indoor plants. Study when and where to use the vacuum cleaner, the squeegee, the broom and cotton or microfibre dusters. Research how to remove dirt, dust, bacteria and mould from every type of surface of your kitchen and bathroom using natural cleaning products. Explore the various tricks and tips for cleaning the living room and bedrooms and recipes for natural cleansers and sanitising sprays made from ingredients in your pantry. Uncover the different uses of baking soda, borax, vinegar, natural essential oils and milk in cleaning your home.</p><p>Are you looking for safe ways to have a healthy home that doesn't spread germs and bugs? Have you been putting off cleaning for too long and now have to do a massive cleaning blitz? Our step-by-step guide to intelligent cleaning methods will help you clean every room in the house using homemade cleansers safely and effectively, and your home will be spotless in no time. Anyone can take this course to learn the tips and tricks that will make cleaning less bothersome. You will also have no reason to go out and buy harsh cleaning products full of harmful chemicals and allergens. If you're seeking natural home remedies to disinfect and clean, as well as ways to spend less time cleaning and saving money, this is the course for you. So why wait? Get started today and make your home a safer and cleaner place.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}