{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3699","title":"How to Use Video to Pitch the Media","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to deliver virtual speeches effectively and generate media exposure with videos with this free online course.","description":"This free online course will teach you how to deliver a virtual keynote speech to an audience effectively by guiding you on setting up a video studio and determining your speech goals. This course will show you how to use stories to help your audience understand and remember your message points. You will learn how to create internet videos to generate publicity for your business and establish partnerships with reporters.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A fantastic way of communicating is giving a keynote speech to a mid-size or huge gathering to promote your cause, business or campaigns. But the travels associated with giving keynote speeches can be overwhelming, especially in long distant places – not to mention limitations due to the global pandemic. This free online course will walk you through the step-by-step process of giving a keynote speech virtually to an audience in another city, country or continent. We begin by introducing you to the concept of the virtual keynote speech and the different methods of delivering keynote speeches virtually. You will learn the skills required to give a live keynote speech and a recorded keynote speech. You will learn about the technical requirements for a virtual interview and how to set up your video studio. This course will help you understand how you can use stories to make your audience understand and remember your message points. You will be shown how to determine speech goals and how stories can help you achieve these goals.</p><p>A vast majority of the world's population watches videos online every day on various platforms such as Facebook and YouTube. We live in a video age. Fortunately, the cost of video has dropped so low that you can create tons of impressive videos. These videos have the potential to increase your business's visibility from the comfort of your home. You'll learn how to create videos that will attract various local media for your cause, business, campaign and more. You will explore multiple ways of attracting reporters, thereby using public relations as a tool to get your messages across to your target audience. Attracting reporters is not enough to get you invited for interviews that will get you noticed by a wider audience network. This course will teach you how to build and maintain relationships with reporters and what to do when reporters call you requesting an interview. We will also explore how to use an 'audition video' for public relations (PR) and share videos with reporters.</p><p>Are you nervous about giving a presentation while making internet videos? It's natural to be anxious about giving presentations and knowing that a group of strangers will be watching your every move and word somewhere on the internet. By engaging in this course, you will gain more confidence and avoid the mistakes that amateurs make while making internet videos on YouTube, Facebook and more. Are you a public speaker, spokesperson or vlogger looking to promote your business? Then this course is for you. You will learn to speak in front of cameras confidently and create publicity-generating videos. This course is essential for learners who want to deliver quality keynote speeches effectively and create videos that would increase and grow their business. So why wait? Enrol and get started now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}