{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4120","title":"How to Draw 101","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Unearth a new skill and learn how to draw realistically in this free online course with portrait artist Ethan Moran.","description":"This free online art course trains you to create lifelike drawings. Ethan Moran, a professional portrait artist from Ireland, shares his tips on everything from the best raw materials to use through to the ability of ancient artistic principles like proportion, perspective and depth to bring your pictures to life. We use speed-drawings to illustrate the lessons taught in this easy-to-follow video course that can help you find your own talent.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Discover the satisfaction of rendering a true likeness on paper in these free online art classes. Our tutor, Ethan Moran, is a professional portrait artist who acquired skills and knowledge as he honed his craft over the years. He shares his expertise through short, easy-to-follow video lessons that include fascinating speed-drawings. A craftsman is only as good as their materials and so Ethan begins the course by illustrating the merits of different types of pencil with varying specific gripping methods. He then examines types of sharpeners, erasers and that all-important paper.</p><p>The course then switches focus to drawing techniques, beginning with lines and outlines. Ethan covers some of the established principles of fine art, including proportion, perspective and creating depth. He teaches a range of methods for achieving the correct proportions, such as the ‘square’ and ‘triangular grid’ techniques. A key aspect of drawing for a realistic effect is creating a sense of depth and we examine light sources and the shadows they make as one of the tools at the artist’s disposal. Ethan also covers the rules of perspective: objects that are nearer should appear bigger and lighter than those that are further away. The course covers various shading techniques, from hatching through to the dusty beauty of graphite before moving on to blending techniques. The final module teaches you how to draw the human face and Ethan covers this topic feature by feature. He explains how to get the best results when drawing eyes, lips, noses and finally hair, using speed-drawing videos to demonstrate his methods as they become yours too.</p><p>Ethan’s free art lessons provide an easy and engaging place to start for anyone who wants to learn how to draw realistically. You don’t require any prior knowledge or even latent talent to benefit from the course as drawing is a skill that can be learnt. Ethan is based in Galway and has been drawing portraits since the age of 13. He divides his time between his art and teaching children to draw and paint through a youth organisation. His passion for sharing his love of drawing is matched by his belief that others can master these skills and become better artists than they imagine - and more quickly than they might believe possible. We can help you discover how relaxing, absorbing and rewarding drawing can be as you learn how to capture life on paper. This course suits anyone looking for some expert help and a creative outlet.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}