{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5634","title":"How to Reset Your Life","totalEnrolled":"367","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online self-improvement course explains how to replace bad habits with good ones to improve your wellbeing.","description":"This self-help course explains how to live your life to the fullest. We show you how to declutter and reorganise various aspects of your life, ranging from sleeping habits to time management. We discuss how to rewire your brain by introducing healthy habits into your daily routine. Sign up to learn how to make the most of each day by dropping unhealthy and time-wasting habits and replacing them with meaningful experiences that increase wellbeing.","courseOutcomes":["Define ‘neuroplasticity’...","Explain how to ‘rewire’ the brain...","Identify brain rewiring strategies...","Distinguish between positive and neg...","Define ‘neuroplasticity’","Explain how to ‘rewire’ the brain","Identify brain rewiring strategies","Distinguish between positive and negative habits","Define ‘decluttering’ in the context of self-improvement and wellbeing","Recognise the clutter in your life","Outline useful strategies for decluttering","Identify that which is positive and gives purpose to your life","Define ‘neuroplasticity’...","Explain how to ‘rewire’ the brain...","Identify brain rewiring strategies...","Distinguish between positive and neg...","Define ‘neuroplasticity’","Explain how to ‘rewire’ the brain","Identify brain rewiring strategies","Distinguish between positive and negative habits","Define ‘decluttering’ in the context of self-improvement and wellbeing","Recognise the clutter in your life","Outline useful strategies for decluttering","Identify that which is positive and gives purpose to your life"],"courseDescription":"<p>This personal development course teaches you how to achieve wellbeing. We explain how to introduce new and healthy habits in many areas of life, from sleep and diet to social media consumption and time management. The first step towards living a better life is to recognise the ‘clutter’ that gets in the way. The second step is to get rid of the clutter, which in this context describes patterns of behaviour more than physical objects, and replace it with rewarding and meaningful habits and routines.</p><p>Rewiring the brain isn’t impossible but is no easy task. We suggest a range of new habits you can integrate into your life to appreciate the difference they make. We show you how making small changes can almost immediately give you more energy and free time. The lessons provided by this self-help course help you to notice and enjoy things you haven’t before, like the singing of the birds, the moon and the stars in the night sky, the gentle touch of the grass against your ankles and other small but meaningful moments that stay with you.</p><p>Who wouldn’t want to be happier? Who wouldn’t want to have more energy and free time? This course explains how to take action and change your life for the better. These lessons only take four hours and that time can literally change your life. Our modern lives often seem to fly by as we fill them with the clutter of forgettable experiences and unhealthy habits. This self-improvement course explains how to clear that clutter and squeeze the most out of each day.</p><a href=\"https://alison.com/resume/courses/5634\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5634\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"How to Declutter Your Life","description":"In this module, you will learn to recognize the clutter that fills your life, takes away your energy and time, and drains you of joy. We will look at four areas where clutter is most often found: sleeping habits, eating habits, the use of social media, and finally, time management.","topics":["How to Declutter Your Life - Learning Outcomes","Rewiring Sleeping Habits","Rewiring Eating Habits","Rewiring the Use of Social Media","Rewiring Time Management","How to Declutter Your Life - Lesson Summary"]},{"name":"Module","details":"Building Positive Habits","description":"In this module, you will build upon what you have learned in the first module. Once you declutter your life, you suddenly have more energy, more time, and more space. In this module, you will discover various positive habits - mindfulness, exercise, hobbies, and managing emotions and feelings - that you can use to create a new, healthier lifestyle.","topics":["Building Positive Habits - Learning Outcomes","Exercise as a Positive Habit","Cultivating Hobbies","Practicing Mindfulness","Practicing Gratitude","Building Positive Habits - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["How to Reset Your Life - Course Assessment"]}]}