{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3670","title":"How to Be a Media Trainer","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to become a media trainer to anyone who needs help with media interviews in this free online course.","description":"In this free online course, you will learn how to prepare anyone who will be interviewed by the media. This course will guide you through basic considerations such as being positive and what to focus on in preparing the individual. You will also be taught how to rehearse efficiently to enable optimal use of available resources while building the client's confidence quickly at the same time. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Media interviews are often like double-edged swords. They can be instrumental in promoting a company or an individual's agenda but may, however, end up causing a lot of damage if mismanaged. Getting messages prepared for a media interview is just the tip of the iceberg of good media training. Good media training can include planning on the spot on how to defuse an uncertain or hostile scenario with soothing and non-defensive responses. This free online media training course will show you pitfalls to avoid that can lead to a negative scene in your training session. You will also learn what to do to keep your media training session positive. A video recording of a practised interview session can provide you with valuable insights into a client's performance and communication style. Examining the footage can help you spot out those physical activities that may give an unprofessional appearance or serve as a distraction. After studying this course, you will understand what to watch out for when watching a recorded rehearse interview session.</p><p>As a media trainer, how do you know you are just being smart without yielding value? Some situations would make a trainer look smart without delivering real value for their trainee. This course will explore those situations and give you insight into what to do to avoid such problems. Wasting time brainstorming on questions and answers without organizing possible message points can show how unprepared a trainee is. You will learn how to help your trainee isolate ideas until they can narrow down their responses to questions to the top three messages prepared. Most people are nervous about how they look on camera, hence the need to learn how to help a trainee look and feel comfortable on camera. You will know how to start asking questions about the trainee immediately they come into the room without being confrontational and with the camera in their face.</p><p>One of the significant aspects of media training is recording your trainee secretly without their consent. You will be taught the importance of filming secretly and its role in bringing out the best in your trainee's performance. When a good sound bite is said, journalists acknowledge it. It answers their question swiftly and creates an emotional impact while being relevant and memorable. You will learn what soundbites are, their importance accompanied by the best sound bites. Before you end a typical training session with a trainee, there are key questions you need to ask. These questions help your trainee to internalize what they have learned and make them appreciate you more. You will be shown what these fundamental questions are. This media trainer course has no pre-requisites as it is for beginners. Are you passionate about being able to help anyone prepare for a media interview? Look no further. Enrol immediately and empower yourself with the excellent skills this course offers.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}