{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4215","title":"How to Do Contour and Highlight Like a Pro","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create clean and professional looks using contour and highlight with this free online makeup course.","description":"Have you ever wanted to contour and highlight your face just like a Kardashian? This makeup course will guide you through the steps of applying contour and highlight to add definition and depth to your face. Learn through detailed, step-by-step explanations on how to achieve the perfect sculpted glow. Discover beauty tips and recommendations on which products and brushes are best to achieve a natural, effortless look.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Contour and highlight is one of the latest makeup techniques that has taken the beauty world by storm. Often dubbed the ‘magical technique’, highlight and contour can offer definition to the cheekbone, jawline, nose, forehead and more by simply creating the illusion of shadow and light on the face, achieving a slimming, sculpted glow. To start, this course dives into the history and origins of contour and highlighting. You will learn the differences between cream and powder-based makeup products and why creams are most often preferred by makeup artists. When starting out on your makeup journey, deciding on what products to use can become overwhelming. We review tried and tested ‘cult’ cosmetic items such as the ‘Iconic London’ sticks and ‘NYX Cosmetics’ professional makeup palettes. In addition to deciding on which products to use, the application is also extremely important, be it with a brush or sponge. This course will advise you on the most effective applicators to use for each step. Makeup hygiene is crucial, especially if you are a makeup artist with multiple clients. Learn good practices to follow when it comes to cleaning your hands, brushes and sponges before and after each session.</p><p>Once you have all your products and tools, you are ready to begin contouring and highlighting. Skin preparation is key when applying makeup, so learn how to effectively choose and apply the base coat to your face. You will also study how and when to apply moisturizers and foundations. We show you how to choose the right shades for your contour and highlights and how to blend them into a seamless, natural look. If ‘subtle’ is not your style, we will also explain how to achieve more bold and dramatic contour looks. The world of contour and highlight is vast and ever-changing; explore other related beauty trends like non-touring, strobing, tontouring and baking to help you discover your own style and incorporate them into your existing makeup techniques.</p><p>Using different makeup techniques to achieve certain looks can be a lot of fun and a great way to change up your makeup routine. In the final section, you will study other uses for contour and highlighting such as how to reshape the nose, hide wrinkles and make the face appear slimmer, among others. The basics of how to pick the perfect products for your face will be explored, such as how to choose a foundation based on your skin tone, details regarding the selection of a perfect concealer and information on the best bronzer to choose depending on your skin type. We will also investigate how to find great inexpensive makeup while avoiding cheaply made products. For the budding makeup artist out there, here’s your chance to learn how to highlight and contour like a pro. Sign up today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}