{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3843","title":"How the Acting Industry Works","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the acting industry including developing resumes, taking headshots, and social media in this free online course.","description":"If you have ever wanted to get into the world of acting then you have come to the right place. This free online course will teach you all you need to know about how to get started in the acting industry, learn how to develop a professional acting resume and what types of information to include as well as what makes good, bad, or decent acting headshots, agency versus self-representation, acting reels, social media advertising, and much more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>What does it take to be in the acting industry? Have you ever wondered what is required of you as a budding actor? This free online acting course has you covered and you will be introduced to acting industry basics, acting resumes, headshots, agencies versus self-representation, social media advertising for actors, as well as acting reels. This is the third in the “Acting 101 Course” series by Emma Paunil, the instructor for this course. You will begin with acting resumes and learn how to develop a professional one including where and what to include in your bios or resume header, physical details section, resume selections, special skills, and improvisation experiences. A practical example and template will be provided and will get you shaping your professional resume in no time.</p><p>Headshots are a critical part of the industry and are one of the first things looked at in the auditioning process. Learn how to look good in your headshots, what makes a good and bad headshot, the types of headshots you will come across, dos and don’ts, and how to get creative when taking your headshots so you stand out from the crowd. Another important factor to consider is the age-old agency vs self-representation debate. The considerations for both options, how to spot agency scams, and how to choose which is right for you is then discussed in detail. In the digital age, no discussion about acting, or the arts can take place without a detailed mention of social media. It can be your best ally or worst enemy and the more you know, the better decisions you can make. You will learn how to market yourself as an actor via social media outlets like Twitter, Facebook, and Instagram, what should and should not be shared on social media, frequency of posting, and helpful hints on tagging, hashtagging, profiles, bios, and profile pictures will be provided. The final section in this course talks about what acting reels are, the types of acting reels and how to connect with filmmakers or camera directors for an opportunity to create a reel.</p><p>This acting course includes many practical examples from the course instructor’s own career and you will gain a wealth of knowledge on what it really takes to not only get into the industry, but make a success of it. If you are a budding actor wanting to gain an in-depth understanding of this massive industry, then this Acting Industry Basics course would be a perfect starting point whether you want to learn acting techniques, more about auditioning or how the industry works as a whole.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}