{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4027","title":"Improving Your Self-Discipline","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to develop self-discipline by influencing your daily habits and behaviour with this free online course.","description":"No matter where you are in life, you are disciplined in some way. How beneficial this discipline is, varies from person to person. In this self-discipline course, you will learn how to manipulate your daily habits, using techniques developed by TJ Walker himself, to help you positively develop your self-discipline skills. By learning how to develop your self-discipline you will take back control of your daily habits and behaviour.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>How much control do you have over your behaviour and the daily habits that make up your life? Outside forces, such as fast-food chains and entertainment companies, may have more control over your life than you realize. In this self improvement course, you will learn how to take back control using proven methods to gain self-discipline developed by personal development expert TJ Walker. You will study the Selfie Program and its three methods, which was created to help people develop daily habits that will lead to fulfilment and happiness in your life. TJ's three techniques include the following: recording yourself with your cellphone, taking pictures of yourself and creating a checklist. Are you familiar with the tools available on your phone to make use of these techniques? This course introduces you to simpler and more effective methods of creating your Selfie Programs.</p><p>You will take a deep dive into the seven areas, also known as spheres, of daily habits that you should take into consideration when creating your Selfie Programs. Included in this section are tips on getting the most out of each sphere for your life. You will learn what dictates people's actions while learning how to take control of your life. How much time and effort do you put into your personal health? This self-discipline training covers how you should approach your daily exercise routine while also discussing the types of mindsets people have, according to Carol Dweck. TJ will cover different methods of staying creative as he shares the methods that he uses daily - which includes a discussion on how your finances can influence your daily habits.</p><p>What is self-discipline? As you continue your studies, you will study exactly what self-discipline means according to TJ. This includes how people are already negatively disciplined, how your cellphone is more influential than any other device and how advertising has determined your behaviour and actions, from what you eat to which activities you enjoy in your leisure time. You will also learn about lifestyle changes as TJ introduces 11 tips on how self-isolation can affect your daily habits. This course finishes with some personal tips from TJ on creating your Selfie Programs and the importance of watching or listening to them every day for the rest of your life. Throughout this course on the power of self discipline, you will form a solid understanding of self-discipline, how your daily habits can affect it and the methods other people use to influence your behaviour. Enrol in this powerful course and take control of your habits as you embark on your journey to becoming a better you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}