{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5316","title":"Introduction to Songwriting","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to draw on poetic skills to create memorable and inspirational lyrics in this free online songwriting course.","description":"Songwriting requires both creativity and artistic skill. You may already have ideas for lyrics and this course teaches you how to turn inspiration into songs that connect with your audience. We explore genres from the blues to hip-hop and dancehall as we explain how to include poetic devices in music to help you develop your artistic identity, technique and song maps. Sign up to unleash your talent and learn how to write the next hit song.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Musicians aim to write timeless songs and entertain audiences by creating art you can dance to. This songwriting course breaks down the craft of writing lyrics to help you find your voice and make it heard. We explain how to harness your emotional connections to make them your most valuable asset as a songwriter. Singers are creative and want to put their message out into the world so we provide the toolbox you need to do so. This course explores the craft of songwriting to prepare you to write electrifying hits that appeal to your audience.</p><p>The course first shows you how to find your unique artistic identity. This includes learning how to develop a voice that projects your personal artistic persona and uses language to identify your philosophy and values as you tell your story. We then examine song concepts and explain how to develop the inspiration for writing your songs using the ‘bumper sticker’ and ‘unique points of view’ strategies.</p><p>Finally, we look at famous examples of great songwriting, starting with the poetic artistry behind the line ‘Whisper Words of Wisdom’ from the classic Beatles hit ‘Let It Be’. We also explore the artistic brilliance found in several other chart-topping songs, including Eminem’s ‘Cleanin’ Out My Closet’ and Rihanna’s ‘Umbrella’. The course goes through eight songwriting techniques and over twenty-one literary devices to nurture your songwriting skills. You may already have the musical talent and desire to start writing, but creating memorable lyrics requires skill and the mastery of poetic craft. Sign up for this songwriting course to find your voice and turn that inspiration into lyrics that make people want to sing.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}