{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5321","title":"Introduction to Voice Acting","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to become a voice artist with the exercises and techniques provided in this free online voice acting course.","description":"Voice acting is an art form that allows you to express your creativity and passion as you provide the voices of animated characters. We provide the stretches and breathing routines you need to perform this physical activity. We show you how to locate different resonators in the body and explain how diction, tone and modulation combine to bring a character to life as you interpret their role. Enrol to learn how to become a successful voice actor.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you have an interest in voice acting and would like to explore this craft? There are many animated roles and the entertainment industry needs well-trained artists to perform them. This course is designed for beginners by Stay Curious Media to teach you the basics of voice acting. It provides rudimentary breathing exercises and stretching routines to prepare you for performances.</p><p>By building a column of air as you breathe, you will be better able to project your voice properly and express any emotion without feeling tired. Stretches will also help to loosen you up and make you feel revived. We then examine resonators, which are elements that detect and amplify sound. We identify the different parts of the body that intensify the sounds we produce. Then we go on to focus on diction and projection, which involve how we control our voice in the space and in the moment to create specific characters and their moods.</p><p>The course then delves into accents, texture and tone. Your natural tone of voice is what you normally use to speak to people but you may need to modify it so that it sounds 'natural' for the character you are portraying. Finally, we discuss how voice modulation must be controlled by the speaker to achieve a precise goal that suits the script. Anyone can learn the art of voice acting but success in the entertainment industry requires some dedication and the right kind of training - which this course provides. Sign up to learn how to turn your voice into an instrument that connects with audiences through your creativity and skills as a voice actor.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}