{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4887","title":"Introduction to Self-Defense for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to defend yourself using multiple defensive tactics against opponents.","description":"This free online self-defense course introduces you to easy-to-learn techniques to help you prepare for the worst-case scenarios should action be necessary. Learn everything from defending yourself against wrist grabs, escaping bear hugs, hair pulling, bar fights and opposing multiple adversaries to carjacking. You will master the techniques of dealing with punch defenses and discover ways to take down a boxer successfully. Start training!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you want to feel like a trained fighter? This course introduces you to an experienced martial art expert who will demonstrate fighting skills so that you are ready to defend yourself and your loved ones. You will start by learning how to break free from the same-side, opposite-side and both-side wrist grabs. Then you will study a step-by-step technique to escape choking from the front before learning to free yourself from a bear hug by focusing on the fingers.</p><p>Additionally, you will learn how to escape from someone who grabs you with two hands and defend yourself against someone pulling your hair, no matter its length. Then work through the strategies of protecting yourself against someone holding your wrist from behind. Discover how to get out of dangerous real-life scenarios like knife attacks, bar fights and having multiple opponents. Memorize tactics to avoid being taken down and understand how to escape an opponent if you are on the ground.</p><p>Lastly, acquire the skills of punch defense, especially countering and evading 'standing haymakers' and techniques for defending against straight punches. We will discuss scenarios such as protecting yourself from carjacking. Gain insight into boxing tactics for self-defense and how you can take down a boxer. By completing this course, you will have the confidence and a wide variety of techniques to protect yourself from various situations. Enroll and start practicing self-defense today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}