{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/2645","title":"Introduction to Gentle Craftivism","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use crafts as a tool for quiet, gentle and effective activism with this free online course.","description":"How can handicrafts be used as a tool to help create beautiful, kind and fair activist actions, serve social change successfully and manifest positive change in hearts, mind, policies and laws? This free online course focuses on Sarah Corbett’s unique ‘gentle protest’ approach to ‘craftivism’ or activism through crafting. This course provides frameworks, practical case studies and craftivism projects you can deliver yourself.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, you will learn the definitions of ‘craft’, ‘activism’, ‘craftivism’ and ‘Gentle Protest’ as formulated by Sarah Corbett, founder of the Craftivist Collective. You will learn the theory and practice of this unique form of activism and see how craftivists around the world have used this approach in different contexts and scales to create real positive change personally, locally, nationally and globally. Discover how craftivism can be a tool to foster change as well as when it might not be the best tool to choose out of activism’s toolbox of tactics. This form of gentle craftivism is for everyone, wherever you are in the world: from skilled crafters to burnt-out activists, introverts, highly sensitive people, people struggling with anxiety and those people who want to challenge injustice but do not know what to do, where to start or how to prioritise their energies and time.</p><p>The course looks at how to use the process of crafting for mindfulness, critical thinking about your activism strategy as well as a process for communal craftivism to find common ground and be in solidarity with others to help make our world a happier, healthier and more harmonious place for all. Secondly, you will see how to use the product as a bespoke gift to give to power-holders such as politicians, business leaders, religious leaders and others to encourage them to use their power to contribute to society and to help you be seen as their critical friend holding them account while also showing you believe they can be part of the solution to injustices rather than being seen as aggressive enemies that shout, don’t listen to each other or, worse, ignore each other. Thirdly, you will learn how craftivism can be used in public spaces (offline and online) as small physical catalysts for thought, conversation and positive action. Finally, you will learn about how to measure the impact of your craftivism projects and consider the strengths and weaknesses of craftivism as a movement.</p><p>By the end of the course, you will have a strong understanding of Gentle Protest craftivism and when best to use craftivism in the right context, with the right people at the right time. You will learn from real case studies of how craftivism has helped make positive change in the world in large, small and varied ways through different projects that people have taken part in alone or in groups all over the world in different situations and cultures Understand how important it is to have a clear goal, strategy and power-analysis, and think through how to attract decision-makers to be empowered to be part of the solutions to injustice. The course will give you much more confidence to be a hopeful, kind and effective changemaker using craft as one of your tools to serve social justice!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}