{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4943","title":"Introduction to Resilience Training","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn how to develop effective resilience skills and deal with setbacks and adversity.","description":"This course will introduce you to the boundaries and characteristics of resilience. We will learn the six pillars of resilience and how these six pillars of resilience provide the qualities for developing robust resilience. We will also study intervention strategies, including the process of CASMT training sessions, and how to manage negative emotions and stress. Next, we will explore mental resilience guidelines for becoming more resilient.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course, ‘Introduction to Resilience Training’, will introduce you to the processes, skills and attributes you need to deal with adversity and setbacks. We will talk about positive psychology, post-traumatic growth, boundaries and characteristics of resilience. Then we will introduce you to the various factors of the human body, environment, social and personal views that contribute to resilience. We will then take an in-depth look at the neurobiology of resilience and the appraisal theories of emotion. Wondering what role the acute stress response system plays? We will go into detail on that as well.</p><p>Developing resilient characteristics in a person involves the six pillars of resilience. This course will provide you with a holistic overview of the six pillars of resilience. We will explore how these six pillars of resilience provide the qualities for developing robust resilience. Are you wondering why building resilience takes a lot of hard work and commitment? This course will focus on how to train to develop resilience and explain how to use nature to become resilient as well as how to improve childhood. We will then learn how to practise listening, gaining deeper insights and changing mindsets, including one of the most effective therapeutic techniques for promoting emotional resilience. We will also explore the intervention strategies and process of cognitive-affective stress management training (CASMT) training sessions. We will then learn how to manage negative emotions and stress.</p><p>Most, if not all, mentally strong people are resilient, but not all resilient people are mentally strong. This course provides you with a guide to mental toughness so you can become more resilient. Want to know how to stay focused, disciplined and resilient? This course will cover all of that in detail. We also look at understanding anxiety and fueling your mind as well as body. This course is ideal for anyone who wants to know how to stay positive and control negative emotions as well as setbacks. So start your learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}