{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1871","title":"Introduction to Job Search Skills","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Equip yourself with valuable job-seeking skills and discover how to land your dream job with this free online course.","description":"This free online course, Introduction to Job Search Skills, is designed to give anyone who is looking for work the skillset they need to find the job they are searching for. Searching for a new job is both an exciting and stressful process. From students looking for internships to experienced professionals, job search skills can be invaluable for almost everyone. With this free online course, gain a few more of these skills, today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>First, this course will guide you through the different scenarios of people searching for a job. These include students graduating from school and pursuing an internship as well as people who are returning to the workforce, changing careers, or relocating. You will learn about the importance of an internship in any career, resume and cover letter writing for a job interview, identify the difference between a career change and a traditional job search, and learn the strategies to successfully complete a long-distance job search.</p><p>Next, you will receive a clear overview of the Six-Step Job Search Process. This will help you identify and position yourself for the types of jobs you like, figure out what employers are looking for, develop relationships with prospective employers, and stay connected throughout the decision-making process. Understanding this process will be a great help for eventually securing your ideal job.</p><p>Confidence, communication skills, poise, and physical resources are important characteristics for nailing your dream job. This job search course will show you how to meet the challenges ahead and come through them with a great reward. It will be of great interest to anyone who is actively looking for employment or considering a career change, as well as for professionals in the areas of career coaching and career guidance counseling. So, check out the course and start moving your career forward today!</p><p>Confidence, communication skills, poise, and physical resources are important characteristics for nailing your dream job. This job search course will show you how to meet the challenges ahead and come through them with a great reward. It will be of great interest to anyone who is actively looking for employment or considering a career change, as well as for professionals in the areas of career coaching and career guidance counseling. So, check out the course and start moving your career forward today!</p><p><br><br></p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}