{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5458","title":"Introduction to DNA and Genealogy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how people can use DNA testing to trace their family ties and history in this free online genealogy course.","description":"Tracing your ancestry can yield many benefits beyond being interesting. Some people connect with their sense of self by learning about the history of their family and its origins, personalities, occupations, legacy and aspirations. This course explains how DNA testing can drive genealogical research. We explore ethical issues surrounding DNA testing and examine the workings of the UK Civil registration records to help you delve into the past.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>What distinguishes ‘family history’ from ‘genealogy’? Can you use these two terms interchangeably? This course offers a chance to find out. When genealogists realised how effectively DNA could be used to study family links, they started looking into new applications for the technology. This course lays out the basics of DNA, genes and the relationship between genetics and genealogy. We outline the types of DNA, the use of DNA testing in genealogy and the types of DNA testing for genealogy.</p><p>DNA testing can generate a lot of sensitive ethical questions because it can both establish and deny presumed biological links. The best method for test-takers to avoid and address the ethical difficulties generated by testing is to educate themselves on DNA tests, their results and testing practices. This course explores the ethical issues regarding DNA testing and explains how to use the standards developed by the International Society of Genetic Genealogy (ISOGG) to protect the integrity of the process and the wellbeing of those being tested. We outline the ‘ten rules for genealogical research’ and show you how and where to find the relevant civil registration records.</p><p>A census is a process for compiling data on the constituents of a specific population and is an excellent resource that can be quite helpful when conducting genealogical research. Genealogy can provide several benefits, including how it influences one's feeling of identity. By researching your ancestry, you can also learn about your family's medical history, which can be used to predict longevity or offer hints about a family member's vulnerability to particular medical disorders. Everyone, including future genealogists, can benefit from this course. Today’s expansion of technology and increased use of internet tools has greatly increased interest in genealogy. If you are an aspiring genealogist or one of the many people who want to investigate your family history and genealogy, this course is for you. Sign up to learn how DNA testing can help guide you on a journey into your own genetic past.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}