{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3905","title":"Introduction to Adobe Lightroom Photo Sharing Features","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes the various photo sharing tools in Lightroom, as well as the process of tethering.","description":"If you are a creative and work with many images at the same time, then this free online Adobe Lightroom Tutorial will bolster your efficiency and organizing skills. Learn how to use the many photo sharing features within Adobe Lightroom such as how to navigate the book module, the steps involved in converting an existing page to a new style, functions of the appearance panel, the tethering process and how to create custom online photo galleries.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Introduction to Adobe Lightroom Photo Sharing Features is a free online course that has been carefully curated to teach you about the various photo sharing tools and applications that Lightroom offers. When working with the book module, it is important to have a clear set of goals and the three book module options available will be discussed as well as the book settings configurations. In this section you will also learn how to convert an existing page to a new style and the importance of the guides panel. The guides panel shows you where text elements are positioned along with many other important layout elements and functions. Did you know that the text, background and type panels play an important role in editing and formatting as well? You will be guided through these many functions and then, how you can use a company called Blurb to print photo books. The services provided by this company and how to export books to Blurb will be discussed in this part of the free online Adobe certification.</p><p>Once you know how to organize your photos, the next step is deciding on the kind of presentation you would like. How to set up slideshows and the preparation and printing process is discussed in detail. For slideshows, you will be taught how the slideshow module works and the tools it has to offer and for printing, how to create print templates and prepare for printing. Creating print templates is very similar to the book mobile because it starts with selecting the images you want to use so a lot of your previous knowledge can be applied to this section. Once you are satisfied with your images, the next step in the print preparation process is called soft proofing. This gives you a chance to view a simulation of your images once they are printed so you can check the colours and output. There are many other options at your disposal in Adobe Lightroom, and this Adobe Lightroom quick tutorial takes you through the various layout styles, page panel, page options, and how to address common errors in the print module.</p><p>Adobe Lightroom is a powerful program that is easy to use and understand, however, there are many features that people do not necessarily know about and that is where this in-depth Lightroom course comes in. You should enrol for this course if you are a professional in photography or graphic design, or take photos as a hobby and want a more efficient way of processing, organizing, sharing, and displaying your photos through slideshows and photo books.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}