{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1797","title":"Job Search Skills - Preparing Your Resume and Cover Letter - Revised","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn valuable skills on how to write your perfect résumé and cover letter from this free online course.","description":"This free online course on Preparing your Cover Letter and Resume will teach you how to ace your cover letter and resume as well as the essential aspects for landing your perfect job. In this course you will learn how to cultivate the ability to plan, design, and write the perfect resume and perfect cover letter. The biggest thing that stands between you and your dream job is a great job application.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course first breaks down the job application process, so you can ensure that you identify and apply for the right job. It then goes through the essential elements of a resume, showing you how to design a professional header and layout, write a concise outline of your background, and format your resume differently depending on what kind of job you are applying for. Then you will learn about the cover letter planning and design, before giving you the examples to work with.</p><p>Furthermore, you will learn how to conduct essential research for a job application. This will include how to find specific industries, functions, and geographies of interest to you; so that you can make a great application for the job you really want. Then, you will be shown how to quantify your accomplishments and create a resume that proves your worth to employers. Finally, you will learn the techniques for clear and simple writing to get your resume and cover letter noticed. By the end of the course, you will know exactly how to make a professional and impressive job application.</p><p>The ability to plan, design, and write the perfect resume and cover letter is one of the most valuable skills you can have in life. Everyone is searching for their dream job, and one of the biggest things that stands between you and that job is a great job application. This online course is for anyone interested in learning how to write a resume and cover letter that will help them get the dream job. Enroll in this online course today and gain knowledge and skills on best practices to write an effective resume and cover letter.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}