{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3983","title":"Landscape Photography - Exposure, Composition, and Editing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to capture beautiful images and edit them like a pro using Adobe Lightroom with this free online course.","description":"Do you love photography and want to level-up your technical skills? This free online photography course can help you do just this with the help of Adobe Lightroom. Get ready to learn all you need to know about these crucial photography elements. You will learn the step-by-step practical procedures of finding the right exposure and composition for your images as well as which editing tools in Adobe Lightroom to use to create visual masterpieces.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>There is much more to photography than just pointing your camera at a subject and clicking the “snap” button. There are skills and techniques that are fundamental in producing quality images. Photography in these modern times requires a meticulous understanding of the basic and unique features of a camera and its components and how to correctly set the camera to capture beautiful images. This free online photography class will teach you about histograms, the principles of exposure, importance of natural light, and how light greatly impacts captured images. The next set of skills you will learn is all about how to shoot in the sunset with a single exposure compared to multiple exposures and this sets the foundation for learning about photo composition guidelines and the so-called “rule of thirds”. The composition theme in this photography certificate moves on to teach you about leading lines and its relationship with diagonals in photography, how scaling and lighting can be utilized to create good images, and how different focal ranges and framing affects scaling.</p><p>Photography is vast, and this course uncovers many lesser-known tricks that can set you apart in this field. Your composition skills learnt in the previous section comes into play when the content discusses wide-angle photography, telephoto photography, and how the focus stacking technique (where you have taken multiple images with a different focus) can produce a very good image when worked on at the post-production/editing level. Another amazing photographic skill to have is that of panoramic photography where multiple shots are combined to form a stunning almost-continuous shot. Some of these panoramic techniques are covered before moving on to learning all about minimalistic photography. Taking the photograph is only the start - it still needs to be edited and you will be taken through the post-production process with an Adobe Lightroom quick tutorial so you are able to put the finishing touches on your images.&nbsp;</p><p>This free online photography basics course will allow you to refine your skills and learn the technicalities you need to make your shooting more efficient, beautifully composed and exposed, as well as improve your image editing. The content is arranged in a systematic and helpful way so you can coherently learn the theory but apply it through practical tips and&nbsp; demonstrations. Achieve even more in your photography career by enrolling in this course as a creative student, someone in brand marketing wanting to hone their technical creative skills or if you simply love taking photos as a pastime and want to add another layer of expertise to your budding hobby.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}