{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4028","title":"Law of Attraction","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will help you improve your manifestation skills and use the law of attraction for your benefit.","description":"Learn manifestation techniques with this free online motivation training which will teach you how to train your brain to create abundance and attract prosperity. Some of what you will study includes the secrets of the law of attraction, how to focus on the positive, as well as an audio creation system that will help you transform your mindset into a growth and success mindset through self-discipline and daily habits.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you looking to live your best life? Are you tired of trying your best but not seeing results? The law of attraction might be the answer to your problems. This law states that positive thoughts can bring positive outcomes to you while the opposite can also be true - negative thoughts bring negative results. How many times have you wanted something to happen but at the back of your head there was a little voice saying “It's not going to happen”? Let this motivational skills training guide you to avoid that kind of self-sabotaging behaviour. We have the right to live in full abundance, that is, to have everything we need at the right time that we need it, to live in joy. Due to limiting beliefs inherited from our relatives at the beginning of our life and from the society where we grow up later, we put up barriers that separate us from this life. In this course, you will learn techniques and tools that will help you to free yourself from memories, beliefs and programs that are separating you from the life you have always dreamed of. Of the many things this positive mindset course teaches, some of them include studying the barriers that separate you from abundance, mastering the universal law of attraction and learning how to change your life and get the universe working on your behalf.</p><p>Do you wonder why there are people who achieve what they want while others do not? Have you ever wanted to know what the secrets of successful people are? The law of attraction tells us that everything you focus your attention on is what you grow, what you feed, what you attract over and over again. Many times we are adrift from circumstances and events that happen to us. We depend on the state of mind in which we find ourselves and the state of mind of those around us. You will learn how to change things in the way you see things, feel them and experience them. It will change the way you relate to others, and things that you previously saw impossible will be at your fingertips and you will have an incredible life full of magical moments.</p><p>This course in the principles of motivation is aimed at all those who want to make a positive change in their lives and want to eliminate limiting beliefs and thoughts and transform their life into unlimited blessings. Do not wait any longer and dare to create changes and generate prosperity in your life through the establishment of daily habits that will guide you in achieving the objectives of all areas of your life. By enrolling in this course, you will be guided through the law of attraction and also of personal growth regarding what the goals and objectives are that you want for your life, giving you the opportunity to achieve them and enjoy a full life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}