{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3913","title":"Learn How to Build Confidence and Stay Persistent as You Face Obstacles","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover what's keeping you from being self-assured, and learn to add grit to the mix with this free online course.","description":"Being unique is not a bad thing. But what if your uniqueness involves avoiding challenges, quickly losing confidence, and lacking determination? It doesn't have to be this way. You will learn what you need to build self-confidence and how to overcome common obstacles. Discover how to be more courageous, but also when it makes sense to quit. This free online course will provide you with direction so you can start your self-development journey.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Did you know self-confidence and self-esteem are closely linked, and both are founded on past experiences and the outlook of future performance? You probably don't realize the full extent to which self-confidence controls your life. Let's change that. The course starts by explaining what self-efficacy is and the different ways it shapes your life. You will study the four main factors that influence self-efficacy. You will also learn how you can use these four factors to improve your self-confidence.</p><p>Next, we will explore the fundamentals of grit. We'll help you understand when quitting makes more sense than perseverance. We will then look at typical ways people self-sabotage and the prevalent limiting beliefs they hold. You will also learn the characteristics and mentality of a determined person. This includes an exploration of techniques to be more relentless and avoid impatience.</p><p>Finally, you will discover which actions to take and which to avoid in attaining your objective. We will provide you with the tools to transform yourself and create a better future by taking action and applying other concepts from the course. Start this free course now and to get direction, and achieve your goals.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}