{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3892","title":"Learn How to Practice Self-Discipline on a Daily Basis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the importance of health, learning, and mindset in your self-discipline journey in this free online course.","description":"You might have remembered hearing the phrase \"I am the master of my fate\" in Invictus. Have you ever been perplexed as to how that is possible? If this is the case, you have come to the right place. This self-discipline course is all about self-control and making changes to your thoughts and behaviours by optimizing your mindset and habits including how to develop self-discipline, avoid temptations, and achieve your long-term goals.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Did you know that self-control makes people happier? A life without self-discipline leads to frustration. However, this does not have to be the issue. This self-discipline training course will teach you techniques for becoming more self-disciplined. It begins by demonstrating the most basic aspect of self-restraint and you will look at how physical activity, food, and fasting can help you achieve your personalized goals. The course will show you the various training techniques and you will then choose which of them work best for you.</p><p>The instructor then illustrates how discomfort is a necessary component of building self-discipline. At this time, you will understand how learning difficult things help you get closer to your goals. Then, you will grasp the role of meditative practice and the influence and power of mindset on self-discipline.</p><p>Once you complete all of the course modules, you will have the tools needed to start transforming your life and the amount of time you feel frustrated in your daily life will gradually decrease. By recognizing the important role of health, learning, and mindset in your life, you will have a toolset to work on self-discipline daily and be able to live healthy habits. This motivation training is for you if you struggle with personal and professional motivation and could do with practical help to bring structure and positive energy into your everyday life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}