{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4174","title":"Making Script Patterns With CorelDraw","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the essentials of script patterns and CorelDraw for improving your tattoo art skills.","description":"This script pattern course provides a comprehensive guide to making colourful patterns for tattoos. You will learn the basics of CorelDraw in the design of script motifs, including how to use scripts and fonts in the creation of patterns. Discover how to make advanced designs using the ‘swastika base’, an ancient symbol representing spirituality and divinity, and plan out cutting-edge artistic concepts for use in the graphic design studio.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Did you know that graphic designers can create stunning works of art using script patterns? Discover these essentials, taught by famed tattoo artist Lily Lu, by learning about psychedelic art composition and exploring the intricacies of CorelDraw using vector programming and identification of different pattern shapes. Do you know the difference between patterns and scripts and what the combination of both can do for your design? Analyse the step-by-step process of selecting scripts from CorelDraw dropdown and learn how to convert some to vector, consequently making a wonderful design.</p><p>The course then explains the make-up of vector graphics as lines and dots. Understand the functions of the wireframe under the ‘view’ options in CorelDraw. This course will teach you about what happens when you change from wireframes to Heinz during your design. You will learn how to make different designs using the drawing tools including how to separate your words and apply different graphics to them. Differentiate between the functions of a font and a script while designing. This course will further explain the functions of ‘helping lines’ in keeping your design in shape. You will also understand what to do with vectors at different stages of your creation. Examine how to play with your fonts as you group and ungroup your words, including how to make two letters become one in CorelDraw.</p><p>Finally, explore the usage of ‘straight script’ patterns along with their application to graphic design. Delve further into the usage of these patterns by playing with the options available, such as the arrow function and other tools in vector programming, and make advanced designs such as the ninety degrees swastika, the ancient symbol representing spirituality and divinity, using swastika-base patterns. You will also be able to recall the step-by-step processes involved in creating this design in CorelDraw using vectors. Enrol today to learn tips and hacks to employ when designing the perfect script pattern with CorelDraw.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}