{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4932","title":"Making a Memory Quilt","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to make a memory quilt from scratch by exploring its techniques and insider tricks in this free online course.","description":"Did you know that you can preserve your special clothing by converting it into memory quilts? Anyone can learn how to make a memory quilt and knowing where to start is the key. This course provides a complete guide on how to cut, deconstruct, stitch, sew and convert any material clothing into memory quilts. Louise, your instructor, will show you all the materials and strategies you need to make beautiful memory quilts.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Memory quilts are made of materials that are memorable and important to the person who owns the quilt. These frequently include diverse clothing and fabric types such as caps, formal shirts, pants, gowns, ties, bridal gowns or any lovely fabric you can sew. Memory quilts also include other elements, such as photos and stitched quotes or sayings, to further personalise them. These quilts help you celebrate and reflect on significant milestones. In this course, Louise, your instructor, will show you how to make various forms of memory quilts by guiding you on how to select, categorise, cut and sew the memory materials from start to finish. First, you will be introduced to memory quilts and shown some of the memory quilts that have been already created.&nbsp;</p><p>Starting with equally cut fabric pieces is crucial if you want to finish with a level, symmetrical quilt. A proper cutting tool makes the finished product look more professional. We will introduce you to some cutting tools and sewing materials needed to make the quilting process easier and faster. After that, Louise will guide you on how to make your first memory quilt project (pillow quilt). We'll demonstrate how to cut the pieces from the material's most distinct features and stitch them together by hand and machine while staying focused. The next project will be to make a T-shirt quilt. These primarily rely on how big and elaborate the quilt is. It can take longer to plan, layout and assemble a larger quilt since more materials will be required. You'll explore some tips and tricks that you can use to make a quilt from a T-shirt.&nbsp;</p><p>You must become familiar with several terms and approaches when it comes to quilting. Explore some of the best practices in quilting and how you can use them. We cover techniques such as chaining, piecing, quilt-as-you-go and more. The final part of the course will teach you how to deconstruct quilting materials and construct pinwheels for your quilt projects. This course is a guide for a total beginner and can also serve as a refresher for anyone wanting to learn the basics of memory quilt-making. Quilting is a valuable and enjoyable hobby that helps to boost your creativity. By the end of this course, you will have gained the necessary skills to create a basic memory quilt that will appeal to anyone. So without further ado, enrol now and start learning to quilt for free!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}