{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1927","title":"Mental Freedom: From Pain To Power","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free yourself from old pain... And live the life you were meant to have with this free online course!","description":"This free online mental health course will teach you how to alleviate mental pain. You will gain a deep understanding of the nature of your pain/problems and learn to find the solution, which will help you feel amazing and have the life you deserve. By learning the hidden secrets of psychology that can give you skills almost nobody has, you will gain a wealth of new coping skills and easily transform your life from pain to power!!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you only do one course this year … it has got to be this one! &nbsp;The free onlinec course Mental Freedom: From Pain To Power is a self-help psychology course that will train you how to deal with the common issues virtually everybody has at some level. In this course you will learn the hidden secrets of psychology known to only a very select few and will give you an unfair advantage for the rest of your life. Leave your old pain behind … and gain joy!</p><p>You may have been cheated your entire life … and it’s not your fault! You were probably never trained in how to use your mind …to understand what that drives peoples every actions, how self-image determines what you will and won’t do, and how personal illusions, which when challenged, can unleash your hidden potential thus allowing you move your life from pain to joy.</p><p>This psychology training will help you feel fantastic by helping you understand how false personas drive the habits and behaviors of yourself and others, and will allow you take back control and free yourself. Learn about these hidden secrets of psychology that can give you skills not many people have. Taking this course will possibly be the first step towards a new you – So start this course now and transform your life from pain to power!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}