{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3732","title":"Mindfulness for the Modern World","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn to achieve mindfulness with the help of yoga, meditation & the Selfie Speak Program","description":"In this course developed by expert TJ Walker, you will learn his innovative techniques using cell phone technology to lead a more mindful life. This course will help you understand what mindfulness is and its benefits. It is beneficial if you're easily distracted, check your email too much, or are obsessed with news and social media. Sign up now if you'd like to be more present and leave the distractions behind!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Would you like to be more present? Would you like to achieve a state of mindfulness more often instead of constantly fretting over the past or the future? In this free online course, personal development expert TJ Walker will show you his innovative techniques to lead a more mindful life. We will study the benefits of the mindful brain and how you practice mindfulness in your life. We will also take a look at how to stop multitasking and increase your focus on work. In addition to this, we will learn the steps to deprogramming your negative thinking. This course will help you identify the problems and reasons for distractions you face because of the overabundance of technology and media in this day and age.</p><p>We will guide you through the characteristics of mindfulness in detail. You will learn how to develop a mindful approach to your cell phone and an easy alternative to yoga to improve your mindfulness. We will also study how to create your own Selfie Speak Program to help you reprogram your brain and improve your mindfulness. In addition to this, we will look at the benefits of sports in mindfulness and how it can help you boost your focus on your daily tasks. We will show you how to integrate mindfulness into all aspects of your life. If you're addicted to news, you'll learn why it's not conducive to mindfulness. This course will help you overcome this addiction. You will also learn to ditch your alarm clock and still sleep the required amount of time your body needs.</p><p>This course is all about how you should practice mindfulness in your life. It provides practical tips to help you organize your life, such as eating healthy food, exercise, and sports activities. We will also discuss why it is important for you to say no to other people's demands. You will study the importance of purpose in life and the most effective ways of organizing your life. Furthermore, this topic will explain how to increase your focus and limit your social media usage. If you are ready to start getting more mindful moments out of life daily, then sign up for this mindfulness course now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}