{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5233","title":"Mobile Photography","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the art of mobile photography in this free online course that explains how to take great photos with your phone.","description":"Mobile photography is a great place for prospective photographers to start since smartphones offer unique opportunities and challenges. This course lays out core photographic concepts, including lighting, multiple camera modes, settings, add-ons and much more. We help you to develop the digital skills required to harness your creativity and create memorable photos. We also explain how to use Instagram and edit your photos.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A smartphone with a good camera is a wonderful way to take photographs as it presents countless opportunities to capture unplanned moments and sights as you’re likely to carry it wherever you go. Mobile phones can take iconic pictures if you know how to use them but smartphone photography presents its own challenges. This mobile phone photography course takes you through the essentials of photography and identifies the necessary equipment. We then compare smartphones and digital cameras and lay out the benefits and drawbacks of taking photographs with a phone.</p><p>The course then establishes the importance of lighting in all types of photography. Even if you have no idea how to use the many shooting modes on a smartphone, this course teaches you everything you need to know to make the most of your phone’s camera. We help you develop your ‘eye’ and photographic skills as you capture the world around you. We also demonstrate how to get the best possible shot with your smartphone by tweaking your camera's settings in different situations and environments.</p><p>The course compares various add-on lenses available for smartphones and highlights the effects of each on your photos. All photographers need tips to improve and we cover a wide range of techniques to help you polish your photographic and editing skills. Finally, we show you how to make the most of Instagram as you seek to turn your digital art into content and online engagement. This mobile photography course is designed to help you harness your creativity and create memorable images of the world around you as you go about your day.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}