{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3124","title":"Motorbike Maintenance for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics and master the techniques of motorcycle care with this free online motorbike maintenance course.","description":"Driving a motorcycle is thrilling but experienced owners recommend getting to know your bike to stay safe and save money. Taking care of it is important and performing little fixes by learning to recognize mechanical or electrical issues can help prevent major breakdowns. We examine useful and easy-to-follow methods to check, repair and replace engine components in this free mechanics course designed to keep you riding.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Motorcyclists say that driving a motorcycle is like flying and makes you feel alive, powerful and free. While wheeling your new bike out of the shop, you were probably more focused on riding than maintenance but experienced bike owners agree that to do the exciting stuff, you first have to know how to take good care of your machine. We begin by explaining the type of tools commonly found in a workshop that are usually bought only when needed. While working with tools, it is very important to be aware of potential safety risks so we will unpack the most common concerns and solutions.</p><p>As you become familiar with your bike's components, you will start to appreciate how the various parts work together to achieve their intended design, starting with the engine and its ignition system. If its timing is off, you can follow the easy steps outlined in this course to adjust it correctly. In addition to its body and moving mechanical parts, a motorcycle also consists of electrical components. Electrical checks can tell you if a specific piece is working correctly or if there is a faulty connection. During an electrical replacement or repair, special care must be taken to prevent short circuits and injury.</p><p>We also offer helpful tips to help you make your bike look good and turn heads. While everyone has their own approach to cleaning a motorbike, there are recommended procedures to avoid as they can damage sensitive components. If your bike doesn't turn on after washing, we offer troubleshooting tips to help you identify the problem and possibly save you some money. This course is for first-time owners, potential buyers or aspiring mechanics as we show you how to keep motorbikes safe, well-tuned and running at optimal performance. This will help you spend more time on the open road and less time in the workshop.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}