{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1279","title":"Music Theory: Melody and Harmony","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to identify different musical scales and build chords with ease with this free online music theory course.","description":"This free online music theory course will introduce you to the concepts of melody and harmony, improving your music comprehension drastically. In this course you will study important music genres, learn how to recognize different chords and harmonics, and study famous composers such as Mozart and Wagner and their various musical techniques. If you're looking to improve your musical understanding, this course is a great place to start.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This online music theory course will teach you how to identify different chords in a melody. You will first study the development of notes and musical scales as well as distinguish between major and minor scales. This will help you develop your music listening skills. The course will then cover the works of Mozart, who is said to be the most gifted musician in the history of classical music, and Wagner, who is known for his epic operas.<br><br>You will then learn how cadences and sequences can be used in musical excerpts, and will stube guided through chord progressions, harmony, and bass patterns. The course will also teach you how to build chords in a melody. You will also listen to blues and rock musical genres to get an idea of how chord progressions are used, as well as learn how to identify between a regular and an irregular rate of harmonic change.<br><br>Versatile and skilled musicians are not made overnight, it takes a lot of practice and training. This free online music course will help you develop your musical ability and pave the way through your music journey slowly but surely. This course is the second in a series of music theory courses, so it's important to first complete Alison's Music Theory: Instruments and Rhythm course. If you have done so, start this course now and strengthen your aural listening skills today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}