{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4749","title":"Phonics Teaching Guide","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to teach phonics using the right approaches and methods for different learners in this free online course.","description":"Do you want to be the brain behind a child's ability to read, write and speak? Explore the basics of phonics, the most suitable techniques for teaching phonics and the benefits of involving parents and carers in the process. Investigate the differences between the parts of speech, devise strategies to support various types of readers and assess and keep track of your student's performance in their journey to learning phonics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Phonics is a style of teaching how to read. It includes matching sounds to letters or groups of letters. We will teach you the basics of phonics and the approaches to teaching it to children as a rewarding and important life skill offering a wide array of career opportunities. ‘Jolly Phonics’ is an interactive, diverse children-centric set of techniques for teaching how to read. We will show you the importance of teaching ‘Jolly Phonics’ and how to do it in various ways. Phonics teaching isn't limited to classrooms and lectures. The understanding and progress can be significantly enhanced by involving parents and guardians to teach it outside the school environment. In this light, learn to encourage parents and carers to become involved in the teaching process by working with children or wards during their spare time and informally boosting their learning.</p><p>Phonics awareness is the understanding of the spoken language with the ability to recognise and distinguish between the parts of speech. Explore various elements of speech that form the entirety of the English language and how to break them down into smaller units for better recognition and familiarity. We will show you the systematic assessment techniques used when teaching and record-keeping methods to ensure the best results. Each child is different with their unique abilities and learning styles. Identify the types of learners and use the proper techniques to support them. Finally, we go through common phonics challenges, how to solve them, how to deal with a deaf child and how to teach advanced phonics levels.&nbsp;</p><p>We designed this course for people who want to teach phonics as a profession. It is helpful for those already teaching and who wish to upgrade their knowledge base and skills on the subject. This course requires no prerequisite knowledge or experience. We break down different methods and practices into small, easy-to-follow steps. Phonics teaching is a full-time career as every student needs to learn it in the early years of their studies. This career can be lucrative, offering up to £40 000 as a beginner salary in the UK. If you want to work part-time as a phonics tutor, you can approach thousands of students looking for online phonics tutors every day. Also, as a parent or guardian, you will be better able to help your child using the different activities and games outlined in the course. Join today and learn for free!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}