{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4590","title":"Piano Lessons for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore basic music theory and learn piano skills to play simple songs fluently in this free online course.","description":"Learn to confidently play songs on the piano in this complete beginner course. Explore the basics of playing the piano, beginning with the keyboard structure - the white keys and accidentals. The lessons will discuss tones, scales, intervals and chords while you practise them on the piano. You will practise all your new skills using two popular songs to be ready to progress to the intermediate lessons by the end of the course. Enrol today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free piano course is for newbies. It is designed to provide a solid foundation for learners to improve their skills progressively. Sly Mills Jnr, the instructor, grew up with a passion for music and has been a music director and piano instructor for the past fifteen years. He has taught people of all ages to play the piano. He is also the founder of ‘Miuzikempire.com’, a resource site for aspiring musicians and enthusiasts. Sly teaches beginners with clarity, simplicity and technical competence. You can expect to begin playing easy tunes by the end of the course.</p><p>We will start with the keyboard structure, exploring the names of the white keys and accidentals. Here you will understand how the twelve music notes were derived. We will then discuss scales and how they are constructed from tones and semitones. Explore the major scale and learn about ‘intervals’ - the distance between notes. The following section discusses the major chords on a piano. A chord is a combination of three or more notes played simultaneously but we will focus on playing mainly three for this course. We will analyse chord inversion and examine how to form minor chords.</p><p>The course will then teach you about suspended chords. There are two types - suspended two and suspended four. We will examine diminished chords constructed by playing the root note, the flattened third and then the flattened fifth. Finally, we combine everything you have learned and practised in two popular songs: ‘The Storm is Over Now’ by R. Kelly and ‘You Raise me Up’ by Westlife. If you are anxious about playing and feel inexperienced, this course is perfect. It will prove that anyone can learn to play the piano from scratch. With consistent practice and some discipline on your part, you too can attain skills. Sign up today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}