{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3838","title":"PowerPoint for Business Communication","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study how to create beautiful, functional presentations using Microsoft PowerPoint with this free online course.","description":"PowerPoint is so popular that it has become synonymous with presentations. In this PowerPoint course, you will learn the fundamental principles of PowerPoint and its many functionalities. You will be taught how to create well-structured presentations as well as how to deliver these presentations to audiences who will not only understand the message points but will remember all of them and be able to put the content into practice.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you given a PowerPoint presentation before? Or have you given a presentation using PowerPoint before? Wait, is there any difference here or is it just a play on words? Many people use variants of these statements in conversations all the time without giving it much thought. This presentation course will start by clarifying this confusion before proceeding to teach you what to do to ensure a perfect start to any PowerPoint presentation. You will learn how to motivate your audience to do what you want them to do and how to determine if the use of PowerPoint is necessary for the given situation or an alternative like a simple word processor is sufficient. After you confirm that PowerPoint is appropriate for the occasion, you will learn simple techniques for every PowerPoint slide such as ‘Double Your PowerPoint', 'Double Your PowerPoint Pleasure’ and 'The Ultimate 2-Part Test' that you can put to use to ensure your presentations are properly structured and delivered and that your audience derives the optimum value intended.</p><p>What kind of PowerPoint presentations have you attended in the past and how did they turn out? Would you rate them as bad, fair, good or excellent? In this course, you will be taught the riskiest thing you could ever do when delivering a PowerPoint presentation. The course content also explores how to prepare and conduct yourself mentally, emotionally and physically to deliver memorable presentations to your audience. In addition to this, you will be taught what should be included on your slides, how to use a graph in PowerPoint and the volume of text that is advisable for each slide. You will also learn about appropriate sequencing for your presentation, how to get your audience focused on one thing at a time, 'advancing slides the advanced way’ and why you should always have a good remote control handy. Additionally, you will be taught why complexity is your enemy, the importance of rehearsals and the place of laser pointers. Other things you will learn include the perfect length of time for PowerPoint presentations, the secret weapon for winning presentations all the time and how to get third-party feedback whether it is from a colleague or a member of the audience.</p><p>We often get to the venue of our presentations and discover that one or even multiple variables like bulbs, power chords, data cables, projectors and screens are either faulty or unavailable. This course will teach you how to prepare for any of such eventualities. Your learning includes exploring PowerPoint’s many features and the ideology behind using such features cautiously and/or sparingly. One of the features that will be discussed here among others, is special effects. Discussed in this section is the ideal number of bullet points to put on slides and the ideal number of slides to put in each presentation. This presentation design course is important for anyone that wants to make their presentation more exciting by using multimedia to boost their audience's focus and is ideal for creating and delivering PowerPoint presentations for lectures, seminars, sales pitches, and business presentations. So if you are interested in creating professional presentations using Microsoft PowerPoint, then you should enrol and explore the rich content offered in this free online PowerPoint design course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}