{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4705","title":"Presentation Skills for Introverts","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"You'll learn how to connect with your audience and deliver an effective presentation in this free online course.","description":"It is one thing to have a vast knowledge of a subject matter, but it's quite another to be able to deliver it to an audience. You can learn and develop presentation skills, even if you're an introvert. Do you have something exciting to share with an audience? We'll show you tools, tips and tricks that will help you deliver a passionate speech and demonstrate your ideas to your audience. Explore various techniques to help your presentation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A presentation involves getting a message across to listeners using effective means, tools and techniques to arouse their interests. The message can be an idea or something you are passionate about and want to convey to an audience. Unfortunately, many people experience stage fright when asked to speak publicly, resulting in poor execution. The good news is that being able to present information is a skill you can learn. Do you have an important pitch coming up but are scared and don't know how to ensure that you nail it? We will teach you the strategies to employ for effective presentations and show you the necessary tools to spice it up. We'll begin by exploring the different demonstrations you can apply to various occasions such as business conferences, educational events, birthdays and so on.</p><p>The areas you focus on guarantee your audience's attention. Discover how to focus on critical sections in your delivery to ensure that your listeners' engagement is under your control. Gain insight into the importance of gathering enough information before making a presentation. Analyse the various online software and tools that can help you effectively present your ideas. Study the dos and don'ts of creating compelling slides that can keep your audience captivated ‘till the end of your lecture.</p><p>Google Slides, an online tool for creating presentations, is efficient and easily accessible. You will learn how to use Google Slides to create visual and background images to make them appealing. Always be prepared for any mishaps that might occur while speaking and be the star of your production. We then demonstrate ways in which you can steer your audience's engagement when making a speech so you do not lose their attention. After that, we discuss the importance of body language, how to use a microphone and how to deliver a speech online. There is no prior knowledge required for taking this course and we have designed it for anyone. Do you want to improve your presentations? Master this vital skill and enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}