{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4323","title":"Professional Emotion Coach","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Acquire the knowledge and skills required to be a professional emotion coach in this free online course.","description":"Self-help and coaching are often appropriate solutions when we face poor emotional health. This fact is exciting and motivating, allowing us to help others and ourselves without necessarily reaching out to professionals. If you obtain the skills, you might be able to become a professional emotional coach. This course will teach you where it is appropriate to coach and do self-help and where licensed professionals should be involved!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Emotional health requires emotional management, emotional intelligence and control (controlling anger and fears). This course starts by differentiating between emotional and mental health before teaching you the habits that promote emotional wellness. Next, we study how to get in touch with your feelings and deal with them before examining how to manage emotions, including identifying them and using emotional intelligence for management.</p><p>The instructor will then illustrate how to cultivate self-compassion and emotional intelligence. First, you will appreciate the role of introspection in working towards self-love and obtaining advice on developing it. Then, you will grasp the importance and steps on how to build self-compassion and be able to differentiate between sympathy and empathy. Finally, you will master the different ways to measure emotional intelligence and how the emotional brain hijacks our rational/logical brain.</p><p>The final section is about understanding the causes, types and styles of anger and effective anger management. Furthermore, you'll grasp how to find comfort during a crisis and the increased susceptibility to depression and suicide. Lastly, you will find out how to manage anxiety and conquer fear. Once you complete the course, you will have the skill to become a professional emotional coach. Start our free emotional health coaching course and bring comfort to those facing emotional issues.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}