{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4416","title":"Professional Life Coach","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the latest coaching approaches to help individuals form new directions in this free online life coaching course.","description":"Are you an excellent problem-solver and listener? Do you want to assist people in transforming their mindsets and lives? If these are your passions, this course is perfect for you. You will study specialized skills and strong tactics that will unlock your true potential and equip you to become a professional life coach capable of assisting individuals in broadening and enhancing their personal and professional aspirations.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Professionals, small company owners, entrepreneurs and whole organizations are all employing life coaches to help them get started on a better trajectory for employee satisfaction. This course introduces the concept of life coaching and the characteristics and responsibilities of a life coach. It begins by presenting some essential life coaching skills and techniques. You will discover that some of the most successful life coaches have attributes like empathy, compassion, kindness and a caring disposition and they can immediately discern a client's strengths and weaknesses. Then you will learn the importance of asking open and well-phrased questions during a coaching session. Following that, you will explore various ways to improve your active listening skills, like being attentive and maintaining eye contact, and studying how to help your clients create and use an action plan to reach their goals.</p><p>The course presents strategies for overcoming setbacks towards reaching goals. First, you will learn the value of motivation and the factors that might undermine it, such as lack of confidence, impatience, the past or the future. We will discuss several successful methods for increasing motivation and reaching achievement. You will discover how to transform limiting thoughts into powerful beliefs by identifying your positive opinions, staying focused on them and using them as your ‘personal North Star’. Next, the course teaches you about good and bad habits, their patterns and their impact on the quality of life. You will study how to break your bad habits in four easy steps. Subsequently, you will gain knowledge about self-doubt - how it affects your motivation, inspiration and self-improvements - as well as strategies for dealing with self-doubt.</p><p>After that, the course teaches you how to find a ‘definite major purpose’ (DMP) for your life. You will learn about using goals to set your target, making action automatic, facing your fears, developing your mind and practising persistence by completing practice exercises. You will also research the most popular types of life coaches such as relationship coach, career, spiritual and mentor, business coach and their traits. Following that, you will come to know about several offline and online coaching formats, such as one-on-one coaching, group coaching, Facebook group coaching, coaching by email and video-based coaching - as well as the benefits and drawbacks of each. Finally, we will guide you through a step-by-step process to start a coaching business. So if you want to aid people to get their lives back on track in a professional and ordered manner, being a life coach may be the vocation for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}