{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3942","title":"Public Speaking on Recorded Video and Video Calls","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to make business proposals via video and make effective calls to prospects in this free online course.","description":"This free online course will teach you how to appear comfortable, calm and relaxed when speaking to the public, clients and prospects through a recorded video and live video calls. This course will also look into ways to write newsletters and use Facebook and YouTube as a tool in your business. Alongside this, you will learn how to look good on camera when sitting or standing during public speaking and how to manage media crises.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Many business owners don't grasp the importance of the media and how it can grow their businesses. They tend to cringe away from anything that has to do with the media for reasons best known to them, which may include nervousness, lack of confidence or being camera-shy. Utilizing and embracing the media can have a significant impact on your business or organization. In this course, you will learn some essential tips and techniques you can use to manipulate the media for the benefit of your organization and how to appear good on camera. The course will show you the advantages of using video in all your proposals and how to communicate by making a simple video. Furthermore, you will learn to communicate with clients and prospects via e-mail and answer clients' questions about your business or organization.</p><p>Many people use Facebook and YouTube for their businesses to reach a wide range of audiences and potential customers. Harnessing Facebook and YouTube as a tool to reach clients and prospects is a great way to promote your business and organization. In light of this, you will learn how to use Facebook and YouTube to promote your business. Are you a business owner willing to share and teach your expertise to ever-ready learners? You will learn how to share your knowledge with learners. Phone calls are valuable because they allow you to communicate information that is of utmost importance. When you call someone, it shows a level of significance to the person, either impersonal or personal. You can also talk about business right away by getting a quick response from clients and prospects if meeting face to face is impossible. The course also provides guidelines to communicate effectively through phone calls. Alongside this, you will learn some tips on the best way to come across when making a phone call with clients for your business.</p><p>Voicemail messages are essential when the supposed receiver of a phone call isn't there. You will be shown how to leave the type of message that will get the attention of clients and prospects as a business owner. You'll be taught what to include in your message and how to write newsletters to your clients and employees. A crisis is a critical moment of severe difficulty and peril. It is also a time when you must make an important but difficult decision. As a business owner, have you ever experienced any form of crisis in your organization? This course will guide you on how to handle and manage crises. On top of that, you will learn how to give online presentations and make them interactive with your audience. This course is designed for both new and experienced business owners. As a business owner trying to gain ideas to promote your business, take it to the next level by enrolling in this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}