{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3438","title":"Diploma in Reiki: A Comprehensive Look Into Energy Healing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to harness the principles of Reiki for different healing purposes in this free online diploma course.","description":"By enrolling in this course, you will learn about the techniques and methods used to help yourself and others in all three Reiki levels. You will study the discipline’s guiding principles, the seven major chakras, and the traditional and non-traditional sacred symbols. The history of Reiki's rebirth and the lives of its most influential practitioners will also be covered. Unlock the benefits and potential of using Reiki by simply signing up.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Reiki is an ancient form of holistic healing that works on the mind, body and spirit through the stimulation of your own natural healing abilities. This course will introduce you to this traditional healing method, along with some potential career choices and more. As you progress, you will familiarize yourself with the three degrees of Usui Reiki, including its guiding principles, the initiation ceremony and the importance of life-giving energy, from how it works to regaining this energy if lost. Throughout your learning, you will understand how Reiki affects your mind and body. In particular, you will study some of the systems of the human body, as well as where to find the seven major chakras. How was Reiki rediscovered and who was involved? This course will teach you about three of the most influential ‘grandmasters’ of Reiki from the nineteenth century and their roles in reshaping Reiki into what is practised today.</p><p>When you progress to the second degree you will be introduced to sending healing to anyone who needs it, no matter the distance. However, before you jump into distant Reiki healing you will cover the sacred symbols used throughout Reiki ceremonies and learn how to perform select Reiki techniques. How many different symbols can you think of off the top of your head? Throughout this course, you will learn about a wide assortment of traditional and non-traditional symbols, from step-by-step drawing instructions to how they are used in practice. Once you have a solid understanding of their meanings, you will be given simple easy-to-follow instructions on how to perform ceremonies using these symbols to help individuals, groups, animals and even global events or world disasters. You will also study other healing disciplines and see how to combine them with Reiki to practice more advanced focusing and healing methods. Grapple with everything from the art of ‘focusing’ and timeline Reiki to techniques specifically for animal care.</p><p>The course also covers the various methods of attunement using symbols and techniques that you have previously covered. Using each degree you will cover the steps involved in each ceremony, as well as the symbols required for each. The steps include descriptions and images to reinforce your learning. You will be introduced to alternative methods to these attunement ceremonies for all three degrees. The course finishes with an overview of reiju, from individual empowerment to giving this healing to others through distant reiju. Throughout this introduction to Reiki, you will form a solid understanding of the purpose, ability and meaning behind this holistic hand-healing method.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}