{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5568","title":"Self Custody - Protecting Your NFTs and Cryptocurrency","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to protect your NFTs and cryptocurrencies from hackers and scammers in this free online course.","description":"This course will guide you through the basics of self-custody and why it is so important in the world of cryptocurrency and NFTs. You will learn about the risks associated with using and not using self-custody, as well as the differences between custodial and non-custodial systems. We will also cover the basics of public and private keys, wallet types and provide tips on selecting the wallet type that suits your needs.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you're interested in NFTs and cryptocurrency but don't know where to start, you have come to the right place. This course will help you understand self-custody for NFTs and cryptocurrency. We'll show you how to take control of your digital assets, explain the terms you need to know and guide you with best practices.</p><p>In the course, you will discover the differences between custodial and non-custodial systems and learn about public and private keys, wallets, and how to choose the right wallet for your needs. We will also cover the importance of self-custody, the involved risks, as well as the steps you could take to mitigate these risks. We will help you master the basics of NFTs and give you tips on how to store and manage them.</p><p>By the end of the course, you'll have a solid understanding of self-custody and how to manage your NFTs. Take the first step towards becoming an NFT pro by enrolling in this course! Join us today and learn about the world of NFTs and cryptocurrency and get started with self-custody and taking control of your digital assets. Don't wait; sign up now and start your journey towards mastering the exciting world of NFTs and digital assets.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}