{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3875","title":"Self-Portraiture and Street Style Photoshoot","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Raise your photographic skills and learn how to shoot and create stunning photos with this free online course.","description":"\"A picture is worth a thousand words\", but only when done right. Take your photography to the next level by signing up for this free online photography course. Learn how to take incredible street style photoshoots or self-portraits (selfies) & then edit them like a pro using the latest photography techniques and tools like Adobe Photoshop and Lightroom to shoot amazing pictures.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These are the times of social media and the online world filled with pictures and images of all types. Uploading your image on any social media platform or click as a professional, perfectly shot photo decides who you are, what you do, and where you are. This passion for standing out has generated high demand for professional photographers. Everybody can't afford them, neither all of us selected for a professional photography course. This free online course fills that gap and teaches you all the tricks, techniques, and processes of clicking a photo with DSLR or even with a Camera phone in your surroundings and then editing them in the latest photo software like Lightroom and Adobe Photoshop. The course covers the two most in-demand photography styles, Portrait Photography and street style photoshoot. It offers you everything you will need to start your photographic journey with some basic accessories or raise your skills to another level.&nbsp;</p><p>The course consists of three different modules to help you build a solid foundation in photography by teaching the basics like proper camera handling and making the best use of your surroundings. Two modules cover Portrait Photography (selfies) and street style photoshoot and, one covers editing the photo. Easy step by step tutorials which hand walks you through all the tools and method required for shooting both Self-Portraiture and Street Style Photoshoot styles of photographs with very basic setup and instruments. An entire module helps you learn how to edit photos in Lightroom and Adobe Photoshop two most advanced and in-demand photo editing software.</p><p>This course is perfect for a creative person, an aspiring or experienced photographer, a Blogger, an Instagrammer, a social media influencer, or someone who wants to raise his and her social media and professional profile. Get ready to take beautiful photos and join the course now. You're destined to be a cut above the rest!&nbsp;</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}