{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3789","title":"Setting up a SelfCare List","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to improve your mental health, relationships, and well-being through self-care in this free online course.","description":"Self-care is the conscious act a person can take to promote their physical, mental, and emotional health. In this free online course, you will learn how to create your self-care list. You'll also learn to include your loved ones in your self-care journey and find time to practice self-care. This course is suitable for anyone who would like to practice self-care and self-love to improve their mental health, relationships and overall wellbeing.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The coronavirus pandemic has radically changed the way we live. Our work, style of learning, and social interactions have all been affected. Our new reality poses a unique set of challenges for all of us. Now more than ever, practising self-care is essential for taking care of our emotional health and well-being. Self-care is a conscious act one takes to promote their physical, mental, and emotional health. This free online course will introduce you to a powerful tool that you can use to improve your mental health, confidence, relationships, and overall wellness. You will learn how to find time to practise self-care at the workplace, in your car and at home. We'll also show you how to involve your loved ones in your self-care activities and how to make your list of self-care activities. Uncover the signs that you need self-care, how you can address it, and the benefits of self-care activities done in various locations such as at home and the workplace. Explore the tools to help you develop a mindset of self-care, appreciation, and understanding of yourself.</p><p>Self-care is often the first thing that gets sacrificed when life gets busy and stressful. We'll show you how to create a self-care list to help you focus, make better decisions and stay healthy. Understand how to incorporate self-care activities into your routine. Activities like going for a walk or socializing gives your body and mind time to rest, reset, and rejuvenate. Maintaining balance in your daily routine will help you to be more productive and more resilient to stressors. Self-care enables you to transmit good vibes and maintain good relationships with other people. You cannot take care of others when you don't take care of yourself. Some people may consider self-care as selfish, which is far from the truth. When you work to improve yourself and become the best version of yourself, everyone around you will benefit from your new level of confidence and happiness.</p><p>Today, we face challenges that can be stressful, overwhelming, and cause us to display strong emotions. Public health standard operating procedures such as social distancing are vital, but they can make us feel isolated and lonely, increase stress and anxiety. You will learn how to take care of yourself while maintaining physical distancing and learn to cope with stress in a healthy way that makes you and your loved ones more resilient. Many people cite lack of time as one of the main reasons for not practising self-care, but you must always create time for yourself. Self-care does not have cost a lot of money, and you can do simple self-care activities in the comfort of your home. This course is suitable for anyone interested in learning self-care and self-love to improve their mental health, relationships, and overall wellness. Take full responsibility for yourself and enrol in this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}