{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4401","title":"Soap Making Masterclass","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you to make soap from scratch, using easy-to-find ingredients and equipment.","description":"Making your own soap can be rewarding. This free online course teaches you all you need to know to learn the basics of soapmaking. Study the chemical reactions, types of soaps available and the ingredients required. You will receive step-by-step instructions on making some unique floral and medicated soaps with flowers, herbs and fragrances. Learn this art so you can use or gift handcrafted soaps or start your own soapmaking business.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Soapmaking is a skill and can be a complex art to master. In this masterclass, you will learn the art of soapmaking with a detailed explanation of its science. You will learn to make useful products that can be either used, gifted or sold. In the first module, you will learn about the science behind making soaps. What is lye or the process of saponification? The videos will explain these particulars and also teach you about pH levels, which help test the safety of a soap. Soaps can be used for various reasons and be available in multiple shapes, sizes or fragrances. You will become familiar with the wide range of soaps that can be handcrafted. What are the ingredients used in a soap? Is natural soap another name for organic soap? We use some essential ingredients like lye, oil and fatty acids to make soaps. Other ingredients like herbs, flowers, fragrances or clay enhance and customise a soap.</p><p>What do you need to start making your soap? You do not require specialised equipment. We will explore soapmaking equipment and explain how to set it up. You will become aware of the essential tools and valuable extras for making soap. We provide some standard recipes for soaps that are not very common and inspired by food. There are many methods to making these necessary items, ranging from simple to more challenging processes such as saponification. You will learn about this art with step-by-step explanations and colourful visuals. You will be quite ready to make your first simple soap by the end of the second module.</p><p>Finally, you will make your own soap bar using unique combinations of flowers such as rose, calendula, violet and geranium. We include several recipes for making floral and medicated soaps so you can make a promising start to practising your new art. We demonstrate some valuable tips and tricks, do’s and don’ts and safety guidelines associated with soapmaking. We explore some common problems in the ‘troubleshooting’ section, covering many issues like your soap becoming too thick or oily. This masterclass will equip you with the know-how to handcraft soaps made with natural elements. There is a rising demand for such soaps. So choose to master this art not just as a hobby or for personal use, but to start a small-scale business. Those looking to start a career in soapmaking will also benefit from this course. Enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}