{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4191","title":"Street Fight Self Defense","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to defend yourself and master Wing Chun street fighting strategies and countermeasures in this free online course.","description":"This free online course teaches you how to defend yourself from violent threats on the street using the martial art of Wing Chun. We lay out proven strategies and basic defensive techniques that can counter attacks commonly used in such attacks. We show you how to get out of a chokehold and simultaneously attack, defend and control the situation. We focus on self-defence for women because you don’t need brute force to use our techniques.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course is aimed at beginners or anyone who already knows some basic combat moves. We provide a simple and practical approach to effective attack and defence moves, particularly for women. We begin with the Wing Chun ‘lap da’ and ‘pak da’ techniques as the first defensive measure used in street fights and then identify common mistakes and pitfalls. We explain fist and kick techniques and demonstrate body movements used to withstand and evade attacks. The course covers the single-hand ‘bik bong’, ‘biu jee man sau’, ‘Leung Sheung’ and the special ‘Wong Shun Leung’ fighting methods. We go into the various combinations of the ‘biu sau’ attack together with applications of the ‘chi sao’ approach. We then show you the countermeasures to the ‘biu sau’ and ‘chi sao’ attacks.</p><p>The course then teaches you combat techniques that combine the use of attack and defence moves in quick succession. We delve into the Wing Chun ‘jat da’ fighting techniques and the combinations used to give you an edge. We suggest you practice what you have learnt on a dummy before using it to protect yourself. If you are a fan of the mighty Bruce Lee and want to learn his amazing moves, then this course is for you. We demonstrate his fast ‘laap da’ and the techniques used to counter the move in slow motion. We go through many countermeasures to the most common attacks you might encounter on the street. This course can protect you from the chokehold, one of the most dangerous and popular attacks, as we explain the traditional and modern techniques used to break one, regardless of the attacker's physique and strength.</p><p>Women are generally physically weaker than men but they can still use our self-defence techniques in close, middle and long range. We provide insider tips and pointers to help you survive an attack. Learn the ‘shifting stand’ method of self-defence along with protective poses for the face and upper body. We go over the ‘kap jang’ and effective front-kick techniques for nullifying an opponent’s rush. This course shows you how to counter moves from larger assailants and use their strength against them. Learn how to combine attack and defence to control a violent situation. We can help you protect yourself and your loved ones by mastering ancient Chinese martial arts techniques that have proven effective across the world.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}