{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3009","title":"The Poetry of T.S.Eliot","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores three great Modernist poems by T.S. Eliot: ‘Prufrock’, ‘Preludes’ and ‘The Waste Land’.","description":"This free online course examines the French symbolist influence on Eliot's early poetry. We conduct a close reading of some of his most iconic poems: 'The Love Song of J. Alfred Prufrock', 'Preludes' and 'The Waste Land'. We deconstruct these poems to understand their mythic style and urban, cinematic quality. This course helps you to understand this important poet’s work but also hones your critical reading skills to help you read more deeply.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course discusses three of T.S.Eliot’s most famous works: 'The Love Song of J. Alfred Prufrock', 'Preludes' and 'The Waste Land'. These Modernist poems are strongly influenced by the French symbolist tradition, evoking the rich symbolism of writers like Stéphane Mallarmé and Charles Baudelaire. This course investigates Eliot’s use of metaphors to reflect metropolitan chaos, urban alienation, decadence and drudgery. We begin with 'The Love Song of J. Alfred Prufrock' (often called simply ‘Prufrock’), the earliest of Eliot’s major works. It examines the tortured psyche of the prototypical modern man: overeducated and eloquent while remaining neurotic and emotionally stunted. The speaker seems to be addressing a potential lover but Prufrock appears to know too much of life and the poem ultimately becomes a narrative of lost love. The poem is visual and cinematic, alive with metropolitan pointers, while also being very broken, fragmented and neurotic. We demonstrate the role of neurosis as a notable element in Eliot’s early poetry and in the wider Modernist milieu.</p><p>We then move on to 'Preludes', a poem of six stanzas split up into four sections, each with varying rhyme schemes and patterns. The poem provides a series of images that reflect metropolitan drudgery and decadence in visual and cinematic montage styles. We explain how the poem humanizes inanimate things while humans are made to feel machine-like to probe the idea of the lack of agency in our lives. Then comes 'The Waste Land', which depicts the dystopian collapse of Western civilization and the end of spirituality and religion. The course follows the poem’s exploration of exhaustion, the crisis in communication and the ruin of human intimacy.&nbsp;</p><p>The style in Eliot's poetry is marked by allusions and quotations from other texts and mythology. 'The Waste Land' references William Shakespeare, Homer and Baudelaire, as does 'Prufrock'. The course breaks down how certain mundane conditions are used by the poet to produce the visual images of metropolitan mysticism. We take you through the Modernist style of mythic writing and the abstract use of metaphors, which helps you to develop your style and close reading skills as the powerful and concise phrases found in poetrys develop your sense of expression and can help you master all forms of writing. This skill is in demand in the media and communications industry so this course has practical application, but anyone interested in beautiful writing can benefit from close attention to Eliot’s masterpieces.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}