{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3845","title":"The Basics of Script Analysis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the foundational basics of script analysis and the various acting techniques in this free online acting course.","description":"Bring your passion and enthusiasm for acting and delve deep into the world of script analysis. This free online course promises to teach you all you need to know about script work including the basics of script analysis, the essential seven acting techniques, their origins, and the personalities behind each technique before moving on to the importance of clearing your mind before working on a script and memorization tactics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online acting class course is a comprehensive way to cover everything included in working with a script. You will learn about script analysis, the 5 W’s in scriptwriting, various acting techniques, as well as the best ways to memorize scripts. You will be shown the tools you need to apply in order to work on your scripts and in the introductory section, you will be introduced to the course, the outline, and the instructor before getting straight into the foundational basics of script analysis. You will study three main things in this section. (1) The job of an actor, given circumstances and why Constantin Stanislavski is one of the most influential people in the acting community, (2) the teachings and techniques of Stanislavski and (3) Stanislavski’s ‘The Method’ or seven-step system. This section includes the important differences between detective work and interpretation, obstacles, and intentions in acting.</p><p>The next part studies further, the seven acting techniques to have better context of each technique and where they originated from, as well as the personalities behind those techniques. The three aspects of Stanislavski’s system or method will be covered, Vakhtangov’s fantastical realism and monism, Chekhov’s psycho-physical approach, Lee Strasberg’s method acting, Adler and Meisner’s techniques, and the four-step analysis of practical aesthetics are also covered. Having a clear mind before working through a script is critical to understanding and delivery and the scientific aspects and effects of meditation on the brain will be highlighted in this section. Some other key themes included, are releasing tensions and stress patterns, and a guide on how to meditate before acting or starting a script. There are several ways of memorizing a script and you will be taken through all of these with a specific focus on the differences between muscle- and conscious memory for script work. A link to a video showing how to memorize ten times faster using imagery will also be provided which acts as a foundation for inner visualization or “story-boards”, to help you break down the context, the characters and make your scripts easy to memorize. A brief example of how to go through a monologue, breakdown the script, and use them alongside the storyboard worksheet will be discussed. Additionally, you will be taught how to decide on which acting technique to use - three simple exercises on Stanislavski, Meisner, and Strasberg techniques to help you practice and have a feeling of the acting techniques will be illustrated. Lastly, the “Paunil technique” using Goleman’s emotional intelligence model will be explored.</p><p>This course is for beginners, acting students, and actors who are interested in studying the basics of script and acting techniques. Those who frequent theatre will also gain great new insight into the art of acting and which methods actors employ to ensure a captivating delivery. You should enrol if you have an interest in filmmaking, casting, cinema and everything in between.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}