{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3766","title":"The Body Language of Public Speaking","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Let TJ Walker take you through his body language principles to improve your public speaking in this free online course.","description":"It's often said that body language tells you more about someone's demeanour, sincerity and general conviction than what they are saying in words. In this free online course, TJ Walker will introduce you to many public speaking techniques to appear comfortable, calm and relaxed when speaking in public. We will also study body language types, looking good on camera and what your clothing communicates about you.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Body language is a collection of nonverbal cues that you employ to communicate your emotions and intentions. There are three big myths that we need to address when it comes to body language in the workplace and body language in general. This course will explore those myths and expose the truth about those myths based on discoveries done by TJ Walker. Public speaking is any form of a presentation given live by a speaker or a presenter to an audience or any group of people. Speaking publicly in front of a large group of people causes anxiety and nervousness. As such, we tend to avoid it. But at some point in life, you might find yourself in a situation where you have no other choice. And we know you will want to make a good presentation and connect well with the audience. This course will teach you how to avoid possible blunders and techniques to calm your nerves and appear comfortable and relaxed during your presentation.&nbsp;</p><p>Have you ever wondered what to do with your hands when giving a public speech? We will show you how to gesture with your hands and move your body when speaking or making a presentation in public while sitting or standing. After that, we'll show you how to be composed and build confidence before making any presentation in public. Everyone makes mistakes - it is simply human - but making one during a presentation can be embarrassing and awful. This public speaking course will teach you how to handle awkward situations whenever you make blunders during public speaking. Eye contact is a powerful form of body language used to convey emotional and social messages. We will guide you through the types of eye contact and how to make good eye contact with your audience when presenting in public or at your workplace.</p><p>In most parts of the world, makeup is considered to be a complete taboo for men and an enterprise for girls only. But when it comes to looking good on camera, makeup is recommended for both genders. Makeup is used to reduce imperfections to look better physically and on camera. In this course, you will learn some makeup tips to look good when speaking in public. The content also covers how to position yourself on camera, clothing colours that don't work on camera and dressing to reflect your personality and story. We will also look into the techniques required to use a teleprompter (a device that displays scripted text to a speaker in a way that is concealed from the camera). This speaking class will help you improve your body language when speaking in public to deliver a professional presentation. You will learn how to keep audiences captivated, whether you're a beginner or professional speaker.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}