{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5192","title":"The Basics of Security Guard Work","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides the skills you need to be a fine security guard who protects people and property.","description":"This risk management course establishes the importance of security officers in most contexts. We examine security risk analysis and the proper responses to an immediate crisis. We explain how to start a career in security and provide a range of skills used to defuse tense situations and keep people and property safe. Enrol today to learn these essential concepts and use these practices to begin a career as a security guard and manage risk.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Security professionals are essential as they maintain the safety of any area, be it a construction site or a retail store. We begin this course by studying definitions and concepts related to security as we establish the importance of risk management. We also describe the security guard workforce in the United Kingdom and outline the benefits of the jobs.&nbsp;</p><p>This course answers questions like ‘what are the responsibilities of a security guard?’ and ‘why should you understand what a risk assessment is?’. We explore the elements of security risk, including physical security protection. We then describe the functions of physical security protection, including the use of technology in its pursuit, before explaining how to respond to bomb threats.</p><p>The course provides the tools you need to work in security and lays out the steps you should take to launch your risk management career successfully as we cover the fundamentals of security guard work. You can use these practical techniques and insider tips to confidently launch a career in this field. We describe the everyday life of a security guard and provide the skills the job requires, from responding to an immediate crisis to dealing with assets. Sign up if you want to turn your eye for detail and passion for safety and protection into a career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}