{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3842","title":"The Acting Series with Emma Paunil","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to work with scripts, write a professional acting résumé and audition successfully in this free online course.","description":"This free online course explains how to become a professional actor. We take you through script analysis, acting techniques and some script memorization techniques. We study some types of auditioning and show you how to handle self-taping and online applications. The course goes over acting résumés, headshots, acting reels and much more as we draw on Emma Paunil’s professional experience to help you launch your own acting career.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course is a compilation of three acting courses by Emma Paunil: script work, auditions and submitting and acting industry basics. We begin with script analysis and delve into Constantin Stanislavski’s famous seven-step system (‘the method’), which made him one of the most influential acting icons. We then study seven acting techniques and explore the origins and personalities behind each in order to help you choose what works for you. The course then establishes the importance of clearing your mind before working through a script and provides a guide to meditation. We then go through three simple demonstrations of Stanislavski’s, Sanford Meisner’s and Lee Strasberg’s techniques to help you practice and acquire a 'feeling' for a script. We also demonstrate the ‘Paunil technique’ using Daniel Goleman’s ‘emotional intelligence model’.</p><p>Before becoming a professional actor, you have to make it through the stress of auditioning for roles. We lay out the basics of auditioning, their types and how to prepare for them. We teach you the dreaded ‘cold read’, methods of memorizing the first and last lines of a script and how to ‘actively listen’ during auditioning. We establish why monologues are good for auditions and provide a helpful activity to help you polish your own. The course then covers auditioning with ‘sides’ (excerpts) prepared. We compare ‘cold reading’ and auditioning with prepared sides and examine an example of an audition with prepared sides from Emma Paunil’s own casting call. We then show you how to prepare for a successful improvisation audition and offer proven insider tips to help you get ahead of the competition. We describe an exercise to help you practice your own improvisation audition at home before explaining how you can improve your self-tape and online submissions.</p><p>The course breaks down how to write a professional acting résumé. We go over a template and discuss how to start your own. We show you which headshots can aid your success and explain how to do your own or how to find a creative photographer to do them for free. We then study the role of acting agencies and break down how to decide if a particular agency can meet your expectations. We show you how to tell if an agency is fake or trying to scam you and Paunil unpacks why she chose self-representation over an agency. We also consider social media marketing for actors via channels like Facebook, Twitter and Instagram and supply tips and tricks to improve your tagging and use of hashtags. Lastly, we take you through acting reels and their types and examine examples of Paunil’s basic acting reels to help you create your own. This course suits aspiring actors, drama students or anyone looking to develop their communication and leadership skills. Successful communication involves performance and the stagecraft provided by this course applies from the classroom to the boardroom.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}