{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3944","title":"Traditional Irish Bodhrán | Beginner 1","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of Irish bodhrán playing in this free online music course with Hermitage Green drummer Dermot Sheedy.","description":"The handheld bodhrán [pronounced bow-ron] drum has a special place in Irish folk and traditional music culture and now you can master it too with these free online beginner lessons. Dermot Sheedy, drummer with Hermitage Green, will teach you techniques for creating traditional rhythms and bringing out the tone for the best Irish bodhrán sound. After this 12-part course, you will have learned a full motor rhythm and be able to drum along to reels.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online bodhrán course has been created to help beginners develop the skills needed to play this traditional Irish drum. Bodhráns [bow-rons] have been around for centuries, however, the national drum of Ireland was only formally introduced into the culture in the 1950s. While historically these handheld skin drums may have been used to set a marching rhythm for Celtic warriors, today the bodhrán is more likely to get the heart racing for all the right reasons. Rhythm is such a vital component of traditional Irish music that every instrument can be pressed into service to set toes tapping. And just as the melodic instruments also provide rhythm, the bodhrán also contributes to the sound and tone of the tunes. In this course, top drummer Dermot Sheedy covers the basics for beginner bodhrán players as well as drummers who want to expand their repertoire and try a more subtle sound. Through a series of interactive videos Dermot will introduce you to the techniques needed to play the most commonly used beats, along with some rhythms.</p><p>The course begins with the basics of identifying the parts of the bodhrán, holding the drum and the stick and the basic ‘down’ and ‘up’ strokes. Dermot devotes time to teaching you how to strike the drum without ‘sweeping’ the stick across the skin and spoiling the sound and demonstrates how to add emphasis or ‘dynamics’ where the volume of the beat varies. He also teaches you how to add a phrase to the first beat. Once you have those skills, he moves on to demonstrating how to play with fluidity and control, introducing a metronome to help you drum at half speed and normal speed. Building on those foundations, Dermot turns his attention to unlocking the tone of the bodhrán to create a more colourful sound and keeping rhythm at different speeds while maintaining the optimum tone. Before long you will learn the ‘rundown’, where the drum is played from the top to the bottom, with the tone varying at each point, and you will practise this to a reel rhythm. Once you have achieved a fluid playing style, Dermot focuses on improving your upswing, which will become a major feature of playing the bodhrán. As the course reaches its conclusion, he introduces the 'pop' or backbeat and the final lesson will see you playing a full bodhrán beat or 'motor rhythm' incorporating the reel rhythm with a phrase beat, backbeats and rundowns.</p><p>If you want to be able to play one of music’s coolest instruments, this free online bodhrán guide is the perfect starting point. Dermot Sheedy is the drummer with the well-known Irish band Hermitage Green. The band has recorded and toured extensively, winning fans from Ireland to Canada and USA to Australia. Dermot has played with high profile artists such as Donal Lunny, The Irish Harp Orchestra and Celtic Legends. Originally from County Clare, he began drumming at a young age and with musical sisters, he was able to hone his skills accompanying them on flute and fiddle. Over the years, Dermot has won many awards at the Fleadh Cheoil na hÉireann, the national music festival held every year. Clearly, by completing this course, you will be learning from an exceptional bodhrán player who is happy to pass on his skills in Irish music’s time-honoured oral tradition. You can also gain certification by passing the end-of-course assessment. You may wish to progress to the next course in this series, Traditional Irish Bodhrán, Beginner 2, and the series concludes with Traditional Irish Bodhrán, Intermediate, for those who have mastered the basics. If you’d like to beat the drum for one of Irish music’s most appetising instruments, why not begin the course today?</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}