{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3653","title":"Traditional Irish Sean-nós Singing | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the secrets of Irish Sean-nós Singing with Nell Ní Chróinín from Danú, in this free online folk singing course.","description":"This free sean-nós singing course is perfect for beginners who would like to learn songs in the Irish language without necessarily being able to speak it. Your tutor is Nell Ní Chróinín, from the Irish band Danú. Learn how to tell the story behind a song by mastering the distinctive ornamentation that gives 'old-style' singing its unique sound, in 11 easy-to-follow sean-nós singing lessons that are all available free-of-charge online.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free online sean-nós singing lessons are ideal for anyone who has completed our basic beginner course and wants to progress, or for anyone who would like to be able to sing in the distinctive sean-nós style. There are particular techniques that distinguish Irish sean nós singing from the folk music of other countries. Here, professional performer Nell Ní Chróinín builds on the basics that any beginner sean-nós singer needs to know, reinforcing the importance of pronouncing the lyrics clearly and adding emphasis in such a way that it embellishes the meaning behind the music. No prior knowledge of the Irish language is required. This course will build on your repertoire and teach you techniques for 'colouring' your singing to create that authentic Celtic singing sound.</p><p>The lessons begin with the song, 'Dá bhFaighinn Mo Rogha de Thriúir Acu', a matchmaking song that translates as, 'If I had my Pick of the Three'. Nell breaks the tune down into parts over the course of three videos and although the lyrics are provided in the course notes, she encourages you to learn the tune by ear and write the sounds phonetically. She explains the meaning of this humorous song, in which the singer is weighing up the merits of the local fisherman, tailor and blacksmith before rejecting them all in favour of the fiddle player. The next tune you will learn is the love song, 'Táimse 'gus Máire', which means, 'Myself and Máire'. It was written by the famous Irish poet Seán Eoin Ó Suilleabháin (also known as Sean Owen O’Sullivan in English) and is a beautiful portrayal of contentment with the important things in life. Again, Nell breaks the song into segments and teaches this touching ballad over three lessons, demonstrating how and where you might add ornamentation to colour the tune. The final tune of this 11-part course is the poignant lament, 'Cá Rabhais Ar Feadh An Lae Uaim'. This is translated as, 'Where Were You For The Day?' and is a conversation between a mother and her son who has been poisoned. Again, Nell gives examples of where ornamentation can be added in the last section of these easy-to-follow sean-nós singing lessons.</p><p>Whether you’re relatively new to Irish sean-nós singing or want to broaden your repertoire and learn how to give your voice an authentic traditional Irish sound, this free online singing course provides the perfect training. You will be learning from a highly respected recording artist and performer. As well as touring internationally as the vocalist with top Irish group Danú, Nell Ní Chróinín is an experienced teacher. Having been raised in the Múscraí Gaeltacht area of County Cork, Nell’s life has been steeped in Irish culture and she began singing at a young age. Among her many achievements was becoming the youngest person ever to win the prestigious ‘Corn Uí Riada’ prize, which is in honour of the legendary Seán Ó Riada, also from Múscraí. By completing this course, you can follow in the footsteps of generations of traditional Irish singers, learning, as they did, through the oral tradition. You may wish to progress to the next course in this series, Traditional Irish Singing, Intermediate Level, where you will learn tunes in the English language, and more of the secrets of ornamentation. Throughout our three sean-nós courses, you can learn vocal techniques that form an intrinsic part of Irish music’s cultural heritage. If you would like to learn how to interpret songs in this highly respected tradition, register for free and begin today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}