{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3836","title":"Traditional Irish Button Accordion | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Delve into the authentic sounds of Irish button accordion playing with Conor Connolly, in this free online music course.","description":"This self-paced accordion course is designed for more advanced beginners who have learned to play basic traditional Irish tunes and want to improve their technique. Multi-award-winning musician Conor Connolly is working the bellows in these 11 easy-to-follow button accordion lessons. You will learn how to play well-known jigs and reels, with a focus on adding ornamentation, the little extras that give Irish music its unique colour and sound.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Acquiring the skills needed to master the button accordion takes time, practise and instruction by an experienced tutor. This free online accordion course is designed to help the slightly more advanced beginner develop those skills and techniques that give authentic Irish accordion playing its unique sound. It is ideally suited to students who have completed our basic Beginner 1 and Beginner 2 courses and want to progress, or to any beginner who can play the D and C scales and knows their way around the higher octave. In this course, you will be introduced to some of the techniques that give Irish folk music its distinctive colour. Accordion expert Conor Connolly passes on some of those expert skills that he has learnt through Irish music’s oral tradition, where tunes are passed from person to person, down through the generations. This course builds on the learner’s basic skills and imparts more while teaching them some new tunes.</p><p>As the accordion is strongly associated with Irish dancing, whether at fleadhs, ceilis or set dances, it’s fitting that the lessons begin with 'Joe Bane’s Barndance'. Conor breaks the tune down into segments so that the learner can remember each part more easily. While there are accompanying notes for each tune in the resources section of the course, it’s usual for the music to be played by ear. This is particularly useful when it comes to adding ornamentation or the extra notes that 'colour' traditional Irish music. In this course, Conor will show you how to introduce ornaments like 'cuts' into your playing by devoting lessons to ornamenting both parts of every tune. 'Young Tom Ennis' is the second tune taught on this course and again, Conor will show you how to play each part of this well-known jig, then teach you how to add ornamentation to that part, to give your playing an authentic Irish flavour. The final series of lessons in this course covers the reel, 'Donald Blue', which is popular at seisiúns [sessions]. For any player, learning their first reel is a milestone moment and Conor suggests places to add ornamentation as he teaches this final tune over the course of two lessons.</p><p>If you are relatively new to the Irish button accordion and want to broaden your repertoire and learn how to recreate authentic traditional Irish sounds, this free online accordion course provides the perfect training. Our tutor, Conor Connolly comes from south Galway, dubbed the 'Accordion Capital of Ireland' and counts great players from that area such as Joe Cooley among his musical heroes. Conor has been playing and performing the button accordion for years and in 2019 he was named the Traditional Irish Young Musician of the Year. Through our three button accordion courses, for Beginner 1, Beginner 2 and this Intermediate course, Conor imparts to learners the knowledge, skills and techniques that are fundamental to developing as an accordion player. You can also gain certification by passing the end-of-course assessment. Begin the course and learn those techniques, rhythms and tunes that will take your accordion-playing to the next, toe-tapping level.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}