{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3945","title":"Traditional Irish Bodhrán | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Build on the bodhrán basics in this free online music course with drummer Dermot Sheedy, of Irish band Hermitage Green.","description":"This free online bodhrán course suits anyone who wants to gain the technical know-how to accompany music on the traditional Irish drum. Your tutor is Dermot Sheedy, an all-Ireland champion and drummer with top Irish band Hermitage Green. He is joined on fiddle by TV presenter Doireann Ní Ghlacáin for some lessons. A sequel to our Beginner 1 course, it is perfect for those who are keen to master new rhythms and playing techniques.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These self-paced bodhrán lessons are suitable for those who have foundational skills on the traditional Irish drum as well as conventional drummers who want to have a go at a completely different style of playing. The bodhrán is a medium-sized handheld skin drum played with a double ended stick or beater to create a mellow, rhythmic sound that is full of tone and colour. Here, professional performer Dermot Sheedy builds on the basics he taught in the Beginner 1 course, where he focused on stick control, the reel rhythm, rundowns and a full motor rhythm. These lessons will expand your skillset, teaching you to play different reel rhythms along with jigs and hornpipes. It will also add to your technical toolkit with double and single-ended rolls and techniques for moving the stick around the drum for a more ornamented style of playing.</p><p>The lessons begin with an introduction in which Dermot outlines the skills the learner is expected to have mastered before beginning this course, including the motor rhythm for a reel and clean down and up beats. He moves on to teaching you how to adapt the basic motor rhythm to add more space, with fiddle player and Irish TV station TG4's live music presenter Doireann Ní Ghlacáin providing the melody. Over the next couple of lessons Dermot will show you how to play double-ended rolls, which use both ends of the stick and which are mainly used in traditional Irish music, as well as the single-ended rolls which he generally uses for folk, rock and pop tunes. With a basic reel rhythm covered in the Beginner 1 course, it’s time to proceed to the jig and these lessons include a basic jig rhythm followed by a more ornamented style of playing, accompanied by Doireann on fiddle. The hornpipe is next and you’ll recognise the similarities with the reel rhythm but with added bounce. Once you’ve got the basics down, Doireann returns for a lesson on embellishing the hornpipe rhythm by adding a single roll. The next area for ornamentation is the motor rhythm and Dermot teaches you how to add interest to enhance the tune by means of single and double-ended rolls. Another trick is to incorporate an emphatic ‘up’ beat and that is taught in the context of a completely new reel rhythm. Further showcasing the musicality of the bodhrán, Dermot demonstrates how to complement the tone of the tune by moving the beat around the drum. This entertaining and packed course concludes with a recap of everything that you’ve covered.</p><p>Whether you want to play Irish traditional or folk music or that of other genres, this free online bodhrán guide is a gift. The video format allows you to pause and rewatch maestro Dermot Sheedy so that you can learn at your own pace. A multi-award winning bodhrán player and accomplished drummer, Dermot has been playing the Irish drum from the age of five years, after seeing bodhrán player Neil Lyons in action at a festival. Being surrounded with music at home, he had plenty of time to hone his skills accompanying his sisters on flute and fiddle. He went on to compete at many fleadhs or Irish music festivals, winning all Ireland titles in the process. Dermot’s career highlights include playing with high profile artists such as Donal Lunny, The Irish Harp Orchestra and Celtic Legends, however, he is best known as the drummer with the well-known band Hermitage Green with whom he has toured the USA and Canada, Australia and the UK. Once you have completed this course, you will wish to proceed to the final course in this three part series, Traditional Irish Bodhrán, Intermediate. All our courses provide the opportunity to gain certification by passing the end-of-course assessment. For now, it’s time to bang the drum for the unique techniques that set bodhrán playing apart by commencing the course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}