{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4081","title":"Traditional Irish Flute | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to ornament your flute playing with all-Ireland medal winner Brian O'Loughlin, in this free online music course.","description":"This free online flute course is designed for those who are competent at playing basic tunes and want to enhance or ‘colour’ their sound. Champion flute player Brian O'Loughlin teaches students how to play reels and jigs, with a focus on adding the ornamentation that gives Irish music its distinctive character. Learn how to perform ‘cuts’ and ‘rolls’ along with new tunes, in this 11-part video course with accompanying notes.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Flute players who want to learn the skills and techniques that add colour to Irish tunes will enjoy this free online flute course. It is ideally suited to students who have completed our basic Beginner 1 and Beginner 2 courses although it will also benefit relative newcomers to the flute, whether they are used to playing by ear or by following notes. If you have mastered playing plain tunes, the next step is to ornament your playing with the ‘cuts’ and ‘rolls’ that make Irish folk music so exhilarating. Here, former all-Ireland chamption Brian O'Loughlin teaches you how to introduce those little extras at the start of the course before moving on to putting your new skills into practice with jigs and reels.</p><p>‘Cuts’ and ‘rolls’ are the topics for the opening lessons of this course and students are given a solid grounding in both before Brian moves on to teaching the tune, 'Mrs Galvin’s Jig'. You can follow the lesson more easily by downloading the notes from the resource section. The tune is taught in two parts, with Brian spending a lesson demonstrating how and where you can add ornamentation after each part. The next tune you will learn is the first reel in this set of courses, ‘The Sailor on the Rock’. Learning your first reel is a major moment for anyone starting out in Irish music as these popular tunes are famed for their lightning speed. Here, Brian slows the pace to help learners master each part properly and pick up those all important ornamentations. The final tune in the course is ‘Michael Cramer’s Reel', which Brian got from Matt Molloy, of The Chieftains. As with every tune, Brian plays it through at the proper speed so that you can hear how it should be played. In the final two lessons, he teaches each part of the tune, demonstrating how and where you can add ornamentation.</p><p>For anyone who is relatively proficient in the flute and is ready to introduce a more authentically Irish flavour to their playing, this free online flute course offers the ideal training. Our tutor, Brian O'Loughlin is an accomplished flute player from County Clare in the musical west coast of Ireland. Steeped in music since childhood, he has won many all-Ireland Fleadh Cheoil medals at junior and senior level, as a soloist and with groups including the triple-winning Shandrum Céilí Band. He has also recorded as part of a trio with uillean pipes player Tom Delany and guitarist Dessie Kelliher. Having toured widely and taught often, he is well-equipped to teach students the techniques that are fundamental to developing as an Irish flute player. Complete this course and with practice, you will master the digital dexterity that is associated with Traditional Irish music. You can also gain certification by passing the end-of-course assessment. If you want to enhance your flute playing with more colour and energy, this course was created for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}