{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3749","title":"Traditional Irish Tin Whistle | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to add ornamentation to Irish jigs and reels, in this free online music course with Brian O'Loughlin.","description":"This free online tin whistle course is designed for beginners who are competent at playing basic Traditional Irish tunes and want to improve their technique. Tutor and professional performer Brian O'Loughlin takes up the whistle for 11 easy-to-follow lessons with accompanying notes. You will learn how to play well-known jigs and reels, with a focus on adding ornamentation such as ‘cuts’ and ‘rolls’ that give Irish music its distinctive sound.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online Irish tin whistle course is designed to help the beginner develop those skills and techniques that will give their tin whistle playing an authentic Irish sound. It is ideally suited to students who have completed our basic Beginner 1 and Beginner 2 courses and want to progress, or to any beginner who can play basic tunes by ear or by following notes. It’s one thing to play a straightforward tune but it’s quite another to pepper your playing with ‘cuts’, ‘taps’ and ‘rolls’, the ornamentations that make Irish folk music so vibrant. Here, accomplished musician Brian O'Loughlin teaches you how to acquire the digital dexterity behind ornamentation over a couple of lessons, before moving on to applying your new skills. Throughout the course, he teaches the tune first, then devotes a lesson to focusing on where and how to add ornamentation.</p><p>The lessons begin with a class on cuts and one on taps and rolls before Brian moves on to teaching the jig, 'Gander in the Pratie Hole'. Download the notes from the resources section of the course to follow the lesson more easily. Brian breaks the tune down into parts and demonstrates where and how to add ornamentation after each part. The next tune you will learn is the first reel in this series of courses, ‘The Silver Spear’. Learning your first reel is a milestone on any instrument, as it’s the fastest type of tune in Irish music and among the most popular. Here, Brian teaches you how to play each part slowly and with practice you can build up your speed. The final tune in the course is another popular reel, 'Rolling in the Rye Grass'. As with every tune, Brian plays it through at the proper speed so that you can hear how it should be. In the final two lessons, he teaches the whole tune first, then spends the final lesson demonstrating how and where you can add ornamentation.</p><p>If you are relatively proficient in the Irish tin whistle and want to broaden your repertoire and learn how to recreate authentic traditional Irish sounds, this free online tin whistle course provides the perfect training. Our tutor, Brian O'Loughlin is an accomplished flute player from County Clare in the musical heart of Ireland, on the west coast. From a well-known musical family, he has been a member of some of Ireland’s top ceili bands as well as performing with a trio. By completing this course, you can learn those all-important techniques that are fundamental to developing as a tin whistle player. You can also gain certification by passing the end-of-course assessment. Complete this course and with practice, you will master the deftness of playing that has been setting Irish music apart for centuries. You will also learn more of the favourites played at 'seisiúns' (music sessions) across Ireland and beyond. If you want to elevate your playing with those techniques and ornamentations that colour Irish folk music, this is the course for you!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}