{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3946","title":"Traditional Irish Bodhrán | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your Irish bodhrán playing with drummer Dermot Sheedy, of Hermitage Green, in this free online music course.","description":"This free online bodhrán course is designed for those who are competent at playing the traditional Irish drum. Learn new rhythms while improving your technique in this 8 part course led by one of Ireland’s top bodhrán players, Dermot Sheedy. He teaches new jig and reel rhythms as well as methods for adding colour such as palm heel beats. TV presenter Doireann Ní Ghlacáin assists on fiddle on this self-paced sequel to our Beginner 1 and 2 courses.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Master those rhythms and techniques that elevate traditional Irish music and give it such vibrancy with this free online Irish bodhrán course. Through a series of eight video lessons, virtuoso bodhrán player Dermot Sheedy shares the skills and insights he has garnered over decades of drumming. The lessons are designed to help the learner develop those skills that make authentic Irish bodhrán playing so infectious. The course is ideally suited to students who have completed our Beginner 1 and Beginner 2 courses though any competent drummer or bodhrán player will take something away from these lessons. The course majors on jigs and a new, swinging reel rhythm and TG4’s live music presenter Doireann Ní Ghlacáin provides the melody on fiddle where required.</p><p>Following an introduction to the course in which Dermot describes the level of playing participants should have attained, he starts with a jig rhythm which he hasn’t taught in the previous two courses which has added swing to it. He teaches the rhythm, together with tricks for enhancing it such as single-ended rolls and rundowns. The next lessons focus on further enhancing your playing by using palm heel beats. These vary the tone of your playing and you can use them to bend the notes as well as move the beat all around the drum for added interest. You will learn how to incorporate your new techniques into your jig playing, through accompanying Doireann on fiddle. Once jigs have been well covered, the lessons move onto a new reel rhythm, also with added swing. This rhythm is found across the world and it’s one Dermot Sheedy favours over the reel motor rhythm. You will learn techniques for enhancing the rhythm and again put those into practise by accompanying Doireann playing the melody. The course concludes with a useful recap of everything you have learned.</p><p>For anyone who is relatively proficient in the bodhrán and wants to enhance their playing for an authentic traditional Irish sound, this free online bodhrán course provides the perfect training. Your tutor, Dermot Sheedy, is an all-Ireland champion bodhrán player and professional drummer from County Clare in the west of Ireland. Dermot took up the bodhrán at the age of five years, having been inspired by the playing of world bodhrán champion Neil Lyons at a festival in Listowel. He grew up practising along with his sisters who played flute and fiddle. He went on to compete at many fleadhs or Irish music festivals, winning many national titles in the process. As a professional musician, Dermot is best known as the drummer with the well-known band Hermitage Green, with whom he has toured the USA and Canada, Australia and the UK. He has also accompanied artists such as Donal Lunny, The Irish Harp Orchestra and Celtic Legends. In this course, he shares special skills and techniques that will help you to develop as a bodhrán player. With practise, this course will help you add dynamics and tone to your bodhrán playing and give you the confidence to accompany a wide range of tunes. You can also gain certification by passing the end-of-course assessment. If you are keen to master the secrets of professional-sounding bodhrán accompaniment, this is the course for you!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}