{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3883","title":"Traditional Irish Guitar | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Guitarist Michael McCague helps you master jigs, reels and polkas using Drop D tuning in this fun free music course.","description":"This free online guitar course is designed for those who are competent at playing basic chords using the Drop D tuning favoured in Irish folk and traditional music. Improve your technique and learn new chords with the help of guitar expert Michael McCague. Learn how to play jigs, reels and polkas, adding colour by substituting chords and changing your strumming style. Doireann Ní Ghlacáin plays fiddle on this course, which has downloadable notes.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Master the rhythms and techniques you need to play traditional Irish tunes well with this free online Irish guitar course. A series of nine video lessons enables you to tap into the vast experience of guitar virtuoso Michael McCague at your own pace. The lessons are designed to help the learner develop those skills that make authentic Irish guitar playing so richly appealing. The course is ideally suited to students who have completed our Beginner 1 and Beginner 2 courses and want to progress to a higher level, or to any player with the basics of Drop D guitar chords in the keys of D, G, E minor and A minor. Most Irish traditional guitar accompaniments use Drop D tuning for the rich, open sound it creates. Michael illustrates the merits and methods for playing this way and experimenting with different chords and strumming techniques. In each segment, he teaches each part of the tune separately, with TG4’s Doireann Ní Ghlacáin accompanying on fiddle. That close attention is designed to help you learn the tune by ear, in keeping with Irish music’s oral tradition although chord charts are included in the downloadable PDF in the resource section of the course.</p><p>The lessons begin with ‘Tripping to the Well’, the first polka in this series of courses. Michael demonstrates the polka rhythm associated with the relaxed playing style of north Connacht and teaches you how to insert a piano style bass run into a bar and which chord progressions are useful for different songs. The next tune you will learn is a newer jig, 'The Sunny Hills of Beara', by Cork composer John Dwyer. This jig is in G minor but by placing the capo on the third fret you can play it using the E minor chord shapes. The reel, ‘Down the Broom’ is next. It’s a popular stalwart for people looking for tunes in A minor and here Michael encourages you to experiment with different chord substitutions to add colour to the sound. The final section of this intermediate guitar course is 'Fred Finn’s Reel’, named after the Sligo fiddle player. This tune is popular at sessions and is in the easy key of D major. Don’t miss Michael and Doireann’s rendition in the final minutes of the course to hear it at full live session speed!</p><p>For anyone who is relatively proficient in the guitar and wants to broaden their repertoire and learn how to recreate authentic traditional Irish sounds, this free online guitar course provides the perfect training. Your tutor, Michael McCague is a multi-instrumentalist and songwriter from a well-known musical family in County Monaghan although he now lives in the cultural hub of Galway. His first instrument, as a young child, was the tin whistle, however, he soon progressed to playing fiddle before switching to bouzouki. He took up the guitar to join the band At the Racket, following in the footsteps of such luminaries as Arty McGlynn, and still occasionally performs with them. He has also been a member of well-known trad group Téada and Belfast band At First Light and has performed across the USA and Europe. A ‘musician’s musician’, Michael has featured on a number of recordings and often performs with his brothers, Donal, Sean and Connor. Michael wrote the music for his debut album, The Waylaid Man, which won excellent reviews and featured performances by top musicians including John McSherry, of Lúnasa, Nollaig Casey and his brother Donal, a fiddle player and former TG4 Gradam Ceoil Young Musician of the Year. In this course, he shares those all-important techniques that are fundamental to developing as a guitar player. By completing this course you can equip yourself to potentially join in at a 'seisiún' (music session) or simply improve your skills and enjoyment of the instrument. Learners can also gain certification by passing the end-of-course assessment. If you want to learn the secrets of professional-sounding guitar accompaniment, begin the course now - you won’t be disappointed!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}