{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3661","title":"Traditional Irish Sean-nós Singing | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Absorb the authentic sounds of Sean-nós Singing in English with Nell Ní Chróinín from Danú in this free online course.","description":"This free online traditional Irish sean-nós singing course is perfect for anyone with a tuneful voice and a love of Celtic music. Nell Ní Chróinín, from the renowned Irish band Danú, will teach you how to tell the story behind a song with the unique ornamentation that gives unaccompanied sean-nós or 'old-style' songs their distinctive sound. These 11 easy-to-follow sean-nós singing lessons focus on songs in English.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free online sean-nós singing lessons have been designed for singers who have completed our two beginner courses and want to progress, but they are also accessible for anyone who would like to be able to sing in the distinctive traditional Irish style. Here, professional performer Nell Ní Chróinín builds upon the fundamental skills that any sean-nós singer needs to know, from breathing properly to adding emphasis and embellishments in such a way that they complement the song. While many sean-nós songs are in the Irish language, Nell devotes this course to songs in English, making it accessible to a wider audience. Whichever language a song is in, the methods of adding ornamentation to give songs more 'colour' are key to distinguishing Irish sean-nós singing from other traditions. The lyrics are included in the notes that accompany the course, helping you to build on your repertoire as you progress on your sean-nós singing journey.</p><p>The lessons begin with the light-hearted song, 'The Whistling Thief', which Nell has collected from the great Irish singer Elizabeth Cronin. The song is a comical conversation as Mary tries to convince her mother that the whistling sound she can hear is not her beau Pat coming over for a late-night visit. The tune includes nonsense words or 'vocables'. Nell breaks the tune down into parts over three videos and although the lyrics are provided in the notes, she encourages students to learn the tune by ear. The next tune you will learn is the song, 'The Banks of the Moy', which commemorates a key Irish political figure, Michael Davitt, who led Ireland’s Home Rule movement in the 19th century. Again, Nell breaks the song into segments and teaches this rousing tune over four lessons, demonstrating how and where you might add ornamentation to colour the tune. The final tune of this 11-part course is the lilting song, 'Uncle Rat', which is another song that was collected from Cronin in the 1940s. Again, Nell gives examples of where ornamentation can be added in the last section of these easy-to-follow sean-nós singing lessons.</p><p>For anyone with an interest in learning the techniques behind unaccompanied singing and who wants to broaden their repertoire, this free online sean-nós singing course provides the perfect training. Your tutor, Nell Ní Chróinín, is a multi-award-winning singer and the lead vocalist with top Traditional Irish group Danú, who are well-known internationally. Nell, who is from the Múscraí Gaeltacht area of County Cork, has been singing from a young age. Among her many achievements was becoming the youngest person ever to win the prestigious ‘Corn Uí Riada’ prize, which is in honour of the legendary Sean O’Riada, also from Múscraí. By completing this course, you can follow in the footsteps of generations of traditional Irish singers, learning, as they did, through the oral tradition. You can also gain certification by passing the end-of-course assessment. If you have not yet completed our beginner Traditional Irish Sean-nós Singing courses, they are packed with tunes in the Irish language which will add immeasurably to your collection. Through all three sean-nós courses, Nell Ní Chróinín unveils the secrets of those vocal techniques that form an intrinsic part of Irish music’s cultural heritage. Begin the course today to add to your Traditional Irish sean-nós singing repertoire!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}