{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4008","title":"Traditional Irish Concertina | Beginner 1","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of playing concertina, in this free online music course with award winning musician Conor O'Loughlin.","description":"These free online beginner concertina lessons are the perfect introduction to the smallest of the squeezebox family, prized in Traditional Irish music for its versatility. Our tutor, multi-award winner Conor O'Loughlin, will cover the basics with lessons that are accompanied by downloadable notes. While the concertina buttons may at first appear baffling, you will be playing your first polka by the end of this easy 10-part course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you want to learn to play Traditional Irish music’s smallest squeezebox, this free online concertina course will equip you with everything you need to get started. While the concertina is most widely associated with sea shanties, as its size made it easy to stow away in the confined space of a boat, it’s a popular choice with Irish musicians. Both in sound and weight, it is lighter than the accordion and functions equally well at seisiúns, at set dances or accompanying songs. There are two main types, the English and the Anglo concertina, with Irish musicians, including our tutor, Conor O’Loughlin, favouring the 30 key Anglo, tuned to G/C. With 15 buttons on each side and bellows to control, it may seem quite a challenging instrument, however, over the course of 10 self-paced lessons, Conor will cover the basics that any beginner concertina player needs to know. There are notes included in the resources section of the course which you can download to help you.</p><p>The course begins with an introduction to the instrument along with a demonstration of how the notes are arranged in lines and rows and how the bellows work. Before long, you will know your way around the concertina and be ready to master the scale of D, which is the building block for tunes in a number of keys. Conor breaks this down into segments and teaches you how to play 'Mary Had a Little Lamb' in both the key of D and G. He ensures that learners have a clear grasp of the fingering on both hands as well as the bellows before moving on to teach Twinkle Twinkle Little Star which enables you to practise the scale of D. Having learned high D, Conor proceeds to teaching more notes in the higher octave which are played with the right hand and again he uses nursery rhymes to help you build muscle memory and grow familiar with the notes. The final section of the courses focuses on your first Traditional Irish tune, ‘Britches Full of Stitches’. This is a polka associated with the Sliabh Luachra area of County Kerry and is the perfect practice tune for newcomers to the concertina.</p><p>If you enjoy Irish music and would love to be able to play along on the smallest ‘box’ of them all, this free online concertina guide provides the ideal starting point. You will be learning from a former all-Ireland champion concertina player who hails from Corofin, near the famous Clare Burren. The west coast is a major hub for Traditional Irish music and Conor O'Loughlin is very much part of that. His brother Brian, another multi-award winning musician, teaches our tin whistle and flute courses. Like his brother, Conor has been playing Irish music since he was a child and showed promise from an early age. The year 2017 saw him win the all-Ireland concertina championship at Fleadh Ceoil na Eireann and together with the other members of the traditional music band Dúchas, he went on to win the prestigious 2017 Siansa Gael Linn competition held in Dublin. More recently, Conor graduated from the University of Limerick with a performance-based degree in Traditional Irish Music. He formed a group, The Conifers, with his college friends and as well as producing a debut album by the same name, they are creating ripples as an excellent live music band and have toured across the USA and Europe. Conor also teaches the other two courses in this series, Traditional Irish Concertina, Beginner 2, and Traditional Irish Concertina, Intermediate. By completing this course, you can not only learn the secrets of playing this charming instrument, but you can also gain certification by passing the end-of-course assessment. Buttons at the ready? It’s time to begin!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}