{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3717","title":"Traditional Irish Tin Whistle | Beginner 1","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to play traditional Irish tunes on the tin whistle with Brian O'Loughlin, in this free online music course.","description":"Get your musical education off to a flying start with these free online beginner tin whistle lessons with accompanying notes. The easiest and most accessible of instruments, the tin whistle is the perfect gateway for anyone wanting to learn to play traditional Irish music. With professional musician Brian O'Loughlin teaching you techniques and tunes in easy-to-follow steps, you’ll be playing Irish favourites like ‘The Siege of Ennis’ in no time!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online tin whistle course is designed to help beginners develop the skills needed to play one of traditional Irish music’s most popular instruments. Often considered the easiest instrument to learn, the tin whistle has long provided a starting point for students who have gone on to become accomplished musicians. Inexpensive and easy to access, penny whistles nevertheless provide a wealth of musical options, whether you want to learn tunes for your own entertainment, or dream of being able to play along with others. In this course, professional performer Brian O'Loughlin covers the basics that any beginner tin whistle player needs to know, including how to breathe properly. Through a series of short, easy-to-follow videos, and using a whistle in the key of D, he will introduce you to the basic techniques needed to play the tin whistle tunefully.</p><p>The course begins with lessons devoted to the notes played with each hand, along with the scale of D, followed by a third lesson focusing on playing the notes in the higher octave. Once those basics are covered, you will learn some easy tunes which will help you practise playing with each hand separately, followed by ‘Yankee Doodle’, which involves playing with both hands. Next comes the opportunity to learn your first Irish tune, the well-known 'The Siege of Ennis'. Brian breaks the tune down into sections for ease of learning over two lessons. He encourages learners to use the notes which are provided in a downloadable PDF from the resource section of the course as well as to practise playing by ear. Once you have mastered ‘The Siege of Ennis’ the tin whistle lessons progress to another popular polka, 'The Kerry Polka’, which is also in demand at ceilis and set dances. It will help you to practise playing in the higher octave.</p><p>For anyone interested in learning to play traditional Irish music, this free online tin whistle guide provides the perfect foundation. Your tutor, Brian O'Loughlin is a respected flute player who has recorded and toured, both as a member of some of Ireland’s top ceili bands and as part of a trio with uillean pipes player Tom Delany and guitarist Dessie Kelliher. Brian is also an active participant at the many traditional music sessions in his native County Clare, one of the most vibrant parts of Ireland when it comes to folk culture. By completing this course, you can learn everything you need to know to begin playing Irish tunes on the tin whistle. You can also gain certification by passing the end-of-course assessment. You may wish to progress to the next course in this series, Traditional Irish Tin Whistle, Beginner 2, where you will learn new tunes and some of the secrets of ornamentation which adds vibrancy to the music. The series concludes with Traditional Irish Tin Whistle, Intermediate Level, for those who have mastered the basics. Throughout the three courses, you will be learning tunes that are widely played at 'seisiúns' (music sessions) and dances across Ireland and beyond. Download the notes, begin the course and you’ll soon be whistling with the experts!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}