{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4009","title":"Traditional Irish Concertina | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master easy Irish tunes on the concertina in this free online course, with former all-Ireland champion Conor O'Loughlin.","description":"This free self-paced concertina course provides beginners with the opportunity to learn from one of Ireland’s top ‘box’ players, Conor O’Loughlin. A sequel to our Beginner 1 course, it is suitable for those who know the D scale and includes a PDF with notes that you can download. Conor will teach you how to play some easy polkas and a popular slip jig. In the process, you will learn alternative D and E notes to help you play more fluidly.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free online concertina lessons are ideal for anyone who has completed our Beginner 1 course and wants to learn more, or for any beginner who can play the D scale and knows the most commonly used notes on the concertina. This instrument can appear baffling to the complete beginner, with both the bellows and finger positions to master. However, top musician Conor O'Loughlin takes you through some easy tunes at a slow pace so that you can grow in skill and confidence quickly. Conor plays an Anglo concertina that has 30 buttons and is tuned to the G/C system, which is the most common tuning. This course will build on your basic knowledge of the instrument and help you progress to playing a wide variety of notes and tunes.</p><p>The lessons begin with an introduction to the air button and tips on the best position for the bellows before you learn the well-known 'Kerry Polka', which is mainly played in the higher octave. Conor covers both parts of the tune over the course of two lessons, with notes provided in a downloadable PDF in the resource section of the course. The next topic is another polka, ‘Maggie in the Woods’, which is about a girl who was lost in the woods and then found by her friends. This is typical of many Irish tunes that have the first part played on the lower octave and the second part on the higher octave. As the course progresses, Conor teaches learners the note C natural along with an alternative button for high D and high E which aids fluency in playing. He then introduces a more challenging tune, the slip jig ‘Bean Pháidin’ which is a popular tune with beginners on any instrument as well as sean-nós singers. There are many versions of the tune and Conor explains it was also a favourite of lilters who would sing an accompaniment for dancers if they didn’t have instruments. ‘Bean Pháidin’, which includes the high D and E on both hands, is taught over two lessons and concludes this easy beginners’ course.</p><p>For anyone who is new to the Irish concertina and wants to learn from a highly experienced young player, this free online concertina course provides the perfect training. Our tutor, Conor O'Loughlin comes from Corofin in County Clare, an area where Traditional Irish music thrives today. From a musical family, Conor has been playing since he was a young child and in 2017 he became an all-Ireland champion at Fleadh Ceoil na hEireann. Together with the other members of the traditional music band Dúchas, he went on to win the prestigious 2017 Siansa Gael Linn competition in Dublin that same year. Conor went on to study traditional music at the University of Limerick. While there he formed a new group, The Conifers, with his college friends and as well as producing a debut album by the same name, they have toured across the USA, Europe and Africa. By completing this course, you will avail of many tips that will help you to develop as a concertina player and you may also gain certification by passing the end-of-course assessment. You may wish to progress to the final course in this series, Traditional Irish Concertina, Intermediate. If you’d like to master the smallest squeezebox of them all, warm up those fingers and get ready to begin!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}