{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3620","title":"Traditional Irish Fiddle | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of playing jigs, hornpipes and reels with Doireann Ní Ghlacáin, in this free online course.","description":"This free online fiddle course is ideal for beginners who wish to learn some easy Irish tunes from the strong tradition of Irish folk music. Your tutor is professional musician and the face of Irish TV station TG4’s live music coverage, Doireann Ní Ghlacáin. Learn how to play jigs, reels and hornpipes along with some ornamentation, the little extras that give Irish fiddle playing its unique sound, in nine easy-to-follow fiddle music lessons.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free online fiddle lessons are ideal for anyone who has completed our basic Beginner 1 course and wants to progress, or for any beginner who has mastered playing the D, A and E strings and moving between strings. Here, professional performer Doireann Ní Ghlacáin builds on the basics that any beginner fiddle player needs to know, reinforcing the importance of playing the notes clearly and tunefully and the method of moving the bow across the strings for a fuller sound. From the way the bow is used to the small ornamentations that add colour to the sound of Irish tunes, there are many techniques that distinguish Irish fiddle playing from the classical violin. Learning these from an accomplished fiddle player is key to being able to reproduce traditional tunes and eventually achieving the desired speed of playing. These lessons will build on your repertoire and teach you the rhythms and tunes of a double jig, jig, hornpipe and finally, a reel, with the notes provided in the resource section of the course.</p><p>The lessons begin with the double jig, 'My Darling Asleep'. Doireann breaks the tune down into parts and encourages you to play by ear. The next tune you will learn is the jig, 'The Gander in the Pratie Hole' and Doireann introduces the 'slur' bow technique in this lesson. Slurring involves changing notes while continuing to move the bow in the same direction and is one of the basic tools of ornamentation. A hornpipe is next with the well-known tune, 'The Rights of Man'. Doireann describes the rhythm of a hornpipe and the history of the tune and encourages you to incorporate the slurring bow technique into your playing. The final tune of this nine-part course is the reel, 'Little Bag of Spuds'. This short tune will help you to learn to play more quickly. Again, Doireann gives examples of where the slur bow technique can be added in the last of these easy-to-follow fiddle lessons.</p><p>If you’re relatively new to the Irish fiddle and want to broaden your repertoire and learn how to recreate authentic traditional Irish sounds, this free online fiddle course provides the perfect training. Our tutor, Doireann Ní Ghlacáin is a recording artist and performer who has toured internationally from her home in the west of Ireland, the hub of Irish Traditional music. Apart from performing, Doireann also presents live coverage of Irish music programmes for the national Gaeilge TV station TG4. A native Irish speaker and an accomplished musician in her own right, Doireann comes from a famously musical family, with many fiddle players, especially on her paternal side. Her maternal grandfather was the composer Seán Ó Riada who is widely hailed as instigating the revival of the traditional Irish music scene of the 20th century. By completing this course, you can learn those all-important techniques that are fundamental to developing as a fiddle player. You can also gain certification by passing the end-of-course assessment. Begin the course and learn new rhythms and tunes that will take your fiddle-playing to the next level.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}