{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4072","title":"Traditional Irish Flute | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn reels, waltzes, polkas and barn dances with top flute player Brian O’Loughlin, in this free online music course.","description":"This free online flute course is packed with tunes with all-Ireland medal winner Brian O'Loughlin teaching students how to play two polkas, a waltz, a reel and a barn dance. It’s perfect for beginners who want to expand their repertoire while working on their breathing and playing techniques. These nine, self-paced flute lessons are a sequel to our Beginner 1 course and are accompanied by notes to download.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free flute lessons are ideal for those who have completed our Traditional Irish Flute, Beginner 1 course and want to progress to learning Irish tunes. They will also suit beginners with a basic knowledge of the notes on the flute and who know their way around the D scale. For anyone who is familiar with the tin whistle, the flute is a natural step up, however, even without knowledge of the tin whistle, the flute is not so difficult to learn once you have mastered the basic playing techniques. In this course, champion flute player Brian O'Loughlin helps students develop their skills and knowledge while reinforcing the importance of playing the notes clearly and tunefully by blowing correctly and breathing in the right places. These lessons will build on your repertoire with no fewer than five easy Irish tunes - two polkas, a waltz, a reel and a barn dance. Don’t forget to download the notes from the resource section of the course.</p><p>The lessons begin with an old favourite, 'The Kerry Polka', which is perfect for practising the D scale. Brian breaks the tune down into parts and encourages you to play using the notes provided but also by ear. The next tune you will learn is 'Maggie in the Woods’, also known as ‘Margaret in the Forest’, another polka which is popular at dances in the south of Ireland. The next section of the course switches to a slower pace with two beautiful melodies which will enable you to practise a more lyrical style of playing. First up is ‘An Gaoth Aneas’, or ‘The South Wind Waltz’. It’s followed by the famous song, ‘Down by the Salley Gardens’ which is associated with the poet WB Yeats. Both make ideal party pieces. This nine-part course concludes with ‘Jimmy Duffy’s Barn Dance', an uplifting tune that is similar in style to a reel or hornpipe.</p><p>If you are relatively new to the flute and would like to add some easy Irish tunes to your repertoire, this self-paced course is the ideal next step. Our tutor Brian O’Loughlin is an accomplished musician who has won all-Ireland medals as a soloist and with groups including one of Ireland’s top céilí dance bands, the Shandrum Céilí Band. He also performs in a trio with uillean pipes player Tom Delany and guitarist Dessie Kelliher. A member of one of County Clare’s most musical families, his brother Conor teaches our concertina courses. Both are active in the west of Ireland’s exciting cultural music scene. By completing this course, you can build on the foundations laid in the Beginner 1 course and learn a range of popular tunes. You can also gain certification by passing the end-of-course assessment. Begin the course and discover the pleasure to be found in performing Irish airs and dance tunes.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}