{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4063","title":"Traditional Irish Flute | Beginner 1","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to play the flute with all-Ireland medal winner Brian O'Loughlin, in this free online music course with notes.","description":"Learn to play one of the mainstays of Traditional Irish music with these free online flute lessons. Getting the basics right is essential if you ever want to master an authentic Irish flute sound and our tutor, Brian O’Loughlin is perfectly placed to give you that grounding. With this top céilí band member leading you through easy-to-follow steps, with accompanying notes, you will have the foundations for becoming a good player in no time.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online Irish flute course is designed to help beginners develop the skills needed to play one of Irish music’s most sought-after instruments. Considered slightly challenging to learn, the flute certainly rewards the student’s efforts. Once you have mastered the basic techniques, a world of opportunity quickly opens and endless hours of enjoyment await, whether you are interested in playing uplifting Irish dancing music, haunting laments or both. This virtuoso instrument can bring a hush over a room or add to the excitement of a fast-paced seisiún. In this course, former all-Ireland champion Brian O'Loughlin introduces the instrument in a series of short, easy-to-follow videos. These self-paced lessons allow you to stop and practise a step or rewind and watch a lesson again until you are happy to move on. Before you know it, you will be playing along with Brian.</p><p>The course begins with lessons devoted to the instrument itself, from putting it together correctly to holding it and most importantly, how to blow into the mouthpiece, developing the correct embouchure for a good, clear tone. Brian then moves on to the notes played with each hand, along with the scale of D, followed by a lesson focusing on playing the notes in the higher octave. The final component for becoming a competent flute player is controlling your breath by breathing from the diaphragm. Having laid the foundations and taught the correct technique for each aspect of playing, Brian begins to build on them, starting with the nursery rhyme, ‘Mary Had a Little Lamb’. He teaches it in the key of G first, which involves playing with just the left or upper hand and then in the key of D, to help you get to grips with using both hands. The next tune ‘Twinkle Twinkle’ is slightly more challenging and is useful for practising the key of D. The final tune of the course is another familiar song, ‘Yankee Doodle’ which adds further items to your armory. The notes for each tune are included in a downloadable PDF in the resources section of the course.</p><p>For anyone interested in learning to play traditional Irish music, this free online flute guide will help you develop good technique and habits from the start. Your tutor, Brian O'Loughlin is a former all-Ireland champion flute player who has recorded and toured, both as a member of some of Ireland’s top ceili bands and in a trio with uillean pipes player Tom Delany and guitarist Dessie Kelliher. He is also active in the many seisiúns in his home county of Clare, one of the most vibrant parts of Ireland when it comes to Traditional Irish music. Brian also teaches the other courses in this series, Traditional Irish Flute, Beginner 2 and Traditional Irish Flute, Intermediate as well as our three tin whistle courses. If you would like to be able to play Irish tunes in the authentic style that has been handed down through the generations, this series of flute courses provides the ideal starting point. Brian will guide you through the process from being a complete beginner to performing the 'rolls' and 'cuts' that ornament traditional music in the Intermediate course. You can also gain certification through passing our interactive, end-of-course assessment. Begin the course and with practice, you will soon find the flute is not as challenging as you thought!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}