{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3652","title":"Traditional Irish Sean-nós Singing | Beginner 1","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of sean-nós singing, with Danú's lead vocalist Nell Ní Chróinín, in this free online music course.","description":"Learn how to perform Irish songs in the traditional sean-nós singing style with this free online course. Our tutor is the voice of top Irish band Danú, Nell Ní Chróinín. The sean-nós art form is famed for its ornamentation that adds expression and colour to the songs, which are often sung in Irish. In this course, Nell will teach you how to sing unaccompanied songs in this uniquely expressive style that is admired across Ireland and beyond.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online sean-nós singing course is designed to help the beginner develop the essential skills needed to perform in traditional Irish music’s most iconic style. While many Irish songs revolve around story-telling, sean-nós singing brings a degree of feeling beyond the lyrics. The name Sean-nós simply translates as ‘old style’ singing and the songs are crafted to be performed without accompaniment. They are usually in Irish [as Gaeilge] but as tutor Nell Ní Chróinín demonstrates, there are also options in English. You don’t need to speak Irish to enjoy these lessons in which Nell covers the basics that any beginner sean-nós singer needs to know, including tips for controlling your breathing and where to introduce ornamentation. Through a series of easy-to-follow videos, she will introduce you to the best techniques for singing some well-known songs clearly and tunefully and teach you how to ‘colour’ your singing for an authentic Irish sound.</p><p>The course begins with an introduction in which Nell explains how sean-nós singing has its origins in Ireland’s Gaeltacht regions where Irish remains the first language. Most regions have their own distinct dialect and songs from that area are passed from generation to generation. She describes some of the sounds used to create ornamentation in traditional melodies and emphasises the importance of the singer being free to use ornamentation how and when they feel like it, to give a song their own unique interpretation. The first song on this course is a beautiful lullaby, 'Bog Braon Don tSeanduine', which means 'A Soft Drop for the Old Man'. Nell breaks it down into segments, encouraging you to write down the lyrics phonetically for ease of learning. The lyrics and a translation are available in the notes for this course. She also demonstrates the best places to take breaths in the song and emphasises the importance of good breathing techniques for delivering a song well. The next song, 'Blackwaterside', is in English and is a romantic ballad of love and emigration. In it, young lovers are saying their heartbroken goodbyes before he leaves for a new life overseas, however, all is not lost as the song draws to a close.</p><p>Sean-nós singing is among the most respected art forms in Irish culture, as anyone who has witnessed the hush that falls over a room as the singer begins, can testify. If you would like to learn how to perform these songs well, this free online sean-nós singing guide provides the perfect foundation. You will be learning from one of the most highly regarded proponents of the form. A recording artist and performer who has toured internationally with top Irish group Danú, Nell Ní Chróinín is also an experienced teacher. Having been raised in the Múscraí Gaeltacht area of County Cork, Nell’s life has been steeped in Irish culture and she began singing at a young age. Among her many achievements was becoming the youngest person ever to win the prestigious ‘Corn Uí Riada’ prize, which is in honour of the legendary Sean O’Riada, also from Múscraí. By completing this course, you can follow in the footsteps of generations of traditional Irish singers, learning, as they did, through the oral tradition. You may wish to progress to the next course in this series, Traditional Irish Singing, Beginner 2, where you will learn new tunes and more of the secrets of ornamentation. The series concludes with Traditional Irish Singing, Intermediate Level, which focuses on songs in English. Throughout the three courses, you will be learning tunes and techniques that have stood the test of time, but which are constantly evolving and touching hearts and minds anywhere that Irish culture is admired. Are you ready to unlock the secrets of sean-nós singing? Take a deep breath and get ready to begin a journey into the soul of Irish music.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}