{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3727","title":"Traditional Irish Tin Whistle | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to play easy tunes on the Irish tin whistle with Brian O’Loughlin, in this free online traditional music course.","description":"This free online tin whistle course is ideal for beginners who wish to learn a mixture of easy Irish tunes. Professional musician Brian O'Loughlin will teach you how to play the lament, ‘The Foggy Dew’, as well as three upbeat tunes that are popular at ceili dances and sessions, ‘The Taureen Derby’, ‘Shoe The Donkey’ and ‘Follow Me Down To Miltown’. These nine easy-to-follow tin whistle lessons have accompanying notes that you can download.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free online tin whistle lessons are ideal for anyone who has completed our basic beginner course and wants to progress, or for any beginner who has mastered playing the notes on the tin whistle, including playing C natural and C sharp (C#) and the D scale. Easy to learn, the tin whistle is regarded as the perfect entry-level instrument for any prospective musician but it is also popular in its own right. Here, professional flute player Brian O'Loughlin shares the basics that any beginner tin whistle player needs to know, reinforcing the importance of playing the notes clearly and tunefully by blowing correctly, and breathing in the right places. These lessons will build on your repertoire and teach you the rhythms and tunes of a polka, lament, mazurka and finally, a barn dance, with notes provided in the resource section of the course.</p><p>The lessons begin with the polka, 'The Taureen Derby'. Brian breaks the tune down into parts and encourages you to play using the notes provided but also by ear. The next tune you will learn is 'The Foggy Dew’, which can be performed as a song, a lament or a march. Brian talks about the origins of the song, against a background of war and unrest, and teaches it over the course of two lessons. A mazurka is next with the well-known tune, 'Shoe The Donkey' and Brian encourages you to look up the accompanying dance. The final tune of this nine-part course is the barn dance, 'Follow Me Down to Miltown' which originates in County Clare. Again, Brian teaches the tune in two parts, in the last of these easy-to-follow tin whistle lessons.</p><p>For anyone relatively new to the Irish tin whistle who wants to add to their repertoire with well-known tunes, this free online tin whistle course provides the perfect training. You will be learning from an accomplished musician as tutor Brian O'Loughlin is a respected flute player who has won many awards as a member of some of Ireland’s top ceili bands. He is also a member of a trio with uillean pipes player Tom Delany and guitarist Dessie Kelliher. Brian comes from one of County Clare’s musically gifted families and is active in the west of Ireland’s exciting cultural music scene. By completing this course, you can learn some tunes that are popular at sessions and Irish ceilis and set dances. You can also gain certification by passing the end-of-course assessment. Begin the course and learn new rhythms and tunes that will take your tin whistle-playing to the next level.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}