{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3621","title":"Traditional Irish Fiddle | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to add ornamentation to jigs and reels, in this free online music course with Doireann Ní Ghlacáin.","description":"This course is designed for beginners who are competent at playing basic traditional Irish tunes and want to improve their technique. Tutor and professional performer Doireann Ní Ghlacáin takes up the bow for these 10 easy-to-follow fiddle lessons, with accompanying notes. You will learn how to play well-known jigs and reels, with a focus on adding ornamentation, or the small touches that give Irish fiddle playing its particular vibrancy.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Acquiring the skills needed to master the unique sounds of Irish music takes time, practice and instruction from an experienced tutor. This free online Irish fiddle course is designed to help the beginner develop those techniques that give authentic Irish fiddle playing its distinctive flavour. It is ideally suited to students who have completed our Beginner 1 and Beginner 2 courses and want to progress, or to any beginner who can play basic tunes by ear or by following notes. The methods that distinguish Irish fiddle playing from classical violin have survived for centuries through Irish music’s oral tradition and here, professional performer Doireann Ní Ghlacáin builds on those basics and teaches you some new tunes. In each segment, she teaches the first part of the tune, then the second part, then the third lesson sees her focus on where and how to add ornamentation. The main techniques in this course include the addition of grace notes or 'cuts', triplets and bow 'slurs', where multiple notes are played during one sweep of the bow.</p><p>The lessons begin with the jig, 'The Connacht Man's Rambles'. Doireann breaks the tune down into parts and whilst the notes are provided in the resource section of the course, she encourages you to play by ear which is the traditional way of learning. She demonstrates where and how to add grace notes or ‘cuts’ once you have learnt both parts of the tune. The next tune you will learn is another popular jig, 'The Geese in the Bog'. As with every tune, Doireann plays the jig through at the proper speed so that you can hear how it should be played before breaking it down into manageable segments and going through it slowly, finally demonstrating how and where you can add ornamentation. With all Irish music, you are free to add grace notes wherever you think best and that freedom adds a unique quality to the expression of the tune. The final section of this easy-to-follow fiddle course is the reel, 'The Lilies in the Field' and once Doireann has taught both parts, she plays the tune through, identifying notes that lend themselves to ornamentation, from grace notes and triplets to slurs.</p><p>If you are relatively proficient in the Irish fiddle and want to broaden your repertoire and learn how to recreate authentic Traditional Irish sounds, this free online fiddle course provides the perfect training. Our tutor, Doireann Ní Ghlacáin is a recording artist, performer and tutor who has toured internationally from her home in the west of Ireland, the hub of Irish traditional music. Doireann also presents live coverage of Irish music programmes for the national Gaeilge TV station TG4. A native Irish speaker, Doireann’s heritage is steeped in Irish music with her paternal family immersed in fiddle playing. On her maternal side, her grandfather was the esteemed composer Seán Ó Riada. By completing this course, you can learn those all-important techniques that are fundamental to developing as a fiddle player. You can also gain certification by passing the end-of-course assessment. Complete this course and with practice, you will master the deftness of playing that has been setting Irish music apart for centuries. Rosin at the ready? It’s time to begin adding colour to your fiddle playing!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}