{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3835","title":"Traditional Irish Button Accordion | Beginner 2","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of playing jigs on the Irish accordion in this free online course with top musician Conor Connolly.","description":"This introductory and self-paced button accordion course is ideal for beginners who know the notes on the treble hand and wish to progress to the next stage. Irish champion musician Conor Connolly, who also teaches our Beginner 1 course, will teach you how to play some popular jigs. In the process, you will learn to play the C scale and the notes in the higher octave. This nine-lesson course concludes with an introduction to ornamentation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>These free online accordion lessons are ideal for anyone who has completed our basic beginner course and wants to learn more, or for any beginner who can play the D scale and knows most of the right hand (treble) notes on the button accordion. This instrument can appear baffling to the complete beginner, with both the bellows and finger positions to master. However, top accordion player Conor Connolly builds on the elements that any beginner needs to know, with patient demonstrations of each of the fundamental techniques and lots of encouragement. Conor’s accordion uses the B/C system, which is the most common tuning. This course will build on your basic knowledge of the instrument and help you progress to playing a wide variety of notes and tunes.</p><p>The lessons begin with learning to play the first part of the jig, ‘The Rollicking Skipper’, a tune which is attributed to Roscommon woman Ann ‘Ma’ McNulty, who played the melodeon, and became a well-known performer in New York in the 1930s-1950s. Conor covers both parts of the tune over the course of two lessons, with notes provided in a downloadable PDF in the resource section of the course. The next topic deals with playing in the higher octave, which you will need to have learned before moving on to the slip jig, ‘Cucanandy’. This is typical of many Irish tunes that have the first part played on the lower octave and the second part on the higher octave. Conor devotes a lesson to teaching you the C Scale, which is played on the inside row of buttons, before proceeding to the final tune in this course, the popular jig, ‘The Geese in the Bog’. As with ‘Cucanandy’, Conor divides ‘The Geese in the Bog’ into two parts which he teaches over two lessons. The course concludes with an introduction to ornamentation, the special techniques Irish musicians use to add colour to a tune and Conor demonstrates how to ‘cut’ a note.</p><p>For anyone who is quite new to the Irish button accordion and wants to learn from a highly experienced player, this free online accordion course provides the perfect training. Our tutor, Conor Connolly comes from south Galway, where many of the great accordion players of the past such as Joe Cooley and Joe Burke lived, and where Traditional Irish music thrives today. From a musical family, Conor has been playing and performing for years and in 2019 he won the prestigious TG4 Gradam Ceoil Young Musician of the Year prize. By completing this course, you can avail of many tips that will help you develop as an accordion player. You can also gain certification by passing the end-of-course assessment. You may wish to progress to the next course in this series, Traditional Irish Button Accordion, Intermediate, where you will learn a barn dance, a jig and a reel and most importantly, how to ornament your playing for an authentic Irish sound. Begin this course and gain the knowledge and skills you need to take your accordion-playing to the next level.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}