{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4010","title":"Traditional Irish Concertina | Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the authentic sounds of the Irish concertina with champion player Conor O'Loughlin, in this free online course.","description":"This concertina course is designed for relative beginners who have learned to play basic Irish tunes and want to improve their technique. Conor O'Loughlin, a former all-Ireland champion and member of The Conifers, is the tutor for these eight easy-to-follow lessons with accompanying notes. Learn how to play jigs, reels and hornpipes, with a focus on adding ornamentation in the form of cuts and triplets, along with chords.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Develop the skills and techniques that give authentic Irish concertina its distinctive sound with this free online concertina course. It is ideally suited to students who have completed our basic Beginner 1 and Beginner 2 courses and want to learn how to enhance their playing, or to anyone who has a good grasp of the fundamentals of playing the concertina. In this course, you will be introduced to some of the techniques that give Irish folk music its distinctive colour such as 'cuts' and 'triplets'. Here, former all-Ireland champion concertina player Conor O'Loughlin passes on some of those skills that he has learned both through Irish music’s oral tradition and through studying music at university. This course includes a lesson on playing chords on the concertina along with new tunes.</p><p>Throughout the course, Conor breaks the tunes down into segments so that the learner can remember each part more easily. There are also accompanying notes for each tune in the resources section of the course. These include reminders of when to add ornamentation or the extra notes that 'colour' traditional Irish music. The course begins with ‘Jackie Daly’s Jig’, named for the famous accordion player from County Kerry. Conor introduces two of the most popular forms of ornamentation used in traditional Irish music, the ‘cut’ and the ‘triplet’. A cut involves quickly tapping a note before the main note you are playing while a triplet is a set of three notes played in the space of two. Once the whole tune is played, there is the opportunity to play it through at a slightly higher tempo with the ornamentation included. The next tune is the hornpipe, ‘Off to California’. A hornpipe is similar to a reel but with added bounce. Conor teaches the tune in two sections, showing you where to add ornamentation in the form of triplets. The final section of this course is devoted to the reel ‘The Weeshie Bag of Potatoes', also known as ‘Follow Me Down to Carlow’ and Conor devotes a lesson to teaching you how to play concertina chords before moving on to the tune itself. This is a popular reel at sessions and a fitting finale to this intermediate course.</p><p>For anyone who is relatively new to the Irish concertina and wants to broaden their repertoire and learn how to recreate authentic traditional Irish sounds, this free online concertina course provides the perfect training. Our tutor, Conor O'Loughlin, is one of the top young players in Ireland, having won the national title at Fleadh Ceoil na hEireann in 2017 and winning the prestigious Siansa Gael Linn competition that same year with the band Dúchas. More recently, Conor graduated from the University of Limerick with a performance-based degree in Traditional Irish Music. He formed a new group, The Conifers, with his college friends and together they have toured internationally with their debut album by the same name. He lives in Corofin, near the Clare Burren, in an area that boasts a vibrant traditional Irish music scene with its annual festival in March attracting visitors from across the world. Through our three free concertina courses, Conor shares the knowledge, skills and techniques that are key to developing as a concertina player. Learners can also gain certification by passing the end-of-course assessment. If you want to master those techniques and tunes that will take your concertina-playing to the next, toe-tapping level, begin the course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}