{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5609","title":"How to Find Your Purpose and Become a Life Coach","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Train as a life coach with this free online course and help clients find their talents, passions and goals in life.","description":"Finding your purpose is difficult and many people need guidance to do so. Identifying your goals is the first step in making lifestyle decisions and finding a profession that ignites your passion and makes full use of your talents and skills. Life coaches play a key role in advising clients and helping them to set goals and work towards them constructively. Sign up to learn how to become a life coach who helps clients unleash their potential.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Many people want to find their life's purpose and struggle to do so. Even those aware of the importance of goal setting may find the process challenging. This course teaches you how to coach others to help them accomplish this objective. We first outline the fundamentals of communication and provide the verbal, physical and emotional skills you need to connect with clients and create trust. We then compare various teaching styles.</p><p>Lacking proper technical skills can be a significant barrier to successful coaching. We explain how to use Microsoft PowerPoint to create video and audio content, handouts and workbooks. We then delve into the idea of ‘life purpose’ and outline benefits of identifying one. The course also discusses how to build trust and show your intent to clients. We then discuss talents and explain how to draw on them to achieve your goals.</p><p>This life coaching training course then shows you how to harness your passions and explore them through meditation and journaling. This helps you to make goal-setting and finding a purpose an important part of your life. We discuss how visualisation, goal-setting and focusing on small changes can help clients to take control of their futures. Our final section explains how to ‘live your purpose’ every day. Life coaching is a growing industry as people come to appreciate the importance of setting goals that reflect their values, passions and talents. Enrol in this course to learn how to become a life coach and guide clients towards their purpose and a fulfilling life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}