{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/2696","title":"U.S. Citizenship and American Civics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain better insight into the process of primary elections and the electoral college system with this course.","description":"This free online American civics course teaches you about the process of primary elections, and about the caucuses that are held in each U.S state, and how they play an integral role in the process of nominating a party's candidate for the Presidential election. You will also study how the Electoral College system works and elects the President, and you will answer questions to prepare you for the U.S. Citizenship test, so start learning today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course begins by discussing the important aspects of American civics such as the Presidential elections and how the executive section of the government functions. You will look into the electoral college which is a body of people representing the states of the U.S. and formally cast votes for the election of the president and vice president. You will also study the primaries and caucuses, deficit and debt ceiling, and the governments financial condition.</p><p>You will then get an introduction to Social Security in the United States where you will learn that they refer to it as the OASDI which stands for Old Age, Survivors and Disability Insurance. You will study the Federal Insurance Contributions Act (FICA) Tax which is the tax paid for social security, the Stop Online Piracy Act (SOPA), and the Protect IP Act (PIPA). You will also look into Medicare sustainability and a whole lot more.</p><p>Finally, you will answer a bank of questions to help you prepare for taking the U.S. Citizenship test. Upon the completion of this course, you will gain a better understanding of how the American political system actually nominates candidates who run for the positions of President and Vice President, how the Electoral College system officially elects the President and Vice President, and how the executive branch of the U.S. government runs its affairs. It is also useful for those preparing for the U.S. Citizenship Test. Sign up for this course and learn more about the American political system.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}