{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5450","title":"Understanding the Problem of Modern Slavery","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Slavery still exists so learn how to identify and assist victims of human trafficking in this free online course.","description":"Did you know that slavery still exists and may even be closer to home than you think? This course explains how human trafficking rings operate in today’s advanced society. We examine legislation that prohibits slavery and explain how to identify people who are being forced to work or kidnap victims who might have their organs sold. We also show you what to do when you suspect someone is being trafficked. Sign up to make the world a little safer.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The term ‘modern slavery’ refers to institutional slavery that is still being carried out despite global laws against this evil practice. This course is designed by Course Gate and is suitable for anyone concerned with protecting human rights. We begin with definitions of ‘modern slavery’ and an analysis of its various types. We outline the history of the fight against slavery and explain how the UK government has taken tough measures to end its modern form by enforcing anti-slavery legislation like the Modern Slavery Act of 2015.</p><p>The course then explores the concepts of forced labour (also known as ‘slave labour’) and human trafficking, one of the most important humanitarian challenges of the 21st century. No matter the social condition, historical period or political system, human trafficking occurs in every country because all human traffickers share the same objective: to profit from the exploitation of others. We investigate the systematic enslavement of a group of people for sexual purposes (known as ‘sexual slavery’) and discuss why its victims are more often women and children.</p><p>We then explain how to accurately identify victims of modern slavery to aid and support them. Fear and intimidation may leave victims of human trafficking feeling unable to flee or report the crime after being tricked or forced into working for no pay. The more knowledgeable you are about the issues, the more helpful you can be when it comes to identifying and even safeguarding victims so that they do not end up in a worse situation after an intervention. You may think of slavery as gone from the world but it still exists all around you, so sign up for this course to learn how to protect the human rights of modern slaves and prevent human trafficking.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}