{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4840","title":"Understanding Travel and Tourism","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course introduces you to the exciting and fascinating world of travel and tourism simply and clearly.","description":"Travel and tourism is one of the world’s largest industries and provides diverse career possibilities and growth for the right candidate. If you want to be a part of this dynamic industry, then this course 'Understanding Travel and Tourism’ is a perfect opportunity to understand this enterprise. This easy-to-follow course introduces you to all the elements that make the world of travel and tourism so important and fascinating.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Travel and tourism is one of the world’s fastest-growing industries. It employs thousands of individuals and provides diverse career opportunities on a global scale. Also known as the world's largest 'smokeless industry’, it can offer employment to people from any background, experience or knowledge area. So if you have an interest and wish to join this dynamic field or explore this subject matter before launching your career, then this course provides the right opportunity for you by introducing the basic concepts of this service industry in simple terms.&nbsp;&nbsp;</p><p>We have structured this course into modules and topics. Each topic covers travel and tourism fundamentals, helping build your knowledge base of this incredible industry. We start with the basic concept of tourism: the skills required, the web of services related to the industry and an overview of important destinations. Next, you will explore the business positions covering corporate travel, hospitality, catering and events planning elements. Finally, some engaging assessment questions will instil a valuable understanding of the field and its possibilities.</p><p>'Understanding Travel and Tourism' is an ideal orientation course outlining the concepts, principles and practices of the modern travel and tourism industry. It is best suited for anybody who wants to start a career in tourism, those in jobs related to this area or tourism students who wish to improve their knowledge by learning additional valuable information. This course will also help prepare you to enter other tourism and hospitality studies. All you need to do is to enrol and begin. Join the course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}