{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1586","title":"Understanding Mortgages and Home Equity","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about the financial concepts behind mortgages and home equity before purchasing a property.","description":"This free online course on understanding mortgages and home equity will discuss the crucial relationship between mortgages and home equity. Your mortgage payments pay off your debt to the bank, while your home equity is how much of your home you actually own. With this course, you will learn how home equity is calculated by taking the appraised value of your home and subtracting the balance remaining on your mortgage. Get started, today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Acquiring a property through a mortgage from the bank entails a lot of considerations, so understanding the relevant calculations at hand can be a big help. This course will first introduce you to the concepts of assets, liabilities, equity, and collateral in relation to obtaining a mortgage from various financial institutions. It will then teach you how to make a balance sheet and compute your equity depending on the market value of your property.</p><p>If you decide to sell your property or are incapable of continuing to pay your mortgage loan from the bank for whatever reason, you will then need to learn how to calculate the interests that come with your decision. This course will discuss how to calculate monthly interest rate repayments over the lifetime of a fixed rate mortgage using a geometric formula.</p><p>Owning a house is a major aspiration for a lot of people. In the vast majority of cases, fulfilling this dream requires taking out a mortgage, which is one of the biggest financial commitments most people make in their lives. This course will ensure that you learn the crucial financial concepts behind getting a mortgage before you dive in. These are really valuable pieces of knowledge, so don't wait until it's too late. Get started with your next learning journey, today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}