{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5127","title":"Understanding the Basics of Gas Safety","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This health and safety course lays out the UK’s safety precautions surrounding the use of natural gas to provide energy.","description":"This health and safety course provides the training required to become a gas safety manager or first aid volunteer in the UK. It outlines the physics principles that drive gas appliances in residential and industrial buildings. We explain how to test a metered regulator and other pressure equipment before going over the regulations that guarantee safe gas installations. Natural gas plays a key role in today’s energy industry so sign up today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The United Kingdom’s ‘Gas Safety Week’ in September acts as a nationwide safety warning. Natural gas heating is found in millions of UK homes. Faulty gas equipment can result in gas leaks, explosions, fires and carbon monoxide (CO) poisoning while gas appliances without labels may be dangerous. This course is designed for safety management technicians, gas safety officers and managers who want to stay current and comply with health and safety regulations.</p><p>Improper handling of gas cylinders can lead to injuries like sprains, bruising and broken bones while incorrect labels can lead to catastrophes such as fires, explosions, chemical burns, poisoning and cold burns. Precautions against gas leaks might save your life and the lives of those around you as faulty gas equipment can produce fires, gas leaks, explosions or CO poisoning.</p><p>This course provides an understanding of the risks and precautions inherent to working with natural gas and the regulations designed to alleviate them. We cover the guidelines, laws and best practices developed for residential and commercial gas use in depth in the UK. We explain how to inspect a gas metre and calculate ventilation for gas appliances. We also demonstrate how to verify the operating pressure of equipment and establish the importance of emergency and evacuation protocols. Register now to train as a gas safety professional in the UK and learn how to use this valuable natural resource safely.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}