{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/5400","title":"Understanding Digital Journalism","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Train as a digital journalist in this free online course that explains how the internet has changed modern reporting.","description":"Today’s journalists make extensive use of the internet to both research and publish their stories. This journalism training course covers the methods, procedures, guidelines relevant to the professional. We then provide professional advice and examine the regulations and ethics governing digital journalism. We describe the impact of the internet on the news industry and describe the skills, tools and applications that today's reporters need.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The advent of the internet has established the field of digital journalism, which has changed the way news is created and reported across online networks to quickly share breaking news that features graphics and audio in the form of multimedia. This type of reporting has become more important and today's news environment requires media-specific journalistic abilities. Journalistic styles and structures from print, radio and television get copied, modified and adjusted for the different demands created by the medium of the internet. This digital journalism course explains how new media supplanted conventional forms and describes the abilities, mobile reporting tools and apps that modern journalists require. We first examine the architecture of the internet, including its web browsers, the file transfer protocol, terminologies, narrative forms and services.</p><p>Digital journalism allows connected debates on public news items. This course shows you how blogs can demonstrate the journalist's personality and abilities and how photos alone may tell a story. We cover technical aspects of the job like hypertext, link structure, voice control navigation, usability, the user experience and website design. We explain how to create narratives using video, infographics and other visual components that create a sense of immediacy. The course also explores multimedia, the four phases of news, the merits and drawbacks of various media, the news-gathering approach, video content and communication technologies.</p><p>This journalism course teaches you how to conduct user research, create online publishing, leverage online networks and monetise the web. Our lessons cover data journalism, metrics, analytics, artificial intelligence and virtual reality. Due to the rising levels of cyberbullying and harassment experienced by female and freelance journalists in the UK, the course contains an entire section on protecting oneself from such threats and trolls. Finally, we explore the ethics of digital journalism and provide the legal knowledge you need to evaluate whether your stories are relevant, appropriate and in the public interest. We describe the reporting restrictions pertinent to court processes and examine election laws, the Defamation Act, copyright laws and the internet safety requirements governing journalists. This course teaches all aspects of digital journalism from the ground up and provides all the training you need to set up and run a professional news site. Sign up to learn how to connect with a wider audience and turn your journalistic skills into an extra revenue stream in the form of self-publishing on new media.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}