{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3782","title":"What is Bullet Journaling?","totalEnrolled":"1,272","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches how the bullet journaling system can help you create positive and productive habits.","description":"Do you have hundreds of to-do lists lying around? Are you easily distracted by your smartphone? Learn how the bullet journaling system can help you solve these problems and improve your lifestyle. A bullet journal is a productivity tool for organizing your tasks and activities. By completing this course, you will learn to adopt this system to eliminate clutter and boost productivity. Let's start your journaling journey!","courseOutcomes":["Relate the history of the bullet jou...","Indicate the setup procedures, equip...","Discuss the basic and essential bull...","Identify the significance of symbols...","Relate the history of the bullet journaling system","Indicate the setup procedures, equipment, and necessary supplies for a bullet journal","Discuss the basic and essential bullet journaling hacks and tips","Identify the significance of symbols in the bullet journaling system","Summarize the methods of adopting journaling as a lifelong habit","Translate the self-improvement template tutorials to a habit tracking productivity tool","Relate the history of the bullet jou...","Indicate the setup procedures, equip...","Discuss the basic and essential bull...","Identify the significance of symbols...","Relate the history of the bullet journaling system","Indicate the setup procedures, equipment, and necessary supplies for a bullet journal","Discuss the basic and essential bullet journaling hacks and tips","Identify the significance of symbols in the bullet journaling system","Summarize the methods of adopting journaling as a lifelong habit","Translate the self-improvement template tutorials to a habit tracking productivity tool"],"courseDescription":"<p>When the creator of The Bullet Journaling system first developed the method, he had no clue that his creation would become such a powerful productivity tool. Perhaps, you’ve heard about Bullet Journaling, and it triggered an interest. Maybe a couple of your friends even showed you theirs, and you have seen how it improved their lives. According to its founder, The Bullet Journaling System can be described as a mindfulness practice disguised in a productivity system. A Bullet Journal aims to give you the platform to explore your inner self and discover what and why you need to succeed. As such, bullet journaling can increase your mindfulness, boost your productivity and lead you on the exciting road towards achieving your goals. Before getting started, ask yourself questions like, can I set aside time every day to journal? What size of journal should I use? In this free online course, we will guide you through the nitty-gritty of the bullet journaling system to enable you to adopt an exciting journaling habit.</p><p>Next, we will examine the history of the bullet journaling system, including the two essential types. We will also present the basic setup procedures, booklet sizes, number of pages, and the equipment and supplies required for this practice. An overview of the hacks and tips of journaling will highlight the use of post-its, artistic masking tapes, divider tabs, and pocket guards. We will show you how to keep track of your daily, weekly and monthly schedules via the daily log. Similarly, we will demonstrate the methods for tracking your future plans (also known as collections). For example, the books you want to read, movies you want to watch can all be planned via the journaling system. Learn how to create an index page, the symbols for creating a key, and why you should write your plans, goals and events for the year on the future log page.</p><p>You will learn why a journal is a great reflection tool and how to make journaling a rewarding, lifelong habit. Recent research studies showed that bullet journaling could benefit your mental health by identifying diurnal stressors. This can help you track your habits and moods, aid in how you process emotions and minimize distractions. Similarly, using a bullet journal could help alleviate the&nbsp;Zeigarnik Effect&nbsp;— a psychological phenomenon according to which it’s much easier to remember unfinished tasks than completed ones. A 2016 study suggests that expressive writing can improve your control over your physical reactions and anxieties. The ability to be open-minded and embrace change will have a positive ripple effect in all areas of your life, including your mental health, work, and relationships. By completing this course, you will learn how to live a decluttered lifestyle, enhance productivity, and achieve your life goals. So why wait? Enrol for this course today!</p><a href=\"https://alison.com/resume/courses/3782\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3782\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Developing a Journaling Lifestyle","description":"In this module, you will study the major requirements and skills for creating a bullet journaling lifestyle. You will be shown the essential types, basic setup procedures, as well as, the equipment and necessary supplies for creating a journal. The hacks and tips for creating the vital aspects of the journaling system will also be explained.","topics":["Developing a Journaling Lifestyle - Learning Outcomes","Bullet Journaling Basics","Journaling Hacks and Self-Improvement Tutorials","Developing a Journaling Lifestyle - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["What is Bullet Journaling? - Course Assessment"]}]}