{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4190","title":"Wing Chun Without Wooden Dummy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn Wing Chun techniques, skills and postures that can be practised without a Wooden Dummy in this free online course.","description":"This martial arts course provides a broad knowledge of various techniques, skills and postures that can be practised without a Wooden Dummy. You will gain an understanding of the styles used in practising self-defence and fighting methods using a lamp post as target practice. Learn about kick techniques and fight-winning foot movements. Sign up today and improve your mastery of Wing Chun in the absence of a Wooden Dummy.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course illustrates methods used in practising self-defence without a Wooden Dummy. Taking it introduces you to the eight Wing Chun kick techniques used in fights. You will learn about the parts of the complete Wooden Dummy system and the key points when hitting or practising with it. The techniques for accurate and more powerful hits will also be analyzed in this course. Study the importance of sticking to the arms of opponents and the application of inch power in Wing Chun. Because Wing Chun is an art and a way of life, study the best practices and ways of directing energy for each move. Hitting an opponent is both self-defence and attack therefore every hit is important, so learn about the postures and hit intensity in this course.</p><p>Next, 13 fight-winning Wing Chun techniques and how the Wooden Dummy can be used to practise these techniques will be highlighted. Study more methods such as the Biu Sau, Laap Sau, Bong Sau and the Woo Sau using a lamp post as target practice. The methods of the Yiji Kim Yeung Ma, Paak Sau and the Gaang Sau will be illustrated extensively. You will gain in-depth knowledge about the basic pose position as well as how to use the full energy of the palm in a fight. Learn to identify the most appropriate time to apply each technique of Wing Chun in the absence of a Wooden Dummy. Taking this course exposes you to the double Tan Sau and Heun Sau together with few low-kick fighting methods. Wing Chun techniques help improve learners’ confidence, develop self-discipline, teach self-respect for everyone and greatly boosts mental as well as physical awareness.</p><p>Lastly, more advanced techniques - including the Mau Sau, Fuk Jat Sau, Po Paai Sau and the Huen Da - are explained. Learn about the technicalities of fighting without a wooden dummy and more techniques specially focused on making your opposition lose balance. Get to know the techniques, including the application of the double Tan Sau and the double Huen Sau - for destabilizing an opponent. You will also get acquainted with how to apply a variety of methods such as the Biu Soa and the Gaang Sau. By taking this course, you will master effective foot movements and kick methods used in Wing Chun. This course will greatly benefit martial arts trainers and trainees with no access to a Wooden Dummy.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}