{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/4187","title":"Wing Chun for Beginners - Using a Wooden Dummy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online self-defense course on Wing Chun fighting skills shows you Wooden Dummy workouts to improve mobility.","description":"This course covers basic Wooden Dummy techniques and how to apply them in a street fight or real-life situation. You will learn how to practice on an empty Wooden Dummy and the various empty-hand forms such as Siu Nim Tao and Biu Jee. Then, explore the five-arm system of the Wooden Dummy and what the different forms look like. Take your self-defense to a new level and enrol today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course gives you a foundational understanding of Ip Man’s traditional Wing Chun techniques and the Wing Chun culture. It introduces you to the basics, important points to bear in mind when practicing with a Wooden Dummy. This training helps you develop the essential skills and control necessary to Wing Chun and improve your self-defence skills. You will learn various footwork techniques, including why it is important to position and move your body correctly in combat. This course explores a variety of Wooden Dummy techniques and how to apply them in an actual fight. You will also learn how to practice with an empty Wooden Dummy. Study the empty-hands forms such as Siu Nim Tao, Chum Kiu, and Biu Jee. Discover how practising alone or with a mirror gives you more insight into what the forms look like. You will see how a Wooden Dummy is made up of a five-arm system. It comprises two legs on one side while on the other, there are three arms and one leg for the traditional ancient dummy. There are also two pairs of knives and a spring arm as well as the Jat Da device.</p><p>Next, this course illustrates how to use a Wooden Dummy to practice Jat Da and Chi Sao techniques, which are almost like a simultaneous block-and-attack move. In Jat Da, you will learn how you can jump lower or higher depending on where the opponent’s fist is coming from. Chi Sau, on the other hand, is a method that challenges one’s ability to develop proficient and effective actions that will be practical when employed against an attacker. Furthermore, the material demonstrates the 13 best Wing Chun techniques to use for self defence. They employ the Wooden Dummy and Wing Chun Eight Kicks, which are aimed to the floating ribs and below. Learn about the Biu Jee Sao or ‘thrusting fingers’, which is one of the many Wing Chun moves that doubles as a block and a strike. Analyze how it can be used to deflect any attack around shoulder height and above or to strike the eyes and throat.</p><p>Lastly, this course teaches you how to use soft energy to overcome hard energy when practicing with the Wooden Dummy. Learn how the Kwan Sau move is going to let you trap your opponent so that you can hit them effectively. The material then discusses the second part of the Wooden Dummy system using the right hand and opposite direction. Learn how, when doing the Bong Sau, the Wu Sau (defending hand) is just as important. In Wing Chun, there is the Chi Sau exercise (which means ‘sticking to the arm’). You will examine the importance of training on both sides because, when you are attacking or defending with your right arm, you should also be able to do it with your left. This gives you a major advantage. In close fighting or Wing Chun, you do not focus on the upper body but on the middle section. Learn why you have to be more flexible in real-life fighting, look at the situation and decide where to attack. This self-defence course on using the Wooden Dummy gives you insights into the teachings of the traditional Wing Chun Ip Man’s eldest son Yip Chun. By taking this course, you will understand how to apply Wing Chun’s different techniques and improve your martial arts techniques!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}