{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/3986","title":"Working Principles of Home Appliances","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to safely operate, maintain and repair home appliances in this practical free online course.","description":"The rapid development of home appliances has made much domestic work easier and faster to complete. This free online course examines commonly used electric devices and some of their non-electric counterparts, like water purifiers. We explain how to operate, maintain and repair such appliances. This course suits aspiring repair professionals or anyone who wants to keep their household machines working at peak efficiency.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Today’s homes are equipped with many appliances to ease our daily lives. This free online course takes you through the operating principles, advantages and disadvantages, maintenance and repair of these devices. Many appliances are used in the kitchen but we begin with the most common and maybe most essential type: lights. The course lays out the characteristics and working principles of lamps. We identify the four main types of lamps: incandescent, fluorescent, compact fluorescent and light-emitting diodes (LEDs). Clean water for cooking, cleaning or drinking is also essential in the home and we guide you through the operation and maintenance of water purifiers, including the activated carbon, reverse osmosis and ultraviolet varieties.</p><p>While food was once cooked over a fire stove or even an open fire, it can now be cooked much faster using various appliances. This course shows you how a heating element is made and works. We then demonstrate how to safely service and maintain appliances like the rice cooker as we investigate both complex cooking devices and their simple counterparts, like the electric kettle. Cooking appliances are not the only type of heating machine found in the home: heaters, clothes dryers and washing machines also feature heating elements as part of their design and we show you how to operate and repair them.</p><p>We then discuss air appliances in terms of how they work and how to maintain them. The course then delves into the various types of electric grinders and mixers used in kitchens. But what about powering all these appliances? In the course’s last section, we examine various types of uninterrupted power supply (UPS) unit and explain how they regulate voltage. We then discuss their operation and troubleshooting process. This course suits anyone who wants to learn the correct operation, working principles, maintenance and repair of home appliances. Aspiring electricians and repair professionals can also benefit as we show you how to keep homes running smoothly.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}