{"subjectName":"Personal Development","subjectDescription":"Personal development is a lifelong process that involves expanding one’s knowledge and improving personal skills. It allows people to assess their skills and qualities, consider their aims in life and set new goals. Our personal development courses will teach strategies and f... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/personal-development.jpg","resumeLink":"https://alison.com/resume/courses/1493","title":"Writing for Young Readers","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to write and publish stories using character, plot, setting and theme with this free online writing course.","description":"This free online writing course is designed to teach new and aspiring writers how to write for young readers, and offers a solid grounding not only in writing, but in editing, and publishing. It features an interview with Uma Krishnaswami, an author of picture books and children's novels as well as Apirana Taylor, a poet, novelist, and story-teller. In this course you will learn about writing structures, forms, and genres, proofreading, and more!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online writing course from the Commonwealth Education Trust is an excellent introduction for new or aspiring writers and includes interviews with top authors. Successful authors David Hill and Maria Gill provide a comprehensive overview of the writing and publishing processes, from jotting down ideas in a journal, to revising and editing your stories, to making a publishing pitch at a conference. The course includes helpful resources such as reading extracts, examples, checklists, links and a plot chart. In addition, there are carefully prepared assessment questions in each module, to help you learn.</p><p>The course begins by giving valuable lessons on the types of writing that can be achieved, whether it's poems, stories, picture books, plays or non-fiction, as well as the benefits to children of writing stories. Next, you will learn about choosing the right genre for your writing, whether it's fantasy, realistic, historical or adventure and tailoring your stories to the particular audience you're targeting. The course then describes all there is to know about writing the elements of stories, i.e. character, plot, setting, theme and language. Maria Gill then introduces the important processes of editing, proofreading and publishing your work and shares her personal experience as a successful author and publisher.</p><p>Finally, the course presents the different publishing options available, such as traditional publishing, self-publishing and digital publishing. Here you will learn the importance of working with a range of professionals in the industry, so that your work can become an actual book on a shelf in a bookstore or on a digital device such as Kindle. This course will be of great interest to anyone who wishes to learn more about writing forms and genres, especially for writing to young reading audiences. So, why wait? Learn how to improve your professional writing skills today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}