{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5164","title":"A Comprehensive Guide to Construction Safety","totalEnrolled":"919","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to protect construction workers from workplace accidents in this free online health and safety course.","description":"Construction is a high-risk industry with a high rate of fatal and serious injuries. How can you ensure workers' safety in such a dangerous environment? We explore the basics of managing health and safety in the construction industry and go through the relevant UK laws and regulations in the UK. We explain how to identify hazards in the workplace and set up the right control measures to protect workers from injuries caused by accidents.","courseOutcomes":["Discuss the core elements of occupat...","Evaluate risks encountered on a cons...","Distinguish between a ‘hazard’ and a...","List accidents that are common in co...","Discuss the core elements of occupational health and safety guidelines","Evaluate risks encountered on a construction site","Distinguish between a ‘hazard’ and a ‘risk’","List accidents that are common in construction","Recognise when a workplace injury is reportable","Select the right safety equipment for workers","Identify common hazards in different types of work environments","Outline measures to minimise and control workplace hazards","Classify hazards according to their types and contexts","Discuss the core elements of occupat...","Evaluate risks encountered on a cons...","Distinguish between a ‘hazard’ and a...","List accidents that are common in co...","Discuss the core elements of occupational health and safety guidelines","Evaluate risks encountered on a construction site","Distinguish between a ‘hazard’ and a ‘risk’","List accidents that are common in construction","Recognise when a workplace injury is reportable","Select the right safety equipment for workers","Identify common hazards in different types of work environments","Outline measures to minimise and control workplace hazards","Classify hazards according to their types and contexts"],"courseDescription":"<p>Ensuring the safety and wellbeing of workers is a legal and ethical requirement of every organisation and business. This course introduces you to the health and safety measures that should be implemented to reduce work-related accidents in the construction industry. We lay out each step taken to carry out a risk assessment to identify and evaluate workplace hazards before the start of construction work. Construction covers a wide array of activities of different kinds, each prone to serious and even fatal injuries to workers. It is therefore important to know the procedures to follow in order to report incidents in a workplace. We outline how to report accidents in the workplace and examine the legal requirements for reporting such incidents.</p><p>Working at heights and in confined spaces also poses serious risks to workers, including falls and exposure to toxic fumes. This course describes the necessary precautions that should be taken before anyone works in such environments in order to minimise the risk of accidents. We then discuss injuries caused by manual and mechanical handling and the safety precautions used to prevent them. Chemicals can exist in a variety of states and be solid, liquid, gas or plasma. During construction, workers may be exposed to hazardous chemicals such as carbon monoxide, asbestos, lead, silica and spray paints. They require proper protection to avoid risks to their health. We go over chemical classifications, the health risks these substances pose and the safety precautions to take. We then compare electrical and fire hazards on a construction site and their safety measures you should put in place to protect workers. Finally, we lay out the UK legislation governing health and safety construction to help you comply with regulations designed to prevent workplace accidents.</p><p>We designed this course for people who work or intend to work in the construction industry. It is also useful for those who want to pursue a career in the field of health and safety or want to build their knowledge base in the field. This is a basic level course and requires no prerequisite knowledge or experience to join. The instructor explains the processes used to protect health and safety in construction, from hazard identification to implementing appropriate control measures. Every construction organisation requires a dedicated health and safety department to ensure the safety of workers and equipment. The application of occupational health and safety management is vast in the construction industry and offers numerous rewarding career opportunities to people with the right knowledge and expertise in the UK and elsewhere. Join the course to take advantage of such opportunities and master the skills required to legally complete construction jobs.</p><a href=\"https://alison.com/resume/courses/5164\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5164\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Health and Safety at Construction Sites","description":"This module will introduce you to the management of safety in construction and the relevant government regulations. We'll teach you how to identify and evaluate hazards in the workplace and set up appropriate safety measures. You'll explore ways to eliminate and reduce the risk of injuries and accidents to workers in different work environments.","topics":["Health and Safety at Construction Sites - Learning Outcomes","Safety and Risks","Different Types of Workplaces","Hazard Control","Health and Safety at Construction Sites - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Comprehensive Guide to Construction Safety - Course assessment"]}]}