{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3744","title":"A Guide to Meeting PIC Microcontrollers Using Python","totalEnrolled":"519","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"With this free online course, learn how to combine PIC Microcontrollers with Python for your next electronics project.","description":"Are you fascinated by PIC Microcontrollers and their various applications in electronics? Microcontrollers are all around us and often we are not even aware of this. In this free online course, you will explore the working principles and circuit design of PIC Microcontrollers, why Python is perfect to combine with PIC Microcontrollers and what the various hardware and software requirements are to successfully complete your project.","courseOutcomes":["Describe the circuit design that is ...","List hardware and software requireme...","Explain the working principles of Py...","Recall the downloading and installat...","Describe the circuit design that is utilized","List hardware and software requirements needed for this course","Explain the working principles of Python","Recall the downloading and installation of Python Editor","Outline the configuration of serial communication","Recognize Python script coding","Explain how to install Python and PIP","Discuss the use of ArdPython","Describe the uploading of the Arduino communication sketch","Outline the installation of mikroC PRO","Compare Python to ArdPython","Describe the circuit design that is ...","List hardware and software requireme...","Explain the working principles of Py...","Recall the downloading and installat...","Describe the circuit design that is utilized","List hardware and software requirements needed for this course","Explain the working principles of Python","Recall the downloading and installation of Python Editor","Outline the configuration of serial communication","Recognize Python script coding","Explain how to install Python and PIP","Discuss the use of ArdPython","Describe the uploading of the Arduino communication sketch","Outline the installation of mikroC PRO","Compare Python to ArdPython"],"courseDescription":"<p>Did you realize that air conditioners and other home appliances such as washing machines, vacuum cleaners and refrigerators use microcontrollers? In this electronics course, you will be guided through connecting PIC Microcontrollers utilizing Python programming language and apply your knowledge in creative and practical ways. As a compact integrated circuit, a microcontroller is designed to govern a particular operation in an embedded system and is also a programmable integrated circuit that is capable of multiple functions depending on how it is programmed. You can use many higher-level programming languages for microcontrolling and the most common ones used are C++, Java and Python. In this Python course, you will be taught how to use Python in microcontrolling and there are many reasons why Python is preferred including the fact that it is a powerful, popular language which is simple to use and understand and has many useful functionalities.</p><p>As you delve deeper into this PIC Microcontroller tutorial, hardware and software requirements are discussed. For hardware, you need a PIC programmer, a PIC 16F Micro Microcontroller, a Breadboard, two types of resistors namely the 100R Resistor and 5.6k Resistor, and an RTDI 232 USB to serial converter. In terms of software, the requirements are a laptop with Python installed, PySerial library or Pycharm, which is the Python integrated development environment (IDE) for professional developers. It is important to ensure that there is a hardware connection between the PIC Microcontroller and the laptop/computer that will run the Python script. You may also need the Virtual COM Port Driver, a powerful technology designed explicitly for developing, testing or debugging serial port software and hardware.</p><p>The last section of this course focuses on other requirements and tips to carry out microcontrolling successfully. Arduino scripts are written in a language similar to C++ and combined or recorded in the flash memory of your microcontroller. Before writing your Python programme to drive Arduino, you need to upload the fermata (fermata is a particular generic protocol for communicating with microcontrollers from software on a host computer) sketch. Other tools can serve this purpose too, including mikroC PRO, a powerful feature-rich development tool for PIC microcontrollers, and the Proteus Design Suite, which is a proprietary software tool used primarily for electronic design automation. The world of electronics is extremely interesting and is evolving fast in this modern world. You should enrol in this comprehensive course if you are a student studying programming, a professional involved in the development of electronics and equipment or an electronics enthusiast wanting to create interesting projects.</p><a href=\"https://alison.com/resume/courses/3744\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3744\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Circuit Design and Python","description":"This module introduces you to python, with specifications of hardware and software requirements. The working principle and the circuit design will be highlighted. Learn how to download and install python editor, along with python script coding, the configuration of the serial communication and the edition of the circuit and C code.","topics":["Circuit design and Python – Learning Outcomes","An Introduction","Working Principle and Circuit Design and Wiring","Using Python","Serial COM Ports and Final Coding","Circuit design and Python – Lesson Summary"]},{"name":"Module","details":"PIC to Python and ArdPython","description":"In this module, you will learn about PIC Microcontroller, Python and circuit design. You will learn about ardPython and the main communication concept and upload the Arduino communication sketch. The downloading and installation of the mikroC PRO and Proteus software will be explained.","topics":["PIC to Python and ArdPython – Learning Outcomes","PIC to Python","Using ArdPython","Software Download","PIC to Python and ArdPython – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Guide to Meeting PIC Microcontrollers Using Python - Course Assessment"]}]}