{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4232","title":"AC Circuits Power Analysis","totalEnrolled":"460","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the complexities of electrical power calculations in AC circuits in this free online course.","description":"This course gives you a proper foundation in power analysis by teaching you about energy, work and instantaneous power. You will learn how to analyze AC circuits using real, reactive and complex power as well as evaluate power and power factor correction (PFC) in three-phase circuits. The course contains easy-to-understand derived formulas based on algebra and trigonometry with concise and crisp animation to guide you through the logic.","courseOutcomes":["Define energy, power and work...","Compare electrical and generic energ...","Discuss power in reactive circuits...","Recall the trigonometric identities...","Define energy, power and work","Compare electrical and generic energy, power and work","Discuss power in reactive circuits","Recall the trigonometric identities","Analyze real, reactive and average power","Explain apparent power, the power triangle, power factor and the power factor angle","Describe complex power and the conjugate phasor","Estimate power factor correction","Outline the procedure for per phase analysis in a balanced three-phase system","Define energy, power and work...","Compare electrical and generic energ...","Discuss power in reactive circuits...","Recall the trigonometric identities...","Define energy, power and work","Compare electrical and generic energy, power and work","Discuss power in reactive circuits","Recall the trigonometric identities","Analyze real, reactive and average power","Explain apparent power, the power triangle, power factor and the power factor angle","Describe complex power and the conjugate phasor","Estimate power factor correction","Outline the procedure for per phase analysis in a balanced three-phase system"],"courseDescription":"<p>Electricity exists in two forms: alternating current and direct current. No form of power is more important than the other as the form in use at any point depends on the situation. When alternating current is used, it is because the condition is appropriate and its advantages - which include ease of generation, ability to travel over long distances and cheaper operation - have been considered. Because alternating current is essential to modern living, this course has been created to give you a comprehensive overview of power in AC circuits. It uses graphics to simplify and explain the generic concepts of energy, power and work and then proceeds to examine the theories of electrical energy, power, work done and instantaneous power. You will learn about the reactive components of AC circuits under inductive load, capacitive load and combined load types.</p><p>Trigonometric identities are foundational mathematical equations that are used as a basis for computing other properties and equations. This course contains formulas based on algebra and trigonometry and is designed to demystify electrical power system calculations through a rigorous but intuitive proof of average power and average reactive power. You will learn about the power factor, the power factor angle and the power triangle. Trig identities will be further applied to deepen your knowledge of instantaneous power in AC resistance and AC inductive circuits. Complex power can be confusing so you will be taught how it is defined, derived and how it relates to apparent power, reactive average power and real average power. You will learn how to define a conjugate phasor or vector, how it is denoted and how it is applied in complex power in series with reactance or resistance reduced to zero.</p><p>Using an interesting example of a hydropower-generating utility, you will be introduced to the impact of various types of loads on a generating facility. You will also be shown how power factor correction is used to remedy different scenarios so that consumers are billed properly and the utility company is able to run efficiently. Per-phase analysis allows analysis of balanced three-phase systems with the same effort as for a single-phase system. This course teaches you what a balanced three-phase system is, how to evaluate phase relationships and the procedure for per phase analysis. Basic knowledge in math, algebra, and trigonometry is required. This course is for electrical engineers, technicians, technologists and anyone interested in having a well-rounded knowledge of electricity. Are you interested in having a good foundation to enable you further your career in power generation? Do you want to be able to troubleshoot electrical power issues? Do not delay any further; enroll in this course today.</p><a href=\"https://alison.com/resume/courses/4232\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4232\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Power in AC circuits","description":"In this module, you will explore power in AC circuits. You will be taught how energy, power and work are defined, how they evolve electrically and how they are applied to resistive, inductive, series R-C and series R-L circuits. You will be taught average, real and reactive power as well as complex power, conjugate numbers and power correction.","topics":["Power in AC Circuits - Learning Outcomes","Energy, Power and Work","Average, Real and Reactive Power","Complex Power","Power in AC Circuits  - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AC Circuits Power Analysis - Course assessment"]}]}