{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3974","title":"AC Circuit Analysis: The Fundamentals","totalEnrolled":"652","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain the fundamental knowledge you need to analyze AC circuits and its applications with this free online course.","description":"This free online electrical engineering course will help you gain an understanding of how an AC circuit works and how it’s applied in the real world. You will learn about the differences between AC and DC circuits, Phasors and root mean squared/root-mean-squared (RMS) values along with important key topics such as how to calculate the reactance and impedance of an AC circuit, and how to perform various calculations in AC circuits.","courseOutcomes":["Distinguish between AC and DC circui...","Explain why AC currents are used in ...","Compute the RMS value of the voltage...","Recall how to change the polar notat...","Distinguish between AC and DC circuits","Explain why AC currents are used in the transmission of electricity over long distances","Compute the RMS value of the voltage and current of an alternating voltage supply","Recall how to change the polar notation of a phasor to its rectangular notation","Recall how to change the rectangular notation of a phasor to its polar notation","Identify the application of basic arithmetic operation of phasors in AC circuits","Solve for the reactance and impedance of an AC circuit","Analyze an RLC circuit","Discuss the power flow in AC circuits","Evaluate the resonant frequency of a capacitor-inductor circuit","Distinguish between AC and DC circui...","Explain why AC currents are used in ...","Compute the RMS value of the voltage...","Recall how to change the polar notat...","Distinguish between AC and DC circuits","Explain why AC currents are used in the transmission of electricity over long distances","Compute the RMS value of the voltage and current of an alternating voltage supply","Recall how to change the polar notation of a phasor to its rectangular notation","Recall how to change the rectangular notation of a phasor to its polar notation","Identify the application of basic arithmetic operation of phasors in AC circuits","Solve for the reactance and impedance of an AC circuit","Analyze an RLC circuit","Discuss the power flow in AC circuits","Evaluate the resonant frequency of a capacitor-inductor circuit"],"courseDescription":"<p>Electricity is simply the movement of electrons through a conductor, such as a wire. These electrons move in two different ways: either in an alternating current (AC) or in a direct current (DC). This free online electrical course will focus on alternating currents and will teach you the basic knowledge you will need to work with AC circuits. The course begins by introducing you to alternating currents and the differences between AC and DC. Thereafter, you will be taught the working principle of a generator and the concept of mutual inductance. Have you ever wondered how transformers work or the purpose they serve? The course content explores the working principle of a transformer and helps understand how it functions. You will learn about AC sinusoidal waveforms and the methods of expressing or calculating the magnitude of a waveform as base knowledge before moving on to dealing with the importance and significance of root mean square (RMS) value in the analysis of an AC circuit and related value and voltage calculations.</p><p>Understanding phasors is vital in the analysis of AC circuits because they form the fundamentals of sinusoidal waveforms in an AC circuit. Phasors are vectors that analytically represent sinusoidal waveforms and this certificate in electrical engineering explores their characteristics such as magnitude, frequency, and relative phase angle and how they can be used in the analysis of AC circuits. Phasors can be described using two basic types of notations which are polar notation and rectangular notation and the content will teach you basic phasor arithmetic such as addition, subtraction, multiplication and division of phasors in both rectangular and polar notations. As part of the phasor theme, you will also learn notation conversion from polar to rectangular and vice versa.</p><p>Basic electricity rules indicate that an AC circuit can contain a number of series or parallel connections and this free electrical engineering online course covers resistor, inductor and capacitor (RLC) circuits connected in both parallel and series connections in great detail along with phase shift and how to calculate the reactance of capacitors, inductors and the impedance of an AC circuit. There are many theories and laws governing AC circuits that you need to understand in order to apply your knowledge and some of these include Kirchhoff’s voltage law, Kirchhoff’s current law and Ohm’s law. Some other key topics of discussion in the final section of the course details how to describe power flow in an AC circuit, how to calculate the average power of a circuit and its significance in the power engineering industry. Are you struggling with the application of electrical theory and basic electrical engineering? Enrolling in this course will point you in the right direction and help you to not only appreciate the many uses of AC circuits, but will set you up to apply your technical knowledge in your career in electrical engineering.</p><a href=\"https://alison.com/resume/courses/3974\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3974\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"AC Circuit Theory","description":"In this module, you will learn how to calculate the RMS value of voltage and current of a generator. You will be taught how to perform basic arithmetic of phasors and how to calculate the impedance and reactance of an AC circuit. Thereafter, you will be shown how to calculate the voltage drop, current flow and resonant frequency of an AC circuit.","topics":["AC Circuit Theory- Learning Outcomes","Introduction to AC Circuits","RLC Circuits","Working With AC Circuits","AC Circuit Theory- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment - AC Circuit Analysis: The Fundamentals"]}]}