{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2400","title":"Advanced Diploma in Fundamentals of Manufacturing Processes","totalEnrolled":"1,500","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Obtain advanced diploma and learn about fundamentals of manufacturing processes from this online course.","description":"This free online diploma course on the Fundamentals of Manufacturing Processes offers a comprehensive guide to the different processes, applications, and terminologies of manufacturing processes. Learn about the effects of manufacturing processes on the mechanical properties of materials, as well as the advantages and limitations of manufacturing processes. So, begin this course today and enhance your knowledge of manufacturing processes.","courseOutcomes":["Analyze different factors involved i...","Recognize various applications of ma...","Identify the requirements for removi...","Discuss the processes of plastic def...","Analyze different factors involved in classifying manufacturing processes","Recognize various applications of manufacturing processes","Identify the requirements for removing and/or cleaning a casting","Discuss the processes of plastic deformation","List the common shearing operations in the metalworking processes","Outline the mechanisms affecting tool life in the material removal processes","Explain the two types of feed motions in the material removal process","Discuss the mechanisms of various grinding operations","Evaluate the purpose of heat treatment in the joining of metals","Discuss the approaches used for surface modification to improve mechanical properties and wear resistance","Analyze different factors involved i...","Recognize various applications of ma...","Identify the requirements for removi...","Discuss the processes of plastic def...","Analyze different factors involved in classifying manufacturing processes","Recognize various applications of manufacturing processes","Identify the requirements for removing and/or cleaning a casting","Discuss the processes of plastic deformation","List the common shearing operations in the metalworking processes","Outline the mechanisms affecting tool life in the material removal processes","Explain the two types of feed motions in the material removal process","Discuss the mechanisms of various grinding operations","Evaluate the purpose of heat treatment in the joining of metals","Discuss the approaches used for surface modification to improve mechanical properties and wear resistance"],"courseDescription":"<p>There are multiple types of processes that manufacturers can use to aid in the manufacturing of a product. Advanced Diploma in Fundamentals of Manufacturing Processes is a free online course that will teach you about the importance of new and innovative technologies that increase the productivity of a product. This course illustrates the fundamentals of manufacturing processes, materials, and procedures in developing a product that provides the desired service or experience.</p><p>This course begins by introducing you to the main purpose of manufacturing goods. You will learn about the different processes needed to achieve the desired features of a product. Furthermore, you will learn about the different types of metalworking processes as well as material removal processes. You will also learn about the processes for changing the chemical composition and coating processes.</p><p>This free online course will give you an in-depth understanding of the fundamentals of manufacturing processes. You will learn the importance of achieving the desired size, shape, and properties of a product. This course will be of great interest to individuals with an interest in the automobile industry and the aviation industry. Start this free course today and improve your knowledge of fundamentals of manufacturing processes.</p><a href=\"https://alison.com/resume/courses/2400\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2400\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Manufacturing","description":"In this module, you will learn about the fundamental approaches to manufacturing, as well as the advantages and limitations of manufacturing processes. You will also discuss the material and manufacturing processes and the classification of manufacturing processes.","topics":["Introduction to Manufacturing - Learning Outcomes","Understanding Manufacturing","Fundamental Approaches of Manufacturing","Manufacturing Processes - Specific Advantages and Limitations","Materials and Manufacturing Processes","Classification of Manufacturing Processes","Introduction to Manufacturing - Lesson Summary"]},{"name":"Module","details":"Manufacturing Processes","description":"In this module, you will learn about the selection and applications of manufacturing processes. You will also learn about the effects of these properties on the mechanical properties of materials as well as break-even analysis in manufacturing processes.","topics":["Manufacturing Processes - Learning Outcomes","Selection of Manufacturing Processes","Applications of Manufacturing Processes","Effects of Manufacturing Processes on Mechanical Properties","Break-Even Analysis in Manufacturing Processes","Manufacturing Processes - Lesson Summary"]},{"name":"Module","details":"Casting Processes - Steps and Terminology","description":"In this module, you will be introduced to the different terminologies of the casting process. You will also discuss the steps involved in casting processes, pattern allowances, and the process of sand molding.","topics":["Casting Processes - Steps and Terminology - Learning Outcomes","Casting - Introduction and Suitability","Steps of Casting Processes","Casting - Terminology","The Pattern Allowances I","The Pattern Allowances II","Casting Processes - Steps and Terminology - Lesson Summary"]},{"name":"Module","details":"Casting Processes","description":"In this module, you will learn about the factors that affect the properties of the moulding sand and the Gating System. You will also study the Core, Core Prints of casting, as well as the Yield and Riser Design.","topics":["Casting Processes - Learning Outcomes","Sand Moulding l","Sand Moulding II","Core and Core Prints","The Gating System","Yield and Riser Design","The Riser Design","Casting Processes - Lesson Summary"]},{"name":"Module","details":"How to Maintain Castings","description":"In this module, you will learn about the process of cleaning castings. You will gain an understanding of the casting defect and their preventions. You will also learn about shell mould casting as well as investment and permanent mould casting.","topics":["How to Maintain Castings - Learning Outcomes","Cleaning of Castings","Casting Defects and Prevention","Shell Mould Casting","Investment and Permanent Mould Casting","How to Maintain Castings - Lesson Summary"]},{"name":"Module","details":"Metalworking Processes","description":"In this module, you will learn about the different types of metalworking processes that occur in manufacturing. You will discuss various types of presses used in metalworking processes and the types of forging processes. You will also study the torque and power consumption required in the rolling process as well as extrusion and wire drawing processes.","topics":["Metalworking Processes - Learning Outcomes","Hot and Cold Working","Rolling","Forging","Extrusion","Wire Drawing","Press","Metalworking Processes - Lesson Summary"]},{"name":"Module","details":"Sheet Metal Operations","description":"In this module, you learn about different shearing operations in sheet metal processes. You will also study the mechanical properties desired in dies and punches that make them perform at an optimal level.","topics":["Sheet Metal Operations - Learning Outcomes","Shearing","Shearing Based Operations","Sheet Metal Operations","Dies and Die Sets","Sheet Metal Operations - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Fundamentals of Manufacturing Systems - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["First Assessment"]},{"name":"Module","details":"Material Removal Processes - Cutting & Chip Formation","description":"In this module, you will learn about the mechanism of metal cutting and the process of chip formation. This includes the different types of chips in the material removal process as well as the different sources of heat generation during the metal cutting process. You will also learn about power consumption, tool failure and tool life.","topics":["Material Removal Processes - Cutting & Chip Formation - Learning Outcomes","Machining","Mechanism of Metal Cutting","Chip Formation","Types of Chips and Power Consumption","Heat Generation","Tool Failure and Tool Life","Material Removal Processes - Cutting & Chip Formation - Lesson Summary"]},{"name":"Module","details":"Material Removal Processes - Cutting Fluids & Grinding","description":"In this module, you will further be introduced to different material removal processes. You will discuss the various options of tool materials available. You will learn about the types and functions of cutting fluids. You will also learn about the grinding process and the different mechanisms involved.","topics":["Material Removal Processes - Cutting Fluids & Grinding - Learning Outcomes","Tool Materials","Cutting Fluids","Introduction to Grinding","Grinding Wheel","Grinding Wheel II","Grinding Operations","Material Removal Processes - Cutting Fluids & Grinding - Lesson Summary"]},{"name":"Module","details":"The Process of Joining Metals","description":"In this module, you will learn the fundamentals of joining metals and welding processes. You will also learn about the processes of brazing and soldering, as well as determining the weldability of metals/materials.","topics":["The Process of Joining Metals - Learning Outcomes","Joining of Metals - Fundamentals I","Joining of Metals: Fundamentals II","Welding Processes","Brazing, Soldering, and Weldability","Weldability and Welding Defects","The Process of Joining Metals - Lesson Summary"]},{"name":"Module","details":"Fundamentals of Heat Treatment","description":"In this module, you will learn about the mechanisms and principles of heat treatment. You will also learn about heat treatment processes, the annealing process, and different applications of tempering.","topics":["Fundamentals of Heat Treatment - Learning Outcomes","Introduction to Heat Treatment","Heat Treatment - Mechanisms and Principles","Heat Treatment Processes","Normalizing and Hardening","Tempering","Fundamentals of Heat Treatment - Lesson Summary"]},{"name":"Module","details":"Improving Surface Properties","description":"In this module, you will learn about improving surface properties through surface modification processes. You will also discuss processes for changing the chemical composition and coating processes for improving surface properties.","topics":["Improving Surface Properties - Learning Outcomes","Introduction to Improving Surface Properties","Surface Modification Processes","Changing Chemical Composition","Coating","Improving Surface Properties - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Fundamentals of Manufacturing Systems - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Fundamentals of Manufacturing Systems - Course Assessment"]}]}