{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3961","title":"Advanced Diploma in Basics of Electrical Technology and Circuit Analysis","totalEnrolled":"4,635","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course evaluates relevant theories, concepts and applications related to electrical technology.","description":"Imagine living a life without electricity. What happens to the heating we use to keep warm, or the air conditioning in our homes and offices? How do we even illuminate our environment at night? Learn about relevant theories, concepts, and applications of electricity that give rise to electrical technologies we always depend on. It is necessary to equip learners with the knowledge of electrical technology. Begin your next learning journey today!","courseOutcomes":["Identify different types of resistor...","Discuss the mechanism and prevention...","Evaluate the process of finding the ...","Solve the issue of low power factor ...","Identify different types of resistors and their applications","Discuss the mechanism and prevention of electric shocks","Evaluate the process of finding the unknown resistance using a Wheatstone Bridge","Solve the issue of low power factor by using capacitors","Distinguish between the types of three-phase systems","Summarize Norton's Theorem in DC circuits","Recall the instructions for testing the capacitor circuit","Compute power and energy consumed by circuits","Identify different types of resistor...","Discuss the mechanism and prevention...","Evaluate the process of finding the ...","Solve the issue of low power factor ...","Identify different types of resistors and their applications","Discuss the mechanism and prevention of electric shocks","Evaluate the process of finding the unknown resistance using a Wheatstone Bridge","Solve the issue of low power factor by using capacitors","Distinguish between the types of three-phase systems","Summarize Norton's Theorem in DC circuits","Recall the instructions for testing the capacitor circuit","Compute power and energy consumed by circuits"],"courseDescription":"<p>Diploma in Electrical Technology is an extensively researched course, specially developed for learners interested in the much-sought applications of electricity. You will require aspects of this diploma to begin and sustain a globally qualitative career in electrical and electronics technology. You will also need its content to refresh your knowledge in the industry. Don’t miss this opportunity to stand out among colleagues. Learn all about standards for safely handling electric sources, circuits, as well as various components including resistors, capacitors, and inductors. Upon successfully completing this diploma, you will be able to command globally standardized safety procedures for preventing electrical emergencies arising from electric fires, fatal shock, and grounding faults. What are you waiting for and why would you miss this opportunity to become a better professional today? Begin discussing theories with a great sense of authority as soon as you enrol into this free online course.</p><p>Students, technicians, and professionals in the industry often find it difficult to recall electrical parameters when they are required for different reasons. This may include basic parameters covering voltage, power, direct or alternating current and even polarity. Avoid this by taking this course to remind yourself of basic electrical parameters along with their workings and varying applications. Also, study important illustrations describing atomic and subatomic particles obeying various scientific laws that give rise to the fundamental principles of electricity. Did you know that electric power is equally as important as its efficient transmission? Learn all about these important characteristics of electrical technology through scientific theorems. These include Thevenin’s Theorem, Norton’s Theorem, and Millaman’s Theorem. You would be able to easily state these theorems correctly when you are successfully done taking this course. By doing so, it is expected that you would find comparative analyses of their applications easy in real-life situations.</p><p>Electricians are encouraged to improve their skills and techniques through courses like this diploma in order to stay updated with new electronic global standards. This course maintains current knowledge circulated among electric and electronics communities. Avoid those embarrassing moments many technicians face in troubleshooting new electronic devices. As a technician, keeping up to date with new devices and their workings has become a necessity. Science and engineering instructors in universities have relevant learning points to acquire and disseminate to their students in order to make them globally competitive. Also, every learner, irrespective of the area of specialization, should be able to analyze the basic workings of distinct electronic devices including light bulbs, couch massage technology, and induction cookers after enrolling. Wouldn’t you want to know how your fruits and vegetables stay fresh in your refrigerator? Begin an extensive learning journey into the important world of electric and electronic technologies today!</p><a href=\"https://alison.com/resume/courses/3961\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3961\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Safety Methods","description":"To start, this module will introduce you to dangers due to lack of safety, artificial respiration methods, and body injuries when lifting equipment. Electricity is friendly to users that handle it with good care, hence the risks of accidents with electricity are lower if people with more experience and knowledge handle it.","topics":["Safety Methods - Learning Outcomes","Handling Equipment","Fighting Electrical Fires","Electrical Shock","Safety Around Electrical Equipment","Precautions and Emergencies","Electrical Safety Procedures","Lock Out - Tag Out Marine Systems","Safety Methods - Lesson Summary"]},{"name":"Module","details":"Electricity Sources","description":"Understanding electricity sources is a fundamental requirement of Electrical Technology. To start, this module will introduce you to the concepts of Electromotive Force (EMF), Voltage, Current, DC Sources in Series and Parallel, and the polarity of both AC and DC Sources.","topics":["Electricity Sources - Learning Outcomes","Band Theory of Solids","EMF, Voltage, and Current","Comparing EMFs with Potentiometers","Electrical Parameters","Electrical Sources and Circuits","DC and AC Circuits","Electricity Sources - Lesson Summary"]},{"name":"Module","details":"Electric Resistors","description":"Resistors are the electronic components used to resist the flow of current in an electrical circuit. Resistance is the property of conducting materials. This module discusses different types of resistors and their applications along with the effect on the total resistance of series and parallel connection of resistors.","topics":["Resistors - Learning Outcomes","Drift Velocity of Electrons","Mobility, Resistivity and Resistance","Temperature Dependence of Resistivity and Graphs","Joule's Law and other Properties of Resistors","Resistors - Lesson Summary"]},{"name":"Module","details":"Electric Circuits","description":"Electric circuits are required to perform various functions of electric devices around us. They are responsible for directing and controlling electric current. In this module, you will about the components of electric circuits and their workings.","topics":["Electric Circuits - Learning Outcomes","Introduction to Electric Circuits","Measuring and Calculating Resistance","Kelvin Double Bridge and Potential Divider Circuit","Resistive Circuits","Electric Circuits - Lesson Summary"]},{"name":"Module","details":"Electric Inductors","description":"Inductors store electric energy in the form of a magnetic field when there is a flow of current through it. Learn about the interaction of magnetic fields, the process of constructing a solenoid, and the series and parallel connection of inductors from this module.","topics":["Inductors - Learning Outcomes","Inductance in AC Circuits","Mutual Inductance","Types, Measurements, and Connections of Inductors","Inductors - Lesson Summary"]},{"name":"Module","details":"Electric Capacitors","description":"A capacitor is a device used for storing electric charges. In this module, you will analyze the functions of a capacitor, the charging and discharging of capacitors in DC circuits, and the calculation of capacitance in series and parallel connections.","topics":["Capacitors - Learning Outcomes","Capacitance","Types of Capacitors","Charging and Discharging of Capacitors","Properties and Measurement of Capacitors","Capacitors - Lesson Summary"]},{"name":"Module","details":"Basic Laws of Electricity","description":"The behavior of an electrically energized circuit includes a voltage source and a load, and it follows certain laws depending on the voltage level and the load intensity which is the resistance. The ultimate effect in such a circuit is the flow of current. Over the years, several laws were developed based on these concepts.","topics":["Basic Laws of Electricity - Learning Outcomes","Ohm's Law","Wheatstone Network Bridge","Kirchhoff's Laws","Basic Laws of Electricity - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Basics of Electrical Technology and Circuit Analysis - First Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Advanced Diploma in Basics of Electrical Technology & Circuit Analysis - First Assessment"]},{"name":"Module","details":"Phase Circuits and Systems","description":"AC voltage supply is used everywhere including residences, commercial buildings, and factories. The waveform of the alternating voltage is sinusoidal. To understand the AC circuits, it is important to know the phasor relationship between voltage and current and the impedance of the AC circuit.","topics":["Phase Circuits and Systems - Learning Outcomes","Single Phase AC Series Circuits","Single Phase AC Parallel Circuits","3-Phase System","Phase Circuits and Systems - Lesson Summary"]},{"name":"Module","details":"Electric Networks, Loads, and Power","description":"AC parallel circuits exhibit the same properties as DC parallel circuits. The voltage is distributed commonly across all the loads but the current through the branch element is different. This module deals with phase sequence, star and delta connections, transformations, load, and power.","topics":["Electric Networks, Loads, and Power - Learning Outcomes","Star and Delta Networks","Balanced and Unbalanced Load","Power and Energy","Single Phase AC Parallel Circuits - Lesson Summary"]},{"name":"Module","details":"Electric DC Sources","description":"In this module, you will learn about sources where the voltage is not varying with time which are known as time-invariant voltage sources or DC sources. These sources of electrical energy are active elements and you will learn about the types of active elements.","topics":["DC Sources - Learning Outcomes","Ideal Voltage and Current Sources","Series Connection of DC Voltage Sources","Parallel Connection of DC Current Sources","DC Sources - Lesson Summary"]},{"name":"Module","details":"Analysis of Circuits","description":"Mesh analysis and node analysis apply to both DC and AC circuits. In this module, you are going to learn about mesh analysis and node analysis in AC and DC circuits. Star-Delta transformation is also explained in detail here.","topics":["Analysis of Circuits - Learning Outcomes","Mesh Analysis","Nodal Analysis and Phases","Star and Delta Networks","Analysis of Circuits - Lesson Summary"]},{"name":"Module","details":"Network Theorems","description":"In this module, you will learn about Norton's theorem and Thevenin's theorem in AC and DC circuits. You will study the maximum power transfer theorem as well as other relevant terminology in the network theorems.","topics":["Network Theorems - Learning Outcomes","Thevenin's Theorem – DC and AC Circuits","Norton's and Superposition Theorem","Reciprocity and Millman's Theorems","Maximum Power Transfer and Tellgen's Theorem","Network Theorems - Lesson Summary"]},{"name":"Module","details":"Resonant Circuits","description":"Resonance is an important phenomenon in many electrical circuits. The study of resonance is useful, particularly in the area of communications. In this module, you will learn about series and parallel RLC resonant circuits as well as bandwidth and quality factors.","topics":["Resonant Circuits - Learning Outcomes","Series RLC Resonant Circuit","Parallel RLC and Series LC Resonant Circuit","Bandwidth and Quality Factor","Resonant Circuits - Lesson Summary"]},{"name":"Module","details":"Generation of Three Phase AC EMF","description":"Three-phase electric power is a common method of alternating current electric power generation, transmission, and distribution. It is a type of polyphase circuit and it is the most common method used by grids worldwide to transfer power. This module will discuss the generation, the phase sequence, and the advantages of three-phase circuit systems.","topics":["Generation of Three-Phase AC EMF - Learning Outcomes","Generation of Three-Phase Voltages","Phase Sequence","Star and Delta Networks","Generation of Three-Phase AC EMF - Lesson Summary"]},{"name":"Module","details":"Analysis of Three Phase Circuits","description":"To meet the required demand, three-phase power is generated and distributed. Normally, in industries, electrical motors consume three-phase power. This module imparts knowledge on the analysis of three-phase balanced and unbalanced loads as well as the power consumed by three-phase balanced and unbalanced loads.","topics":["Analysis of Three-Phase Circuits - Learning Outcomes","Balanced and Unbalanced Load","Power Factor","Power Factor of a Balanced Load","Analysis of Three-Phase Circuits - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Basics of Electrical Technology and Circuit Analysis - Second Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Advanced Diploma in Basics of Electrical Technology & Circuit Analysis - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Basics of Electrical Technology & Circuit Analysis - Final Assessment"]}]}