{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2223","title":"Diploma in Chemical Process Safety","totalEnrolled":"5,238","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about safety, hazards and risks, as well as risk management, and also the classifications of fire and explosions.","description":"The free online chemical process safety course will teach you about the concept of safety, hazards, and risks, as well as the concept of risk management, and also industrial hygiene problems and source modeling. You will also learn about the classifications of fires and explosions, the anatomy of the fire extinguisher, as well as the types, design, and installation of sprinkler systems, and also, the importance of personal protective equipment.","courseOutcomes":["Discuss a summary of the various typ...","Discuss an introduction and the impo...","Discuss the importance of relief siz...","Explain the concept of hazards and h...","Discuss a summary of the various types of sprinkler systems.","Discuss an introduction and the importance of relief system devices.","Discuss the importance of relief sizing.","Explain the concept of hazards and how hazards are identified.","Explain the concepts of risks and risk assessment.","Discuss the quantitative risk analysis of any hazard or hazard process","Discuss the cause consequence analysis and the layer of protection analysis","Identify the methods used in bow-tie Analysis","Discuss various theories surrounding the causes of accidents.","Explain the importance of process safety management in the chemical process.","Identify the importance of personal protective equipment in industries.","Discuss the various safety laws and regulations in the workplace","Discuss a summary of the various typ...","Discuss an introduction and the impo...","Discuss the importance of relief siz...","Explain the concept of hazards and h...","Discuss a summary of the various types of sprinkler systems.","Discuss an introduction and the importance of relief system devices.","Discuss the importance of relief sizing.","Explain the concept of hazards and how hazards are identified.","Explain the concepts of risks and risk assessment.","Discuss the quantitative risk analysis of any hazard or hazard process","Discuss the cause consequence analysis and the layer of protection analysis","Identify the methods used in bow-tie Analysis","Discuss various theories surrounding the causes of accidents.","Explain the importance of process safety management in the chemical process.","Identify the importance of personal protective equipment in industries.","Discuss the various safety laws and regulations in the workplace"],"courseDescription":"<p>In this course, you will learn about the concept of safety, hazards, and risks, as well as the concept of risk management. Various toxicology studies and modelling concepts, as well as the classifications of hazardous materials will also be covered in this course. Then, you will learn about some problems related to industrial hygiene, and also source modelling.</p><p>This course will also teach you about fires and explosions, as well as the various classifications of fires and the anatomy of the fire extinguisher. The course will also cover the design, types and installation of sprinkler systems, and also, the types of relief systems. Then, this course will also teach you about the health and safety at work, as well as the probability theoryu in risk analysis.</p><p>Then, the course will teach you about the outcomes of accidents, as well as a look at various case studies on disasters that have occurred in the past. Lastly, the course will teach you about process safety management, as well as the importance of personal protective equipment. This course is important for learners who want to learner about safety in chemical plants, as well as the various risks and hazards that can occur in chemical plants.</p><a href=\"https://alison.com/resume/courses/2223\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2223\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Safety, Hazards and Risks","description":"In this module, you will be introduced to the concept of safety, hazards, and risks, as well as the concept of risk management. You will also be introduced to four significant disasters of the world, fundamental principles related to reaction runaway, and loss statistics problems.","topics":["Safety, Hazards and Risks - Learning Outcomes","Safety and Accident Loss Statistics","Risk Management and Hazardous Substance Rules","Nature of Accident and Major Disasters","Fundamental Principles: Scale Up and Runaway Reactions","Problems Related to Safety and Accident Loss Statistics","Safety, Hazards and Risks - Lesson Summary"]},{"name":"Module","details":"Introduction to Toxicology","description":"In this module, you will be introduced to various toxicology studies, the elimination of toxic substances, and also, dose versus response. You will also be introduced to the toxicological disease process and modelling concepts, as well as the concept of industrial hygiene.","topics":["Introduction to Toxicology - Learning Outcomes","Toxicology: Introduction, Routes and Exposure","Toxicology: Elimination, Responses and Treatment","Dose Response Relationship","Dose Response and Threshold Dose: Predictive Models and Extrapolation","Industrial Hygiene: Regulations and Identification","Introduction to Toxicology - Lesson Summary"]},{"name":"Module","details":"MSDS Information and Industrial Hygiene","description":"In this module, you will be introduced to the classifications of hazardous material, and also look at the material safety data sheet. You will also be introduced to threshold limit values, noise intensity, as well as personal protective gear.","topics":["MSDS Information and Industrial Hygiene - Learning Outcomes","Material Safety Data Sheet I","Material Safety Data Sheet II","Industrial Hygiene: Evaluation","Noise, Vibration and Radiation","Industrial Hygiene: Control","MSDS Information and Industrial Hygiene - Lesson Summary"]},{"name":"Module","details":"Introduction to Source Models","description":"In this module, you will be introduced to problems related to industrial hygiene, as well as an introduction to source modelling. You will also be introduced to the source model for gas, the source model for pool boiling, and some problems related to source models.","topics":["Introduction to Source Models - Learning Outcomes","Problems Related to Industrial Hygiene","Introduction to Source Models","Source Models for Gas","Source Models for Pool Boiling","Source Model Problems","Introduction to Source Models - Lesson Summary"]},{"name":"Module","details":"Introduction to Fire and Explosions","description":"In this module, you will be introduced to fires and explosion, as well as modes of heat transfer, and also, the characteristics of flammability. You will also be introduced to the various classifications of explosions, the classifications of fire, and the types of fire extinguishers.","topics":["Introduction to Fire and Explosions - Learning Outcomes","Fire and Explosions: Introduction","Fire and Explosions: Flammability Characterisitics","Explosion and its Classification I","Explosion and its Classification II","Fire Extinguishers I","Introduction to Fire and Explosions - Lesson Summary"]},{"name":"Module","details":"Prevention of Fire and Explosions","description":"In this module, you will be introduced to the anatomy of the fire extinguisher, as well as vacuum and pressure purging with impure nitrogen. You will also be introduced to electrostatic discharge, and general design methodology to prevent the electrostatic ignition.","topics":["Prevention of Fire and Explosions - Learning Outcomes","Fire Extinguishers II","Problems Related to Fire and Explosion","Designs to Prevent Fire and Explosion: Inerting and Purging","Designs to Prevent Fire and Explosion: Static Electricity","General Design Methods to Prevent Fire","Prevention of Fire and Explosions - Lesson Summary"]},{"name":"Module","details":"Diploma in Chemical Process Safety - First Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Chemical Process Safety - First Assessment"]},{"name":"Module","details":"Introduction to Reliefs","description":"In this module, you will be introduced to the design of sprinkler systems, as well as the types and installation of sprinkler systems. The topic also examines an introduction to relief systems, the various types of relief systems, and an introduction to relief scenarios.","topics":["Introduction to Reliefs - Learning Outcomes","Sprinklers I","Sprinklers II","Introduction to Reliefs","Type of Reliefs","Relief Scenario","Introduction to Reliefs - Lesson Summary"]},{"name":"Module","details":"Hazards and Risk Assessment","description":"In this module, you will be introduced to relief sizing, the definition of hazards, and its classifications, as well as the methods of identifying hazards. You will also be introduced to the health and safety at work act, and various tools available for risk assessment.","topics":["Hazards and Risk Assessment - Learning Outcomes","Relief Sizing","Hazard and Hazard Identification: Introduction","Hazard Identification Methods and HAZOP","Safety Reviews and Risk Assessment I","Safety Reviews and Risk Assessment II","Hazards and Risk Assessment - Lesson Summary"]},{"name":"Module","details":"Quantitative Risk Analysis","description":"In this module, you will be introduced to the probability theory in risk analysis, as well as the essential elements of the probability theory. You will also be introduced to probability as risk assessment, and the mathematics of the probability theory.","topics":["Quantitative Risk Analysis - Learning Outcomes","Review of Probability Theory","Quantitative Risk Analysis: Event Trees","Quantitative Risk Analysis: Fault Trees","Cause Consequence Analysis and Layer of Protection Analysis","Bow-Tie Analysis","Quantitative Risk Analysis - Lesson Summary"]},{"name":"Module","details":"Introduction to Accident Investigation","description":"In this module, you will be introduced to studies related to accidents, as well as accident near miss. You will also be introduced to dangerous occurrences, the outcomes of accidents, as well as accident causation theories.","topics":["Introduction to Accident Investigation - Learning Outcomes","Accident Research: Introduction","Accident Causation Theories","Accident Investigation Procedure I","Accident Investigation Procedure II","Jaipur Terminal Fire, India: October 29, 2009","Introduction to Accident Investigation - Lesson Summary"]},{"name":"Module","details":"Case Study: Historical Industrial Disasters","description":"In this module, you will be introduced to various case studies around the operations of the Flixbourough petrochemical plant, as well as the safety measures and reactor configuration that led to the Seveso accident. You will also be introduced to the extent of the Chernobyl nuclear disaster, and the accident investigations surrounding the Bhopal gas tragedy.","topics":["Case Study: Historical Industrial Disasters - Learning Outcomes","The Flixborough UK, Cyclohhexane Disaster: June 01, 1974","Seveso Accident: July 10, 1976","The Chernobyl Nuclear Disaster: April 26, 1986","Bhopal Gas Tragedy: December 03, 1984","Bhopal Gas Tragedy: Investigation","Case Study: Historical Industrial Disasters - Lesson Summary"]},{"name":"Module","details":"Nuclear Radiation and Safety","description":"In this module, you will be introduced to radioactivity, as well as a definition of process safety management. You will also be introduced to the importance of personal protective equipment, safety laws and regulations, and the effects of a nuclear disaster.","topics":["Nuclear Radiation and Safety - Learning Outcomes","Nuclear Radiation","Process Safety Management","Personal Protective Equipments","Safety: Laws and Regulations","Nuclear Disaster: Earthquake","Nuclear Radiation and Safety - Lesson Summary"]},{"name":"Module","details":"Diploma in Chemical Process Safety - Second Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Chemical Process Safety - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Chemical Process Safety - Course Assessment"]}]}