{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2296","title":"Diploma in Mechanics of Machining","totalEnrolled":"3,738","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course provides an analytical basis which relates cutting forces, tool stresses to the cutting conditions.","description":"This free online course on Diploma in Mechanics of Machining starts with explaining the physics of the cutting process. The objective of this study is to provide an analytical basis which relates cutting forces, tool stresses, and temperature, etc. Non-traditional machining processes are now being widely used to generate intricate and accurate shapes in materials, like titanium, stainless steel and other difficult-to-machine alloys.","courseOutcomes":["Define machining and subtractive man...","Identify the type of manufacturing p...","Describe the mechanics of chip forma...","Explain why strains and stresses are...","Define machining and subtractive manufacturing process.","Identify the type of manufacturing processes.","Describe the mechanics of chip formation.","Explain why strains and stresses are important in machining operation.","Discuss the mechanics of oblique cutting and how to visualize it.","Identify and explain the three distinct regions of heat generations.","Describe the milling and drilling process.","Describe CNC machines and CNC programming.","Discuss the nontraditional machining processes.","Define machining and subtractive man...","Identify the type of manufacturing p...","Describe the mechanics of chip forma...","Explain why strains and stresses are...","Define machining and subtractive manufacturing process.","Identify the type of manufacturing processes.","Describe the mechanics of chip formation.","Explain why strains and stresses are important in machining operation.","Discuss the mechanics of oblique cutting and how to visualize it.","Identify and explain the three distinct regions of heat generations.","Describe the milling and drilling process.","Describe CNC machines and CNC programming.","Discuss the nontraditional machining processes."],"courseDescription":"<p>This free online course on Diploma in Mechanics of Machining aims at explaining the physics of the cutting process. Machining is a metal removal process, which can be accomplished by applying force on raw material by means of a cutting tool. It can also be seen as a manufacturing term encompassing a broad range of technologies and techniques.&nbsp;</p><p>In machining mechanics, the basic chip formation process by the removal of material from a workpiece by the action of a wedge-shaped cutting edge of the tool is considered. The objective of this study is to provide an analytical basis which relates cutting forces, tool stresses, and temperature, etc., to the cutting conditions such as the cutting speed, size of cut, cutting tool geometry, and the material properties of the workpiece and the tool.</p><p>The course contains discussion of statics, kinematics and kinetics of the cutting process. Experimental findings relevant to mechanics of the process will also be discussed. The course will also include an introductory discussion on non-traditional machining processes. Non-traditional machining processes are now being widely used to generate intricate and accurate shapes in materials, like titanium, stainless steel and other difficult-to-machine alloys having higher strength, hardness and other diverse material properties.</p><a href=\"https://alison.com/resume/courses/2296\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2296\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics on Machining","description":"In this module you will learn about the basics of machining and subtractive manufacturing process. Machining is a manufacturing process of making useful product by the removal of the material. Machining processes can be traditional or conventional.","topics":["Basics on Machining - Learning Outcomes","Deformation of Metals","Mechanism of Plastic Deformation","Machining Processes: Single Edge Tool, Types of Chips","Basics on Machining - Lesson Summary"]},{"name":"Module","details":"Tool Geometry and Mechanics of Orthogonal Cutting","description":"In this module you will learn about tool geometry. It is basically referred to some specific angles or slope of the salient faces and edges of the tools at their cutting point.","topics":["Tool Geometry and Mechanics of Orthogonal Cutting - Learning Outcomes","Tool Geometry: Single Point Cutting Tool Specifications","Tool Specifications, Conversion Of Tool Angles, Multi-Point Cutting Tools","Mechanics of Orthogonal Cutting and Force Relationships","Tool Geometry and Mechanics of Orthogonal Cutting - Lesson Summary"]},{"name":"Module","details":"Introduction to Orthogonal Cutting","description":"In this module you will learn about Orthogonal Cutting. Along with learning about the strains and stresses in orthogonal cutting, experimental study of orthogonal cutting and other models.","topics":["Introduction to Orthogonal Cutting - Learning Outcomes","Determination of Stress, Strain, and Strain Rate","Measurement of Shear Angle","Other Analysis for Force Relationships","Introduction to Orthogonal Cutting - Lesson Summary"]},{"name":"Module","details":"Oblique Cutting and Measurement of Cutting Forces","description":"In this module you will learn about oblique cutting and measurement of cutting forces. Along with learning about that measurement of chip flow direction are classified into two categories; direct and indirect measurement.","topics":["Oblique Cutting and Measurement of Cutting Forces - Learning Outcomes","Mechanics of Oblique Cutting","Measurement of Cutting Forces","Oblique Cutting and Measurement of Cutting Forces - Lesson Summary"]},{"name":"Module","details":"Diploma in Mechanics in Machining - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mechanics in Machining - First Assessment"]},{"name":"Module","details":"Thermal Aspects Of Machining","description":"In this module we will learn about thermal aspects of machining. Heat is generated when conversion of mechanical energy takes place. In tool wear and tool life, wear can be caused by adhesion, abrasion, erosion etc.","topics":["Thermal Aspects Of Machining - Learning Outcomes","Thermal Aspects Of Machining: Temperatures in Orthogonal Cutting","Tool Wear and Tool Life and Tool Life Equations","Economics in Machining","Thermal Aspects Of Machining - Lesson Summary"]},{"name":"Module","details":"Practical Machining Operations","description":"In this module you will learn about the practical machining operations and how turning is used to produce axisymmetric components. Along with learning about that milling operation requires a milling machine, fixture, workpiece and a milling cutter.","topics":["Practical Machining Operations - Learning Outcomes","Turning And Shaping & Planning Operation","Milling and Drilling","Grinding of Metals and Mechanics of Grinding Process","Practical Machining Operations - Lesson Summary"]},{"name":"Module","details":"Introduction to Advanced Machining Processes","description":"In this module you will learn about machining processes. In mechanical processes, there is a physical contact between the workpiece and another material. Along with learning about electrochemical machining is the process governed by the Faraday’s law of electrochemistry.","topics":["Introduction to Advanced Machining Processes - Learning Outcomes","Introduction to Advanced Machining Processes","Introduction to Advanced Machining Processes - Lesson Summary"]},{"name":"Module","details":"Finishing Processes and CNC Machine","description":"In this module you will learn about the finishing processes and CNC machine, difference between machining and finishing. Along with learning about numerical control.","topics":["Finishing Processes and CNC Machine - Learning Outcomes","Abrasive Machining and Finishing Operations","CNC Machines and CNC Programming","Finishing Processes and CNC Machine - Lesson Summary"]},{"name":"Module","details":"Diploma in Mechanics in Machining - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mechanics in Machining - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Mechanics in Machining - Final Assessment"]}]}