{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2247","title":"Advanced Diploma in Abrasive Machining and Finishing Processes","totalEnrolled":"427","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course discover the processes of abrasive machining and finishing material surfaces.","description":"In this free online course, you will learn about the theories, technologies and operations of abrasive machining and finishing processes. This instructor-led video-based course includes commentary, illustrations, assessment questions and citations from publications to enhance your learning. It will be of interest to students of industrial and manufacturing engineering. Start the course today and learn about machining and finishing processes.","courseOutcomes":["Discuss the grinding process, includ...","Recall the working mechanisms of hon...","Describe the vibratory bowl and drag...","Demonstrate how surface roughness ca...","Discuss the grinding process, including grinding fluids and their ecological effects","Recall the working mechanisms of honing, lapping and super finishing","Describe the vibratory bowl and drag finishing methods","Demonstrate how surface roughness can be measured and represented","Distinguish between abrasive jet machining and abrasive water jet machining","Discuss the ultrasonic machining system","Summarise the material removal mechanism in elastic emission machining","Explain the electric discharge diamond grinding process","Discuss the electrochemical machining, grinding and honing system","Outline the abrasive flow finishing process","Summarise the material removal mechanism in magnetorheological finishing","Discuss the grinding process, includ...","Recall the working mechanisms of hon...","Describe the vibratory bowl and drag...","Demonstrate how surface roughness ca...","Discuss the grinding process, including grinding fluids and their ecological effects","Recall the working mechanisms of honing, lapping and super finishing","Describe the vibratory bowl and drag finishing methods","Demonstrate how surface roughness can be measured and represented","Distinguish between abrasive jet machining and abrasive water jet machining","Discuss the ultrasonic machining system","Summarise the material removal mechanism in elastic emission machining","Explain the electric discharge diamond grinding process","Discuss the electrochemical machining, grinding and honing system","Outline the abrasive flow finishing process","Summarise the material removal mechanism in magnetorheological finishing"],"courseDescription":"<p>In this free online course, you will learn about the working principles and material removal mechanisms of various abrasive machining and finishing processes. The course starts by introducing you to manufacturing and abrasive particles and grinding processes. The course examines the use of grinding fluids, their adverse effects and biodegradation. You will learn about honing, lapping and superfinishing.</p><p>Next, you will be introduced to vibratory bowl finishing, ice-bonded abrasive polishing and how surface roughness can be measured. Further in the course, you are introduced to the electric discharge diamond grinding process, electrochemical machining, and electrochemical grinding. The course then teaches you about abrasive flow finishing, magnetic abrasive finishing and magnetic abrasive deburring.</p><p>Finally, the magnetorheological finishing and magnetorheological abrasive flow finishing processes are examined. This course will be of interest to students of industrial and manufacturing engineering, or those looking to learn more about how manufactured products and materials are machined and finished. Start this course today and learn more about abrasive machining and finishing processes.</p><a href=\"https://alison.com/resume/courses/2247\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2247\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Abrasive Processes","description":"In this module, you will learn about abrasive particles, grinding processes, grinding fluids, additives and more.","topics":["Introduction to Abrasive Processes - Learning Outcomes","Course Overview","Grinding Process","Grinding Fluids and Additives","Introduction to Abrasive Processes - Lesson Summary"]},{"name":"Module","details":"Sustainable Grinding Process","description":"This module will educate you on the emissions from grinding fluids, biodegradation and Minimum Quantity Lubrication (MQL) of grinding fluids.","topics":["Sustainable Grinding Process - Learning Outcomes","Grinding Fluids and its Emissions","Bio-degradation of Grinding Fluids","MQL in Grinding Process","Sustainable Grinding Process - Lesson Summary"]},{"name":"Module","details":"Honing, Lapping and Super Finishing","description":"In this module, you will learn about the honing, lapping, superfinishing and sand blasting process, including their mechanism and applications.","topics":["Honing, Lapping and Super Finishing - Learning Outcomes","Honing Process","Lapping Process","Super Finishing and Sand Blasting","Honing, Lapping and Super Finishing - Lesson Summary"]},{"name":"Module","details":"Finishing Processes and Surface Texture","description":"In this module, you will learn about vibratory bowl, drag and tumbling finishing, pitch polishing and the measurement and representation of surface roughness.","topics":["Finishing Processes and Surface Texture - Learning Outcomes","Vibratory Bowl and Tumbling Finishing","Drag Finishing and Pitch Polishing","Introduction to Surface Texture","Representation of Surface Roughness","Finishing Processes and Surface Texture - Lesson Summary"]},{"name":"Module","details":"Advanced Abrasive Machining Processes","description":"In this module, you will learn about abrasive jet machining, abrasive water jet machining and ultrasonic and elastic emission machining.","topics":["Advanced Abrasive Machining Processes - Learning Outcomes","Abrasive Jet Machining (AJM)","Abrasive Water Jet Machining (AWJM)","Ultrasonic Machining (USM)","Elastic Emission Machining","Advanced Abrasive Machining Processes - Lesson Summary"]},{"name":"Module","details":"Hybrid Abrasive Machining Processes","description":"In this module, the working principles of electric discharge diamond grinding, electrochemical machining and grinding and honing processes.","topics":["Hybrid Abrasive Machining Processes - Learning Outcomes","Electric Discharge Diamond Grinding","Electrochemical Grinding","Hybrid Abrasive Machining Processes - Lesson Summary"]},{"name":"Module","details":"Advanced Abrasive Finishing Processes","description":"In this module, you will learn about the elements and classification of the abrasive flow finishing process, and operations of magnetic field-assisted abrasive finishing processes.","topics":["Advanced Abrasive Finishing Processes - Learning Outcomes","Elements of Abrasive Flow Finishing Process","Classifications of Abrasive Flow Finishing Process","Magnetic Field Assisted Abrasive Finishing","Advanced Abrasive Finishing Processes - Lesson Summary"]},{"name":"Module","details":"Magnetorheological Abrasive Finishing Processes","description":"In this module, learn the principles and mechanisms involved in magnetorheological finishing and the working operations of magnetorheological abrasive flow finishing.","topics":["Magnetorheological Abrasive Finishing Processes - Learning Outcomes","Magnetorheological Finishing","Magnetorheological Abrasive Flow Finishing","Summary of the Course","Magnetorheological Abrasive Finishing Processes - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Abrasive Machining and Finishing Processes - Course Assessment"]}]}