{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2858","title":"Advanced Diploma in Bioengineering: An Interface between Biology and Medicine","totalEnrolled":"4,675","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the significance of the integration of biology, engineering and medicine in this free online course.","description":"In this free online course in bioengineering, you will study the various ways in which engineers and clinicians can collaborate effectively to solve a range of societal problems. You will learn about the concepts of gene cloning and biotechnology. Genetics, developmental biology, evolution and proteomics will also be discussed. Consider the technological advancements that are being made in these fields and analyze how they can be improved upon.","courseOutcomes":["Identify common problems faced by bo...","List the functions of nucleic acids ...","Indicate the uses of biotechnology t...","Discuss the fundamentals of Mendelia...","Identify common problems faced by both biologists and engineers","List the functions of nucleic acids in DNA","Indicate the uses of biotechnology tools in agriculture and medicine","Discuss the fundamentals of Mendelian genetics","Distinguish the properties of bacteria and viruses","Outline the applications of plant and animal cloning","Highlight the aims of proteomic studies","Discuss the properties of amino acids","Summarise the methods for studying protein-protein interactions","Identify common problems faced by bo...","List the functions of nucleic acids ...","Indicate the uses of biotechnology t...","Discuss the fundamentals of Mendelia...","Identify common problems faced by both biologists and engineers","List the functions of nucleic acids in DNA","Indicate the uses of biotechnology tools in agriculture and medicine","Discuss the fundamentals of Mendelian genetics","Distinguish the properties of bacteria and viruses","Outline the applications of plant and animal cloning","Highlight the aims of proteomic studies","Discuss the properties of amino acids","Summarise the methods for studying protein-protein interactions"],"courseDescription":"<p>Bridge the gap between the sciences of engineering and medicine in this free online course on bioengineering. You will consider the various global problems that bioengineering, using the various technological advancements in the field, aims to solve. In the first section, you will be introduced to the significance of major life processes such as growth, reproduction, evolutionary adaptation and the properties of cells. You will also examine the various technologies associated with biological research such as polymerase chain reaction (PCR) and electrophoresis.</p><p>Next, you will consider the various applications of biotechnology and DNA tools. See how these tools can be used in various sectors like agriculture, clinical research, medicine and more. There will also be a series of laboratory demonstrations that reveal the practical uses of some of these tools. Then, you will study the fundamentals of genetics, where you will examine the properties of Mendelian genetics and how its laws influence the patterns of inheritance in plants, animals and humans. The concepts of ‘genetic recombination’, ‘cell cycles’ and ‘cell development’ will also be discussed.</p><p>Finally, you will be introduced to the field of proteomics, which features the properties of amino acids, proteins and the applications of protein-related technology, showing how they have driven this field. The basics of mass spectrometry and its applications, as well as the various tools used in the study of biomolecular interactions and the structure of proteins, are also analyzed. This course will be highly beneficial to anyone in the field of bioengineering, genetic engineering, biotechnology, medicine and other related disciplines.</p><a href=\"https://alison.com/resume/courses/2858\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2858\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Bioengineering","description":"In this module, you will understand the significance of the integration of biology, medicine and engineering to address major societal problems. You will also learn about the various processes that are associated with the sustenance of life, such as growth, reproduction, evolutionary adaption and cell properties.","topics":["Introduction to Bioengineering - Learning Outcomes","Biology for Engineers","Bio-inspired Engineering","Cells and Life Processes","Properties of Cells","Clinicians Perspective: Tackling Brain Tumors","Introduction to Bioengineering - Lesson Summary"]},{"name":"Module","details":"DNA Tools and Biotechnology","description":"This module features the functionalities and Properties of DNA and DNA tools. You will learn about the various technologies involved in molecular biology research and biotechnology such as Polymerase Chain Reaction, Gene Cloning and more.","topics":["DNA Tools and Biotechnology - Learning Outcomes","Nucleic Acid and Central Dogma","Gene Cloning","Lab Demonstration: DNA Cloning","Polymerase Chain Reaction","Lab Demonstration: Polymerase Chain Reaction","DNA Tools and Biotechnology - Lesson Summary"]},{"name":"Module","details":"Applications of Biotechnology","description":"In this module, you will study the practical applications of DNA tools and Biotechnology through some laboratory demonstrations. You will also explore the uses of these tools in various sectors like agriculture, clinical research and medicine.","topics":["Applications of Biotechnology - Learning Outcomes","Uses of DNA Tools","Gene Expression","Lab Demonstration: RNA Extraction and cDNA Synthesis","Plant Biotechnology","Clinicians Perspective: Impact of Biotechnology","Application of Biotechnology - Lesson Summary"]},{"name":"Module","details":"Fundamentals of Genetics","description":"In this module, you will learn about some of the basic terminologies associated with genetics such as phenotype, hereditary, genotype, alleles and traits. You will also examine the properties of Mendelian Genetics and how they influence the patterns of inheritance in humans.","topics":["Fundamentals of Genetics - Learning Outcomes","Introduction to Genetics","Mendelian Genetics","Deviations from Mendelian Genetics","Rules of Probability","Clinicians Perspective: Infectious Disease Diagnosis","Fundamentals of Genetics - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of the first four modules of the course.","topics":["Advanced Diploma in Bioengineering - First Assessment"]},{"name":"Module","details":"Inheritance and Pathology","description":"In this module, you will be introduced to Mendel's Laws of Inheritance and consider how these laws affect the behaviour of chromosomes during meiosis. The concepts of genetic recombination, linkage and the properties of bacteria and viruses will also be examined.","topics":["Inheritance and Pathology - Learning Outcomes","Chromosomal Basis of Inheritance","Genetic Recombination and Linkage","Classical Genetics Experiment","Bacteria and Viruses","Clinicians Perspective: Pathology Meets Engineering","Inheritance and Pathology - Lesson Summary"]},{"name":"Module","details":"Developmental Biology","description":"In this module, you will study more intently about cell cycles and development. You will also come to understand the importance of mitosis and the significance of meiosis for reproduction. The principles and applications of plants and animal cloning will also be explained.","topics":["Developmental Biology - Learning Outcomes","Cell Cycle and Dysregulation","Cell Development","Plant and Animal Cloning","Evolution","Clinicians Perspective: Technology and Disease Control","Developmental Biology - Lesson Summary"]},{"name":"Module","details":"Proteomics","description":"In this module, you will be introduced to the subject of proteomics. The history of proteomics will be highlighted and you will learn about the properties of amino acids, proteins and protein-related technology, considering how they have driven the field of proteomics. Basic techniques commonly used in the study of proteins will also be discussed.","topics":["Proteomics - Learning Outcomes","Amino Acids and Proteins","Proteins and Proteomics","Techniques to study Proteins and Proteome","Difference Gel Electrophoresis","Bioinformatics","Proteomics - Lesson Summary"]},{"name":"Module","details":"Protein Interactions","description":"In this module, you will study the basics of mass spectrometry and its applications in the field of proteomics. You will also learn about the methods used in the study of protein-to-protein interactions as well as the various tools used in the study of bio-molecular interactions and the structure of proteins.","topics":["Protein Interactions - Learning Outcomes","Mass Spectrometry","Protein Interactions and Micro-arrays","Protein Interactions and Systems Biology","Bioinformatic Tools","Ethics in Research and Publication","Protein Interactions - Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of the last four modules of the course.","topics":["Advanced Diploma in Bioengineering - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Bioengineering - Course Assessment"]}]}