{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2517","title":"Advanced Diploma in Genetic Engineering - Theory and Application","totalEnrolled":"2,210","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the roles of performance and reward management systems in an organization with this free diploma course.","description":"This free diploma for performance and reward management course gives you some great insights into the concept of performance management systems from the key components, guiding principles, and characteristics of an ideal performance management system. You will learn about employee benefits and individual incentive level plans. By the end of this course, you will be better equipped at grading jobs. These are great skills, so get started, today!","courseOutcomes":["Explain the concept of biotechnology...","Discuss the important milestones in ...","List the enzymes involved in molecul...","Explain the importance of the restri...","Explain the concept of biotechnology","Discuss the important milestones in biotechnology","List the enzymes involved in molecular cloning and state their functions","Explain the importance of the restriction-methylase system","Discuss DNA delivery in host cells","Define antibiotic sensitivity","List and explain the steps involved in the synthesis of protein","Discuss the criteria for selecting an expression system","Explain the steps in the generation of antibody and receptor","Discuss receptor coupling","Discuss the impact of biotechnology on social welfare","Explain the concept of biotechnology...","Discuss the important milestones in ...","List the enzymes involved in molecul...","Explain the importance of the restri...","Explain the concept of biotechnology","Discuss the important milestones in biotechnology","List the enzymes involved in molecular cloning and state their functions","Explain the importance of the restriction-methylase system","Discuss DNA delivery in host cells","Define antibiotic sensitivity","List and explain the steps involved in the synthesis of protein","Discuss the criteria for selecting an expression system","Explain the steps in the generation of antibody and receptor","Discuss receptor coupling","Discuss the impact of biotechnology on social welfare"],"courseDescription":"<p>Advanced Diploma in Performance and Reward Management is a free online course that begins by introducing you to the meaning of performance management as well as the key components and guiding principles of performance management. You will learn about the aims and objectives of a performance management system. You will also be familiar with the challenges in implementing a performance management system and the reasons behind a poorly implemented performance management system. You will be able to explain the outcomes of performance appraisal and the appropriate methods employed in managing underperformers.</p><p>The course then explains the concept of strategic reward management along with the significance of having fundamental values. You will gain an understanding of the purpose of reward strategy as well as the important link between the HR strategy, reward strategy, and the line management capability. Next, you will learn about important laws and regulations, the components of the Hay group engaged performance model, and the concept of the broad brush reward strategy.</p><p>Furthermore, you will get familiar with the significance of valuing and grading jobs as well as the determination of pay levels. You will be able to explain the relevance of employee benefits and pension schemes. This free online course will be of great interest to students, researchers, and anyone with an interest in organizational management. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/2517\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2517\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Biological System","description":"In this module, you will be introduced to the concept of biotechnology, its techniques as well as its importance in science. You will also be introduced to the different types of hosts which are available for the biotechnology applications.","topics":["Introduction to Biological System - Learning Outcomes","Cellular Structure","Cell Organelles","Isolation of Cell Organelles","Introduction to Biological System - Lesson Summary"]},{"name":"Module","details":"Basics of the Biological System","description":"In this module, you will be introduced to the metabolic reactions which occur in the host cells. You will also be introduced to microbiology medium constituents, cell division and microbial growth kinetics.","topics":["Basics of the Biological System - Learning Outcomes","Metabolic Reactions in Biological System","Growth Media for Different Expression System","Microbial Growth Kinetics","Basics of the Biological System - Lesson Summary"]},{"name":"Module","details":"Basics of Cloning","description":"In this module, you will be introduced to the preparation of a genetically modified organism and the different approaches for the isolation of gene of interest. You will also be introduced to the reagents which are important for the polymerase chain reaction.","topics":["Basics of Cloning - Learning Outcomes","Isolation of Gene Fragment","Screening","Polymerase Chain Reaction","Technical Aspects of Polymerase Chain Reactions","Basics of Cloning - Lesson Summary"]},{"name":"Module","details":"Cloning Vectors","description":"In this module, you will be introduced to the generation of genetically modified organism and the enzymes for molecular cloning. You will also be introduced to cloning vectors and the isolation of plasmids.","topics":["Cloning Vectors - Learning Outcomes","Molecular Tools for Cloning","Cloning Vectors","Isolation of Plasmids","Cloning Vectors - Lesson Summary"]},{"name":"Module","details":"Recombinant DNA Technology","description":"In this module, you will be introduced to the concept of transformation and electroporation in bacterial cells. You will also be introduced to DNA delivery in host cells and the screening of recombinant clones.","topics":["Recombinant DNA Technology - Learning Outcomes","DNA Delivery in Host","DNA Delivery in Mammalian Cells","Screening of Recombinant Clones","Recombinant DNA Technology - Lesson Summary"]},{"name":"Module","details":"Protein Production in Host","description":"In this module, you will be introduced to protein synthesis machinery and host as production machinery. You will also be introduced to the yeast, e.coli, insect cell line and mammalian cells as expression systems.","topics":["Protein Production in Host - Learning Outcomes","Protein Synthesis Machinery","Protein Synthesis in Yeast and Insect Cell Line","Mammalian Expression System","Protein Production in Host - Lesson Summary"]},{"name":"Module","details":"Genetic Engineering - Theory and Application - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Genetic Engineering - Theory and Application - First Assessment"]},{"name":"Module","details":"Isolation and Purification of Product","description":"In this module, you will be introduced to the overview of different steps in product processing as well as the purification and isolation of protein. You will also be introduced to the types of chromatography techniques.","topics":["Isolation and Purification of Product - Learning Outcomes","Product Recovery from Host Cells","Basics of Chromatography","Chromatography System","Ion-Exchange Chromatography","Hydrophobic Interaction Chromatography","Isolation and Purification of Product - Lesson Summary"]},{"name":"Module","details":"Gel Filtration and Affinity Chromatography","description":"In this module, you will be introduced to a technique known as gel filtration chromatography and the processes involved. You will also be introduced to the concept of affinity chromatography and its types including bio-affinity chromatography and pseudo-affinity chromatography.","topics":["Gel Filtration and Affinity Chromatography - Learning Outcomes","Gel Filtration Chromatography","Gel Filtration - Demo Session","Affinity Chromatography","Generation of Receptor and Antibody","Types of Affinity Chromatography","Affinity Chromatography - Demo Session","Gel Filtration and Affinity Chromatography - Lesson Summary"]},{"name":"Module","details":"Electrophoresis","description":"In this module, you will be introduced to product characterization as well as the basic principles of electrophoresis. You will also be introduced to the process of performing electrophoresis with a detailed demo session.","topics":["Electrophoresis - Learning Outcomes","Product Characterization","Image Analysis and Staining","PAGE","Electrophoresis - Lesson Summary"]},{"name":"Module","details":"Characterization of Isolated Product","description":"In this module, you will be introduced to the sequencing techniques for biomolecules as well as functional groups in biomolecules, You will also be introduced to the spectroscopic techniques which allow the probing of different types of molecular processes.","topics":["Characterization of Isolated Product - Learning Outcomes","Protein Sequencing","Spectroscopy","Types of Spectroscopy","Characterization of Isolated Product - Lesson Summary"]},{"name":"Module","details":"Biotechnology in Social Welfare","description":"In this module, you will be introduced to different avenues by which genetic engineering can potentially help society. You will also be introduced to the different applications in which genetic engineering can be used.","topics":["Biotechnology in Social Welfare - Learning Outcomes","Biotechnology in Plant Science","Biotechnology in Animal Science","Monoclonal Antibody Production","Biotechnology in Social Welfare - Lesson Summary"]},{"name":"Module","details":"Summary and Conclusion","description":"This model summarizes the topics related to biotechnology which have been covered in this genetic engineering course so far. It also includes a refresher in order to help prepare you for your assessment.","topics":["Summary and Conclusion - Learning Outcomes","Fundamentals of Biotechnology Recap","Product Isolation and Purification Recap","Summary and Conclusion - Lesson Summary"]},{"name":"Module","details":"Genetic Engineering - Theory and Application - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Genetic Engineering - Theory and Application - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Genetic Engineering - Theory and Application - Course Assessment"]}]}