{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2530","title":"Advanced Diploma in Maintenance and Repair of Concrete Structures","totalEnrolled":"3,204","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of concrete structures, corrosion of reinforcement, waterproofing and concrete surface repair.","description":"In this free online training course, you will learn about how best to maintain and repair concrete structures. The course covers such topics as the significance and fundamentals of corrosion, how to address the deterioration of cementitious systems, the condition assessment of concrete structures, and the strategies and materials for surface repair. You also learn about waterproofing, strengthening and stabilization of these structures.","courseOutcomes":["Discuss the significance and fundame...","Differentiate between carbonation-in...","Explain corrosion in prestressed con...","Discuss the deterioration of cementi...","Discuss the significance and fundamentals of corrosion","Differentiate between carbonation-induced corrosion and chloride-induced corrosion","Explain corrosion in prestressed concrete","Discuss the deterioration of cementitious systems","Describe the testing of concrete, both on-site and in laboratory","Summarise strategies and materials for surface repair","Examine cathodic protection and service life estimation","Describe waterproofing on concrete structures","Differentiate between strengthening and stabilization of concrete structures","Discuss the significance and fundame...","Differentiate between carbonation-in...","Explain corrosion in prestressed con...","Discuss the deterioration of cementi...","Discuss the significance and fundamentals of corrosion","Differentiate between carbonation-induced corrosion and chloride-induced corrosion","Explain corrosion in prestressed concrete","Discuss the deterioration of cementitious systems","Describe the testing of concrete, both on-site and in laboratory","Summarise strategies and materials for surface repair","Examine cathodic protection and service life estimation","Describe waterproofing on concrete structures","Differentiate between strengthening and stabilization of concrete structures"],"courseDescription":"<p>In this free online certification course about the maintenance and repair of concrete structures, you will be introduced to the fundamentals of corrosion, notably its mechanism. Through this video-based course, you will learn about construction materials and steel rebars in particular. This course covers the deterioration of cementitious systems, delving deeper into the various attacks concrete structures are prone to, and how to address them. Also, root-cause analyses of the problems of these structures will be highlighted, as well as how to adequately solve them.</p><p>Furthermore, this course enables you to explore surface preparation and protective treatments. You will learn about the waterproofing of concrete structures, allowing you to learn better about coatings on concrete infrastructures, with a specific emphasis on industrial application of these coatings for concrete substrate. The needs and strategies to stabilize and strengthen concrete structures, the injection of grouts for concrete repair, and the strengthening of prestressed concrete systems will be discussed.</p><p>Finally, you will study service life design, design principles, and design modelling. This course is about how best to ensure durability and safety of concrete structures, through maintenance and repair, thus allowing people to use them safely. It will be of interest to students specialising in civil engineering and government officials in charge of drafting tender specifications for public works.</p><a href=\"https://alison.com/resume/courses/2530\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2530\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Concrete Structures and Corrosion","description":"In this module, you will be introduced to concrete structures and the corrosion that threatens their safety and durability. The fundamentals of corrosion within the context of concrete structures and the necessity to manage it will be unravelled. The mechanism of corrosion, such as carbonation-induced chloride-induced corrosion are discussed.","topics":["Introduction to Concrete Structures and Corrosion - Learning Outcomes","Prologue","Corrosion of Embedded Metal: Significance and Fundamentals of Corrosion","Corrosion of Embedded Metal: Carbonation-induced and Chloride-induced Corrosion","Introduction to Concrete Structures and Corrosion – Lesson Summary"]},{"name":"Module","details":"Corrosion of Embedded Metal and Reinforcement","description":"In this module, about corrosion of embedded metal and reinforcement, you will learn about the construction materials, steel rebars in particular, and why it is necessary to resort to testing for the quality assessment of these rebars. You will also learn about the TM – Ring Test used for assessing the quality of TMT / QST steel rebars. The module also addresses the manufacturing process of some of rebars, their reinforcement, and corrosion in prestressed concrete systems.","topics":["Corrosion Embedded Metal and Reinforcement - Learning Outcomes","Types of Reinforcement of TD Bare Steel","TM - Ring Test for Assessing the Quality of TMT / QST Steel Rebars","Types of Reinforcement TD Metallic and Nonmetallic Coated Rebars","Corrosion in Prestressed Concrete","Corrosion of Embedded Metal and Reinforcement - Lesson Summary"]},{"name":"Module","details":"Deterioration of Cementitious Systems","description":"This module is about the deterioration of cementitious systems. In this module, you will learn about some of the attacks which concrete structures are prone to, namely sulphate attack, biofouling and biogenic acid attack, frost attack, freeze-thaw attack, and fire attack. You will also know how shrinkage, creep, abrasion, and erosion challenge the safety of concrete structures. How to address the various attacks and challenges are also discussed.","topics":["Deterioration of Cementitious Systems - Learning Outcomes","Sulphate Attack, Biofouling and Acid Attack","Frost Attack, Freeze-Thaw and Alkali-Silica Reaction","Shrinkage and Creep","Fire Attack, Abrasion and Erosion","Deterioration of Cementitious Systems - Lesson Summary"]},{"name":"Module","details":"Condition Assessment of Concrete Structures","description":"This module covers the condition assessment of concrete structures that must be carried out before any maintenance or repair work. You will learn about exposure conditions of concrete structures through visual inspection and on-site testing. You will also learn about laboratory testing. By the end of the module, you will be introduced to testing on rebars in the field and in laboratories, with a specific emphasis on the mechanical and corrosion testing of rebars.","topics":["Condition Assessment of Concrete Structures - Learning Outcomes","Exposure Conditions and Visual Inspections","Testing of Concrete in Laboratory","Mechanical and Corrosion Testing of Rebars","Condition Assessment of Concrete Structures - Lesson Summary"]},{"name":"Module","details":"Strategies and Materials for Surface Repair","description":"In this module dedicated to strategies and materials for surface repair, you will learn about root-cause analyses of the problems of concrete structures and how to address them adequately. You will also learn about the techniques, methods, and strategies to choose the best materials for a specific type of repair. By the end of this module, you will know about the compatibility of repair materials with substrate.","topics":["Strategies and Materials for Surface Repair - Learning Outcomes","Strategies and Materials for Surface Repair, Part I","Strategies and materials for Surface Repair, Part II","Strategies and Materials for Surface Repair, Part III","Strategies and Materials for Surface Repair - Lesson Summary"]},{"name":"Module","details":"First Course Assessment","description":"N/A","topics":["First Course Assessment"]},{"name":"Module","details":"Surface Preparation and Protective Treatments","description":"In this module, you will learn about anti-corrosive / zinc coating and sacrificial anode cathodic protection and the Galvanic Anode Performance Test. You will also learn about how to protect the steel from corrosion using the Impressed Current Cathodic protection (ICCP), the placement of repair materials, and curing.","topics":["Surface Preparation and Protective Treatments - Learning Outcomes","Surface Preparation and Protective Treatments, Part I","Surface Preparation and Protective Treatments, Part II","Surface Preparation and Protective Treatments, Part III","Surface Preparation and Protective Treatments, Part IV","Surface Preparation and Protective Treatments, Part V","Surface Preparation and Protective Treatments - Lesson Summary"]},{"name":"Module","details":"Waterproofing on Concrete Structures","description":"In this module about waterproofing of concrete structures, you will learn about coatings on concrete infrastructures, with a specific emphasis on industrial application of coatings for concrete substrate. You will also learn about the various sources of water that threatens concrete structures and how to waterproof them. Waterproofing of control joints, expansion joints, precast concrete joints and roofs will also be addressed.","topics":["Waterproofing on Concrete Structures - Learning Outcomes","Coating on Concrete Infrastructures","Waterproofing on Concrete Structures, Part I","Waterproofing on Concrete Structures, Part II","Waterproofing on Concrete Structures - Lesson Summary"]},{"name":"Module","details":"Structural Strengthening and Stabilisation","description":"This module covers structural strengthening and stabilization. In this module, you will learn about the needs and strategies needed to stabilize and strengthen concrete structures. Specifically addressed are the strengthening of beams and slabs, the types of column failure and how to strengthen them. You will also learn about good practices associated with the repair and strengthening of joints and connections.","topics":["Structural Strengthening and Stabilization - Learning Outcomes","Loads Effects and Introduction to S & S","Beams and Slabs","Columns and Walls","Joints and Connections","Structural Strengthening and Stabilization - Lesson Summary"]},{"name":"Module","details":"Tender Specifications and Cases Studies","description":"In this module, you will learn about injection grouts for concrete repair, the strengthening of prestressed concrete systems, the types of damage the prestressed concrete systems are prone to, and the possible repair scenarios and methods. You will also learn about the approach to systematic repairs and strengthening methodologies, and through case studies, the various types of structures and strengthening techniques.","topics":["Tender Specifications and Cases Studies - Learning Outcomes","Injection Grout for Concrete Repair","Structural Repair of Prestressed Concrete Systems","Case Studies on Structural Repair","Tender Specifications and Cases Studies - Lesson Summary"]},{"name":"Module","details":"Cathodic Protection and Service Life Estimation","description":"In this module, you will learn about cathodic protection in concrete structures, the principles of service life design, the service life modelling and the residual service life estimation. After a brief review of service life of RC structures, you will also learn about the most important variables that influence the service life of concrete structures.","topics":["Cathodic Protection and Service Life Estimation - Learning Outcomes","Laboratory and Field Studies","Service Life Estimation, Part I","Service Life Estimation, Part II","Cathodic Protection and Service Life Estimation - Lesson Summary"]},{"name":"Module","details":"Second Course Assessment","description":"N / A","topics":["Second Course Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Final Course assessment"]}]}