{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2828","title":"Amino Acids and Macromolecules","totalEnrolled":"1,007","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Be introduced to amino acids and how they combine to form macromolecules in this free biological chemistry course.","description":"You will gain an understanding of the reasons why an organic chemist is interested in the field of biology and drug development in this free online course. It begins with an introduction to the ‘molecules of life’ by describing the structure of amino acids and various charged forms. You will learn about their importance, functions and chemistry, and how they combine to form macromolecules.","courseOutcomes":["Discuss the reasons why the field of...","Explain the importance of the isoele...","Describe the macromolecules that mak...","Outline the chemistry of the buildin...","Discuss the reasons why the field of biology and drug development process is important to the organic chemist","Explain the importance of the isoelectric point and chirality in making a peptide or protein","Describe the macromolecules that make up the biological system","Outline the chemistry of the building blocks of the molecules of life","State the details of ninhydrin reactions of amino acids","Indicate how amino acids can be combined to form peptide bonds","Discuss the reasons why the field of...","Explain the importance of the isoele...","Describe the macromolecules that mak...","Outline the chemistry of the buildin...","Discuss the reasons why the field of biology and drug development process is important to the organic chemist","Explain the importance of the isoelectric point and chirality in making a peptide or protein","Describe the macromolecules that make up the biological system","Outline the chemistry of the building blocks of the molecules of life","State the details of ninhydrin reactions of amino acids","Indicate how amino acids can be combined to form peptide bonds"],"courseDescription":"<p>The course begins with the genesis of biological chemistry, which is a field of study that combines biology and drug discovery processes. You will learn about the biological system from a molecular perspective. This field of study started when American chemist Linus Pauling determined the structure of proteins, which are biological molecules. Gain insight into the intersection of chemistry and biology to appraise the evolving field of study of biological molecules. These are also called ‘the molecules of life’; they are present in all living systems and consist broadly of proteins, nucleic acids, lipids and carbohydrates. This course will describe the structure of the macromolecules that make up the biological system and show that, without them, the living system cannot survive. You will also learn about the building blocks of protein - amino acids - and get introduced to monosaccharides and nucleotides or deoxynucleotides, which are the building blocks of carbohydrates and nucleic acids, respectively.</p><p>Living systems consist of organs, which are made of tissues that are comprised of cells. Each biological cell will have the molecules of life and you will study their structure, importance and functions. Grapple with the central dogma of biology, which is about how information flows from the nucleic acids to the proteins, to understand the relationship between the molecules of life. You will learn the structure of glucose, which is a basic carbohydrate, and why lipids are different from the other three molecules of life. Neutral lipids, such as fatty acids, certain steroids or terpene, are not soluble in water. You will understand the structure of different types of lipids and you will also be introduced to the polymers of nucleotides, or the nucleic acids, which are the genetic materials of all eukaryotic cells. Biological systems are formed of large molecules (or macromolecules) and small molecules. Macromolecules are proteins, carbohydrates and nucleic acids. You will also gain an understanding of the structure and importance of certain small molecules like neurotransmitters, vitamins, dopamine and acetylcholine.</p><p>Next, you will get an in-depth understanding of amino acids, their structure, isoelectric point, zwitterions (or inner salts) and chirality. Isoelectric point is the pH at which the intermediate ion or zwitterion has an overall neutral charge. You will learn to calculate the isoelectric point, if the pH values are given. Master the concept of ‘chirality’ and the stereochemistry of amino acids and, lastly, you get brief insight into the separation of amino acids and peptide bond synthesis. Chemists need to know the basics of biology to understand the nature and type of chemistry that goes on in the biological system. Biologists, too, have to study the biological system from the standpoint of molecules, to analyze the precise microscopic details of any process of synthesis or decomposition. If you are a chemistry or biology enthusiast or from the pharmaceutical industry, you can benefit from this course and chart a new path of success in your professional development.</p><a href=\"https://alison.com/resume/courses/2828\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2828\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Molecules of Life and Amino Acids","description":"Organic chemistry in the pharmaceutical industry is one of the main drivers in the drug discovery process. In this module, you will learn about the reasons why the field of biology and drug discovery process is important to the organic chemist. You will also gain an understanding of the building blocks of protein, biological macromolecules and small molecules. Finally, you will be introduced to the separation and detection of amino acids, electrophoresis, and the Ninhydrin reaction.","topics":["Learning Outcomes: Introduction to Molecules of Life and Amino Acids","Molecules of Life: Structure of Amino Acids and their Various Charged Forms","Biological Macromolecules and Small Molecules: Importance and Functions","Amino Acids: The Building Block of Proteins","Amino Acids: Separation and Detection, Electrophoresis, and Ninhydrin Reaction","Lesson Summary: Introduction to Molecules of Life and Amino Acids"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}