{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3716","title":"An Introduction to the Arduino Solar Tracker","totalEnrolled":"580","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the sensors and techniques involved in designing the Arduino Solar Tracker.","description":"Learn how to make your own Arduino Solar Tracker in this free online course. We'll show you how to use light-sensitive sensors to track sunlight and direct the solar panel towards the areas that increase its efficiency. The program we will follow is written using the Arduino IDE, an open-source electronics platform. Improve your Arduino Solar Tracking knowledge and skills by studying this comprehensive course.","courseOutcomes":["Outline the hardware requirements fo...","Describe the applications where serv...","List the two main methods of creatin...","Define the concept of solar tracking...","Outline the hardware requirements for designing an Arduino Solar Tracker","Describe the applications where servo motors are used","List the two main methods of creating a new file","Define the concept of solar tracking","Discuss the actions that you can carry out from the tools section in Arduino IDE","Evaluate the built-in examples in Arduino IDE","Explain what happens if the amount of light is the same on both Light Dependent Resistors","Outline the hardware requirements fo...","Describe the applications where serv...","List the two main methods of creatin...","Define the concept of solar tracking...","Outline the hardware requirements for designing an Arduino Solar Tracker","Describe the applications where servo motors are used","List the two main methods of creating a new file","Define the concept of solar tracking","Discuss the actions that you can carry out from the tools section in Arduino IDE","Evaluate the built-in examples in Arduino IDE","Explain what happens if the amount of light is the same on both Light Dependent Resistors"],"courseDescription":"<p>Would you like to build your own Arduino Solar Tracker from scratch? This course will guide you through the process of using Light Dependent Resistors (LDRs), which are light-sensitive devices in your solar tracking project. You will use four LDRs to detect the sunlight and send signals to Arduino, guiding two servo motors to place the solar panels in an optimal position that maximises their efficiency. We will show you how the servo motors move the solar panel towards the LDR where resistance is low. This resistance decreases as light falls on the LDR. When the light falls equally on both resistors, the solar panel doesn't move, which will be optimal. Throughout this course, you will learn more about Arduino, an open-source electronics platform based on easy-to-use hardware and software.</p><p>At first, we will introduce you to the hardware requirements that you will need to design your Arduino solar tracker. The Arduino board is critical in this project since it can read inputs and turn them into outputs such as activating a motor. Using the Arduino programming language and the Arduino software, you can send a set of instructions to the microcontroller via the board. The other necessary hardware that you will use is the photoresistor. The resistance on this resistor varies depending on the intensity of the light. It is made of a high resistance semiconductor that absorbs photons. You will learn that depending on the quantity and frequency of these absorbed photons. The semiconductor material gives the bound electrons enough energy to jump into the conduction band. As a result, the free electrons will conduct electricity which will lower the photoresistors' resistance.</p><p>The course will demonstrate how the solar panels move to the optimal position because the Arduino code sends LDR readings to the Arduino board to control the two servo motors. But where is the solar tracker program written? The Arduino IDE is used to program your solar tracker, and you will master the two main methods of creating a new file in this software: void loop and void setup. We will explore the interface of the Fritzing software and see how one can use the Arduino web editor without downloading and installing any software, depending on your preference. Finally, we will study light-sensitive sensors, schematic wiring diagrams, circuit design and loop coding. This course will interest electronic circuit experts or anyone passionate about designing a solar tracker. Don't delay! Sign up for this course today and learn how to create your first Arduino solar tracker.</p><a href=\"https://alison.com/resume/courses/3716\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3716\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Solar Tracking","description":"In this module on Solar Tracking, you will learn why resistance decreases as light falls on the Light Dependent Resistor. You will also gain insight into the fact that the number of electrons in a photoresistor is dependent on the frequency of the photons and the hardware requirements for designing an Arduino Solar Tracker.","topics":["Solar Tracking - Learning Outcomes","Arduino Solar Tracker - Introduction","Project Requirements","Download and Install","Coding in Arduino","Download and Install Software Section","Solar Tracking - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to the Arduino Solar Tracker - Course Assessment"]}]}