{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3105","title":"An Introduction to Optical Fiber","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Dive into the world of fiber optics, with all its advantages and applications, in this free online course.","description":"Discover the power of optical fiber, insight into its functionality and its roles in this introductory course. You will expand your knowledge of the advantages of this cutting-edge technology as you explore how this has led to daily leaps forward in the telecommunication industry. In addition to this, you will examine the advancements in such diverse areas as medicine, mechanics and plumbing, in which fiber optics have made an immense impact.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Optical fiber (also called ‘fiber-optics’) are microscopic strands of very pure glass, each about the same diameter of a human hair. Thousands of these optical fibers are arranged in bundles in optical cables and are used to transmit light signals over long distances with a capacity that is far superior to wires or coaxial cables. Travelling along the fibers at around two hundred trillion cycles per second, each photon bounces down the pipe with continued internal mirror-like reflection protected by the cladding that keeps the light signals inside the core. Inexpensive to produce, fiber-optic cables do not conduct electricity, are not degraded by lightning storms and are small in size. This introductory course on fiber-optics will expand your knowledge of this unique technology, breaking down how it works and all the relevant varieties.</p><p>To start with, you will learn about single and multimode fiber, two types of optical fibers. Single-mode is used for long distances, has small cores and transmits infrared laser light while&nbsp; multi-mode is usually used for short distances, has large cores and transmits infrared light. This course then explains how fiber-optic cables transmit data via fast-travelling pulsations of light. Lower attenuation and interference allows an optical fiber to have significant advantages over the copper wire in long-distance, high-bandwidth applications. The information transmitted by fiber optics is typically digital information generated by computers, telephone systems and cable television companies. Finally, you will learn the components that are needed to facilitate communication through an optical communication network, like light signal transmitters, optical fibrervand the photo-detecting receiver. The transmitted signal that travels through the fibers does not radiate. Moreover, the signal cannot be easily tapped from a fiber. Consequently, optical fiber communication provides hundred percent signal security. It is no wonder that it is becoming commercialised. To package fiber into a commercially viable commodity, it typically is protectively covered by using ultraviolet (UV), light-cured acrylate polymers, then finished with optical fiber connectors and subsequently assembled into a cable.</p><p>Fiber-optic cables are used in hundreds of industries around the world. Due to its versatility, the professional opportunities are limitless. Fiber-optic systems have enabled scientists to make numerous important strides in the telecommunication, mechanical and medical fields. The realm of fiber optics has opened many opportunities for solving technological predicaments and has improved human civilization. This course is an exciting option for anyone contemplating a career in fiber optics, especially scholars who want to know more about what fiber-optic workers do on the job and how to get into the profession. A career in fiber optics will allow you to work anywhere in the world, from rural districts to big cities, outdoors or indoors, in large or miniature office buildings, on the ground, in the air or inside a data centre. There are many exceptional benefits to working with fiber. You don’t need a high-level university degree, simply specialised skill experience. If you have an interest or dream to work and have a career in fiber optics, why wait? Start this course today and advance your career in this dynamic field!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}