{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3611","title":"An Introduction to Mechatronic Systems","totalEnrolled":"1,840","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online engineering course examines the key components and electrical elements of mechatronic systems.","description":"Every system has basic principles that guide it and this free online course explores those of mechatronics, which unite mechanical, electrical and computer technologies. This course covers the fundamentals of mechatronic systems and uses familiar examples to make their more complex and technical aspects easier to understand. We also study the working principles of their electrical elements to illustrate the crucial role these machines play.","courseOutcomes":["Define ‘mechatronics’...","Summarize the basic components of me...","Describe some examples of mechatroni...","Explain the working principles of ke...","Define ‘mechatronics’","Summarize the basic components of mechatronic systems","Describe some examples of mechatronic systems","Explain the working principles of key components of electrical circuits","State the major laws guiding their operation","Discuss the working principle of diodes and transistors","Distinguish between ‘bipolar junction’ transistors and ‘field-effect’ transistors","Analyze how ‘bipolar junction’ transistors can be used as switches in mechatronic systems","Define ‘mechatronics’...","Summarize the basic components of me...","Describe some examples of mechatroni...","Explain the working principles of ke...","Define ‘mechatronics’","Summarize the basic components of mechatronic systems","Describe some examples of mechatronic systems","Explain the working principles of key components of electrical circuits","State the major laws guiding their operation","Discuss the working principle of diodes and transistors","Distinguish between ‘bipolar junction’ transistors and ‘field-effect’ transistors","Analyze how ‘bipolar junction’ transistors can be used as switches in mechatronic systems"],"courseDescription":"<p>Mechatronic systems merge elements from various technological fields (such as electronics, mechanics and telecommunications) to create systems that perform work more efficiently and precisely. You probably come across many of those elements in daily life, from staple household appliances to cutting-edge new inventions. This course sets you on the path to becoming proficient in mechatronics systems by taking you through their fundamentals. We show you the key elements and principles of the major electronic components used in mechatronics while explaining their various definitions and real-life applications. We teach you the classification and historical development of mechatronics and introduce you to their major components. The course studies examples of mechatronic systems, starting with photocopiers.</p><p>The course then moves on to the electronic components of mechatronics. We cover the essential laws that guide the operation of electrical circuits, including Kirchhoff's, Thévenin's and Norton's laws, which can help you to design mechatronic systems. We investigate the characteristics of critical semiconductor devices and show you how they work. We then teach you the characteristics of a ‘p-n junction’ and explain how they apply to the operation of diodes and transistors. The course discusses the operational principle of various types of diodes and demonstrates how to implement them in rectifiers. We describe the characteristics and working principles of various types of transistors. Lastly, the course breaks down how a ‘bipolar junction’ transistor can act as a switch in a system and describes the application of LED phototransistors in the design of an autonomous robot.</p><p>To grasp mechatronic engineering, you need to start from the basics and follow its key principles until you become an expert specialist. This introductory course demonstrates how such systems help us in our daily lives and takes you through the circuit schematic symbols of semiconductor devices that are used to design mechatronic systems. These devices are crucial to modern living and this course is designed to serve as a stepping stone to becoming a valued mechatronic engineer, a skill that will only grow in value in the twenty-first century.</p><a href=\"https://alison.com/resume/courses/3611\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3611\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of Mechatronics Systems","description":"This module, Basics of Mechatronics Systems, introduces you to the working principles of key components of electric circuits and how those electronic components can be applied in mechatronics systems.","topics":["Basics of Mechatronics Systems - Learning Outcomes","Introduction to Mechatronics Systems","Examples of Mechatronics Systems","Electric Circuit and its Components","Basics of Semiconductor Devices","Application of Transistors","Basics of Mechatronic Systems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to Mechatronic Systems - Final Course Assessment"]}]}