{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2805","title":"An Introduction to Public Transportation","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the operating characteristics and planning considerations of public transport in this free online course.","description":"This free online course introduces you to the key elements needed for a working public transportation system. You will learn about the factors involved in determining fare structures, the operating measures that influence bus and rail transit, the design of paratransit systems,and the significance of station design elements in facilitating an efficient public transport network.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Master the marketing and planning considerations of public transportation in this free course. Firstly, it explains the financial sustainability of public transport and the various factors involved in determining fare structures, including the different types of financing schemes for fares and sustainable subsidies. Next, the course highlights the need for marketing transit services and the different strategies that are used to improve ridership and revenue. Then, the various types of rail transportation and their structures and dependability in terms of passenger safety are explained. This includes the criteria for planning different types of rail transit and the process of designing overground or underground systems.</p><p>You will then grapple with the basics of intermediate public transportation and the different regulatory policy frameworks and challenges concerning the paratransit system for people with disabilities. Study an overview of the vehicles that supplement the system by providing first- and last-mile connectivity to commuters. Following this, the process of measuring the performance and efficiency of public transport, including the perspectives of passengers and transit agencies, is highlighted. The advanced aspects of the operational characteristics of public transportation and the processes of measuring the operating keys are discussed, including the illustration of travel time and traffic environment on its capacity, speed and reliability. The course emphasizes the process of estimating the capacity and speeds of the bus and rail systems in particular.</p><p>Finally, you will learn how the movement of people and vehicles depends on the size and operation characteristics of transit vehicles, and the interaction of passenger traffic and vehicle flow. You will also explore the transit preferential treatments and operating measures that influence bus and rail systems. This will include the estimation procedure for ascertaining the rail station dwell time, passenger design loads and the prime locations where the bus transit capacity is determined. Following this, the different types of stations, their configurations, the impact of station elements on capacity, and the procedure for estimating the size of a station stairway, are also explained to you. Lastly, the objectives of a bus stop and the process of determining the location of a stop on a rapid transit line are discussed. An Introduction to Public Transportation is an informative course which will interest students studying civil engineering, transportation engineering and urban planning.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}