{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3689","title":"An Introduction to the ESP32 Web Server","totalEnrolled":"685","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how to use ESP32 to build a simple web server that controls output such as LEDs with this free online course.","description":"The ESP32 board has a Wi-Fi feature that allows it to create its own access point for other devices to join or connect to other Wi-Fi routers. With the utilization of the Wi-Fi feature, you can programme the ESP32 to serve web pages to web clients. This course will show you how to use the Arduino Integrated Development Environment to programme the ESP32 and turn it into a web server that controls outputs such as LEDs.","courseOutcomes":["Explain how to download and install ...","Recall how to download and install t...","Distinguish between a web server and...","Outline the operating modes of ESP32...","Explain how to download and install the Arduino application on your computer","Recall how to download and install the ESP32 package in the Arduino application","Distinguish between a web server and a web client","Outline the operating modes of ESP32","Discuss how to turn an ESP32 into an access point and serve webpages to any connected client","Describe how to build a simple web server with an ESP32 to control outputs such as LEDs","Select the correct General Purpose Input Output for your projects","Explain how to download and install ...","Recall how to download and install t...","Distinguish between a web server and...","Outline the operating modes of ESP32...","Explain how to download and install the Arduino application on your computer","Recall how to download and install the ESP32 package in the Arduino application","Distinguish between a web server and a web client","Outline the operating modes of ESP32","Discuss how to turn an ESP32 into an access point and serve webpages to any connected client","Describe how to build a simple web server with an ESP32 to control outputs such as LEDs","Select the correct General Purpose Input Output for your projects"],"courseDescription":"<p>One microcontroller that can help you control the output display of your electronics project from a webpage is the ESP32 board. One can program the ESP32 microcontroller to act as a web server and deliver webpages to any connected web client. When you connect electronic components such as relays and LEDs to the ESP32, you can program it to act as a webserver and deliver the status of the electronic component to a webpage. Would you like to have the capability to help bring an innovative touch to your electronics projects? This course will show you the step-by-step procedure of creating a simple web server that controls and delivers output status, such as LEDs, from a web page. First, the course will give you an overview of what you will learn and the background of the course creators. This section will also reveal the hardware and software requirements for the course.</p><p>Before learning how to build the ESP32 web server, you will have to set up your coding environment. You will discover how to download and install the Arduino app and its associated drivers on your computer. In addition, you will be shown how to install the ESP32 package on the Arduino application. To kickstart your coding in the Arduino Integrated Development Environment (IDE), you will run codes that scan for available Wi-Fi networks. Next, the course discusses the operating modes of ESP32 and how the ESP32 can serve as a web server. In preparation to build a simple ESP32 web server, we will show you the schematics of how LEDs are connected to the ESP32 board. The programming codes for the simple ESP32 web server are revealed. The course explains the programming codes, including the HTTP request and HTML codes, to successfully execute the ESP32 Web server project. You will identify how the programming codes are uploaded to the ESP32 board through the Arduino IDE. You will be shown how the programming codes make the ESP32 act as a web server and display the status of the LEDs connected to it. As the course winds up, you will learn how to select the correct General Purpose Input Output (GPIOs) for your electronics projects.</p><p>This introductory course on the ESP32 web server will guide you in presenting more innovative electronics projects. You will catch a glimpse of how the ESP32 can make the control of electronics via the internet possible. Controlling devices or components via the internet is no longer a new development. It has been evolving through technology associated with the Internet of Things (IoT). The ESP32 is one of the technologies setting the path to controlling devices via the internet. Its Soft Access Point operating mode can create a network and allow other devices to connect and access webpages. Suppose you have a project that requires you to control an electronic component and access its status from anywhere. In that case, the ESP32 web server might just be what you're looking for. If you want to get a head-start on how you can control devices from anywhere, this course is designed for you. Start this course today and become inspired to make your electronics projects more creative.</p><a href=\"https://alison.com/resume/courses/3689\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3689\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The ESP32 Web Server","description":"This module, The ESP32 Web Server, describes how an ESP32 can be turned into an access point and made to serve webpages to connect clients, with an example of how to build a simple web server, using an ESP32, to control outputs such as LEDs.","topics":["The ESP32 Web Server - Learning Outcomes","Introduction to ESP32 Web Server Course","Setting up Arduino Coding Environment","ESP32 as a Web Server","Coding for ESP32 Web Server","The ESP32 Web Server - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to the ESP32 Web Server - Course Assessment"]}]}