{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3079","title":"An Introduction to Technical Drawing","totalEnrolled":"9,204","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A background in technical drawing and the apparatuses it uses is a solid grounding for many engineering fields.","description":"In this course you will learn the basics to all technical drawing for all engineering professions. Discover the instruments and equipment used as well as the fundamentals of dimensions and the uniform standard for all technical drawing. This free material is for anyone interested in expanding their current foundational understanding and novice knowledge of technical drawing.","courseOutcomes":["Discuss the standards of technical d...","List the apparatus used in technical...","Define 'dimensions' ...","Recall the basics of engineering dim...","Discuss the standards of technical drawing","List the apparatus used in technical drawing","Define 'dimensions'","Recall the basics of engineering dimensions","Identify special issues of dimensions","Describe 'tolerances'","Discuss the standards of technical d...","List the apparatus used in technical...","Define 'dimensions' ...","Recall the basics of engineering dim...","Discuss the standards of technical drawing","List the apparatus used in technical drawing","Define 'dimensions'","Recall the basics of engineering dimensions","Identify special issues of dimensions","Describe 'tolerances'"],"courseDescription":"<p>‘An Introduction to Technical Drawing’ is an entry-level course on the fundamentals of technical drawing used in all forms of engineering such as electrical, industrial, mechanical and civil. It is a short briefing on the basics of drawing, the instruments involved and the proper use of dimensions. First, it explains the various types of engineering fields and their distinctions. It quickly moves onto what technical drawing is and the methods used to represent ideas and designs. You will learn to distinguish between artistic expression and engineering drawing, and discover how large a role technical drawing plays in manufacturing and industry. You will examine the equipment needed to successfully proceed in this career.</p><p>After discussing the different instruments, apparatus and equipment needed for optimal drawing, you will break down each of their uses and characteristics, including learning about the variables of drawing sheets such as their designations and dimensions. Compare different drawing boards, drafters, T-squares, set squares, protractors, compasses, dividers, and French curves as well as different grades of pencil and lead sticks. Defining the standard letter style and heights is a basic skill that is uniformly used within all engineering professions. The reason for this is that the size of the text divulges what the text is; for example, size 3 (mm) corresponds to legends and schedules. After this meticulous breakdown of the basics, you will be taught the standards of technical drawing specified by different organizations with the same purpose. Begin by recognizing the standard of the drawing sheet layout, which includes its borders, margins, reference grid system and revision tables. Finally, you will look at dimensions and all that they involve.</p><p>Dimensions, as the largest topic of the course, will be discussed at length. Dimensions, having a wide range of variations, is a larger study area than many assume. Within technical drawing, you need to distinguish between the units of dimensions and how to use dimensions with angles. You will compare the features of dimensions and have an understanding of what is called ‘tolerances’, an interesting section based on the margin of error. This is a very important aspect for manufacturers, designers and engineers to understand. This course is a great basic introduction for anyone looking into engineering as a profession and who would like to learn the foundations of technical drawing, which is a fundamental section of engineering.</p><a href=\"https://alison.com/resume/courses/3079\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3079\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Drawing and Dimensions","description":"In this module, Drawing and Dimensions, you will learn to distinguish between different drawing instruments and accessories as well as learn their functions and uses. You will discover dimension units and the different angles and circumstances where dimensioning is used.","topics":["Drawing and Dimensions - Learning Outcomes","Introduction to Engineering Drawing","Drawing Instruments and Accessories","Dimension and Sheet Layout","Dimension Units and Angles","Direct Dimensioning Situations","Features and Tolerance","Drawing and Dimensions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to Technical Drawing - Final Assessment"]}]}