{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3102","title":"An Introduction to Optical Networks","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the exciting world of fiber-optics communication, in this free online course that is ideal for beginners.","description":"This course offers an introduction to optical networking and fiber-optic communications. This is an important and fascinating area of study as optical networks serve as the foundation of our connected society, enabling an information superhighway that delivers the Internet all across the globe. If you are tech-savvy and want to know more about fibre engineering and cabling technology, then this course is for you.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This introductory course on optical networks provides a basic understanding of how fiber networks operate and how they are beneficial to society. An optical network is a communications network where transmission links, made up of optical fibers, and its architecture is designed to maximize the advantages of optical fibers. Optical networks connect computers and or devices that can generate or store data in an electronic form using optical fibers. Unlike copper cables, optical networks offer much greater bandwidth, free of electromagnetic interference and other undesirable effects. The performance of optical communication systems depends on numerous issues such as geographical reach, network configuration and information. Nowadays, storage networks using the fiber channel typically generate data rates in multiples of gigabits per second. As we evolve as a society, the larger the demand is for online connectivity, the greater is the requirement for bandwidth that optical networks provide. This course will introduce you to the different layers of an optical network and the different network topologies, providing you with information on the different interconnected structures of a local network and the method of connectivity employed.</p><p>Next, this course will highlight the SONET frame structure, as well as look at the standardization and deployment of SONET (in the USA) and SDH (synchronous digital hierarchy) networks (in Europe and Japan) and its purpose. The emergence of second-generation networks is considered a new level in a layered network model - known as the optical layer - and is used by SONET and IP (Internet protocol) network components. You will learn how optical interconnects are used to address current and forthcoming needs for the transfer of large data volumes, in an ever-growing data centre. You will also be taught about the fronthaul network, the common public radio interface, and why the wireless community needs to agree on a standardized universally accepted source. Those taking this course will gain an in-depth understanding of the functions of an optical network and how this may be implemented. You will gain insight into how an optical network can work together with IP-based network infrastructure, to ensure both high reliability and performance. Additionally, you will obtain a greater understanding of why network protection is essential and how you can secure your network to overcome disruptions like fiber cuts, and delay of service or interruptions due to catastrophic events like flooding or fire.</p><p>Finally, optical networks support a wide range of communication services including domestic, business and portable services. This course is suited for individuals who are responsible for ensuring business continuity by learning how to perform maintenance work on the systems, and knowing how to troubleshoot them to isolate and replace component failures. Fiber optics is a part of our everyday lives, now more than ever, and many people now opt to work from their homes or be homeschooled. Careers in fiber optics can range from hands-on work installing, repairing and or servicing a network to designing new and better ways to create the optical threads that transmit data. If you are interested in a career in engineering, networking, installation or repairing, this course is for you. Why wait? Enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}