{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3041","title":"An Introduction to Solar Energy Engineering","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of solar energy exploitation and radiation geometry in this free solar engineering course.","description":"You will learn about the nature of solar radiation, how the sun’s power reaches the earth and different ways of harnessing and using it. Explore various instruments and devices used in capturing and measuring solar radiation, and study the fundamentals of radiation geometry, how to calculate the solar time of a place and read sun-path diagrams. This course is your gateway to the field of solar energy engineering!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the field of solar energy engineering and its immense importance in today’s world. Renewable power generation is fast gaining prominence, and solar energy is at its heart, being the ultimate source of all energy. Capturing solar energy optimally and understanding how to use it to its maximum capacity in all processes where energy is needed is the intention of solar engineering. You will learn about the complex devices used to collect and store solar energy, both in thermal and electrical forms. Gain an understanding of how solar photovoltaic (PV) generators and solar power plants work. Examples will help you understand how solar equipment designers estimate the amount of energy available and work out how to maximize its use.&nbsp;</p><p>Next, you will explore the relationship between the sun and Earth and understand how solar radiation reaches us from the sun. Delve into the phenomena of atmospheric absorption, ‘scattering’ and the concept of air mass. Gain insight into the various types of radiation, the instruments used to measure solar radiation and basic solar radiation geometry. Get acquainted with the numerous terms and definitions of radiation geometry, particularly the different angles and mathematical expressions used in these calculations. Next, see how to record sunshine duration, how to obtain radiation data and where it is applied. Finally, learn how to calculate the ‘solar time’ of a place and read sun-path diagrams.</p><p>Anyone familiar with high-school-level physics and mathematics can take this course. It will help you assess your interest in the absorbing subject of renewable energy and effectively provides an in-depth study of solar energy engineering and technology. It will introduce you to the concepts and definitions associated with solar radiation measurement and capture energy physics in general. Thus, this course will be helpful not only to students who wish to pursue a career in solar energy technology but also those interested in energy management and technology, renewable energy studies, architecture and town planning. As the need for sustainable energy increases, well-educated energy engineers and technicians will become even more sought-after. Establish a new profession in energy engineering or a related field and be part of the solution to the global energy crisis. Enrol now and embrace this opportunity to start developing your understanding of the sun’s radiation and the technology around it.&nbsp;</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}