{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2870","title":"Analysis of Resonant Circuits and Three-Phase Circuits","totalEnrolled":"228","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about resonant circuits, bandwidth/quality factors, and three-phase circuit analysis in this free online course.","description":"Three-phase electric power is a common method of alternating current electric power generation, transmission and distribution. Analysis of Resonant Circuits and Three-Phase Circuits is a free online course that offers a comprehensive guide to understanding phenomena of resonance. This covers communications along with an analysis of three-phase systems and power measurement methods. What are you waiting for? Begin your next learning journey now!","courseOutcomes":["Discuss the resonance condition in t...","Analyze the resonance condition in p...","Outline the importance of resonance ...","Define the bandwidth and quality fac...","Discuss the resonance condition in the series circuits","Analyze the resonance condition in parallel circuits","Outline the importance of resonance in the field of communications","Define the bandwidth and quality factor in resonance","Analyze the generation of three-phase voltages in an alternator","Distinguish between the types of three-phase systems","Explain the phase sequence indicator","Contrast star and delta connections","Analyze power factor measurement in a three-phase circuit","Distinguish between balanced and unbalanced three-phase loads","Discuss the resonance condition in t...","Analyze the resonance condition in p...","Outline the importance of resonance ...","Define the bandwidth and quality fac...","Discuss the resonance condition in the series circuits","Analyze the resonance condition in parallel circuits","Outline the importance of resonance in the field of communications","Define the bandwidth and quality factor in resonance","Analyze the generation of three-phase voltages in an alternator","Distinguish between the types of three-phase systems","Explain the phase sequence indicator","Contrast star and delta connections","Analyze power factor measurement in a three-phase circuit","Distinguish between balanced and unbalanced three-phase loads"],"courseDescription":"<p>Analysis of Resonant Circuits and Three-Phase Circuits is a free online course that provides an extensive guide to learning about the importance of resonance. This involves communication technologies as well as the generation and analysis of three-phase voltages and systems. Such systems are applied in our personal lives and technologies all around us. For instance, chef’s use electromagnetic materials to utilize induction heating through series and parallel resonant circuits. So, next time you go to eat in a fancy restaurant, think about induction heating and resonant circuits! Also, LC circuits are responsible for the easy tuning we enjoy on radio transmitters to desired radio channels we listen to. This course examines the phenomenon of resonance in electrical circuits and three-phase system analysis. It begins with a discussion of the series and parallel RLC (resistor, inductor, capacitor) resonant circuits along with the bandwidth and quality factors. You will learn about how LC circuits behave as electronic resonators in many appliances including contactless cards and security tags.</p><p>Learners will evaluate the various analyses conducted in this course through the theories associated with resonant circuits and their proper practice. You will also evaluate concepts related to quality factor for resonant circuits covering measurements of power, resistance, and capacitance. Next, you will discuss the generation, phase sequence and the advantages of three-phase circuit systems. You will also study how to determine the current and voltage values in Star-Delta circuits. Then, you will analyze three-phase balanced and unbalanced loads as well as the power consumed by them. You will also learn about the derivations of instantaneous power equations and how the issue of low power factor problems can be solved by using capacitors. Furthermore, you will grapple with the use of watt-meters for power measurement. Why miss on all these details relevant to electrical circuits useful to common electronic appliances around us?</p><p>Did you know electricity handles load balancing differently from other conventional balancing techniques in science and engineering? Learn all about the techniques employed for this and the relevance of load factor concepts today! This course will enable you to build on your foundational knowledge of circuit analysis by analyzing resonant circuits and the mechanisms of three-phase systems. You will enjoy complete coverage of these details from functional current generation through networks, charge conveyance, and dissipation into useful power for work. You cannot afford to miss any learning points evaluated in this course. It will be of special interest to electricians, technicians, students and anyone seeking to understand the workings and theories of electrical circuits. It will also be of interest to learners who wish to relate possibilities available in resonant and three-phase circuits. What are you waiting for? Register for this course now in order to begin your next learning journey today!</p><a href=\"https://alison.com/resume/courses/2870\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2870\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Resonant Circuits","description":"Resonance is an important phenomenon in many electrical circuits. The study of resonance is useful, particularly in the area of communications. In this module, you will learn about series and parallel RLC resonant circuits as well as bandwidth and quality factors.","topics":["Resonant Circuits - Learning Outcomes","Series RLC Resonant Circuit","Parallel RLC and Series LC Resonant Circuit","Bandwidth and Quality Factor","Resonant Circuits - Lesson Summary"]},{"name":"Module","details":"Generation of Three Phase AC EMF","description":"Three-phase electric power is a common method of alternating current electric power generation, transmission, and distribution. It is a type of polyphase circuit and it is the most common method used by grids worldwide to transfer power. This module will discuss the generation, the phase sequence, and the advantages of three-phase circuit systems.","topics":["Generation of Three-Phase AC EMF - Learning Outcomes","Generation of Three-Phase Voltages","Phase Sequence","Star and Delta Networks","Generation of Three-Phase AC EMF - Lesson Summary"]},{"name":"Module","details":"Analysis of Three Phase Circuits","description":"To meet the required demand, three-phase power is generated and distributed. Normally, in industries, electrical motors consume three-phase power. This module imparts knowledge on the analysis of three-phase balanced and unbalanced loads as well as the power consumed by three-phase balanced and unbalanced loads. You will also learn about watt meters for power measurement.","topics":["Analysis of Three-Phase Circuits - Learning Outcomes","Balanced and Unbalanced Load","Power Factor","Power Factor of a Balanced Load","Analysis of Three-Phase Circuits - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Analysis of Resonant Circuits and Three-Phase Circuits - Course Assessment"]}]}