{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2023","title":"Analysis of Solar Photovoltaic Devices","totalEnrolled":"2,269","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the analysis of solar photovoltaic devices in the dark and under light with this free online course.","description":"This free online solar photovoltaic devices course introduces you to the basics of P-N junctions, and the various characteristics of P-N junctions. Start this course today and you will learn about P-N junction analysis in dark and P-N junction analysis under illumination or light, as well as circuit representation of solar cells, the evolution of solar PV technologies, design considerations in solar PV technologies, and reducing parasitic losses.","courseOutcomes":["Identify the differences between P-t...","Discuss the analysis of P-N junction...","Examine the basic equations and assu...","Identify the minority carrier equati...","Identify the differences between P-type ans N-type semi-conductors","Discuss the analysis of P-N junctions in the dark","Examine the basic equations and assumptions in the quantitative treatment of P-N junctions","Identify the minority carrier equation and the total current in a P-N junction","Examine the I-V characteristics of a P-N junction","Identify the depletion regions of P-N junctions in dark and in light","Discuss a detailed analysis of P-N junctions in light or under illumination","Examine the three evolution of solar PV technologies","Identify the primary forms in which silicon is usually presented: mono silicon, poly silicon and amorphous silicon","Identify the differences between P-t...","Discuss the analysis of P-N junction...","Examine the basic equations and assu...","Identify the minority carrier equati...","Identify the differences between P-type ans N-type semi-conductors","Discuss the analysis of P-N junctions in the dark","Examine the basic equations and assumptions in the quantitative treatment of P-N junctions","Identify the minority carrier equation and the total current in a P-N junction","Examine the I-V characteristics of a P-N junction","Identify the depletion regions of P-N junctions in dark and in light","Discuss a detailed analysis of P-N junctions in light or under illumination","Examine the three evolution of solar PV technologies","Identify the primary forms in which silicon is usually presented: mono silicon, poly silicon and amorphous silicon"],"courseDescription":"<p>This free online course will introduce you to the basics solar photovoltaic devices both in the dark and under illumination or light. The course begins by introducing you to P-N junctions and their characteristics. You'll learn about the effects of bias on P-N junctions, as well as gain an understanding of the dark analysis of P-N junctions, the change in the curvature of the carrier density and the change in potential in P-N junctions.</p><p>Next, the course introduces you to the boundary conditions for P-N junctions, how to combine current yields in P-N junctions, photo-current and efficiency of P-N junctions in special cases, device characteristics, and effects of irradiation. It also teaches you about circuit representation of solar cells, the design considerations in solar PV technologies, how to improve light absorption in P-N junctions, and reducing parasitic losses in P-N junction devices.</p><p>If you are interested in becoming a solar power engineer, or working in the solar power industry then this is the course for you. Start the course today and learn how solar photovoltaic devices function in the dark and under illumination or light.</p><a href=\"https://alison.com/resume/courses/2023\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2023\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Semi-Conductor Junctions","description":"In this module, you will be introduced to the basics of P-N junctions, the characteristics of P-N junctions, and the effects of bias on P-N junctions. You will also be introduced to the Dark analysis of P-N junctions, the change in the curvature of the carrier density and the change in potential.","topics":["Semi-Conductor Junctions - Learning Outcomes","P-N Junction Basics","P-N Junction Characteristics","P-N Junction: Effect of Bias","P-N Junction Analysis (Dark)","Semi-Conductor Junctions - Lesson Summary"]},{"name":"Module","details":"Essential Characteristics of Solar Photovoltaic Devices","description":"In this module, you will be introduced to a basic framework for determining I-V characteristics in light, and conditions of P-N junctions in three regions. You will also be introduced to P-N junction analysis in light, boundary conditions, combining current yields, photo-current and efficiency in special cases, device characteristics, and effects of irradiation.","topics":["Essential Characteristics of Solar Photovoltaic Devices - Learning Outcomes","P-N Junction Analysis (Light) - Part 1","P-N Junction Analysis (Light) - Part 2","Solar Cell Device Parameter","Essential Characteristics of Solar Photovoltaic Devices - Lesson Summary"]},{"name":"Module","details":"First Generation Solar Cells","description":"In this module, you will be introduced to the circuit representation of solar cells, resistance in series, resistance variation, liming efficiency, and effect of bandgap. You will also be introduced to the requirements for an ideal P-V device, quantum efficiency, the discovery of photovoltaic effect, evolution of solar PV technologies, design considerations, how to improve light absorption, and reducing parasitic losses.","topics":["First Generation Solar Cells - Learning Outcomes","Solar Cell Device Parameters","Solar PV Technologies: Introduction","Generation 1 Technologies - Part 1","Generation 1 Technologies - Part 2","First Generation Solar Cells - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Analysis of Solar Photovoltaics Devices - Course Assessment"]}]}