{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3756","title":"AP Chemistry: Chemical and Nuclear Reactions","totalEnrolled":"389","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"To prepare for the AP exam, this course unpacks chemical reactions and bonding plus the properties of acids and bases.","description":"This free online course teaches you the calculation of changes in temperature or pressure of the gas and temperature effects on solubility. You will also learn how the properties of materials can be based on the structure and shape of atoms. Explore how the amount of solute dissolved in a solid can be expressed with gases in a solution and the types of covalent bonds.","courseOutcomes":["Describe the observations that are e...","Identify the chemical equation for a...","List the various types of chemical r...","Analyze whether an ionic compound is...","Describe the observations that are evidence of a chemical reaction","Identify the chemical equation for a chemical reaction and balanced chemical equations","List the various types of chemical reactions and Avogadro's number","Analyze whether an ionic compound is soluble in water based on the solubility rules","Describe the different kinds of chemical bonds and intermolecular forces","Explain the properties of materials based on the structure, shape of atoms and molecules","Describe solution formation, the process of dissolution and temperature effects on solubility","Describe the properties of acids, bases, and acid-base titrations","Explain the difference between Arrhenius and Bronsted-Lowry acids and bases","Identify the acid and base strength, acid/ base dissociation constant","Describe the observations that are e...","Identify the chemical equation for a...","List the various types of chemical r...","Analyze whether an ionic compound is...","Describe the observations that are evidence of a chemical reaction","Identify the chemical equation for a chemical reaction and balanced chemical equations","List the various types of chemical reactions and Avogadro's number","Analyze whether an ionic compound is soluble in water based on the solubility rules","Describe the different kinds of chemical bonds and intermolecular forces","Explain the properties of materials based on the structure, shape of atoms and molecules","Describe solution formation, the process of dissolution and temperature effects on solubility","Describe the properties of acids, bases, and acid-base titrations","Explain the difference between Arrhenius and Bronsted-Lowry acids and bases","Identify the acid and base strength, acid/ base dissociation constant"],"courseDescription":"<p>This is a free online course that provides a comprehensive explanation of how to calculate the molar mass of a substance, among other methods in chemistry. It is important to understand the concept of Avogadro’s number, and how to calculate the number of particles of a substance. Before working with the percentage composition of a compound, you must know the analysis of the empirical formula of the compound. This course takes you through the concept of stoichiometry, the consideration of the balanced chemical equation for the production of water and mass calculations. Explore how the mass of solid silver, molality and molarity analysis can be calculated. Can you use the key properties of a gas, and the calculation of change in the volume or pressure of the gas with Boyle’s law? This course will teach you how to use Charles’s law to change the volume or temperature of the gas.</p><p>If you want to know how to use Gay-Lussac’s law for the calculation of change in the temperature or pressure of the gas, then sign up now. You will be able to explain the concept of vapour pressure and Dalton’s law of partial pressure. Understand the factors that affect vapour pressure, and the ideal gas law (also known as the general gas equation) with examples of problems and their solutions. Do you know there is a significant relationship between intermolecular forces, vapour pressure, boiling point, viscosity, and surface tension? The material explains the properties of liquids, intermolecular forces, properties of solids and the most common intermolecular forces. It specifies how to identify the different kinds of solids/ crystal types based on attractive forces and ionic solids.</p><p>Furthermore, you will learn about the properties of materials based on the structure and shape of atoms. The course takes you through solution formation and the process of dissolution. You will be able to explain the temperature effects on solubility and the types of the covalent bond by electron sharing. You will also learn different types of solutions and how the amount of solute dissolved in solid can be expressed together with gases in solution. Do you know specific processes involved with dissolving sodium chloride (NaCl) in water? This course helps you understand the properties of acids and bases as well as the difference between the Arrhenius equation and the Bronsted-Lowry theory of acids and bases. It details the types of acids and bases as well as neutralization reactions. This free online course will be of interest to students taking the introductory part of Advanced Placement (AP) chemistry. Register for this course now and start your next learning journey today!</p><a href=\"https://alison.com/resume/courses/3756\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3756\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Chemical Reactions","description":"This module teaches you about the observations that are evidence of a chemical reaction and the chemical equation for a chemical reaction. You will also study the various types of chemical reactions and the molar mass of a substance.","topics":["Chemical Reactions - Learning Outcomes","Writing and Balancing Chemical Equations","Molar Mass and Molar Volume","Stoichiometry Concept","Gases and Properties of Gases","Vapour Pressure","Liquids and Solids","Properties of Solids","Chemical Reactions - Lesson Summary"]},{"name":"Module","details":"Introduction to Chemical Bonding","description":"This module teaches you about different kinds of chemical bonds and intermolecular forces. Learn about the properties of materials based on their structure along with the shapes of atoms and molecules. Study solution formation, the process of dissolution and temperature effects on solubility.","topics":["Bonding and Shapes of Molecules - Learning Outcomes","Introduction to Chemical Bonding","Solution Formation and Dissolution","The Process of Dissolving","Bonding and Shapes of Molecules - Lesson Summary"]},{"name":"Module","details":"Acids, Bases and Salts","description":"This module teaches you about the properties of acids, bases and acid-base titrations. Study the difference between Arrhenius and Bronsted-Lowry acids and bases. You will also learn about acid and base strength together with the acid/ base dissociation constant.","topics":["Acid, Bases and Salts - Learning Outcomes","Properties of Acids and Bases","Strengths of Acids and Bases","Acid-Base Indicators","Buffer Solutions","Acids, Bases and Salts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AP Chemistry: Chemical Reactions, Bonding and Substances - Course Assessment"]}]}