{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3755","title":"AP Chemistry: Chemical and Nuclear Reactions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course on nuclear reactions, chemical kinetics, as well as the redox reactions from oxidation numbers.","description":"This course explores how to calculate the rate of disappearance of reactants and the representation of equilibrium constant for reversible reactions. You will learn how the set rules of the oxidation number can be assigned, the concept of chemical equilibrium and equilibrium in the physical process. If you want to understand chemical kinetics, redox equations and nuclear reactions for the AP chemistry exam, this course is for you.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course provides an in-depth understanding of the dynamics of various chemical reactions. Study how to calculate the rate of disappearance of reactants. It is important to understand the prediction of how a rate of a reaction can depend on the concentration of reactants. Before calculating the order of a chemical reaction, it is crucial to recognize the different factors that affect the reaction rate. This course takes you through examples of problems in the rate of reaction, their measurement, as well as the required procedures when the rate is given. It introduces you to the effect of surface area and concentration or pressure on reaction rate. Have you considered the impact of temperature and the influence of catalysts on reaction rate? This course shows you the different ways of determining the rate law or the order of the reaction, as well as how to use the concentration approach.</p><p>If you want to know how to calculate the appearance of products and the effect of surface area on reaction rate, then you should take this course. You will be able to explain the concepts of chemical equilibrium, and equilibrium in the physical process together with equilibrium in a constant expression. Also, this course will help you understand the representation of the equilibrium constant for reversible reactions and equilibrium shifts for gases. Do you know there are factors that affect equilibrium and the oxidation number of an element in a compound? The material also analyzes Le Chatelier’s principle, as well as the effect of concentration on equilibrium and equilibrium constant. It outlines the effect of changing the reactant and product concentration on the direction of the reaction. You will be able to explain how reduction-oxidation reactions and the set rules of the oxidation number can be assigned.</p><p>Furthermore, you will learn about the procedure for balancing redox reactions using the half-reaction or ion-electron. This course takes you through how to predict the spontaneity of redox reactions and the redox and electrode process of values. You will also be able to describe electrolysis, the electrolytic cell and the electrolysis of sodium chloride. Do you know there are special differences between electrolytic cells and voltaic cells? This course helps you understand the schematic of galvanic cells, how to write balanced nuclear equations and the products of nuclear reactions. Explore the properties of the different types of radioactive particles, the concept of half-life, the types of radioactivity and nuclear emissions. This course will be of great interest to students studying chemical kinetics, redox equations and nuclear reactions as well as those preparing for the AP (Advanced Placement) chemistry exams. Register now and start your next learning journey today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}