{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2325","title":"Architecture of Welding and Joining Technologies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Online course about the architectural welding, chemical reactions in welding as well as solidification and cracking.","description":"This free online certification course about architectural welding will teach you about the architecture of welding and joining technologies. The course covers welding metal, chemical reactions, residual stress and distortion in welding. This free online course will teach you the remedies for distortion, solidification and phase transformation in welding. It will also teach you the basic solidification modes, and weld metal nucleation mechanics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online Architecture of Welding and Joining Technologies course will help you understand the structures and design of welding. You will learn about welding metal, the chemical and slag metal reactions, and oxygen and nitrogen processes in welding. This will further lead you to learn about residual stress, distortion and the remedies of distortion. This online training program will also teach you about welding solidification,and the complete diffusion in solids and liquids.</p><p>Next in this free online certification course, you will be introduced to constitutional supercooling in welding solidification and phase transformation. You will learn about solidification, cracking and it's causes during the welding process. This free online training will further teach you about the heat treatment of weld joints and its importance.</p><p>Furthermore, you will learn about the basic solidification modes and cracking as well as weld metal nucleation mechanics. By the end of this study program, you will have a strong understanding and knowledge in Architectural Welding and chemical reactions in welding which will enable you to become a better welder. Join our free learning community and begin this online welding certification course in Architecture of Welding and Joining Technologies.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}