{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3704","title":"Arduino Boards Fusion 360 Guide to 3D Printed Enclosure","totalEnrolled":"554","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master using Fusion 360 to design 3D enclosures for Arduino boards in this free online course.","description":"One of the essential aspects of the modern electronic manufacturing process is the 3D design of enclosures. The 3D design of enclosures has helped speed up the manufacturing process and improve the creativity of enclosure designers. However, to catch up with the growing 3D printing technology, you need to understand how the 3D designs are done. This course guides you on using the Fusion 360 to design 3D printable enclosures for Arduino boards.","courseOutcomes":["Recall how to download and install t...","List the features of the Fusion 360 ...","Explain how to create frames with sp...","State the process of using the chamf...","Recall how to download and install the free Fusion 360 software","List the features of the Fusion 360 application","Explain how to create frames with specific dimensions on Fusion 360","State the process of using the chamfers and extrude tools in the Fusion 360 software","Paraphrase the steps in using the time machine feature to fix errors in the Fusion 360 tool","Discuss how to import 3D models of Arduino into the Fusion 360 application","Describe the process of creating cutouts on a design in Fusion 360","Summarise the method of creating a 3D motion video from the Fusion 360 tool","Recall how to download and install t...","List the features of the Fusion 360 ...","Explain how to create frames with sp...","State the process of using the chamf...","Recall how to download and install the free Fusion 360 software","List the features of the Fusion 360 application","Explain how to create frames with specific dimensions on Fusion 360","State the process of using the chamfers and extrude tools in the Fusion 360 software","Paraphrase the steps in using the time machine feature to fix errors in the Fusion 360 tool","Discuss how to import 3D models of Arduino into the Fusion 360 application","Describe the process of creating cutouts on a design in Fusion 360","Summarise the method of creating a 3D motion video from the Fusion 360 tool"],"courseDescription":"<p>Electronics designers have always faced the challenge of creating a perfect-fit enclosure for their electronics products. Even with the various enclosures in the market, they find it hard to get appropriate enclosures for their products. So, they are left to think of ways to customise enclosures for their products. One unique way to customise enclosures for your electronics products is through 3D printing. It’s an unfolding technology that allows manufacturers to create prototypes or finished products much faster and cheaper than the traditional manufacturing method. With 3D printing technology, designers can develop customised enclosures for their products. This course demonstrates how to design a printable 3D enclosure for Arduino boards using the Fusion 360 software. First, you will learn about the course's objectives and the professional background of the course instructor.</p><p>We will then show you how to download and install the Fusion 360 software, for free, on your computer. In addition to this, you will discover the key features of the Fusion 360 design interface. The program will work through the first step, which involves creating a sketch and designing an outer frame for your 3D printable enclosure for your Arduino UNO board. Then, you will learn how to extrude and split the body of the enclosure. Furthermore, you will discover how to create standing points for the enclosure. The course will teach you how to go back in time to fix any error using the time machine feature of the software. You will learn how to perform the projection and chamfering processes on the enclosure. To ensure the Arduino UNO board fits into the enclosure, we will show you how to import it to the Fusion 360 software to be slotted into the enclosure. We will then make various cutouts to provide space for the Arduino board's pins and ports. The course concludes by following similar steps in designing a 3D enclosure for Arduino UNO to create a 3D enclosure for an Arduino Mega board.</p><p>Manufacturing processes have been simplified through the use of 3D printing. It also gives you the freedom to be more innovative with your products or business branding. Even though 3D printing is in its infant stage, it is already paving ways to manufacture enclosures better. Don't wait to discover how to print in 3D. Start by learning how to design in 3D. The 3D printing of enclosures happens after you complete the 3D design of the enclosure. Let this course guide you through the steps in using Fusion 360 to design 3D enclosures for Arduino boards. If you are in the electronics manufacturing industry or looking to start your career in this industry, this course will set you on the path to designing enclosures that would be a perfect fit for your products. Sign up today and position your brand or product in the marketplace with a perfect enclosure.</p><a href=\"https://alison.com/resume/courses/3704\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3704\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Designing 3D Enclosure for Arduino Boards","description":"In this module, Designing 3D Enclosure for Arduino Boards, you will be shown the systematic process of designing a printed 3D enclosure for an Arduino UNO and Arduino Mega boards using the Fusion 360 software.","topics":["Designing 3D Enclosure for Arduino Boards - Learning Outcomes","Introduction to the Design of Arduino Enclosure Course","Setting up the Fusion 360 Software","Designing an Arduino UNO Enclosure","Designing an Arduino Mega Enclosure","Designing 3D Enclosure for Arduino Boards- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Arduino Boards Fusion 360 Guide to 3D Printed Enclosure - Course Assessment"]}]}