{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4175","title":"Basics of Electricity: Resistance, Inductance & Capacitance","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an understanding of the basic elements of electrical circuits and their behaviour with this free online course.","description":"This course takes you through resistors, capacitors, and inductors which are the three main building blocks of electrical circuits. You will examine these components and their functionality both in series and parallel. The pairing of these components with one another along with their phasor representations and impedance diagrams will be explained. Key terms such as resonance, bandwidth, and the Q factor of circuits will also be defined.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you aware of the three main components of electrical circuits? Do you know what role they play in our homes and workplaces? This course guides you through the main components of electrical circuits: resistors, inductors, and capacitors. An analysis of these components will be carried out in both series and parallel connections. You kick off with an examination of series and parallel circuits. The grouping of series and parallel circuits will also be discussed. Then, the combination of resistors, inductors, and capacitors in AC (alternate current) circuits will be explained. Video illustrations, diagrams, and key formulae will be provided in order to ensure you fully grasp the concepts and develop a solid foundation to build on.</p><p>Moving on, you will be introduced to phasor representation and impedance diagrams of RL and RC series-parallel circuits connected across an AC supply. An explanation of the time constants of RL and RC circuits will also be provided. Computation of the key formulas developed through the various circuit tests carried out will be shown. Along with video illustrations, the course provides detailed tables and procedures to understand RL and RC circuit tests in both series-parallel connections. Next, the RLC circuit will be the focus. Both RLC series and parallel circuits will be discussed along with circuit tests, diagrams, and procedures. The RLC circuit will also be looked at in connection with an AC supply. The key conclusions derived from circuit tests will also be discussed so that the output of those experiments can be learned in detail.</p><p>In the final section, you analyze resonance in series and parallel circuits and their calculations. The derivation of resonant frequency in series-parallel connections will be carried out. Key definitions of bandwidth and quality factors will also be looked at along with diagrams and formulas. The last module takes you through the power factor and the concepts of active and reactive components of power. The derivation of instantaneous power equations of AC circuits will also be provided. Understanding RLC circuits is a key topic for those interested in electrical technology. These rudimentary concepts will enable you to build a solid foundation for further application in both your academic and professional lives. Enroll now in this free online course and begin your journey to mastering the field of electrical fundamentals!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}