{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5250","title":"Basics of Asbestos","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the dangers of asbestos, risk assessments and precaution measures in this free online construction course.","description":"Do you understand the justifications behind the ban on asbestos in the UK? This crucial course introduces you to the different types, properties and history of asbestos in the United Kingdom. We explain why it is so dangerous, the risk factors and its adverse health effects. The Control of Asbestos Regulations 2012 and other asbestos-related legislation is covered. Examine the types of asbestos surveys and how to find competent surveyors.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Asbestos is a naturally occurring fibrous silicate mineral. This course will hone your asbestos-working compliance skills and the required precautions to reduce exposure hazards. We start by looking at the definition and sources of asbestos with how it impacts human health before delving into its main types in the UK, including how to identify it in vehicles, equipment and buildings. Study the concept of asbestos-containing material (ACM) including the difference between ‘pure’ asbestos and ACMs.</p><p>Familiarise yourself with the common types of asbestos materials and the conditions under which various ACMs will release fibres to avoid the risk of exposure. We lay out several materials that are viable alternatives to asbestos. Look deeper into the reasons for and timing of the asbestos ban in UK buildings with why the issue persists today. We discuss the benefits and compensation for asbestos-related diseases and the legislation that aims to protect people in the workplace.</p><p>Finally, we cover the types of asbestos licensing like licensable work and non-licensable work. Learn how to manage asbestos in non-domestic premises and assess the risk in the workplace. We outline the precautions to follow when working with asbestos and the appropriate use of respiratory protective equipment. We will break down the procedures for handling asbestos-containing waste (ACW) disposal, accidental disturbance of ACMs and dealing with emergencies. This course is suitable for those in the construction sector with no prior qualifications or experience required. Enrol and start learning today - for free.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}