{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5589","title":"Basics of Architectural Studies","totalEnrolled":"310","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore ancient and modern architecture and the principles of interior design in this free online architecture course.","description":"Are you fascinated by the design of both old and new buildings? This architecture course examines ancient structures and describes the influences that define them. We lay out building design practices and architectural concepts. We also contrast the Art Deco style of the 20th century with today’s ‘milder’ postmodern buildings. The course also delves into the key principles of interior design. Sign up to learn how buildings are designed.","courseOutcomes":["Discuss the basic principles of arch...","Outline the primary elements of an a...","Identify different architectural sty...","Describe the types of materials and ...","Discuss the basic principles of architectural design","Outline the primary elements of an architectural design","Identify different architectural styles that have evolved through history","Describe the types of materials and finishes that characterise Art Deco-style interiors","Define the term 'Eco-Architecture'","Recall the seven fundamental principles of interior design","Discuss the basic principles of arch...","Outline the primary elements of an a...","Identify different architectural sty...","Describe the types of materials and ...","Discuss the basic principles of architectural design","Outline the primary elements of an architectural design","Identify different architectural styles that have evolved through history","Describe the types of materials and finishes that characterise Art Deco-style interiors","Define the term 'Eco-Architecture'","Recall the seven fundamental principles of interior design"],"courseDescription":"<p>Architecture is an ancient artform that we used to create marvellous structures like the Louvre Pyramid in France and the Beijing National Stadium in China. Training Facility, an online education company, designed this basic architecture course to teach you how buildings are designed, both now and in the past. We begin by exploring the history of architecture and analysing the seven fundamental ideas that form the foundation of an exciting building design.&nbsp;</p><p>The course then discusses the role of ‘concepts’ in architecture as they guide the design process. We also explain how 'movement' relates not only to a structure but also to people’s perceptions of it. We then describe the historical significance and aesthetic qualities of buildings constructed in different eras. The course provides examples of various styles, including chinoiserie, Hindu, Renaissance, Baroque, Art Nouveau and more.</p><p>Our next topic explores the Art Deco architectural style in depth. This style was an aesthetic movement and we show you how to appreciate its structures, interiors and furnishing. We then compare it to its postmodern successors, which are distinguished by asymmetrical compositions and simple adornments. Lastly, the course delves into interior design to explain the guidelines for planning and creating the ideal interior spaces of buildings. This course is a great place to start if you are interested in working in the fields of architecture or interior design. It also suits anyone who is interested in buildings and wants to know how they are designed. Sign up to explore this practical artform and learn how it has influenced our history and future.</p><a href=\"https://alison.com/resume/courses/5589\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5589\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Architectural Studies","description":"This module will define the term architecture and explore interesting historic buildings. We will discuss architectural concepts and architectural styles, analysing the Art Deco Architectural Style in-depth and contrasting it with post-modern structures. We will also explore interior designing - its principles and guidelines.","topics":["Architectural Studies - Learning Outcomes","Introduction to Architecture","Architectural Concepts","Art Deco Architecture","Architectural Studies - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Basics of Architectural Studies"]}]}