{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5144","title":"Basics of Architectural Construction Drawing and Reading","totalEnrolled":"3,795","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Grasp the basics of structural blueprints with this free course that teaches you to interpret architectural drawings.","description":"To advance in the construction sector, you must be able to read and execute blueprints because a precise plan shows how everything should go together and mistakes can be costly and dangerous. Find out about foundations, such as the plinth, ground floor shuttering, and reinforcements. After this course, you'll be able to understand architectural designs and use software programmes for managing measurements and structural analytics, such as ETABS.","courseOutcomes":["Identify the fundamental features of...","State the importance of architectura...","Describe the main aspects of a groun...","Outline the structural data for cons...","Identify the fundamental features of housing foundation plans","State the importance of architectural plans as construction guidelines","Describe the main aspects of a ground-floor housing plan","Outline the structural data for constructing columns, footings, and reinforcements","Recognise the blueprints for the floor, section, and house elevation","Explain the characteristics of structural home drawings","Understand Vastu shastra architectural principles","Recall the minimum sizing and basic rules for rooms and beams","Discuss the benefits of using ETABS for structural analysis","Summarise the advantages of employing Excel sheets to make structural calculations","Identify the fundamental features of...","State the importance of architectura...","Describe the main aspects of a groun...","Outline the structural data for cons...","Identify the fundamental features of housing foundation plans","State the importance of architectural plans as construction guidelines","Describe the main aspects of a ground-floor housing plan","Outline the structural data for constructing columns, footings, and reinforcements","Recognise the blueprints for the floor, section, and house elevation","Explain the characteristics of structural home drawings","Understand Vastu shastra architectural principles","Recall the minimum sizing and basic rules for rooms and beams","Discuss the benefits of using ETABS for structural analysis","Summarise the advantages of employing Excel sheets to make structural calculations"],"courseDescription":"<p>When you build something, you need detailed drawings to show you how everything should fit together. Without architectural knowledge, you may feel perplexed the first time you open a building plan. We've created a tutorial for deciphering architectural drawings. Imagine if you could understand the architect's ideas. Maybe you could start thinking like a civil engineer or even be in a builder's shoes when comprehending the roofs, floors, and other facilities' designs. Anyone who takes this class will learn the basics of reading construction drawings.</p><p>Understanding blueprints is vital to moving up in the construction industry. This knowledge will make you more valuable and give you access to new opportunities. This course makes this path easier by dividing the learning process into two modules. The first teaches you how to read house plans, and the second instructs you about architecture so you can understand planning ideas, measurements, and building designs.</p><p>You'll learn to interpret building designs at the end of these lectures, and grasp key structural elements using practical examples. You'll also be able to recognise well-designed columns. Study the foundations, like the plinth, beam shuttering, and slab reinforcements. By enrolling in and completing this course, you will gain knowledge with helpful software tools for calculations and analytics like Excel and ETABS. Plans are the backbone of the construction company. Do not miss the chance to gather knowledge that might gain you a promotion. Learn the plans, build your future, or even design your own house. The material also unpacks Vastu shastra, a traditional Indian system of architecture that has guidelines on spatial geometry, layout, space arrangement and more.&nbsp; Enrol now!</p><a href=\"https://alison.com/resume/courses/5144\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5144\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Interpreting House Building Plans","description":"This module teaches architectural plan interpretation. Start by understanding the blueprint design and the construction details. Then, study the structural drawing by exploring various house plans. Finish the lecture after learning about column sizes, types, and foundation essentials, including shuttering, slab, and plinth beam arrangement.","topics":["Interpreting House Building Plans - Learning Outcomes","Fundamentals of Reading Architectural Plans","Understanding Residential Designs","Grasping the Basics of House Planning","Comprehending Structural Formations","Explaining the Column Construction","Understanding the Housing Foundations","Interpreting House Building Plans - Lesson Summary"]},{"name":"Module","details":"Explaining Architectural Dimensions","description":"This module introduces Vastu home planning and the essential thumb principles for building and measuring. You'll see how to use ETABS to analyse building models. Also, the class ends with examples of Excel sheets used to figure out things like footings, columns, and beams in structural design.","topics":["Explaining Architectural Dimensions - Learning Outcomes","Knowing the Vastu Shastra Architectural System","Understanding the Structural Measurements","Grasping the ETABS Software Analytical Tools","Using Excel to Assess Structural Calculations","Explaining Architectural Dimensions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Architectural Construction Drawing and Reading - Course Assessment"]}]}