{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5172","title":"Basics of Construction Project Planning","totalEnrolled":"1,829","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to assess project baseline schedules, material and manpower requirements.","description":"‘Project planning’ describes the creation of a framework for the execution, monitoring and control of projects and is a critical phase that takes much time if done manually. Project planning is inherently uncertain because it occurs before work begins. Specific methods are required to estimate required resources and the cost of each activity to gauge total project cost. This course explains how to apply these skills in the construction industry.","courseOutcomes":["Outline the concept of project plann...","Identify the scope and nature of a c...","Explain how to compare start-to-star...","Describe the process of preparing a ...","Outline the concept of project planning and scheduling","Identify the scope and nature of a construction project","Explain how to compare start-to-start and finish-to-start links","Describe the process of preparing a baseline schedule","Discuss the procedure for preparing monthly quantities and invoices","State the procedure for preparing the average cost rate for the project","List the steps involved in preparing bulk materials quantities","Recognise the method of calculating coefficients","Outline the concept of project plann...","Identify the scope and nature of a c...","Explain how to compare start-to-star...","Describe the process of preparing a ...","Outline the concept of project planning and scheduling","Identify the scope and nature of a construction project","Explain how to compare start-to-start and finish-to-start links","Describe the process of preparing a baseline schedule","Discuss the procedure for preparing monthly quantities and invoices","State the procedure for preparing the average cost rate for the project","List the steps involved in preparing bulk materials quantities","Recognise the method of calculating coefficients"],"courseDescription":"<p>Construction projects are never simple and require careful planning to establish their overall direction. A project plan is a collection of documents that can evolve throughout a project. To plan any project successfully, you must first understand the fundamental concept of planning. This project management course lays out the crucial steps of the process of the project planning and scheduling process. We begin with a definition of ‘planning’ and an examination of the requirements of the planning process.</p><p>The course then explains how to determine the scope and nature of construction projects and emphasises the importance of project scheduling. Once established and agreed upon, the project schedule is referred to as the ‘baseline schedule’. We outline how to prepare and complete a baseline schedule for substructure and superstructure construction works.</p><p>We go through a number of tools designed to monitor progress on projects, starting with the ‘Bill Of Quantities’ (BoQ) used to measure the monthly quantities of material required to complete construction. We then explain how to calculate the monthly cost rate and prepare an invoice. The course covers the process of estimating bulk material quantities for specific activities as calculating the correct coefficients for PCC, concrete, plastering and flooring works is critical. Our final sections address labour and lay out the procedures for determining how many workers are required for each phase of the construction project. Sign up to learn how to apply project planning and management principles to the field of construction.</p><a href=\"https://alison.com/resume/courses/5172\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5172\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Project Baseline Schedule and Monthly Quantities","description":"This module provides an overview of the project planning and scheduling process. You will discover how to create a baseline schedule and plan the monthly quantity for a construction project.","topics":["Project Baseline Schedule and Monthly Quantities - Learning Outcomes","Introduction to Project Planning and Scheduling","Preparing Project Baseline Schedule","Preparing the Monthly Quantities","Project Baseline Schedule and Monthly Quantities - Lesson Summary"]},{"name":"Module","details":"Project Invoice, Bulk Material and Manpower Requirements","description":"This module will teach you how to create monthly invoices for construction projects. You will also learn how to calculate bulk material requirements and the number of workforces required for the project's various phases and activities.","topics":["Project Invoice, Bulk Material & Manpower - Learning Outcomes","Completing the Monthly Quantities and Invoice Cost","Preparing Bulk Material Requirements","Bulk Material and Manpower Requirements","Project Invoice, Bulk Material & Manpower - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Construction Project Planning - Course Assessment"]}]}