{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5429","title":"Basics of Building Information Modelling (BIM)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use building information modelling (BIM) to plan and manage projects in this free online BIM course.","description":"Building information management (BIM) is used to showcase prototypes and digital designs of buildings, locations and their functional characteristics. To provide a comprehensive view of a building's life cycle, BIM employs advanced technologies such as 3D modelling, data analytics and collaboration tools. It is through this process that potential design flaws can be visualised before they consume engineering and construction resources.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Building information modelling (BIM) is a technology-based method of managing information in the architecture, engineering and construction industries. BIM enables project teams to collaborate, share information and track project costs through the use of digital tools, making project management much easier and more standardised. This course teaches you the concepts of BIM and explains how it is used in design, construction and architecture. We begin with an overview of BIM as we outline its history and benefits and compare it to computer-aided design (CAD). We then examine various models of BIM.</p><p>The implementation of BIM requires extensive planning and preparation as change must be implemented in stages supported by meticulous planning and execution. We trace the phases of BIM implementation and describe the various BIM software and tools used in the construction industry for building and infrastructure planning, design and management. We show you how project owners can significantly benefit from this process and discuss BIM’s benefits for facility managers. The course demonstrates the application of BIM and its various aspects in architecture, engineering, construction and design.</p><p>The future of BIM is to use the model at all stages to improve collaboration. The use of end-to-end models via cloud technology will be more important in the future of BIM. This course provides a glimpse into the future of BIM and explores its current trends and challenges. Implementing BIM in the construction process improves project outcomes and increases customer satisfaction. BIM is an essential tool for the construction industry's growth and success in the digital age. Sign up for this course to learn how BIM aids project management and plays a key role in the construction industry.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}