{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3002","title":"Batteries as Alternative Energy Sources","totalEnrolled":"1,881","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how the chemical energy stored in batteries is converted into electrical current.","description":"This course explores the internal architecture of batteries. We examine the oxidation process and break down various technical terms. We then demonstrate how internal chemical reactions allow cells and batteries to provide direct current. We study lithium batteries and the properties that make them the most popular batteries used today to perform many industrial tasks. This course suits anyone interested in green, renewable energy.","courseOutcomes":["Define the basics associated with ba...","Describe the different parts of the ...","Compare primary and secondary batter...","Analyze the principle of the electro...","Define the basics associated with batteries, their sign conventions and how they work","Describe the different parts of the battery and their functions","Compare primary and secondary batteries","Analyze the principle of the electrochemical series and its relationship to batteries","Explain the standard procedure for testing and comparing batteries","Outline the relevance of ‘C-Rate’ to the test procedure","Analyze the charge and discharge curves together with the polarization curves and their meaning","Compare lithium metal and lithium-ion batteries","Break down the advantages of lithium-ion batteries over lithium metal batteries","Discuss the concepts of ‘plating’ and ‘pickling’","Define the basics associated with ba...","Describe the different parts of the ...","Compare primary and secondary batter...","Analyze the principle of the electro...","Define the basics associated with batteries, their sign conventions and how they work","Describe the different parts of the battery and their functions","Compare primary and secondary batteries","Analyze the principle of the electrochemical series and its relationship to batteries","Explain the standard procedure for testing and comparing batteries","Outline the relevance of ‘C-Rate’ to the test procedure","Analyze the charge and discharge curves together with the polarization curves and their meaning","Compare lithium metal and lithium-ion batteries","Break down the advantages of lithium-ion batteries over lithium metal batteries","Discuss the concepts of ‘plating’ and ‘pickling’"],"courseDescription":"<p>This free course covers the basics of batteries, which are devices consisting of multiple electrochemical cells that create electrical current from stored chemical energy. This course demonstrates that batteries are so much more and can be an alternative option for energy sources and may wean people off fossil fuels. We also go over battery sign conventions and how they work. The first part of the course focuses on the different parts of the battery: a positive electrode (or ‘cathode’), a negative electrode (or ‘anode’) and electrolytes that allow ions to move between the two to allow current to flow out of the battery. We also compare non-rechargeable ‘primary’ to rechargeable ‘secondary’ batteries and examine the electrochemical series called ‘reduction-oxidation’.</p><p>The course then delves into the standard procedure for testing and comparing batteries and the relevance of C-Rate to the test procedure. We explain a constant that is created by manufacturers and depends on the milliamp-hours specified in the battery. This constant is used to pinpoint how much a battery should be charged without damaging it. We study charge and discharge curves, which describe the behaviour of battery voltage with respect to time in hours of charge or discharge at normal rates. Then come polarization curves, which show the interdependence between the potential of the electrode and current intensity and its significance with respect to battery technology. The course then moves on to newer lithium-ion batteries, which use a graphite anode and a cobalt oxide cathode to allow high-capacity densities. Lithium metal batteries facilitate greater energy density and a much higher discharge rate and we break down each in detail. We then establish the advantages of lithium-ion batteries over their lithium metal counterparts.</p><p>Finally, we discuss the concepts of ‘plating’, ‘pickling’ and ‘sandwiching’. We identify various battery types in terms of shape, chemistry and meaning. Batteries can be made from many different materials and minerals: poly-acid, nickel-iron, nickel-cadmium, nickel-metal hydride and lithium-ion batteries, which can be charged without having to be fully discharged. Lithium-ion batteries have high capacity densities and are one of the most commercialized batteries worldwide. There is a wide variety of batteries, from miniature cells used in hearing aids and wristwatches to room-sized versions that provide backup power to telephone exchanges and data centre computers. We analyze batteries from a chemical perspective and list and discuss the advantages and disadvantages of each type. This course is aimed at anyone who wants to research batteries as alternative energy sources. It is particularly useful to those who want to study the improvement of electrochemical conversion processes for the treatment of the possible environmental consequences of waste. We can help anyone who wants to know more about this clean and renewable form of storage and energy creation that can preserve the environment while powering industry.</p><a href=\"https://alison.com/resume/courses/3002\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3002\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Batteries","description":"In this module, you will be introduced to batteries and some of the basics terms associated with them. This will include signs of batteries and how they work. You will learn how batteries play a very critical role in the context of unconventional energy sources. You will learn the types of batteries and the convenience of an energy conversion device. You will learn about battery performance and testing and you will also learn the standard procedure to test a battery.","topics":["Fundamentals of Batteries - Learning Outcomes","Batteries: Fundamental Concepts","Battery Testing and Performance","Charge - Discharge Curves","Lithium-Ion Batteries","Fundamentals of Batteries - Lesson Summary"]},{"name":"Module","details":"Rechargeable and Non-Rechargeable","description":"In this module, you will be introduced to the plating and pickling mechanisms. You will learn about host materials, within which lithium can settle at a potential close to the potential of lithium metal. You will study how a combination of lithium and carbon favours lithium's batteries in terms of organic solvents. Finally, the structure of the different types of batteries will be discussed in detail. You will also study densities of the different batteries.","topics":["Rechargeable and Non-Rechargeable - Learning Outcomes","Structures and Types","Pro and Cons of Types of Batteries","Rechargeable and Non-Rechargeable - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Rechargeable and Non-Rechargeable  - Course assessment"]}]}