{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3638","title":"Biointerface Engineering: Protein Aggregation and Biomaterials","totalEnrolled":"624","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This foundational course explains protein aggregation and important biomaterials as a crucial part of healing.","description":"Injuries occur from time to time, and the body has natural mechanisms for preventing or stopping bleeding and healing the wound. In this free online course, you will discover protein aggregation, which is crucial in forming a fibrin plug that covers and protects the wound from bacteria. Start this interesting course today and learn more about biointerface engineering!","courseOutcomes":["Explain the methods used in the char...","Describe the effects of surfaces on ...","Identify the various therapeutic sol...","State the functions of a cell membra...","Explain the methods used in the characterisation of protein aggregation","Describe the effects of surfaces on the aggregation of proteins","Identify the various therapeutic solutions applied to the protein aggregation process","State the functions of a cell membrane in cell-surface interactions","Summarise the sequence of the natural responses of the body to an injury","Outline the methods used in the characterisation of cell adhesion","List the different techniques used for assessing biocompatibility","Explain the methods used in the char...","Describe the effects of surfaces on ...","Identify the various therapeutic sol...","State the functions of a cell membra...","Explain the methods used in the characterisation of protein aggregation","Describe the effects of surfaces on the aggregation of proteins","Identify the various therapeutic solutions applied to the protein aggregation process","State the functions of a cell membrane in cell-surface interactions","Summarise the sequence of the natural responses of the body to an injury","Outline the methods used in the characterisation of cell adhesion","List the different techniques used for assessing biocompatibility"],"courseDescription":"<p>Biointerface engineering is an essential part of medical research into new treatments, cures and vaccines. In this course, you will learn about biointerface engineering with a focus on protein aggregation and biomaterials, analysing their role in the medical world. Firstly, you are introduced to the processes involved in forming protein aggregates and its effects. You will discover the methods used to characterise protein aggregation and the factors that affect it. Then, study the kinetics of protein aggregation, its various pathways, and the aggregation process in bulk. After that, explore the process on surfaces, followed by how to determine the rate of aggregation. The effects of surfaces on the aggregation of proteins is discussed using the insulin model protein example. The concept of modified surfaces is introduced, and the wettability of surfaces with mono and mixed self-assembled monolayers (SAMs) is explained.</p><p>Study the effect of surface roughness on adsorption and the therapeutic solution to the protein aggregation process. Learn about host responses to biomaterials where surface-biomolecular interactions, host cell response and hemostasis are explained in detail. The sequence of reactions that occur when the body detects an injury or intrusion by a foreign object will be examined. You will also discover the application of inflammation mediators while exploring the factors that affect the cell-surface interactions. Cell adhesion, a critical part of the wound-healing process, will be introduced, and you will study how it works. The phenomenon of cell adhesion kinetics will also be examined. Lastly, you will be introduced to biocompatibility, the different classes of biomaterials, and the techniques for assessing biocompatibility. The characteristic of cytotoxicity will be contrasted to that of cytocompatibility as the various biological responses are uncovered. Though these topics and terminologies seem complex, they will be related systematically using examples that relate to your experiences in the real world.</p><p>The importance of biointerface engineering in biomedical research cannot be overemphasised. This course is designed for practising and aspiring medical research, diagnostics, and pharmacology professionals. It is also intended to benefit those in the world of academia, including lecturers, tutors and research fellows. If you are a medical practitioner, a nurse, a clinical officer, or laboratory assistant, you will find this course refreshing as you grow your knowledge base and relate it with your work experiences. The knowledge gained will reinforce the skills you already have and build a formidable résumé when coupled with your work experience. If you are a medical student or an aspiring professional in any of the fields mentioned above, this course will build a solid foundation for your future career. You can register for free, today.</p><a href=\"https://alison.com/resume/courses/3638\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3638\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Protein Aggregation","description":"This module will introduce you to the process of protein aggregation, the methods used in the characterisation of protein aggregation, and the kinetics of protein aggregation. You will also learn about the effect of surfaces on the aggregation of proteins.","topics":["Aggregation of Proteins - Learning Outcomes","Aggregation of Proteins","Kinetics of Protein Aggregation","Effect of Surfaces on the Aggregation of Protein","Protein Aggregation - Lesson Summary"]},{"name":"Module","details":"Cell-Surface Interactions","description":"In this module, you will learn about host responses to biomaterials, including surface-biomolecules interactions, host cell response, and the hemostasis process. You will also study the cell adhesion process and biocompatibility of biomaterials.","topics":["Cell-Surface Interactions - Learning Outcomes","Host Responses to Biomaterials","Cell Adhesion","Biocompatibility of Biomaterials","Cell-Surface Interactions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Biointerface Engineering: Protein Aggregation and Biomaterials - Course Assessment"]}]}