{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3636","title":"Biointerface Engineering: Intermolecular Forces and Surface Interactions","totalEnrolled":"160","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course explains intermolecular forces, adhesion of cells and adsorption of proteins in the healing process.","description":"Cuts, bruises and minor injuries occur occasionally, and they usually heal naturally in time. Have you ever wondered how the healing process works? In this free online course, you will learn about the adhesion of body cells, which helps stop bleeding and form protective tissues around the injury. You will also study intermolecular forces, the adsorption of proteins, and their role in our lives. Begin this exciting biointerface engineering course","courseOutcomes":["Outline the historical development o...","List the various categories of inter...","Describe the relationship between we...","Explain the methods used in the meas...","Outline the historical development of theories about intermolecular forces","List the various categories of intermolecular forces","Describe the relationship between wettability and contact angles","Explain the methods used in the measurement of surface tension of liquids and solids","Compute the work of adhesion and contact angles of liquids and solids","Identify the methods used in the measurement of adsorbed proteins","Discuss the competitive adsorption phenomenon and the Vroman effect","Outline the historical development o...","List the various categories of inter...","Describe the relationship between we...","Explain the methods used in the meas...","Outline the historical development of theories about intermolecular forces","List the various categories of intermolecular forces","Describe the relationship between wettability and contact angles","Explain the methods used in the measurement of surface tension of liquids and solids","Compute the work of adhesion and contact angles of liquids and solids","Identify the methods used in the measurement of adsorbed proteins","Discuss the competitive adsorption phenomenon and the Vroman effect"],"courseDescription":"<p>Scientists invest a lot of time and effort in coming up with cures or vaccines for diseases. Many experiments, trials and tests are carried out in this regard. At the core of this research process is the little-known discipline of biointerface engineering. In this course, you learn about this fascinating subject and its role in improving human lives. Firstly, study the fundamentals of intermolecular forces, the four forces of nature and the classification of these energies and pair potentials. After that, you will learn about the basics of thermodynamics, the strength of interactions and the hydrophobic effect. These form a solid foundation for the subsequent lessons, and they influence the natural environment. Have you ever wondered how spiders and other organisms can walk on water? You will get to understand how that happens as you learn about surface energy, surface tension, and surfaces’ wettability characteristics. These are closely related to adhesion, cohesion, and interfacial energy thermodynamics, which will be explained in detail.</p><p>Next, you will discover the various ways of measuring surface tension in liquids and solids. Then, study the solid-liquid interface and the techniques used to measure the contact angles formed when a drop of a liquid comes into contact with a solid surface. In addition, find out how to determine the contact angle of a finely divided powder and learn about the two types of contact angles. This will prepare you for the next module on protein-surface interactions. Proteins are commonly known as the building blocks of life, and this section takes you through their components and role in the human body. Then, the factors that affect protein stability are elaborated on, followed by the methods to measure adsorbed proteins, and their advantages and disadvantages. Lastly, you are taken through the kinetics of protein adsorption, where you study the step-by-step procedure of the process. The phenomenon of intramolecular rearrangements will be presented before the final aspect of competitive adsorption, and the Vroman effect is explained.</p><p>Knowledge in biointerface engineering plays a pivotal role in medical research, diagnostics and development of new medicines and vaccines. If you are a medical practitioner, biomedical researcher, or clinician, you will find this course fascinating, and you will easily relate to the concepts and ideas presented as you enrich and refresh your knowledge. This course will also be helpful to nurses, pharmacists, medical officers, and clinical officers who would like to expand their knowledge of medical research. If you are a medical student or are aspiring to join one of these professions in the future, this course forms a firm foundation for your career, and you will find it exciting and fulfilling. The demand for solutions to emerging public health problems is ever-growing, especially with the proliferation of new infectious illnesses putting millions of lives at risk worldwide. Therefore, taking this course is imperative to joining the medical research and pharmacological fraternity to help save humanity. So do not hesitate, register today!</p><a href=\"https://alison.com/resume/courses/3636\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3636\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Intermolecular Forces","description":"This module will introduce you to the four forces of nature, including electromagnetic and gravitational interactions. You will also study the classification and thermodynamics of intermolecular forces.","topics":["Intermolecular Forces - Learning Outcomes","Introduction to Intermolecular Forces","Classification of Intermolecular Forces","Thermodynamics Aspects of Intermolecular Forces","Intermolecular Forces - Lesson Summary"]},{"name":"Module","details":"Adhesion and Wetting Phenomena","description":"In this module, you will learn about surface energy, surface tension and the wettability of surfaces. Also, you will study adhesion, cohesion, and see some typical examples of adhesion in biological systems.","topics":["Adhesion and Wetting Phenomena - Learning Outcomes","Surface Tension and Energy","Wettability Phenomenon","Adhesion and Cohesion","Adhesion and Wetting Phenomena - Lesson Summary"]},{"name":"Module","details":"Methods of Measurement","description":"This module will introduce you to the various methods of measuring the surface tension of liquids and solids. You will also learn the techniques used in determining the contact angle of liquids and finely divided powder.","topics":["Methods of Measurement - Learning Outcomes","Methods for Surface Tension Measurement","Methods for Contact Angle Measurement","Determination of Surface Tension of Solids","Methods of Measurement - Lesson Summary"]},{"name":"Module","details":"Protein-Surface Interactions","description":"In this module, you will learn about the basic structure of proteins and the factors that affect protein stability. You will also study the methods used to measure adsorbed protein and the kinetics of protein adsorption.","topics":["Protein-Surface Interactions - Learning Outcomes","Protein Adsorption","Characterization of Protein Adsorption","Kinetics of Protein Adsorption","Protein-Surface Interactions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Intermolecular Forces and Surface Interactions -  Course Assessment"]}]}