{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3640","title":"Biointerface Engineering: Surface Modification and Characterization","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"See how implants are engineered so that their surfaces are compatible with our bodies in this free online course.","description":"Metal implants are invaluable solutions for patients who have sustained fractures or require a dental or hip replacement. Have you ever thought about how the body copes with these non-biological objects? In this biointerface engineering course, learn about the surface modifications that make them compatible with bodily systems, eliminate immune reactions, and prevent the accumulation of harmful bacteria. Start this fascinating course today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Implants are required in certain medical conditions such as fractures, dental injuries, or hip disorders that necessitate replacement procedures. The commonly used materials for implants are metals such as titanium alloys, stainless steel, and alumina (aluminum oxide). These are non-biological and are foreign objects to the body, and thus require particular improvements to make them compatible with the body’s systems. In this course, you learn about the surface modification of materials to make them biocompatible. Firstly, you are introduced to biomaterials, their applications and bio-interfacial interactions. The objectives and approaches of surface modification are examined. After that, study the purpose of surface modifications, their physicochemical properties and the methods and challenges of modifying surfaces. You will also study calcium phosphates and their use in coating titanium alloys with a specific focus on Ti-6Al-4V, an alpha-beta titanium alloy with high specific strength and excellent corrosion resistance. Then learn about cell adhesion and the relationship between surface roughness and wettability.</p><p>Next, study the methods used in the characterisation of surfaces. You will discover the two broad categories of surface characterisation: microscopic and spectroscopic techniques and their respective sub-categories. These processes establish the properties of the material surfaces, such as roughness, hydrophobicity or hydrophilicity, which help design the appropriate surface modifications to suit the intended purpose. For instance, for bodily implants, the materials should minimise bacterial adhesion and possess antifouling properties. After that, you will be introduced to self-assembled monolayers (SAMs), a method of modifying surfaces to make them biocompatible. The process of forming them and the different types of SAMs will be explained. The effect of modification on interface properties is explored. Then, you are taken through the impact of SAMs on bio-interfacial interactions, where you will study the surface functionalisation and modifications of titanium alloys. Finally, learn about the impacts of surface energy, protein adsorption and secondary structure.</p><p>Knowledge of the characterisation and modification of surfaces is crucial in medicine, especially where implants are involved. Implants are primarily used in orthopaedic surgery for bone strengthening, joint replacement surgery, vertebrae replacement, and artificial tooth implants. Heart pacemakers and contraceptive implants are other examples of bodily implants that need to be assessed for biocompatibility and modified to suit the intended purpose. This course is designed for medical professionals, including general practitioners, orthopaedic surgeons, nurses, and medical officers who would like to refresh or upgrade their knowledge and skills. If you are a medical student or aspiring to join a medical practice in the future, then this course is for you. You will find it very interesting and it will form an excellent foundation for your career. So, why wait? Start now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}