{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3416","title":"Bioreactor Design: Fed-Batch and Continuous Bioreactors","totalEnrolled":"395","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to design fed-batch and continuous bioreactors and processes in biotechnology with this free online course.","description":"The bioreactor is the heart of any biochemical process. It contributes significantly to many economic activities such as agriculture, production of antibiotics, bioenergy, and environmental protection. This exciting course will reveal how fed-batch and continuous bioreactors are designed. Training in this interdisciplinary area would benefit many fields of human endeavour. Start learning today and be a part of the journey.","courseOutcomes":["Describe how to design a simple fed-...","Discuss the design of an ideal conti...","Compare the productivity between a b...","Discuss the model for a plug flow re...","Describe how to design a simple fed-batch process","Discuss the design of an ideal continuous stirred tank reactors","Compare the productivity between a batch and a continuous bioreactor","Discuss the model for a plug flow reactor","Explain how to determine the productivity of a chemostat","Describe the relationship between cell density, nutrient, and dilution rate","Describe how to design a simple fed-...","Discuss the design of an ideal conti...","Compare the productivity between a b...","Discuss the model for a plug flow re...","Describe how to design a simple fed-batch process","Discuss the design of an ideal continuous stirred tank reactors","Compare the productivity between a batch and a continuous bioreactor","Discuss the model for a plug flow reactor","Explain how to determine the productivity of a chemostat","Describe the relationship between cell density, nutrient, and dilution rate"],"courseDescription":"<p>The bioreactor is the pith of any biochemical process in which enzymes, microbial, mammalian, or plant cell systems are used for the manufacture of a wide range of useful biological products. The fermentation process can be carried out in batch, fed-batch, or continuous modes of operations. This free online course introduces you to design principles of fed-batch and continuous bioreactors to design an appropriate bioreactor for a particular bioprocess. Do you know what pseudo-state or steady-state means? The definitions of these terms will be covered by the course. Estimate the batch culture time and the final biomass concentration, the final mass of cells in a reactor, and how much cell biomass can be produced annually.</p><p>Next, you will gain knowledge of the basic features of an ideal continuous stirred tank reactor, and a simple schematic representation of a chemostat and turbidostat will be shown. Learn the mathematical model of a continuous stirred tank reactor, and how to determine the productivity of a chemostat and steady-state substrate concentration. The Monod equation will be used to describe the stimulation of growth by the concentration of nutrients, describe the substrate consumption and bacterial growth. The significance of various parameters, the relationship between growth rate and dilution rate will be explained. Compare productivity between a batch and continuous reactors, and describe the model for the plug flow reactor.</p><p>In recent years, bioreactors have received great interest. Bioreactors are the pillars of bioprocessing, supporting the production of biomass and therapeutic products. Those responsible for operating bioreactors must understand the intricacies of their functionality to ensure they can optimize their performance and maximize the bioprocess efficiency. This course will present all aspects that are relevant for an appreciation of all relevant features of bioreactors. By completing this course, you will have crucial skills that would benefit many fields of human endeavour. There is a high demand for qualified and trained engineers in this field, so enrol in this course to build up your skills, and jump-start your career. Start now!</p><a href=\"https://alison.com/resume/courses/3416\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3416\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Design of Fed-Batch Bioreactors","description":"Discover how to design a simple fed-batch process, the advantages of fed-batch reactors, and the objective of running a fed-batch operation. You will be able to determine the reactor volume, product concentration, dilution rate, and amount of biomass and more.","topics":["Design of Fed-Batch Bioreactors - Learning Outcomes","Fed-Batch Cultivation","Fed-Batch Process: Continuation","Fed-Batch Problem","Fed-Batch Reactors Practice Problems","Fed-Batch Reactors Practice Problems 2","Design of Fed-Batch Bioreactors - Lesson Summary"]},{"name":"Module","details":"Design of Continuous Bioreactors","description":"In this module, you will learn how to design ideal continuous stirred tank reactors, and compare the productivity between a batch and continuous bioreactor. The relationship between cell density, nutrient concentration, and dilution rate will be explained.","topics":["Design of Continuous Bioreactors - Learning Outcomes","Design of Continuous Bioreactors","Evalution of Monod`s Kinetic Parameters","Model for Plug Flow Reactor","Design of Continuous Bioreactors Practice Problem","Continuous Bioreactors: problem 2","Design of Continuous Bioreactors - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Bioreactor Design: Fed-Batch and Continuous Bioreactors - Course assessment"]}]}