{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2986","title":"Cargo Refrigeration Plant Systems","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study direct and brine expansion systems as well as precautions for loading cargo in this free online course","description":"This detailed free online course on cargo refrigeration plant systems teaches you about the relationship between the refrigeration cycle and coefficient of performance, as well as the pressure-enthalpy chart. You will learn about the components of direct and indirect expansion systems, and be able to explain the precautions and preparations for handling cargo.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Cargo Refrigeration Plant Systems’ is a free online course that introduces you to the principles of cooling by evaporation and latent heat of evaporation, as well as the relationship between the refrigerant cycle and coefficient of performance. It will familiarize you to the pressure-enthalpy chart in the ideal and non-ideal refrigeration cycle, as well as how the vapour-compression refrigeration cycle works. The main components of the direct expansion system, which include the compressor, oil separator, condenser, filter dryer, thermostatic expansion valve and evaporator, will be covered. You will learn about the functions and operations of the direct and indirect expansion systems, as well as the cascade refrigeration system. The individual compressors with multiple expansion valves and compound compression with flash intercooling, as well as the merits of a brine system, will also be covered in this comprehensive course. Study the four main components of a vapour-compression system, as well as new and traditionally conventional developments in the reefer shipping segments, and get an overview of conventional reefer operators and reefer boxes.</p><p>This course then explains cargo space cooling arrangements such as direct expansion grids, as well as direct expansion batteries and air. You will also learn about cold brine grids, brine battery and air, design of an air-circulating system and defrosting. The material teaches you about the functions of container cooling systems, air cooler fans, refrigerated piping containers, as well as air circulation in a reefer container. The stowage of refrigerated cargo, insulation, preparation of cargo compartments, and precautions to be taken while handling refrigerated cargo will also be covered in this course. Learn about the preparation of cargo holds, precooling, precautions to take during loading, as well as measures to be taken to prevent fluctuation in temperature. Do you know the steps to take prior to and while receiving cargo, as well as how to handle frozen cargo? Steps required for the inspection of cargo during loading, use of brine traps, as well as the importance and guidance of reefer cargo temperature recording will also be covered.</p><p>Furthermore, this course will help you get familiar with instruments used to measure and log the temperature of refrigerated cargo such as mercury or spirit thermometers, and electrical resistance and electronic self-balancing thermometers. You will learn about carbon dioxide concentration in the cargo chamber, as well as the functions of a reliquefaction plant. Analyze the single-staged direct reliquefaction system, as well as how the cargo condenser is refrigerated in the direct cycle and cascade direct cycle. You will also learn about how full refrigerated ship carry cargo, as well as the four different containment systems used for the ships, which include independent tanks with single hulls, double bottom and hopper tanks, independent tanks with a double hull, integral tanks and semi-membrane tanks (both incorporating a double hull). The course will also teach you about how to improve the operational flexibility of a fully refrigerated ship. This free online course will be useful to marine engineering students and anyone wanting to know more about refrigerated cargo transport.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}