{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1513","title":"Carpentry - Introduction to Construction Methods","totalEnrolled":"18,734","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to construct walls, roof frames, and flooring systems with this free online construction carpentry course.","description":"Learn how to construct walls, roof frames, and flooring systems with this free online construction carpentry course.This free online construction carpentry methods course will teach you the carpentry skills required for the installation of flooring systems, wall frames, and roof frames. Carpentry is a highly skilled trade, always in-demand, and is essential for the construction of any structure. This free online course will teach you about the s","courseOutcomes":["Identify the various types of constr...","State the guidelines to read and int...","List the various terms associated wi...","Explain the different methods of fra...","Identify the various types of construction drawings that make a drawing set","State the guidelines to read and interpret reading plans and drawings, blueprints, and specifications","List the various terms associated with floor systems, wall, ceiling and roof framing","Explain the different methods of framing and constructing houses made of wood","Describe the types of beams/girders and supports used in construction","Outline the sequence involved in constructing a platform floor assembly","Summarize the basic procedure for laying out, assembling, and erecting wood frame walls","Recognize the different types of roofs used in residential construction","Determine the length of a common rafter required to construct a roof","Identify the various types of constr...","State the guidelines to read and int...","List the various terms associated wi...","Explain the different methods of fra...","Identify the various types of construction drawings that make a drawing set","State the guidelines to read and interpret reading plans and drawings, blueprints, and specifications","List the various terms associated with floor systems, wall, ceiling and roof framing","Explain the different methods of framing and constructing houses made of wood","Describe the types of beams/girders and supports used in construction","Outline the sequence involved in constructing a platform floor assembly","Summarize the basic procedure for laying out, assembling, and erecting wood frame walls","Recognize the different types of roofs used in residential construction","Determine the length of a common rafter required to construct a roof"],"courseDescription":"<p>This course will first discuss construction drawings, specifications, plans, and elevations, as well as the importance of organizing and scheduling projects and working with people from different trades. You will study the different types of architectural drawings, the methods of framing for structures made of wood, and the parts of a typical platform floor system such as sills, girders, joists, and trusses. The course will also discuss the step-by-step process of constructing a platform floor assembly.</p><p>Next, you will study the wall framing process. The course will discuss the components of a wall and the procedures for laying out, assembling, and erecting wood frame walls. You will learn how to cut and install ceiling joists and learn about the main types of steel studs used in framing walls. The course will then discuss the different types of roofs used in residential construction, as well as the types of roof framing systems. You will also study the procedure for installing roof sheathing.</p><p>Being a carpenter takes knowledge, skill, and talent. Aside from learning how to work with different construction materials, being able to read drawings, specifications, plans, and elevations is a necessity. By the end of this free Introduction to Construction Methods online course, you will have kickstarted your journey towards gaining a career in both residential and commercial construction. So why wait? Start your journey, today.</p><a href=\"https://alison.com/resume/courses/1513\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1513\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Reading Plans and Elevations","description":"In this module, you'll get to learn more about reading plans and elevations used by carpenters in the construction process from drawing sets, reading and interpreting drawings, organizing projects and working with other trades.","topics":["Reading Plans and Elevations - Learning Outcomes","Introduction to Reading Plans and Elevations","Drawing Set","Reading and Interpreting Drawings","Reading Plans - Other Important Terms","Organizing Projects and Working With Other Trades","Reading Plans and Elevations - Lesson Summary"]},{"name":"Module","details":"Floor Systems","description":"Learn more about constructing floor systems from methods of framing houses, building drawings and specifications, floor systems, constructing platform floor assembly and installing joists, determining girder and joist sizes.","topics":["Floor Systems - Learning Outcomes","Introduction to Floor Systems","Methods of Framing Houses","Building Drawings and Specifications","Floor Systems","Constructing Platform Floor Assembly and Installing Joists","Determining Girder and Joist Sizes","Floor Systems - Lesson Summary"]},{"name":"Module","details":"Wall and Ceiling Framing","description":"Learn more about the process of wall and ceiling framing used in construction in this module from the process of laying out a wall, assembling and erecting a wall, ceiling layout and framing, wall framing in masonry.","topics":["Wall and Ceiling Framing - Learning Outcomes","Introduction to Wall and Ceiling Framing","Laying Out A Wall","Assembling and Erecting A Wall","Ceiling Layout and Framing","Wall Framing in Masonry","Wall and Ceiling Framing - Lesson Summary"]},{"name":"Module","details":"Roof Framing","description":"Learn more about roof framing in construction in this module from types and components of roofs, rafters, sheathing, construction and installation of trusses, and other available types of roof framing.","topics":["Roof Framing - Learning Outcomes","Introduction to Roof Framing","Roof Types and Components","Rafters","Sheathing","Truss Construction and Installation","Other Types of Roof Framing","Roof Framing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Carpentry - Introduction to Construction Methods Assessment"]}]}