{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1514","title":"Carpentry - Introduction to Formwork and Joinery","totalEnrolled":"10,240","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the necessary knowledge and skills for the construction of formwork and joinery with this free joinery course.","description":"This free online Joinery course will introduce you to formwork and joinery. Carpenters are always in demand in the construction trade. Knowledge and expertise in working with various types of building materials, formworks, and joinery are indispensable requirements for any carpenter's job. With this course, you will gain a strong understanding of the general types of concrete and woodwork used in residential construction.","courseOutcomes":["Discuss the terms associated with co...","Apply the concrete mixing informatio...","Explain the basic concrete curing me...","List the various components of windo...","Discuss the terms associated with concrete, concrete reinforcing materials, and formwork","Apply the concrete mixing information to get different types of concrete, designed to suit various purposes","Explain the basic concrete curing methods and materials","List the various components of windows, exterior doors, and stairways used in residential construction","Summarize the basic installation procedure for pre-hung windows","State the various types of exterior doors used in residential construction","Identify the essential requirements for framing stairs","Describe the design and layout techniques used for stairways and stairwells","Discuss the terms associated with co...","Apply the concrete mixing informatio...","Explain the basic concrete curing me...","List the various components of windo...","Discuss the terms associated with concrete, concrete reinforcing materials, and formwork","Apply the concrete mixing information to get different types of concrete, designed to suit various purposes","Explain the basic concrete curing methods and materials","List the various components of windows, exterior doors, and stairways used in residential construction","Summarize the basic installation procedure for pre-hung windows","State the various types of exterior doors used in residential construction","Identify the essential requirements for framing stairs","Describe the design and layout techniques used for stairways and stairwells"],"courseDescription":"<p>This course will first discuss the different terms associated with concrete, concrete reinforcing materials, and concrete forms. You will study the four basic materials used in making concrete and the concrete mixing procedure used to get high-strength, general use, and large volume concrete. The course will also cover concrete walls, footings, and floor slabs. You will then look into types of windows and exterior doors used in residential construction, as well as study the kinds of glass used in window glazing.</p><p>Next, you will study the different types of doors used in residential construction as well as learn their different components. The course will also discuss the construction of stairs, as well as the different stair designs including straight-run, platform, or winding stairs. You will then study the three categories of stairs as well as the components of a flight of stairs and interior stairways. The course will also discuss the requirements, design, and layout for building stairways, stairwells, and stair framing.</p><p>The use of formwork and joinery are very important processes in construction. By gaining this skills, you can become a valuable member of almost any construction team. But sometimes, these processes can seem difficult and complex. This free online carpentry course is designed to teach formwork and joinery in an easy-to-understand manner and in just a few short hours. Check out the course today, and by the end of the week you will have given your career a solid boost.</p><a href=\"https://alison.com/resume/courses/1514\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1514\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Concrete","description":"Learn more about using concrete as a building material for construction purposes in this module from concrete, reinforcing materials, forms, concrete mix proportions and measurements, special types of concrete, concrete curing, testing and estimating volume.","topics":["Introduction to Concrete - Learning Outcomes","Concrete, Reinforcing Materials, Forms","Concrete and Concrete Materials","Concrete Mix Proportions and Measurements","Special Types of Concrete","Concrete Curing, Testing, Estimating Volume","Concrete Reinforcement Materials","Concrete Forms and Footings","Introduction to Concrete - Lesson Summary"]},{"name":"Module","details":"Windows and Exterior Doors","description":"Learn more about constructing and installing windows and exterior doors in the construction process in this module from associated terms, window components, types and installation, exterior door components and types.","topics":["Windows and Exterior Doors - Learning Outcomes","Terms Associated With Windows And Exterior Doors","Window Components, Types, Installation","Exterior Doors and Components","Windows and Exterior Doors - Lesson Summary"]},{"name":"Module","details":"Stair Construction","description":"This module will introduce you to the procedures involved in stair construction for buildings from stair types, components and terminologies, framing, and the design and layout of stairways and stairwells.","topics":["Stair Construction - Learning Outcomes","Introduction to Stair Construction","Types of Stairs","Stairway Components And Terminology","Stair Framing","Design and Layout of Stairways and Stairwells","Stair Construction - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Carpentry - Introduction to Framework and Joinery Assessment"]}]}