{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5247","title":"Comprehensive Guide to Construction Design and Management","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the rules and safety practices crucial to construction design and management (CDM) in this free online course.","description":"Violating safety laws on construction sites can lead to significant material and time losses. This course introduces you to construction and design management (CDM) and explains how safety laws in the UK can protect health and safety on construction sites. We lay out the key roles and responsibilities of those involved in construction projects and the necessary documentation required for safety management processes and information flow.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Construction design and management (CDM) is a set of health and safety guidelines applicable to all construction projects in the United Kingdom. This course teaches you the basics, origin and history of CDM regulations and explains how these regulations were altered to meet the requirements of the construction industry. CDM assigns certain roles and responsibilities to those involved in a construction project and we show you how each stakeholder promotes health and safety on a construction site. We then compare the responsibilities of clients and those of the construction company’s employees. Just like any management system, the field of construction health and safety requires certain documents. We identify the necessary CDM documents and outline who is responsible for maintaining them and how they should do so.</p><p>A construction project can be divided into multiple stages with each stage requiring its own flow of information to communicate health and safety risks. This course identifies the information required at every step of a project and the personnel responsible for obtaining and sharing it. The ‘health and safety file' is a record document that must be revised from time to time and shared with the relevant people on a construction site. We explore the key contents of a ‘health and safety file’ and identify commercially available software products that support specific CDM standards or guidelines before demonstrating how they can be tailored to your needs. The course then covers health and safety rules, traffic regulations, emergency procedures and how to prevent accidents from occurring on construction sites.</p><p>We designed this course for people who work or intend to work in the field of construction safety. This course is also useful for learners who studied occupational health and safety and now want to specialise in this field. This course also suits anyone considering a construction project who wants to meet their legal and safety obligations as clients. It covers the relevant legal guidelines governing construction design and management (CDM) in the UK. The instructor provides a case study related to site safety to provide a practical understanding of construction safety concepts. All construction organisations need to hire construction safety professionals to create and apply cost-effective safety protocols and meet their legal requirements. Career opportunities are thus available for people trained in CDM practices who possess expertise in construction safety. Sign up to build and improve your knowledge of construction design and management and learn how to maintain safety on building sites and meet your legal obligations.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}