{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2988","title":"Compressors and Refrigerated Containers","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This is a free online course on the principles of air conditioning, plus types of compressors and compressor designs.","description":"This free online course on compressors and refrigeration systems teaches you about the principles of air conditioning (AC), psychometric properties of air and airflow capacity. You will learn about types of compressors and compressor designs, and be able to explain the components of a reefer container, as well as the functions of an oil rectifier, separator and dryer.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Compressors and Refrigerated Containers’ is a free online course that introduces you to the definition of ‘air conditioning’, how to find the relative humidity of the air, as well as the design of an air-conditioning (AC) system. The functions and applications of a psychrometric chart for solving HVAC (heating, ventilation and air conditioning) problems; wet and dry bulb hygrometers; the sling psychrometer; the dew point temperature of air; as well as latent heat of the air are all covered. You will also learn about enthalpy lines, thermal comfort, comfort zone, steam injection, humidification, humidity ratio and humidity control. Airflow and air-conditioning capacity, cabin load, the total load on AC apparatus, as well as the heat balance (HB) method and heating load estimate also form part of the in-depth material. Learn about the important points to be taken into account when heat load required calculations are done, which include transmission heat loss, solar radiation and internal heat gains. The basic components of cooling and heating systems, and the parts of direct expansion systems will also be presented.</p><p>This course then explains the operational procedures of an air-conditioning system. You will study the basic components of hydronic hot-water and all-air heating systems, as well as the parameters of air controlled by the air-handling system. This course will also teach you about the two types of air-handling systems plus the functions and types of centrifugal fans (including radial, forward and backward curved). You will get to grips with the replacement of air filter elements, functions of humidistats, as well as the contamination of ships’ air-conditioning systems by legionella bacteria, which can lead to severe lung infections. Learn about compressors, types of compressor designs, the single-stage compression process, suction and discharge valves, plus the arrangement of compressor reed and ring valves. Study reciprocating compressor efficiency in refrigeration air-conditioning systems, as well as the four processes of a non-ideal reciprocating cycle. This course will also teach you about lube oil circuit, oil for refrigeration compressors, types of refrigeration compressor lubricating oils, as well as precautions for using lubricating oil.</p><p>Furthermore, it will help you get familiar with the core component of a centrifugal compressor known as the ‘impeller’, the centrifugal compressor chart and suction. You will learn about domestic refrigeration plant layout, refrigerating chamber volume and maintenance temperature, as well as a high- and low-pressure cut-out. This course will teach you about the functions of the condenser, evaporator, economizer, as well as classifications of the evaporator. The types of heat exchangers used in refrigeration, functions of the double pipe heat exchanger, as well as the pattern of coolant flow will also be covered. You will analyze constructional features of a refrigerated container (or reefer), which include the shell and tube type, as well as heat exchanger routine and maintenance. This course will also teach you about cleaning techniques, backflushing, and manual as well as chemical cleaning of a heat exchanger. The functions of the oil rectifier and separator and liquid-line dryer will also form part of your coursework. This course is ideal for mechanics students looking into refrigeration, air conditioning and ventilation, or those wanting specialist training in compressors and refrigerated containers.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}