{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3184","title":"Design of Electric Vehicle Batteries","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online automotive engineering course, learn how to design and build a battery pack for an electric vehicle.","description":"The future of the automotive industry is the electric vehicle. Understanding electric vehicle batteries will empower you to take your career to the next level. Learn about the fundamental engineering principles required to design and build a battery that will power an electric vehicle and much more. So why wait? Start this free online course today and align your path with this exciting field.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>For centuries, humankind has relied on fossil fuel to power their machines, from tools to vehicles. The internal combustion engine, for example, revolutionised the automotive industry. But now, fossil fuel deposits are depleting, the price of petrol and diesel is rising and the excess of vehicles in big cities is contributing to pollution. For this reason, big manufacturing countries, such as China and the United States, are pushing automakers to produce more electric vehicles. As a result, there is a need for engineers with a background in electric vehicle technology. This course will help you understand how to build the power-core of electric vehicles: the battery pack. This knowledge will be useful not only in designing batteries for electric vehicles but any other type of electric-powered machines.</p><p>The first thing you will learn in this course is how to measure essential battery parameters. You will also understand the role of charge and discharge rates. Next, you will study the chemical composition of batteries. Special attention will be given to the lithium-ion battery, the battery of choice for electric vehicles, and why this battery's chemical properties separate it from other batteries. You will then learn about battery cells and how there are three different types of cells that form what we know as a ‘battery pack’ when assembled. You will understand how to compute the amount of energy, known as ‘battery capacity’, stored in an assembled battery pack, estimate the amount of charge and discharge cycles that a battery pack has left and determine battery health.</p><p>Finally, you will learn how to assemble a safe and reliable battery pack, following an excellent mechanical, thermal and electrical design. When you study a battery pack’s mechanical design, you will review stress-strain theory to understand the forces that act on a battery pack, such as tension force. Selecting materials based on their properties to build a battery pack container using a material index is critical. When you study the thermal design of a battery pack, you will learn how to design a good thermal management system, calculate the amount of energy a battery loses due to heat and calculate different materials' thermal resistance. If your interests are in automotive technology, mechanical or electrical engineering, this course is for you. Why wait? Start this ‘Design of Electric Vehicle Batteries’ course today and equip yourself with the knowledge needed to design and build electric vehicles batteries.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}