{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2777","title":"Design and Analysis of Digital Circuits","totalEnrolled":"841","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on the design and analysis of digital circuit systems, as well as the flow diagram of circuits.","description":"Focus on the building blocks for combinational systems, and the design and analysis of digital circuits, in this free online course. You will learn about the design process and flow diagrams of circuits as well as about sequential elements and assignment statements. Start this course today to study the design and analysis of digital circuits.","courseOutcomes":["Outline the advantages and disadvant...","Discuss the multiplexer as a buildin...","Discuss the universality of multiple...","Examine the Shannon expansion theore...","Outline the advantages and disadvantages of MUX-based logic","Discuss the multiplexer as a building block for combinational circuits","Discuss the universality of multiplexers","Examine the Shannon expansion theorem","Analyze the basic syntax of the Verilog","Outline the steps in the compilation of the Verilog","Identify the step-by-step process of writing Verilog code","Explain the concept and types of gated latch","Discuss flip-flop as a basic building block for sequential logic circuits","Analyze the Master-Slave Timing diagram","Analyze the assignment statements","Discuss the process of assignment statement and instantiation","Outline the advantages and disadvant...","Discuss the multiplexer as a buildin...","Discuss the universality of multiple...","Examine the Shannon expansion theore...","Outline the advantages and disadvantages of MUX-based logic","Discuss the multiplexer as a building block for combinational circuits","Discuss the universality of multiplexers","Examine the Shannon expansion theorem","Analyze the basic syntax of the Verilog","Outline the steps in the compilation of the Verilog","Identify the step-by-step process of writing Verilog code","Explain the concept and types of gated latch","Discuss flip-flop as a basic building block for sequential logic circuits","Analyze the Master-Slave Timing diagram","Analyze the assignment statements","Discuss the process of assignment statement and instantiation"],"courseDescription":"<p>Design and analysis of digital circuits is a free online course that discusses the application and building blocks for combinational circuits. The course introduces you to the practical application of a multiplexer (MUX), as well as its structure and symbolic representation. You will also learn about the similarities and conversations between multiplexers and decoders. Shannon's expansion theorem, as well as a brief introduction to demultiplexers, will also be covered.</p><p>The material then explains the design process and the diagram flow of a digital circuit, as well as the step-by-step process of writing Verilog codes. You will study basic sequential elements, as well as the differences between the combinational circuit block and the sequential circuit block. The concepts, types, applications, structures and truth table representation of types of gated latches will also be explained.</p><p>Furthermore, you will get familiar with the types of flip-flop and learn about the instantiation of a controller and data path, as well as the relevance of assignment statements. You will also examine the structure, as well as the application of registers, in the design of sequential circuits. This free online course will be of great use to anyone with an interest in the design and analysis of digital circuits. So, register now and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/2777\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2777\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Design and Analysis of Combinational Circuits","description":"In this module, you will be introduced to the application of combinational circuits, as well as determining the potency of combinational logic designs. You will also be introduced to the universality of multiplexers and demultiplexers. The design process of a circuit, as well as the process of writing Verilog codes, will also be analyzed in the module.","topics":["Design and Analysis of Combinational Circuits - Learning Outcomes","Encoders and Decoders","Multiplexers","Multiplexer-Based Circuit Design","Verilog","Compiling and Running Verilog - A Demonstration","Design and Analysis of Combinational Circuits - Lesson Summary"]},{"name":"Module","details":"Design and Analysis of Sequential Elements","description":"In this module, you will be introduced to the fundamentals and applications of sequential elements in a gated latch. You will also be introduced to the application of registers in sequential circuits. The concepts of Flip-flop, as well as assignment statements and instantiation, will also be covered in this module.","topics":["Design and analysis of Basic Sequential Elements - Learning Outcomes","Sequential Elements","Gated Latches","Flip-Flops","Verilog - Assign Statement and Instantiation","Sequential Circuits","Design and Analysis of Sequential Elements - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Design and Analysis of Digital Circuits - Course Assessment"]}]}