{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3723","title":"Design & Manufacture a Training Kit using PIC Microcontrollers","totalEnrolled":"580","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the processes of designing and fabricating a PIC microcontroller training kit with this free online course.","description":"Wouldn’t it be nice to produce your own microcontroller training kit that will meet the needs of your electronics projects? Then, look no further than this free online course, which will enable you to design and fabricate PCBs to complete your project at a low cost. We will guide you through using the Proteus Professional software to design a PIC microcontroller training kit, as well as manufacturing techniques of the PCB.","courseOutcomes":["Define a Printed Circuit Board (PCB)...","Recall how to download and install t...","List the main components of a PIC mi...","Discuss how to design a single-layer...","Define a Printed Circuit Board (PCB) and a PIC microcontroller training kit","Recall how to download and install the Proteus professional software, for free, on your computer","List the main components of a PIC microcontroller Training Kit","Discuss how to design a single-layer and double-layer PCB on Proteus professional application","Explain how to prepare your PCB design for manufacturing","Identify the elements needed in the fabrication of a PIC microcontroller training kit","Describe the processes of manufacturing a PIC microcontroller training kit","Define a Printed Circuit Board (PCB)...","Recall how to download and install t...","List the main components of a PIC mi...","Discuss how to design a single-layer...","Define a Printed Circuit Board (PCB) and a PIC microcontroller training kit","Recall how to download and install the Proteus professional software, for free, on your computer","List the main components of a PIC microcontroller Training Kit","Discuss how to design a single-layer and double-layer PCB on Proteus professional application","Explain how to prepare your PCB design for manufacturing","Identify the elements needed in the fabrication of a PIC microcontroller training kit","Describe the processes of manufacturing a PIC microcontroller training kit"],"courseDescription":"<p>It’s not always easy to find microcontroller training kits suitable for your electronics prototypes or products. Most times, commercially available kits contain far more features than you need for your project. As a result, you will incur more costs with a commercial Printed Circuit Board (PCB). But there is a solution for this problem: You can reduce these costs and procure a suitable training kit for your project by designing and manufacturing it yourself, and this free online course will show you how. This course will teach you how to manufacture a Peripheral Interface Controller (PIC) microcontroller training kit and show you how to design and manufacture any PCB you want. You will also master the use of Proteus software in building your PCB. We’ll take you through the systematic processes of designing and fabricating a PIC microcontroller training kit. By the end of the course, you would have also mastered designing and manufacturing PCBs. Starting, we’ll take you through the objectives and potential benefits of this course. Then, we will introduce the PIC microcontroller training kit and PCBs. We’ll show you how the microcontroller training kit can benefit you in testing microcontroller-related projects. You might be familiar with some of the elements in the training kit, and you will realise the extra components that you can add to the training kit to meet your demands.</p><p>This course uses the Proteus software to design the PIC microcontroller training kit and introduce you to PCB’s basic structure. To get started, you will need to download and install the Proteus software, for free, on your computer. Proteus is a popular software used for electronics design. Next, you will learn how to use the Proteus software to draw the circuit schematics of the PIC microcontroller training kit. We will show you how to design the PCB from the circuit schematic using the Proteus software. PCBs can be in single layers or multilayers, but did you know that most companies prefer creating multi-layer PCBs to single-layer PCBs? The course demonstrates the difference between the two designs of PCBs and why one is preferred to the other. Having designed the PCBs using the Proteus, you will learn about the material and equipment needed to print out the PCB design. Lastly, we will show you the systematic manufacturing process of PCB designs to fit your electronics needs.</p><p>You will find many devices that use PCBs, such as your computer, phone, and many other devices, when you look around. This course will help you free your mind to find creative ways of building devices. Whether you operate in the field of mechatronics engineering or are just enthusiastic about building electronics circuits, this course will add value to your career or business. You do not have to worry about getting a proper Printed Circuit Board (PCB) for your electronics project anymore. With this course, you are already on the path to providing your electronic projects with a fitted PCB and training kit. Begin this hands-on course today and start fabricating unique training kits with ease.</p><a href=\"https://alison.com/resume/courses/3723\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3723\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Designing and Fabricating PIC Training Kit","description":"This module, Designing and Fabricating a PIC Training Kit, demonstrates the steps in designing and manufacturing Printed Circuit Boards (PCBs) using the Proteus software, focusing on how the PIC microcontroller training kit can be designed and fabricated.","topics":["Designing and Fabricating a PIC Training Kit - Learning Outcomes","Introduction to PIC Training Kit Manufacturing Course","Basics of PIC Training Kit and PCB Designs","Designing PIC Microcontroller Training kit","Printing and Fabricating a PIC Training Kit","Designing and Fabricating a PIC Training Kit - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Design & Manufacture a Training Kit using PIC Microcontrollers - Course Assessment"]}]}