{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2365","title":"Design of Tension Members in Steel Structures","totalEnrolled":"792","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, you will learn about the design procedures for tension members in steel structures.","description":"This free online course in the Design of Tension Members in Steel Structures will provide you with the step-by-step process of designing Tension members for steel structures in accordance with the Indian standard codes. The course will reveal how to calculate the design strength and net area of tension members. You will also learn about the criteria for designing lug angles, how to design a splice to connect member plates and more.","courseOutcomes":["State the factors affecting the tens...","Compute the net area of a tension me...","Explain how to calculate the design ...","Discuss how to design a suitable sec...","State the factors affecting the tensile strength of members","Compute the net area of a tension member along critical sections","Explain how to calculate the design strength of a tension member","Discuss how to design a suitable section that can be connected to a gusset plate via bolting or welding","Compute the dimension of a gusset plate that can hold members","Discuss the criteria for designing lug angles","Describe how to design a splice to connect member plates","State the factors affecting the tens...","Compute the net area of a tension me...","Explain how to calculate the design ...","Discuss how to design a suitable sec...","State the factors affecting the tensile strength of members","Compute the net area of a tension member along critical sections","Explain how to calculate the design strength of a tension member","Discuss how to design a suitable section that can be connected to a gusset plate via bolting or welding","Compute the dimension of a gusset plate that can hold members","Discuss the criteria for designing lug angles","Describe how to design a splice to connect member plates"],"courseDescription":"<p>In this free online course in the Design of Tension Members in Steel Structures, you will explore the steps in designing tension members for steel structures, with examples to illustrate the designs. The course starts by stating the forms of tension members and the factors that affect the strength of tension members. You will then learn how to determine the net area of a tension member along its critical section and how to determine the design strength of tension members.</p><p>The course then proceeds to explain how to design a suitable section that can be connected to a gusset plate via bolting or welding. You will learn how gusset plates and lug angles can be designed to hold steels members in a steel structure. Lastly, you will discover how to design splices to hold member plates of a steel structure.</p><p>Tension members are structural elements that require efficient designs in order to help achieve an overall economical steel structure. If you are a civil engineer, structural designer, or one who looks to discover how tension members are designed for steel structures, then this course is for you. So, start this free course today, to realise the steps in designing tension members of steel structures.</p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/2365\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2365\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Tension Members","description":"In this module, Tension Members, you will learn how to calculate the design strength and net area of tension members that are welded or bolted to a gusset plate; examples are provided to demonstrate such calculation.","topics":["Tension Members - Learning Outcomes","Overview of Tension Members and Net Area","Calculation of Net Area in Tension Members","Design Strength of Tension Members","Strength Calculation of Tension Members","Strength of Tension Members with Weld Connection","Tension Members - Lesson Summary"]},{"name":"Module","details":"Design of Tension Members and Connectors","description":"This module, Design of Tension Members and Connectors, discusses the steps to designing tension members, gusset plates, lug angles, and splices; with an example to illustrate these designs.","topics":["Design of Tension Members and Connectors - Learning Outcomes","Steps in Designing Tension Members","Design Calculation for Tension Members","Design of Gusset Plate","Lug Angles","Design of Splices in Tension Members","Design of Tension Members and Connectors -  Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Design of Tension Members in Steel Structures - Course Assessment"]}]}