{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2366","title":"Design of Connections in Steel Structures","totalEnrolled":"1,402","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the step-by-step process of economically designing connections in steel structures.","description":"In this free online course in Design of Connections in Steel Structures, you will be exposed to the various connections used in steel structures, and how they can be economically designed. This course will teach you the different patterns and design methodologies of bolt connections. You will learn about the types of weld and how they are designed. You will also learn how to design weld or bolt connections that can safely carry an eccentric load.","courseOutcomes":["Recall the types of connections in s...","Distinguish between the different pa...","Discuss the design methodology of bo...","Compare the design of a fillet and b...","Recall the types of connections in steel structures, their advantages, and disadvantages","Distinguish between the different patterns of bolt connections","Discuss the design methodology of bolt connections under shear and bearing","Compare the design of a fillet and butt weld connections","State the specifications for the design of plug or slot weld","Explain how to design an eccentric connection when a load is lying in a plane of weld or bolted connections","Discuss how to design an eccentric connection when a load is lying perpendicular to the plane of weld or bolt connections","Recall the types of connections in s...","Distinguish between the different pa...","Discuss the design methodology of bo...","Compare the design of a fillet and b...","Recall the types of connections in steel structures, their advantages, and disadvantages","Distinguish between the different patterns of bolt connections","Discuss the design methodology of bolt connections under shear and bearing","Compare the design of a fillet and butt weld connections","State the specifications for the design of plug or slot weld","Explain how to design an eccentric connection when a load is lying in a plane of weld or bolted connections","Discuss how to design an eccentric connection when a load is lying perpendicular to the plane of weld or bolt connections"],"courseDescription":"<p>This free online course in the Design of Connections in Steel Structures, will equip you with the knowledge of how to design connections in steel structures. The course starts by introducing you to the various types of connections used in steel structures, including their types and importance. You will then learn about the different patterns of bolt connections and how to calculate the strengths of ordinary black bolts. Also, you will learn about the design methodology of bolt connections under shear and bearing.</p><p>Next, the course illustrates the types of weld and welding processes, including the step-by-step process of designing the various types of weld to safely carry members in steel structures. Lastly, you will learn how to design eccentric connections, where the load is in plane or perpendicular to the plane of bolt or weld connection.</p><p>In addition, this free course implements diagrams and worked-out examples in demonstrating the process of designing suitable steel connections for steel structures. If you are looking to advance your knowledge of how steel connections are designed economically, this course is certainly for you. Start this course today, to get a deep understanding of how steel connections are designed to hold steel members.</p><p>Start Course Now.</p><a href=\"https://alison.com/resume/courses/2366\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2366\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Bolt Connections","description":"This module illustrates the design methodology of ordinary black bolts and high strength friction grip bolts; examples are provided.","topics":["Bolt Connections - Learning Outcomes","Introduction to Connections","Introduction to Bolt Connections","Design of Ordinary Black Bolts","Design of Ordinary Black Bolts - Examples","Design of High Strength Friction Grip (HSFG) Bolts","Bolt Connections - Lesson Summary"]},{"name":"Module","details":"Weld Connections","description":"In this module, Weld Connections, you will learn about the types of welds and their design methodology; examples are provided to help demonstrate.","topics":["Weld Connections - Learning Outcomes","Introduction to Weld Connection","Design of Fillet Welds","Design of Butt Welds","Design of Plug and Slot Weld","Weld Connections - Lesson Summary"]},{"name":"Module","details":"Eccentric Connections","description":"This module, Eccentric Connections, discusses the design of eccentric connections due to plane and perpendicular loading on bolt and welded joints; with examples to illustrate.","topics":["Eccentric Connections - Learning Outcomes","Eccentric Loading in Plane of Bolted Joint – Concepts","Eccentric Loading in Plane of Bolted Joint – Design","Eccentric Loading in Plane of Welded Joint","Eccentric Load Lying Perpendicular to Plane of Bolt Joint - Design","Eccentric Load Lying Perpendicular to Plane of Bolt Joint - Example","Eccentric Load Lying Perpendicular to Plane of Welded Joint","Eccentric Connections - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Design of Connections in Steel Structures - Course Assessment"]}]}