{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3856","title":"Diploma in AP Chemistry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about chemical, nuclear and thermodynamic reactions to prepare for the Advanced Placement (AP) chemistry exams.","description":"This free online course teaches you different types of solutions and how the amount of solute dissolved in a solid can be expressed. You will learn about the impact of temperature on reaction rate and the influence of catalysts. Develop your knowledge by exploring how matter can transition between various physical states including properties of materials based on the structure and shape of atoms.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course provides you with an in-depth understanding of the physical states of matter and how it can transition between different states. Before calculating the number of particles of a substance, it is important to understand stoichiometry and consideration of the balanced chemical equation. This course explores the concept of heterogeneous and homogeneous mixtures, including the types of pure substances. It introduces you to the concept of vapour pressure and Dalton’s law of partial pressure. Have you considered the process of dissolving sodium chloride (NaCl) in water? This course will teach you the metric system, dimensional analysis and the steps that are important for having successful dimensional analysis. You will also learn about the properties of materials based on the structure and shape of atoms, giving you a better understanding of the concept of nuclei, electrons, neutrons and protons.</p><p>If you want a detailed understanding of the dynamics of various chemical reactions, then you should sign up for this course. You will be able to explain how the mass of solid silver plus molality and molarity can be calculated. The material will help you understand the factors that affect vapour pressure, ideal gas law with examples of problems and their solutions. Explore how the rate of disappearance of reactants can be calculated. You will be taken through the effect of surface area as well as of concentration or pressure on reaction rate. Study the different ways of determining the rate law or the order of the reaction. Do you know there are factors that can affect equilibrium and the oxidation number of an element in a compound? This course explains the procedure for balancing redox reactions using the half-reaction or ion-electron. If you have any difficulty understanding chemical and nuclear reactions, including intermolecular forces, then this course is for you.</p><p>Furthermore, learn about the different factors that affect the reaction rate and how to use Gay-Lussac’s law for the calculation of change in pressure gas. You will be able to explain the temperature effects on solubility and the types of the covalent bond by electron sharing. This course will help you have a better understanding of the general concept of, and terminologies used in thermodynamics, as well as the different forms of energy. Do you know there are definite expressions of a system, surroundings, and boundary in thermodynamics? You will learn how to predict the spontaneity of redox reactions and the electrode process of values. Explore the driving forces of a chemical reaction, the definition of Gibbs free energy and the effect of standard state enthalpy. The course improves your understanding of the classification of the alkenes and alkynes. If you are considering taking the AP chemistry exams, this free online course provides great preparation and revision.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}