{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2814","title":"Diploma in Electrochemical Reactions in Corrosion","totalEnrolled":"285","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study electrochemical reactions in corrosion, as well as the oxidation mechanisms of corrosion, in this free course.","description":"Two important aspects of electrochemical reactions are covered in this free online course. You will learn about the features and elements of passivation, as well as the interaction between polarization and the Pourbaix diagram. You will also be able to explain the calculation of Pilling-Bedworth ratio in different metals, as well as plot the Ellingham diagram. Start this course today to improve your understanding of electrochemical reactions.","courseOutcomes":["Distinguish between activation and c...","Describe the mixed potential theory...","Explain the derivation of the Tafel ...","Discuss the evolution of the microst...","Distinguish between activation and concentration polarization","Describe the mixed potential theory","Explain the derivation of the Tafel equation and the Tafel slope","Discuss the evolution of the microstructure of pearlite","Identify the elements and features of passivation","Analyze the interaction between polarization and the Pourbaix diagram","Explain the corrosion rate of metals in a concentration-controlled environment","Analyze the effect of galvanic coupling in active-passive metals","Discuss how to calculate Pilling-Bedworth ratio","Outline the steps for drawing the Ellingham diagram","Distinguish between activation and c...","Describe the mixed potential theory...","Explain the derivation of the Tafel ...","Discuss the evolution of the microst...","Distinguish between activation and concentration polarization","Describe the mixed potential theory","Explain the derivation of the Tafel equation and the Tafel slope","Discuss the evolution of the microstructure of pearlite","Identify the elements and features of passivation","Analyze the interaction between polarization and the Pourbaix diagram","Explain the corrosion rate of metals in a concentration-controlled environment","Analyze the effect of galvanic coupling in active-passive metals","Discuss how to calculate Pilling-Bedworth ratio","Outline the steps for drawing the Ellingham diagram"],"courseDescription":"<p>This course will introduce you to the important aspects of electrochemical reactions, how they react with the mixed potential theory, as well as the formation of the Helmholtz double-layer and the Tafel equation. You will learn about the area effect on the corrosion of the active component connected to a noble component, as well as galvanic coupling between two active metals in an electrolyte.</p><p>You will study the features and elements of passivation, as well as the interaction between polarization and the Pourbaix diagram. Learn about Faraday's two-staged experiment on converting iron with HNO3 (nitric acid) solution from the passive to the active stage, as well as the ennoblement of metal in relation to passivity. The interaction of cathodic and anodic polarization plots when a system goes into passivation mode will also be highlighted in this course.</p><p>Furthermore, you will gain an understanding of how to calculate the Pilling-Bedworth ratio in different metals, as well as the two fundamental aspects of oxidation. You will also learn how to plot the Ellingham diagram, as well as how an oxidation process occurs in metal deficient diffusion of the interstitial cation. This free online course will be of great value to anyone with an interest in electrochemical reactions in corrosion – register now and expand your knowledge today.</p><a href=\"https://alison.com/resume/courses/2814\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2814\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Aspects of Electrochemical Polarization and Mixed Potential Theory","description":"In this module, you will be introduced to the two important aspects of electrochemical reactions, as well as their interactions with mixed potential theory. You will also be introduced to the concepts of Tafel equation, cathodic and anodic reactions, as well as how to plot appropriate graphs representing the reactions and the formation of the Helmholtz double-layer.","topics":["Aspects of Electrochemical Polarization and Mixed Potential Theory - Learning Outcomes","Recap of Electrochemical Polarization","Activation and Concentration Polarization","Tafel Equation and Tafel Slope","Exchange Current Density in Anodic and Cathodic Polarization","Interaction between Concentration Polarization and Mixed Potential Theory","Aspects of Electrochemical Polarization and Mixed Potential Theory - Lesson Summary"]},{"name":"Module","details":"Corrosion Processes on the basis of Mixed Potential Theory","description":"In this module, you will be introduced to the evolution of microstructure in pearlite, the concept of an optical microscope, as well as their formation. You will also be introduced to the concepts of etching, equilibrium potentials, corrosion processes, galvanic coupling and depolarization effects.","topics":["Corrosion Processes on the basis of Mixed Potential Theory - Learning Outcomes","Introduction to Corrosion Processes based on Mixed Potential Theory","Evolution of Microstructure and Optical Microscope","Depolarization Effect","Equilibrium Potentials","Exchange Current Density and Galvanic Contacts","The Corrosion Processes on the basis of Mixed Potential Theory - Lesson Summary"]},{"name":"Module","details":"Area Effect Factor and Galvanic Coupling in Active Metals","description":"In this module, you will be introduced to the different values of half-cell, anodic and cathodic reactions, as well as the parallel line of individual Tafel lines for hydrogen evolution reaction on zinc and platinum. You will also be introduced to the area effect on the corrosion of an active component, as well as the galvanic coupling between two active metals in an electrolyte.","topics":["Area Effect and Galvanic Coupling in Active Metals  - Learning Outcomes","Effect of Exchange Current Density on Corrosion Rate of an Active Metal","Area Effect of the Cathodic and Anodic Component","Area Effect on the Current and Corrosion Rate","Corrosion Processes on the basis of Mixed Potential Theory: Numerical Analysis","Galvanic Coupling between Two Active Metals","Area Effect Factor and Galvanic Coupling in Active Metals - Lesson Summary"]},{"name":"Module","details":"Corrosion Rate of Active Metals in a Concentration Controlled Environment","description":"In this module, you will be introduced to the two segments of cathodic protection which are the sacrificial anode and impressed current cathodic protection, as well as the effect of magnesium and zinc on iron corrosion when they are galvanically coupled. You will also be introduced to how corrosion current density can be affected in both activation, as well as concentration controlled environment. The relationship between velocity and corrosion rate will also be highlighted in this module.","topics":["Corrosion Rate of Active Metals in a Concentration Controlled Environment - Learning Outcomes","Theory of Sacrificial Anode Steel Objects Protection","Effect of Two Active Metals on Fe–Corrosion","Corrosion of Metals in Controlled Concentration","Effect of Velocity on Corrosion Rate","Numerical Analysis in Polarization","Corrosion Rate of Active Metals in a Concentration Controlled Environment - Lesson Summary"]},{"name":"Module","details":"Diploma in Electrochemical Reactions in Corrosion - First Assessment","description":"You must score 80% or more to pass.","topics":["Diploma in Electrochemical Reactions in Corrosion  - First Assessment"]},{"name":"Module","details":"Theory of Passivation and Pourbaix Diagram","description":"In this module, you will be introduced to the features, elements and types of passivation, as well as the interaction between polarization and the Pourbaix diagram. You will also be introduced to Faraday's two-staged experiment on converting iron with HNO3 solution from the passive to the active stage, as well as the ennoblement of metal in relation to passivity.","topics":["Theory of Passivation and Pourbaix Diagram - Learning Outcomes","Numerical Problems and Passivation","Theory of Passivation","Features and Elements of Passivation","Interaction between Passivation and Pourbaix Diagram","Changes in Current Density","Theory of Passivation and Pourbaix Diagram - Lesson Summary"]},{"name":"Module","details":"Anodic and Cathodic Polarization in Active-Passive Metals","description":"In this module, you will be introduced to the interaction of cathodic and anodic polarization plots for a system in passivation mode, as well as the effect of the interaction of cathodic polarization at different plots. You will also be introduced to the different criteria for stable passivity, complete passivity and primary passivity in relation to the anodic and cathodic polarization line.","topics":["Anodic and Cathodic Polarization in Active-Passive Metals - Learning Outcomes","Passivity in Mixed Potential Theory","Interaction of Cathodic Polarization with an Active-Passive Metal","Interaction of Anodic Polarization with an Active-Passive Metal","Passivation and Mixed Potential Theory - Case Study","The Effect of Concentration Polarization of Cathodic Reaction","Anodic and Cathodic Polarization in Active-Passive Metals - Lesson Summary"]},{"name":"Module","details":"Corrosion Resistance of a Metal and Pilling-Bedworth Ratio","description":"In this module, you will be introduced to the anodic protection of active-passive metal due to the lesser current flow in the circuit for the same degree of protection, as well as the relative corrosion response of a metal in an electrolyte. You will also be introduced to the different stages of oxidation, as well as how metals react with gaseous oxygen to form metal oxides.","topics":["Corrosion Resistance of a Metal and Pilling-Bedworth Ratio - Learning Outcomes","Effect of Galvanic Coupling","Anodic Protection of an Active-Passive Metal","Linear Polarization and Relative Corrosion Resistance","Oxidation of Metals and Alloys","Different Stages of Oxidation and Pilling-Bedworth Ratio","Corrosion Resistance of a Metal and Pilling-Bedworth Ratio - Lesson Summary"]},{"name":"Module","details":"Oxidation Mechanisms and Ellingham Diagram","description":"In this module, you will be introduced to the calculation of the Pilling-Bedworth Ratio in different metals, as well as the fundamental aspects of oxidation which are thermodynamics of oxide formation and kinetic analysis of oxide growth. You will also be introduced to the plotting of the Ellingham diagram, as well as how the oxidation process occurs in metal deficient diffusion of the interstitial cation.","topics":["Oxidation Mechanisms and Ellingham Diagram - Learning Outcomes","Pilling Bedworth Ratio of different Metal Oxides","Thermodynamics of Oxidation","Construction of Ellingham Diagram","Ellingham Diagram - Plotting Without Detailed Calculation","Kinetics of Oxidation","Oxide Structure and Oxidation Mechanism","Oxidation Mechanisms and Ellingham Diagram - Lesson Summary"]},{"name":"Module","details":"Diploma in Electrochemical Reactions in Corrosion - Second Assessment","description":"You must score 80% or more to pass.","topics":["Diploma in Electrochemical Reactions in Corrosion  - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Electrochemical Reactions of Corrosion  -- Course Assessment"]}]}