{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3190","title":"Diploma in Ship Construction","totalEnrolled":"1,898","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course specialises in ship construction, bulkheads, stresses and explains the Voith-Schneider system.","description":"When a ship sails on the ocean, its structure is consequential to how it handles the sea’s stress. This course teaches you about the constructional features of the ship’s structure and the three types of bulkheads, the functions of watertight doors, bilge and ballast piping systems. Enrol today and gather knowledge of the working principles of the Voith-Schneider propulsion system and the Azimuthing propulsion drives.","courseOutcomes":["Describe the construction of ship fr...","Describe the general constructional ...","Evaluate the cause and effect of hog...","Define the various types of bulkhead...","Describe the construction of ship frames","Describe the general constructional feature and arrangement of various types of ships","Evaluate the cause and effect of hogging and sagging","Define the various types of bulkhead","Outline the midship structural arrangement for different types of ships","Evaluate the constructional features of the bow and stern","Describe the operation of a watertight door","Explain the provisions of the bilge and ballast piping system","Describe the constructional features of various types of rudders","Evaluate the constructional features of various types of propellers including CPP","Describe the operation of a tug using a Voith-Schneider and Azimuthing propulsion","Outline the significance of load lines in terms of cargo carriage and safety of navigation","Describe the construction of ship fr...","Describe the general constructional ...","Evaluate the cause and effect of hog...","Define the various types of bulkhead...","Describe the construction of ship frames","Describe the general constructional feature and arrangement of various types of ships","Evaluate the cause and effect of hogging and sagging","Define the various types of bulkhead","Outline the midship structural arrangement for different types of ships","Evaluate the constructional features of the bow and stern","Describe the operation of a watertight door","Explain the provisions of the bilge and ballast piping system","Describe the constructional features of various types of rudders","Evaluate the constructional features of various types of propellers including CPP","Describe the operation of a tug using a Voith-Schneider and Azimuthing propulsion","Outline the significance of load lines in terms of cargo carriage and safety of navigation"],"courseDescription":"<p>This diploma course in ship construction is a dynamic course that introduces you to vessels’ historical background, rapid growth and hydro-kinetic development. Discover the constructional features of the ship’s structure and ship terms used for dimensions and structure. Definitions such as ‘camber’, ‘floor rise’ and ‘shear’ and the essential role of the ship framing system are all outlined. This course will also introduce you to the primary hull ship designs commonly used, together with their structural cross-sections. Investigate the factors considered for proper cargo stowage and precautions to avoid damage to cargo and dunnage. This course will teach you about cargo hold inspection, preparation of the hold, requirements for loading and precautions to be taken when handling heavy lift cargo. Discover the concepts of hygroscopic and non-hygroscopic cargoes and types of ‘cargo sweat’. We will introduce you to the two types of ventilation (natural and mechanical) and the concept of hold ventilation. There are three types of bulkheads: watertight, non-watertight and oil-tight. Become familiar with the purpose of wash bulkheads, using cross ties in tankers and comparing cofferdam, flat plate and corrugated bulkheads.</p><p>Different components are present in the midship region and the midship structural arrangement for general cargo and container ships. This course teaches you about the impact loading has on its external surface. We will research the definition and concepts of ‘slamming’, ‘pounding’ and ‘panting’ during ship navigation. This course will also explain the division of the ship structure into the bow, stern and midship structures. Learn about the further division of its structure into the longitudinal, transverse, combination and double hull system. We analyse the features of watertight and weathertight doors and the types and operations of watertight doors. We scrutinise the maintenance of watertight doors, functions and proper routine maintenance of hatch covers. There are three methods to check the water tightness of hold covers: hose water, ultrasonic and chalk test. Understanding the differences between the two types of bilge piping systems, the importance of a leak test in a bilge piping system and the operations and functions of a ballast system for the stability of a ship is crucial.</p><p>Become trained in the definition and elements of a propulsion system. Study the power source, power transfer, thrust creation and directional control mechanism. This course will teach you about the main propulsion slow-speed diesel engine’s operations and the components of a transmission system. Become an authority on the components of the stern tube and the constant airflow type of stern tubes. Learn to identify the driver rotating around a horizontal axis (propellers) and which driver rotates around a vertical axis (Voith-Schneider cycloidal). Master the functions and constructional features of rudders. Recognise the balanced, unbalanced and semi-balanced rudders, along with the classification of blades based on the solid fixed-pitch and constructional-pitch propellers. Calculate the propeller’s pitch using the measurement in drydock, disc area, blade area ratio, wake and the true slip. The functions, mechanisms and working principles of the Voith-Schneider propulsion system, as well as the controls in the Voith-Schneider tractor tugs, will also be covered in this course. Become acquainted with the operations and mechanisms of the Azimuthing propulsion drives and their functions in stern-drive tugs. This course will be of great interest to students, researchers and anyone interested in ship construction. So don’t delay and register today.</p><a href=\"https://alison.com/resume/courses/3190\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3190\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ship Construction, Stresses and Bulkheads","description":"This module will teach you about the constructional features of a ship's structure, as well as ship terms for dimensions and structures. This module will also teach you about the static and dynamic forces, different shapes of steel sections, and the definition and three basic types of bulkheads. You will learn about the comparison between cofferdam, flat plate, and corrugated bulkheads.","topics":["Ship Construction, Stresses and Bulkheads - Learning Outcomes","Construction of Ships","General Cargo Ships","Ship Stresses","Bulkheads","Ship Construction, Stresses and Bulkheads - Lesson Summary"]},{"name":"Module","details":"Diploma in Ship Construction - First Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Ship Construction - First Assessment"]},{"name":"Module","details":"Midship Structure and Hull Fittings","description":"This module will teach you about the different components present in the midship section, as well as the midship structural arrangement for general cargo, container, bulk carrier, oil and ore bulk carrier, and double hull-tank ships. This module will also teach you about constructional features of the bow and stern, the structural arrangement of the aft of a ship, the features of watertight doors, as well as the typical bilge and ballast system pipeline.","topics":["Midship Structure and Hull Fittings - Learning Outcomes","Structural Arrangement Midship","Bow and Stern","Hull Fittings","Midship Structure and Hull Fittings - Lesson Summary"]},{"name":"Module","details":"Steering Machinery and Load Lines","description":"This module will teach you about the propulsion system, components of a transmission system, as well as the constructional features of rudders and propellers. This module will also teach you how to calculate the propeller terms, pitch, and slip. You will also be introduced to the features and working principles of the Voith-Schneider system, azimuthing propulsion drives, as well as ship's load lines","topics":["Steering Machinery and Load Lines - Learning Outcomes","Propulsion and Steering Machinery","Voith Schneider System and Azimuthing Propulsion Drives","Load Lines and Draft Marks","Steering Machinery and Load Lines - Lesson Summary"]},{"name":"Module","details":"Diploma in Ship Construction - Second Assessment","description":"You need to score 80% or more to pass.","topics":["Ship Construction - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Ship Construction - Course Assessment"]}]}