{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3057","title":"Diploma in Marine Boilers","totalEnrolled":"1,507","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study this free online course on the components of marine boilers and the processes involved in boiler heat transfer.","description":"Marine boilers are critical ship elements and are responsible for many ship functions. This Diploma in Marine Boilers free online course teaches you how a marine boiler can be used for main and auxiliary purposes like steam production for running a steam turbine and steam propulsion. You will also learn about cargo pump-turbines, oil heating, accommodation heating and all about the design and maintenance of marine boilers.","courseOutcomes":["Explain the steam cycle and steam en...","Outline the types of auxiliary boile...","Identify the main components of a fi...","Outline the main components of a hig...","Explain the steam cycle and steam engine thermodynamics","Outline the types of auxiliary boilers used aboard a ship","Identify the main components of a fire tube boiler and its functions","Outline the main components of a high-pressure water tube boiler and its functions","Describe the various boiler mountings and their functions in a boiler","Explain the constructional features and the operation of exhaust gas economizers","Identify the boiler combustion process and the working principle of the air register","Describe the types of boiler burners and the boiler fuel oil system","List the arrangement of refractory materials used in boilers","Explain the steam cycle and steam en...","Outline the types of auxiliary boile...","Identify the main components of a fi...","Outline the main components of a hig...","Explain the steam cycle and steam engine thermodynamics","Outline the types of auxiliary boilers used aboard a ship","Identify the main components of a fire tube boiler and its functions","Outline the main components of a high-pressure water tube boiler and its functions","Describe the various boiler mountings and their functions in a boiler","Explain the constructional features and the operation of exhaust gas economizers","Identify the boiler combustion process and the working principle of the air register","Describe the types of boiler burners and the boiler fuel oil system","List the arrangement of refractory materials used in boilers"],"courseDescription":"<p>This Diploma in Marine Boilers is a free online course that begins by introducing you to the application of high-pressure boilers to run the main propulsion turbines of ships. Although this system is on the decline because of newer combined-cycle plants that harness the flexibility of diesel and steam plants, the use of auxiliary and exhaust gas boilers remain an established practice on board diesel-powered propulsion plants. The course will introduce you to steam theory, the components and properties of fluids, the combination of the important modes of heat transfer, as well as the technical terms that are used in connection with steam generation. It will outline the steam engine thermodynamic cycles, the advantages of the steam plant and the role of steam in power generation. The principle of steam generation, the features of boiler design, classification of boiler types and the popular boilermakers will also be covered in this course.</p><p>The material then explains how a marine boiler is optimized for producing steam, as well as how it can be used for main and auxiliary functions like running steam and cargo pump-turbines, oil heating, crew accommodation heating and turbo generation. You will study fire and water tubes, composite boiler types such as the low-pressure boiler as well as how all boilers have a furnace or combustion chamber where fuel is burnt to release energy. The course will teach you the process where the air is supplied to the boiler furnace to enable the combustion of fuel to take place, as well as how the water fed into the boiler can be used to produce steam. It highlights the other important aspect of heat recovery from the diesel engine exhausts, which is the exhaust gas boiler or economizer, as well as how these can be both fire or water tube types and how they contribute significantly to overall plant efficiency. As you work through this marine boilers course, you will analyze the differences between the subcritical and supercritical power plants, types of once-through boilers and the characteristics of D-type boilers. The function of various components in a boiler and boiler mountings, along with mastering the characteristics of the main steam stop and feed check valves is then discussed. Learn all about the feed regulatory system that can be used in steam boilers of a low-pressure system, as well as how to monitor the movement of the float. The examples of a float control application, the element of water level control in high-pressure systems, as well as the importance of the safety and relief valves, will be demonstrated.&nbsp;</p><p>This course on the mechanics of marine boilers will help improve your knowledge of the vital maintenance of the safety valves, including the procedure to set a safety valve of improved high-lift type, as well as the operation of the soot blowers and you should enrol if you are a marine engineering student, professional boilermaker or interested in this crucial part of shipping mechanics.</p><a href=\"https://alison.com/resume/courses/3057\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3057\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Steam Theory and Main Boilers","description":"In this module, you will be introduced to the steam theory, as well as the heat transfer and properties of the fluid. You will also be introduced to the steam engine thermodynamic cycle, as well the main boilers features and the principles of boiler design.","topics":["Steam Theory and Main Boilers  - Learning Outcomes","Steam Theory","Steam Engine Thermodynamic Cycles","Main Boilers","High Pressure Water Tube Boiler","Steam Theory and Main Boilers - Lesson Summary"]},{"name":"Module","details":"Double Evaporation Boiler","description":"In this module, you will be introduced to the double evaporation boiler, as well as the foster wheeler ESD boilers. You will also be introduced to the V2M-8 main Boiler combustion engineering, as well as the once-through boiler types and the main steam stop valve.","topics":["Double Evaporation Boiler - Learning Outcomes","Drum Type WT  Double Evaporation Boiler","Foster Wheeler ESD Boilers","Once Through Boilers and Boiler Mountings","Automatic Feed Regulation and High Pressure Systems","Double Evaporation Boiler - Lesson Summary"]},{"name":"Module","details":"Diploma in Marine Boilers - First Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Marine Boilers - First Assessment"]},{"name":"Module","details":"Safety Valves","description":"In this module, you will be introduced to the safety valve and relief valve definitions and terms. You will also be introduced to a low lift safety valve, improved high lift, high capacity (full lift) safety valve, as well as the maintenance of the safety valve.","topics":["Safety Valve - Learning Outcomes","Safety Valve and Relief Valve","Improved High Lift","Maintenance of Safety Valve","Reflex Level Gauge","Boiler Refractories","Safety Valves - Lesson Summary"]},{"name":"Module","details":"Soot Blowers","description":"In this module, you will be introduced to the concept of soot blowers for high boilers, as well as the diamond retractable soot blower. You will also be introduced to the main fuel system, as well as the process of liquid fuel burning in an open furnace.","topics":["Soot Blowers - Learning Outcomes","Operation of Soot Blowers","High Pressure Boiler Design and Challenges","Waste Recovery System","Exhaust Gas Economizer","Boiler Combustion Process","Soot Blowers - Lesson Summary"]},{"name":"Module","details":"Diploma in Marine Boilers - Second Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Marine Boilers - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Marine Boilers - Course Assessment"]}]}