{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3642","title":"Diploma in Manufacturing Processes: Casting and Joining","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a comprehensive understanding of the manufacturing processes of casting and joining in this free online course.","description":"This course offers you a detailed guide to understanding the manufacturing processes. It focuses on the mass removal and constant mass operation aspects of casting and joining. You will learn the various casting processes, cost analysis, and casting defects. You will also be taught the types, characteristics, features, and limitations of the welding processes. Register for free now.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Manufacturing processes are steps in which raw materials go through several processes to get the final or finished product. This course focuses on the mass removal and constant mass operation or addition aspects of the manufacturing processes. You start by learning the characteristics and classifications of the various kinds of casting processes. The steps involved in the foundry practise of casting and the application of aluminium die casting in automobiles will be highlighted. The entire foundry practice and how to cast an iron wheel will be explained in a short video. The principles of casting are very simple yet, during the process, several aspects have to be considered to get a defect-free result. Five short video clips on how to cast an engine block the BMW way, the Indian way of casting foundry technique, the automation process of casting, how to cast a propeller, and how the casting of a mirror is made, will be shown. Then, you will study the pattern processes. Depending on the pattern and the right internal cavity, the particular part that needs to be created by casting is attained. Thereafter, study the various types of sand molds and their respective parts. The classifications and properties of sand casting are covered in this section. Learn how to design a good gating system to ensure the distribution of metals in the mold cavity at a proper rate. The vertical and bottom gating systems as well as the permeable and impermeable mold aspiration effects will be explained.</p><p>The solidification process in casting is very complicated, but it is thoroughly broken down and explained in this section. The solidification time, temperature, and freezing for pure metals and alloys are discussed. Thereafter, you will be introduced to the expandable mold casting processes with a focus on the shell molds and investment casting processes. You will be taken through the steps involved, their characteristics, advantages, and disadvantages of both shell mold casting and investment casting processes. Next, you will be taught how permanent mold casting is made and learn about die casting machines. The steps, advantages, and disadvantages of the hot and cold chambers of the die castings machine will be highlighted. A short video on how to integrate shapes and how good accuracy parts can be cast or produced in die casting will be shown. Centrifugal and continuous casting will be clarified in this section. The equations of the total cost of casting which includes all costs, both direct and indirect, that results from the design, production, distribution, and use of the cast over its lifetime will be analyzed. Casting defects, their causes, and prevention are also covered.</p><p>This course also teaches you about the joining processes, in which two materials or parts are joined together by welding, rapid prototyping, soldering, or brazing. This course focuses on welding processes and you will learn its mechanisms, classification, importance, and limitations. The physics and power density in the various welding processes will be examined. Then, you will be taught the principles and characteristics of fusion welding. The sources of heat in fusion welding and various fusion welding processes are explained. Next, the effects and steps relating to the cooling of the weld (solidification) and the applications of electron beam, laser beam, and plasma arc welding in the physical world are considered. You will also be introduced to the liquid state welding processes. Study a schematic diagram that exhibits the detailed processes involved in arc welding. The steps and methods of initiating an electric arc as well as the consumable and non-consumable electrodes of arc welding will be emphasized. Furthermore, the shielded metal arc welding and the arc welding processes that use non-consumable electrodes and their various features are discussed in detail. The various types of welding defects, their causes, and preventions will also be covered. This course is of interest to manufacturing or metal engineers, metallurgists, or anyone interested in studying the manufacturing processes. So do not delay, start learning today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}