{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3228","title":"Diploma in Tugboat Operations","totalEnrolled":"568","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course delves into vital safety practices and the hydraulic oil system used during tugboat operations.","description":"This course explores the important safe practices for tug operations during tugboat handling. You will also learn about the equipment used on a tugboat and the stability issues during the vessel operation. We will teach you about the components of hydraulic oil systems and the pumps' classification into different groups. It will also examine the handling tools used in performing operations on systems. Enrol today!","courseOutcomes":["Identify the various types of tug op...","Outline the various modes of tug ope...","Explain the use of various rigging, ...","List the tools and equipment used fo...","Identify the various types of tug operations, and responsibilities","Outline the various modes of tug operations under different conditions of ship work","Explain the use of various rigging, towing gears and their safe usage","List the tools and equipment used for cutting and welding on board","Identify the hazardous cargo and chemicals carried on tugs","Define the concept of the ‘surface finish’ and the drilling tools","Describe how to use the filing, grinding machines and drilling machines","Identify the file specifications, types of files and shapes of files","Explain the concept of the surface finish as and the drilling tools","Discuss how to use the filing, grinding machines and drilling machines","Recognise file specifications, types of files and shapes of files","Identify the various types of tug op...","Outline the various modes of tug ope...","Explain the use of various rigging, ...","List the tools and equipment used fo...","Identify the various types of tug operations, and responsibilities","Outline the various modes of tug operations under different conditions of ship work","Explain the use of various rigging, towing gears and their safe usage","List the tools and equipment used for cutting and welding on board","Identify the hazardous cargo and chemicals carried on tugs","Define the concept of the ‘surface finish’ and the drilling tools","Describe how to use the filing, grinding machines and drilling machines","Identify the file specifications, types of files and shapes of files","Explain the concept of the surface finish as and the drilling tools","Discuss how to use the filing, grinding machines and drilling machines","Recognise file specifications, types of files and shapes of files"],"courseDescription":"<p>This diploma course in tugboat operation is a free online course that introduces you to various tug operations and responsibilities. We demonstrate the multiple modes of tug operation under different conditions of ship work. You will investigate the characteristics of the harbour tugs, tractor tugs and the Azimuth stern drive (ASD) tugs. You will learn how to fit tugs out for rescue and salvage. You find tugs where there are higher concentrations of heavy shipping traffic. We explain how to record training in the ship’s logbooks and various river work scenarios. We outline the precautions and guiding principles that can assist a pilot in his decisions and describe the use of aft tug for breasting the ship's stern in place of the spring line as the critical manoeuvre steps. Understand how you can use towing gear to connect to a tug and tow, towing arrangements and equipment you should confirm during towing. This section ends with the procedures for carrying out checks on the towing winch.</p><p>The course then examines the towline and terminal gear equipment of UTV, the components of the hydraulic oil system and the classification of the pumps into different groups. Learn about oil properties, oil deterioration, oil contamination and oil filtration. Discover the welding and cutting processes in tugboats and the tools used to make permanent joints. We teach you the concept of the current setting, the length of the arc, the angle of travel of the arc welding, the oxy-acetylene gas welding process and finally the brazing process. Explore the sequential operations performed before making a soldered joint and classify the soldering flux and the functions. Become an authority on applying the soldering iron and the safety precautions in soldering. The course will also explain the process of basic marking, how to take measurements on steel plates, features of the measuring gauges and marking tools. You will learn about the measuring tools and marking gauges and how to measure the outer diameter of a cylindrical tube using a vernier calliper.</p><p>Become familiar with the use of a marking gauge, the importance of marking gauges and the essential parts of the marking gauge. You will also learn about handling tools that can be used to perform operations on a physical system and how to use a screwdriver. We demonstrate the general safety precautions of hand tools, misuse of hand tools, basic hand tool safety rules and spark-resistant tools. We highlight some non-sparking tools, different types of hacksaws, the surface finishing process, the important use of grinding machines and the application of drilling machines. We research the importance of filing and grinding, the shapes of files, portable and hand grinding machines. We end the course by disclosing general safety guidelines for different tools and the general precautions that power tool users should observe. This course will be of great interest to students, researchers and anyone intent on learning tugboat operations. So, register for this course and experience the art of tugboat operations.</p><a href=\"https://alison.com/resume/courses/3228\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3228\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Towing Vessel Operations","description":"This module will teach you about the towing vessel operations, operations of the tugboats, as well as the types of tugboats operations. In this module, you will learn about the harbour tugs, oceangoing river tugs, as well as the tug operations and responsibilities.","topics":["Towing Vessel Operations - Learning Outcomes","Operation of Tugboats","Rescue and Salvage Tugs","River Work","Towing Gear, Towing Safety and Record-keeping of Towing Gear","Towing Vessel Operations - Lesson Summary"]},{"name":"Module","details":"Hydraulic Oil System","description":"This module will teach you about the hydraulic oil system, welding and cutting, as well as the tools that can be used for breaking permanent joints. In this module, you will learn about gas cutting, plasma cutting, as well as tools that can be used to make permanent joints.","topics":["Hydraulic Oil System - Learning Outcomes","Hydraulic Oil System","Tools Use for Making Permanent Joints","Soldering Operation","Hydraulic Oil System - Lesson Summary"]},{"name":"Module","details":"Tugs Tools","description":"This module will teach you about the tools that are used on tugs, as well as the features of the marking and measuring tools. In this module, you will learn about the hand tools, safety precautions of the hand tools, as well as the features of the cutting tools.","topics":["Tug Tools - Learning Outcomes","Marking and Measuring Tools","Marking Gauge and Hand Tools","Safety Precautions of Hand Tools","Tug Tools - Lesson Summary"]},{"name":"Module","details":"Diploma in Tugboat Operations - First Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Tugboat Operations - First Assessment"]},{"name":"Module","details":"Safety Guidelines for Tugboat Tools","description":"This module will teach you about the drilling tools, general safety guidelines for different types of tools, as well as the filling and grinding machines. In this module, you will learn about drilling machines, metal tools, external threading, as well as internal threading.","topics":["Safety Guidelines for Tugboat Tools - Learning Outcomes","Surface Finish and Drilling Tools","General Safety Guidelines for Different Types of Tools","Hacksaw Usage, Internal and External Threading","Safety Guidelines for Tugboat Tools - Lesson Summary"]},{"name":"Module","details":"Vessel Stability","description":"This module will teach you about the principles of vessel stability, basic theories on floatation, equilibrium and transverse stability. In this module, you will learn about the principles of statical stability, as well as the factors that influence vessel stability.","topics":["Vessel Stability - Learning Outcomes","Introduction to Vessel Stability","Transverse Stability","Factors of Stability","Vessel Stability - Lesson Summary"]},{"name":"Module","details":"Hatches and Maintenance of Watertight Integrity","description":"This module will teach you about hatches, other openings, watertight integrity, as well as watertight doors and openings. In this module, you will learn about the maintenance of watertight integrity, and the standard operation operating procedures onboard.","topics":["Hatches and Maintenance of Watertight Integrity - Learning Outcomes","Hatches and Other Openings","Maintenance of Watertight Integrity","Stability and Risk of Capsizing","Hatches and Maintenance of Watertight Integrity - Lesson Summary"]},{"name":"Module","details":"Diploma in Tugboat Operations - Second Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Tugboat Operations - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Tugboat Operations - Final Assessment"]}]}