{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2165","title":"Diploma in Architectural Conservation and Historic Preservation","totalEnrolled":"3,179","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about world heritage site management with this online Architectural Conservation and Historic Preservation course.","description":"This free online Architectural Conservation and Historic Preservation course is designed to show you how heritage sites all over the world are identified, preserved and rehabilitated. The course describes heritage sites around the world, including their structure, their decay, and how they are conserved over the years through various world accepted practices. So enroll today and learn something meaningful in just a few hours.","courseOutcomes":["Discuss the significance and values ...","Identify the approaches for managing...","Analyze the ethics of conservation...","Explain the concept of decay with re...","Discuss the significance and values of heritage property","Identify the approaches for managing and rehabilitating heritage properties","Analyze the ethics of conservation","Explain the concept of decay with respect to heritage sites","Explain how heritage properties are identified","Describe the principles and factors governing the foundation behaviour of historic structures","Describe some examples of historic cities and heritage areas around the world","Explain at least two international doctrines governing preservation of monuments and heritage sites","Discuss the concept of historic urban landscape","Define adaptive reuse","Discuss the benefits of adaptive reuse","List the guidelines for rehabilitation of historic structures","Discuss the significance and values ...","Identify the approaches for managing...","Analyze the ethics of conservation...","Explain the concept of decay with re...","Discuss the significance and values of heritage property","Identify the approaches for managing and rehabilitating heritage properties","Analyze the ethics of conservation","Explain the concept of decay with respect to heritage sites","Explain how heritage properties are identified","Describe the principles and factors governing the foundation behaviour of historic structures","Describe some examples of historic cities and heritage areas around the world","Explain at least two international doctrines governing preservation of monuments and heritage sites","Discuss the concept of historic urban landscape","Define adaptive reuse","Discuss the benefits of adaptive reuse","List the guidelines for rehabilitation of historic structures"],"courseDescription":"<p>This Architectural Conservation and Historic Preservation course will give you a comprehensive understanding of the history of world heritage sites and the techniques by which they are identified, conserved and rehabilitated. You will first be introduced to the value and significance of heritage building materials, sites and structures. You will also be taken through the evolution of heritage conservation management through different periods in the world.</p><p>In this free online course on architectural conservation and historic preservation, you will learn about the causes of decay in cultural or historic sites. Knowledge gained from taking this architectural conservation course will help in the easy identification of heritage properties, preparation of conservation documents and comprehension of famous historical stories, including the story of the leaning tower of Pisa.</p><p>Finally, you will learn about new buildings in historic preservation settings, unique heritage zones in India, legally delineated protected heritage areas, and international doctrines governing the preservation of historic areas or heritage zones. You will also learn about how the construction and design of new architecture structures are done to meet the demands of the modern world.</p><a href=\"https://alison.com/resume/courses/2165\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2165\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Overview","description":"In this module, you will be introduced to heritage conversation. You will learn about the purpose of conservation, values and ethics.You will also learn about the significance of heritage and the distinction between architectural and urban conservation.","topics":["Introduction and Overview - Learning Outcomes","Introduction","Need, Debate and Purpose","Heritage Significance and Values","Introduction and Overview - Lesson Summary"]},{"name":"Module","details":"Heritage Values","description":"In this module, you will be introduced to the assessment of heritage significance and values. You will also learn about the divergent approaches for conserving and rehabilitating properties with different degrees of intervention.","topics":["Heritage Values - Learning Outcomes","Assessing Heritage Values & Significance","Assessing Heritage Values & Significance (Contd)","Assessing Heritage Significance Concept & Process","Assessing Heritage Significance Concept & Process (Contd)","Divergent Approaches for Managing and Rehabilitating Heritage Properties: Degrees of Intervention","Heritage Value - Lesson Summary"]},{"name":"Module","details":"Conservation Approaches","description":"In this module, you will be introduced to the ethics of conservation and further divergent approaches for managing and rehabilitating heritage properties. You will also learn about the evolution of heritage conservation.","topics":["Conservation Approaches - Learning Outcomes","Divergent Approaches for Managing and Rehabilitating Heritage Properties - Part 1","Divergent Approaches for Managing and Rehabilitating Heritage Properties - Part 2","Ethics of Conservation","Evolution of Heritage Conservation","Evolution of Heritage Conservation (Contd)","Conservation Approaches - Lesson Summary"]},{"name":"Module","details":"Heritage Sites","description":"In this module, you will be introduced to important heritage sites in the world. You will also learn about their significance and the role of international organisations in the preservation of these sites.","topics":["Heritage Sites - Learning Outcomes","World Heritage Sites Part 1","World Heritage Sites Part 2","World Heritage Sites Part 3","World Heritage Sites Part 4","World Heritage Sites Part 5","Heritage Sites - Lesson Summary"]},{"name":"Module","details":"Diploma in Architectural Conservation and Historic Preservation - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Architectural Conservation and Historic Preservation - First Assessment"]},{"name":"Module","details":"Decay in Cultural Property","description":"In this module, you will learn about the causes of decay in cultural properties and also about documenting heritage properties. This module also give emphasis to the biological and botanical causes of decay and how to prevent it.","topics":["Decay in Cultural Property - Learning Outcomes","Causes of Decay in Cultural Property","Documenting Heritage Properties","Decay in Cultural Property - Lesson Summary"]},{"name":"Module","details":"Documenting, Investigation and Conservation of Historic Structures","description":"Learn about documenting, investigation and conservation of historic structures in this module. Learn also about the principles and factors governing the foundation behaviour of historic structures","topics":["Documenting, Investigation and Conservation of Historic Structures - Learning Outcomes","Documenting Heritage Properties - A Demonstration Example","Investigation and Conservation of Historic Structures - Case Study 1","Investigation and Conservation of Historic Structures - Case Study 2","Conservation of Historic Structures Maintenance and Repair","Documenting, Investigation and Conservation of Historic Structures - Lesson Summary"]},{"name":"Module","details":"Historic Cities and Heritage Zones","description":"In this module, you will learn about historic cities and heritage areas around the world. You will also learn about the declaration of Amsterdam that launched the policies for integrated conservation, and citizen's participation.","topics":["Historic Cities and Heritage Sites - Learning Outcomes","Historic Cities and Heritage Areas","Historic Cities and Heritage Zones - India","Historic Cities and Heritage Sites - Lesson Summary"]},{"name":"Module","details":"New Buildings in Historic Settings","description":"Learn about elements of a townscape, visual impact assessment, benefits of adaptive reuse and guidelines for rehabilitation of older buildings in this module.","topics":["New Buildings in Historic Settings  - Learning Outcomes","New Buildings in Historic Settings","Adapting an Older Building for New Buildings","New Buildings in Historic Settings  - Lesson Summary"]},{"name":"Module","details":"Diploma in Architectural Conservation and Historic Preservation - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Architectural Conservation and Historic Preservation - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Architectural Conservation and Historic Preservation - Final Assessment"]}]}