{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2774","title":"Diploma in Digital Circuits and Systems","totalEnrolled":"1,794","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course on the logical design and implementation of digital circuits and number systems.","description":"This free online course teaches you about the building blocks used in the design and construction of digital circuits. You will learn about the minimization of logical expressions using the design of combinational and sequential circuits. You will also be able to explain the application of number systems, as well as building algorithms in Verilog, a hardware description language (HDL).","courseOutcomes":["Discuss the history of digital circu...","Outline the comparison of digital sy...","Discuss the application of Boolean t...","Explain the uses of Karnaugh maps in...","Discuss the history of digital circuits and systems","Outline the comparison of digital systems to analog systems","Discuss the application of Boolean theorems in logic functions","Explain the uses of Karnaugh maps in Boolean representation","Analyze the multiplexer as a building block for combinational circuits","Outline the flow of the design process and the syntax of the Verilog","Outline the uses of the preset (PRE) and clear (CLR) inputs","Examine the functions of complementary metal-oxide-semiconductor (CMOS)","Analyze the finite state machines","Examine the special class of circuits","Discuss the history of digital circu...","Outline the comparison of digital sy...","Discuss the application of Boolean t...","Explain the uses of Karnaugh maps in...","Discuss the history of digital circuits and systems","Outline the comparison of digital systems to analog systems","Discuss the application of Boolean theorems in logic functions","Explain the uses of Karnaugh maps in Boolean representation","Analyze the multiplexer as a building block for combinational circuits","Outline the flow of the design process and the syntax of the Verilog","Outline the uses of the preset (PRE) and clear (CLR) inputs","Examine the functions of complementary metal-oxide-semiconductor (CMOS)","Analyze the finite state machines","Examine the special class of circuits"],"courseDescription":"<p>Digital circuits and systems is a free online course that begins by introducing you to the basic building blocks in the design and construction of digital circuits. The course will also introduce you to the terminologies used and basic Boolean theorems, as well as the universality of logic gates. You will also learn about combinational circuits and the process of designing a digital circuit. The minimization of logical expressions, as well as a brief introduction to Verilog, will be covered in this course.</p><p><br>The material then explains the basic sequential elements, as well as latches and flip-flops as building blocks in sequential circuits. You will learn about assignment statements and instantiation, as well as the basis of building a hierarchical design. This course will teach you about the importance of complementary metal-oxide-semiconductor (CMOS), as well as give you a brief description of a transistor. Verilog style mixing and an introduction to finite state machines will also be analysed in this course.</p><p><br>Furthermore, you will get familiar with the design and implementation of the greatest common divisor (GCD) algorithm, as well as its translation to Verilog for communication with hardware. You will learn about the instantiation of a controller and data path, as well as the connection between the elements with an interface description. This free online course will be of great benefit to IT students, researchers and anyone with an interest in digital circuits and systems. You can start learning about digital circuits and number systems today.</p><a href=\"https://alison.com/resume/courses/2774\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2774\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Boolean Logic and Terminologies","description":"In this module, you will be introduced to the fundamentals of building blocks in the design of a digital circuit. You will also be introduced to the basic boolean theorems, as well as the associate techniques used in digital circuits. An understanding of Verilog as a hardware description language will also be covered in this module.","topics":["Introduction to Boolean logic, functions and Terminologies - Learning Outcomes","Introduction to Digital Circuits and systems","Basic Boolean Logic","Boolean Theorems","Sum of Product and Product of Sum","Algebraic Minimization Examples","Introduction to Verilog","Introduction to Boolean Logic and Terminologies - Lesson Summary"]},{"name":"Module","details":"Boolean Functions and Truth Tables","description":"In this module, you will be introduced to the concept of universality, as well as its importance in a circuit design. You will also be introduced to the basics of Karnaugh maps and using it in boolean representation. The minimization of multiple-output, as well as the implementation of number systems, will also be covered in this module.","topics":["Boolean Functions and Truth Tables - Learning Outcomes","Universality and Rearranging Truth Tables","Karnaugh Maps","K-Map Minimization","K-Map with Don't Care Conditions","Multiple Output Functions","Number Systems","Boolean Functions and Truth Tables - Lesson Summary"]},{"name":"Module","details":"Design and Analysis of Combinational Circuits","description":"In this module, you will be introduced to the application of combinational circuits, as well as determining the potency of combinational logic designs. You will also be introduced to the universality of multiplexers and demultiplexers. The design process of a circuit, as well as the process of writing Verilog codes, will also be analyzed in the module.","topics":["Design and Analysis of Combinational Circuits - Learning Outcomes","Encoders and Decoders","Multiplexers","Multiplexer-Based Circuit Design","Verilog","Compiling and Running Verilog - A Demonstration","Design and Analysis of Combinational Circuits - Lesson Summary"]},{"name":"Module","details":"Design and Analysis of Sequential Elements","description":"In this module, you will be introduced to the fundamentals and applications of sequential elements in a gated latch. You will also be introduced to the application of registers in sequential circuits. The concepts of Flip-flop, as well as assignment statements and instantiation, will also be covered in this module.","topics":["Design and analysis of Basic Sequential Elements - Learning Outcomes","Sequential Elements","Gated Latches","Flip-Flops","Verilog - Assign Statement and Instantiation","Sequential Circuits","Design and Analysis of Sequential Elements - Lesson Summary"]},{"name":"Module","details":"Diploma in Digital Circuits and System - First Assessment","description":"You must score 80% or more to pass.","topics":["Diploma in Digital Circuits and System - First Assessment"]},{"name":"Module","details":"Introduction to Delays and Sequential Circuits","description":"In this module, you will be introduced to complementary metal-oxide-semiconductor(CMOS), as well as a brief description of a transistor. You will also be introduced to the parameters affecting delays in circuits and the characterization of time. The fundamentals of the state machines and styles mixing in Verilog will also be covered in this module.","topics":["Introduction to Delays and Sequential Circuits - Learning Outcomes","CMOS and Electrical Properties","Delays","Sequential Element Delays","More Sequential Circuits","Introduction to State Machines","Always Statement in Verilog","Introduction to Delays and Sequential Circuits - Lesson Summary"]},{"name":"Module","details":"State Machines","description":"In this module, you will be introduced to finite state machines, as well as the special class of circuits. You will also be introduced to the techniques for solving problems, as well as state minimization in circuits. The process of timing sequential circuits and Verilog styles will also be covered in this module.","topics":["State Machines - Learning Outcomes","Sequential Logic Synthesis","FSM Design Problems","State Minimization","State Assignment","Timing Sequential Circuits","Verilog Styles and Sequential Elements","State Machines - Lesson Summary"]},{"name":"Module","details":"GCD Machine and Data path","description":"In this module, you will be introduced to the design and implementation of the Greatest common divisor algorithm, as well as its translation to Verilog for communication with hardware. You will also be introduced to the application of a controller in GCD machines, as well as the rudiments of the data path.","topics":["GCD Machine and Data path - Learning Outcomes","GCD Algorithm","GCD Machines Datapath","GCD State Machine","GCD Top Level Module","Datapath in Verilog","Datapath Elements in Verilog","FSM in Verilog","GCD Components Interlink","GCD Machine and Data path - Lesson Summary"]},{"name":"Module","details":"Pipelining and Statement Structure","description":"In this module, you will be introduced to the concept of pipelining in digital circuit design, as well as the methodology for pipelining circuits. You will also be introduced to the latency and throughput of a K-pipeline. The algorithms and syntax of assignments in Verilog will also be covered in this module.","topics":["Pipelining and Statement Structure - Learning Outcomes","Pipelining","K-Stage Pipeline","Interleaving and Parallelism","Blocking and Non-blocking Statements","Modeling Circuits with Pipelining","Pipelining and Statement Structure - Lesson Summary"]},{"name":"Module","details":"Number Representation and Arithmetic Circuits","description":"In this module, you will be introduced to number representation, as well as the operational computation of signed numbers. You will also be introduced to the fundamentals of adders, as well as the notion of carry. Multipliers and the recursive doubling technique will also be covered in this module.","topics":["Number Representation and Arithmetic Circuits - Learning Outcomes","Signed Number Representation","Signed Number Addition","Adder and Subtracter","Fast Adders","Multiplication","Number Representation and Arithmetic Circuits - Lesson Summary"]},{"name":"Module","details":"Diploma in Digital Circuits and System - Second Assessment","description":"You must score 80% or more to pass.","topics":["Diploma in Digital Circuits and System - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Digital Circuits and System - Course Assessment"]}]}