{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4045","title":"Diploma in Building Construction Methodology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the modern technologies, technical skills and design models for building construction in this free online course.","description":"In this free online diploma course, you will study the principles and the advanced technical processes, procedures and technologies involved in building construction. We will highlight specific aspects of the tasks, the required tools, and the safety concerns in building construction. By completing this course, you will master the advanced technologies and technical skills for a successful career in civil engineering. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Construction methodology refers to a system of construction that considers the risks, constraints, opportunities, and contractual terms and legal agreements involved in this profession. It provides detailed information about the processes, procedures, and sequences to implement structural development projects. The specific aspects of the tasks to be done, safety concerns and the required tools for performing the necessary tasks are also regarded as parts of the intrinsic components of the system. Construction methodology incorporates essential techniques such as project control systems, implementation plans, project planning, and quality control policies for the materials. This subject also covers the project mobilization planning technology and the structural layout and site facilities. First, you will consider the site clearing activities and the preliminary activities on the construction site. We will also show you the practical procedures for excavation and grid line marking. We will explain the differences between the nominal mix and the design mix of concrete. Then, you will learn about soil preparation for Plain Cement Concrete (PCC), placing of column reinforcement, and shuttering for the foundation.</p><p>Next, we will demonstrate the step-by-step system for marking the starter column, placing the starter frame for column concrete, and shuttering for the column. We will show you the four types of stirrups used in column reinforcements. Similarly, we will present the methods for concreting and curing the columns. Learn how to properly carry out the backfilling of foundations, which is considered the most crucial task for the site engineer. We will discuss the preparation of plinth beam PCC and the chemicals and systems used for the anti-termite treatment of the PCC. We will explore the methods for placing the plinth beam reinforcements and shuttering and the procedures for concreting the plinth beams. The course material on the finishing activities will cover the brickworks, types of bricks, and the types of brick bonds used in building construction. The course material will also reiterate the importance of concrete bands and sill concrete in earthquake-prone regions. We will also examine the practical measures for casting the lintel and chajja in earthquake-prone and non-earthquake-prone regions. You will also learn how to carry out the Mechanical, Electrical, and Plumbing (MEP) activities on a construction site by properly following the instructions provided in a detailed structural drawing.</p><p>Furthermore, we will teach you the application of methods used for fixing window and door frames. Next, we will highlight the activities involved in ceiling and wall plastering. You will see the work checklists, including the pre-checks, process checks, and safety checks to be carried out on a construction site. The concluding parts of the course will cover the process and importance of painting, the components and systems for the formworks, the methods for scaffolding, and the concepts for a state-of-the-art home interior. Whether you are an aspiring engineer, engineering trainee, professional building contractor, or experienced structural engineer, you will benefit from this course. By completing this course in construction methodology, you will master the systems for executing successful building construction projects and contracts. You will master the basic principles, technical knowledge, and creative skills to pave your way from a beginner to a professional level in structural engineering. So, why wait? Start this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}