{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3023","title":"Diploma in Solar Energy Engineering","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free engineering course, you will learn about harnessing solar energy, photovoltaics and solar installations.","description":"You will learn how to design photovoltaic (PV) systems for the conversion of solar energy into useful electrical energy for both stand-alone and grid-connected systems. You will also study solar radiation and its geometry to be able to extract the maximum energy out of solar radiation at a given location. The comprehensive course material also covers solar thermal devices.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the field of solar energy engineering and reveals some of the basic techniques and measures adopted by solar scientists and engineers to gauge and capture solar radiation. Begin by exploring the need for, and importance of, renewable energy sources in today's world and the global focus on solar energy. Learn about the nature of solar radiation, how it reaches the earth and the different ways it can be used. This section includes the employment of different instruments and devices for capturing and storing solar radiation, both in thermal and electrical forms. While you gain a basic understanding of how solar PV generators and solar power plants work, you will see how solar equipment designers predict and estimate the amount of solar energy available and the challenges they face. Learn about the empirical equations and correlations that relate the values of radiation (global or diffused), with meteorological parameters like sunshine hours, cloud cover and precipitation. Several numerical examples will give you ample practice in making calculations related to real-life problems and scenarios encountered by solar energy engineers.&nbsp;</p><p>As you progress, you will appreciate the need for estimating and predicting the availability of solar radiation, not only in the different parts of the world but also in extraterrestrial regions. Grapple with designing different photovoltaic systems for the conversion of solar energy into electricity, including the construction of PV cells and their manufacturing process, specifications of solar modules, arrays, their application, and the working principles of solar cells. To understand how solar cells work, you will dive into the fascinating field of semiconductor physics. Like all systems, PV conversion has its own challenges and you will be introduced to difficulties such as cell mismatch, the effect of shadows, maximization of solar PV output, and load matching. You will be shown certain solutions to these challenges, such as mechanical and electrical tracking and bypass diodes. Finally, you will learn the steps in the design process of stand-alone and grid-connected PV systems and their performance analysis.&nbsp;</p><p>Anyone with a basic knowledge of physics who understands the fundamentals of light, electricity and thermodynamics can take this course. The technology and engineering behind solar power and solar energy are enthralling. Building a career in energy engineering or a related field can be extremely rewarding as the need for energy engineers and technologists is gaining momentum. Furthermore, due to the current emphasis on sustainability, architects and town planners must also incorporate solar energy devices in all their designs and planning of green buildings and environments. This course will be also helpful to you should you wish to pursue a career in environmental studies, architecture or planning.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}