{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2418","title":"Diploma in Audio System Engineering","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the basic principles and processes in audio system engineering in this free online diploma course.","description":"This free online Diploma in Audio System Engineering course teaches you the basic principles, processes, and models that are essential for acoustic systems. Learn about the importance of linear vibrations, the concepts of oscillation and some mathematical tutorials. You will learn about the sensitivity of microphones and the functional requirements of a loudspeaker. Begin this course and improve your audio engineering knowledge and skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This audio engineering course begins by explaining the different fundamental concepts behind audio system engineering and an overall understanding of the propagation of sound. You will learn about the basics of acoustics, sound reflection, transmission, absorption, attenuation and the calculation of reverberation time. You will also learn about Kirchhoff’s loop rule and the types of cascading. You will solve mathematical problems on velocity, oscillation, mechanical acceleration and equivalent mechanical circuits.</p><p>The course then explains condensation, relaxation, some acoustic variables and the necessary differential equations to obtain a wave equation. You will be introduced to the applications of Linear Force Equation also known as Euler’s equation and Linear Continuity Equation. You will learn about the human perception of sound as well as the step-by-step process of hearing. You will also learn about sound pressure level loudness, intensity and transfer functions at the periphery.</p><p>You will be introduced to the significance of the acoustic environment as well as the factors affecting the acoustic environment. You will also learn about the types of sound fields including free fields, diffuse fields and others. You will learn about the concept of acoustical transduction and psychoacoustic transduction. You will also learn about the sensitivity of microphones and the electronically standard sensitivity defined by the Electronic Industries Association (EIA).</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}