{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3130","title":"Diploma in Marine Electrical","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the principles of electricity to see how they affect marine electrical technology in this free online course.","description":"This free online course offers you a comprehensive guide to the fundamental principles of electricity and explains how they apply at sea to power marine electrical technologies. We describe safety measures that prevent shock and protect electrical circuits. We then examine electrical distribution systems and performance tests to provide you with the skills you need to work onboard a ship or as a maritime engineer.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course provides an in-depth and practical understanding of the principles of electricity that affect battery maintenance and electric currents. We delve into electric distribution systems, performance tests and the maintenance of electrical equipment. We also lay out the fundamental definitions and laws of electricity and magnetic induction. The course covers electron theory, electromotive force (EMF), voltage and current in electrical circuitry before moving on to alternating current, power factor calculations and the working of electrical circuits. Batteries are an essential feature of ships and their maintenance can affect safety at sea. We go through the description, operation and layout scheme of marine electrical machinery. We then lay out the operating principles of electrical generators and motors as we examine their shipboard distribution, insulation properties and common challenges. This course then investigates the inspection, safety concerns and maintenance of marine electrical machinery, which requires continual monitoring, testing and attention to stay in good working order.</p><p>We explore the concepts of resistance, resistivity and inductance and explain the difference between electrical elements and networks. We outline the color-coding of capacitors and break down the factors affecting their capacitance value. We then investigate the flow of electrons on an atomic level. The course then moves on to the components, types and mechanics of batteries and their chargers as we examine their application, performance, maintenance and troubleshooting methods. We cover electrolysis and the internal resistance and polarity of batteries before laying out the factors that increase the risk of electric shock in the marine environment along with its quick treatment. We take you through the safety management requirements of marine systems and identify the steps taken to prevent electrical shock. The course breaks down the basic laws of electricity, including Kirchhoff's laws, Ohm's law and those governing energy and power. We compare series and parallel connections and demonstrate the usage of direct current (DC) voltages in various circuits.</p><p>This course clarifies basic concepts pertaining to electrical currents and electromagnetism as well as the practical alternating current (AC) generator. We teach you the reactions of circuits consisting of resistors, inductors and capacitors. We then show you the layout of AC and DC shipboard installation in addition to the ship's navigation light circuit. The course outlines marine power distribution systems along with the concept of high- and low-voltage application. We identify the types and methodology of electrical maintenance and show you how to maintain DC machines, alternators and induction motors. We demonstrate the process of detecting electric malfunctions and describe measures to prevent further damage. We then go through the maintenance of switchboards. The course wraps up with an analysis of the function, configuration and performance tests of marine electrical equipment and its monitoring systems. This course suits electricians, marine engineers and anyone working at sea as we provide the information and skills you need to keep ships safe and moving.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}