{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2845","title":"Diploma in Robotics","totalEnrolled":"6,830","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the uses of robots and how they are classified, laws of robotics and more in this free online diploma course.","description":"This free online diploma course in robotics unravels the fundamentals of this field, starting with its history before moving onto the various applications and laws of robotics. You will enhance your understanding of both forward kinematics and inverse kinematics in animation and gain knowledge of ‘manipulators’, a key part of industrial robots. You will also learn about DH algorithms, along with differential relations.","courseOutcomes":["Define robotics...","List the various application of robo...","Discuss the laws of robotics...","Explain the use of rehabilitation ro...","Define robotics","List the various application of robotics","Discuss the laws of robotics","Explain the use of rehabilitation robotics","Define kinematics","Contrast polar robot characteristics to Cartesian robot characteristics","Explain the DH algorithm","Distinguish between joint parameters and link parameters","Recognise a six-articulated arm","List the necessary condition for the solvability of a manipulator","Contrast tool configuration Jacobian to manipulator Jacobian","Explain static analysis of the manipulator Jacobian","Define robotics...","List the various application of robo...","Discuss the laws of robotics...","Explain the use of rehabilitation ro...","Define robotics","List the various application of robotics","Discuss the laws of robotics","Explain the use of rehabilitation robotics","Define kinematics","Contrast polar robot characteristics to Cartesian robot characteristics","Explain the DH algorithm","Distinguish between joint parameters and link parameters","Recognise a six-articulated arm","List the necessary condition for the solvability of a manipulator","Contrast tool configuration Jacobian to manipulator Jacobian","Explain static analysis of the manipulator Jacobian"],"courseDescription":"<p>This diploma course covers the main themes in robotics, starting with the basics such as its origins. After this, kinematics and the Diffie-Hellman (DH) algorithm are unravelled, along with important differential relations. Although its roots go back to the fourteen or fifteen century, robotics is a relatively new science, engineering discipline or industrial technology that is often misrepresented in the popular media. You will learn that the history of modern robotics can be traced back to 1495 when Leonardo da Vinci designed a mechanical device that looked like an armoured knight. Later, Czech playwright Karel Capec introduced the word ‘robot’ from the Czech word, ‘robota’, meaning ‘tedious labour’. Then move onto to study the basic laws that regulate robotics, such the Zeroth law, which says that a robot may not injure humanity or, through inaction, allow humanity to come to harm. Industrial robots (manipulators), fields and service robots (humanoids, medical robots and walking robots), and entertainment and educational robots are the three main categories that you will explore next.</p><p>A robot's joints and links will then be discussed in the course material. Learn how joints provide relative motion while links are rigid members between joints. There are various joint types, such as linear and rotary, and each joint provides a ‘degree of freedom’. You will see how many degrees of freedom most robots possess. Robot architecture is the combination and disposition of the different kinds of joints that configure the robot’s kinematical chain. As you progress through the course, you will be taught that the relative position and orientation of the axes of two successive joints can be specified by two link parameters, link length and link twist angle. You will also learn that you can represent the orientation in joint co-ordinates by the YPR (yaw, pitch and roll) convention. In rectangular or Cartesian co-ordinates, the same can be represented by a rotation matrix R, where the three columns of R correspond to the normal, sliding and approach vectors respectively. You will discover that in order to manipulate objects, it is required to control both the position and orientation of the tool/end effector in a three-dimensional space.</p><p>Finally, you will study robot path planning: such a problem is formulated in a tool-configuration space, and robot motion is controlled at the joint space. You will discover that one of the potential problems with solving for joint space velocity is the non-existence of inverse, and the Jacobian matrix may not be invertible for all the values. Find out at which points in joint space, Jacobian loses its rank and why there is a reduction in the number of independent rows and columns. As part of analysing the Jacobian matrix, you will study joint spaces singularities and learn that the interior singularity is potentially troublesome, as it is formed when two or more axes form a straight line. This course will be of great interest to industrialists who might use robots in their factories or who are investigating automation. Students of mechanical engineering, especially those specializing in robotics, will also find this course particularly interesting.</p><a href=\"https://alison.com/resume/courses/2845\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2845\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Robotics","description":"In this module, you will learn about the fundamentals of robotics. You will be taught about the various applications of Robotics, along with the history and laws of robotics. The classification of Robots will be discussed, highlighting industrial and rehabilitation robotics. Manipulator Kinematics, which is about object location and motion, will be covered, along with transformation matrices and homogeneous transformations.","topics":["Fundamentals of Robotics - Learning Outcomes","Introduction to Robotics","Evolution of Robotics","Classification of Robots and Rehabilitation Robotics","Manipulator Kinematics","Homogeneous Transformation","Fundamentals of Robotics – Lesson Summary"]},{"name":"Module","details":"Robotics and Kinematics","description":"This module covers Robotics and Kinematics and addresses the degree of freedom a robot may have. It also addresses the robot anatomy, with some emphasis on the joints and links of a manipulator. You will be taught the five common body-and-arm configurations for industrial robots and the characteristics of the SCARA Robot. Wrist configurations are highlighted with some emphasis on end effectors and mechanical grippers.","topics":["Robotics and Kinematics – Learning Outcomes","Industrial Robot-Kinematic Structures","Robot Architectures","Kinematic Parameters","Robotics and Kinematics – Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"","topics":["First Assessment"]},{"name":"Module","details":"DH Algorithm","description":"This module is about the DH Algorithm. You will learn about the direct forward kinematics. A specific Example of DH Algorithm will be provided. You will be taught about assigning coordinate frames and determining kinematic parameters for a 5-axis articulated Robot, Alpha II, along with the Arm Matrix.","topics":["DH Algorithm - Learning Outcomes","DH Algorithm - Concept","DH Algorithm - Examples","DH Algorithm – Lesson Summary"]},{"name":"Module","details":"Kinematics","description":"This module is about Kinematics. The direct forward kinematics introduces the problem of the case of the Alpha II Arm and that of six-axis articulated Arm. You will learn how to cross-check to make sure that the formulation you got for the forward kinematics is correct. The inverse kinematics problems will also be addressed. Specific examples will be given, along with the most commonly used equations and their solutions.","topics":["Kinematics – Learning Outcomes","Forward Kinematics","Forward Kinematics - Examples","Inverse Kinematics - Concept","Inverse Kinematics - Example","Kinematics – Lesson Summary"]},{"name":"Module","details":"Differential Relations","description":"This module covers differential motions and statics, allowing you to learn about the calculation of the Jacobean. You will also learn about the singularities, along with the generalized inverses. The module addresses the Manipulator Jacobian, highlighting the computational method, along with the related algorithm. The numerical computation of the Jacobian will be unravelled.","topics":["Differential Relations – Learning Outcomes","Differential Motions and Statics","Manipulator Jacobian and Statics","Differential Relations – Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Robotics - Course Assessment"]}]}