{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3474","title":"Diploma in Metabolic Network Analysis and Applications","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about transgenic technologies, bioenergetics, and metabolic network analysis in this free online course.","description":"In this metabolic engineering course, study the interconnections, ‘circuit diagrams’, and key features of biological networks. The reaction maps, boundaries, and stoichiometric matrixes will be explained. Also, the CRISPR system and CRISPR-Cas9 tools will be extensively discussed. By completing this exciting course, you will acquire in-demand technical knowledge for a rewarding career in systems biology or bioenergetics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Bioenergetics is the sum of the processes of transformation of external sources of energy into biologically useful work of living systems, and the process of storing and consuming the energy in the form of adenosine triphosphate (ATP). In this course, you will study bioenergetics, and how it highlights the cellular energy requirements for biofuel synthesis. The cellular carbon yield and energy efficiency, and the process of ATP formation from the electron transport chain will be discussed. The one-dimensional annotation of genome sequences will highlight the procedures for locating the open reading frames (ORFs) and assigning functions to gene products. Similarly, the two-dimensional systems will cover reaction mechanisms, regulatory networks, and signalling networks etc. You will examine the biochemical network reconstruction process and the four-level hierarchy for simplifying the conceptualization of network functions. Then, the genome-scale metabolic model and the mathematical representation of biochemical networks will be elucidated. Learn the methods for defining a network boundary, as well as the mathematical models for estimating a network map and stoichiometric matrix.</p><p>Next, discover the definition and mathematical procedures for formulating an objective function. The systems for assessing the sensitivity of the optimal properties of a network (also known as robustness analysis) will be covered. The module on phase plane analysis considers the characteristics and mathematical systems for value estimations from the four isocline regions of a metabolic network. Examine randomized sampling, and artificially centered hit and run (ACHR) procedures for characterizing and estimating the centre of a flux solution space. Likewise, the module on computational design of mutant strains will dissect optknock, optstrain, and other strain development strategies. Learn about the convex basis for the null space, elementary modes, and extreme pathways. Additionally, the 13C labelling techniques, 13C MFA formulation steps, and the challenges in 13C-assisted MFA will be highlighted. The systems for 13C fingerprinting and nonstationary metabolic flux analysis (NMFA) will be discussed. Then, the applications of metabolic engineering in microbial strain design are looked at. The module on genome editing technology highlights several genetic tools and strategies employed for gene expression modulation and metabolic pathway optimization. You will learn about promoters, ribosome binding sites (RBS), RNA-mediated gene modulation systems, etc.</p><p>Finally, the exciting features and basic timelines of CRISPR technology will be examined. Learn about the CRISPR array, the structure of the CRISPR locus, and the stages of CRISPR-Cas adaptive immunity. Also, the basis of the Cas9 engineering tool, plus the advantages of CRISPR-Cas9 over other conventional tools, is highlighted. You will be shown how to classify the chemicals produced by bioengineered microorganisms (also known as the microbial cell factories). Then, the microbial factories for hemicellulosic ethanol production in yeasts and lignocellulosic bioethanol production in E. coli will be identified. Similarly, the strategies and applications of metabolic engineering in amino acids production will be disclosed. What are the functional states of biological networks? How can the information obtained from reaction networks be presented in a mathematical framework? These questions will be addressed in this course and the practicable solutions will be revealed. If you want a career in systems biology, metabolic engineering, or related disciplines, then you will find this course exciting and rewarding. Your application of the knowledge acquired in these subjects could lead to improvements in the development of natural metabolites and products for the pharmaceutical, bioenergy, or biotechnological industries.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}