{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3232","title":"Diploma in Ship Handling and Seamanship","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about ship manoeuvring methods, functions of the IAMSAR manual and safety at sea in this free online course.","description":"Begin your studies into maritime safety as you are introduced to various ship manoeuvre procedures. You will learn about the effects of wind and currents on vessels, as well as how to berth and unberth in various weather conditions. This course explores the IAMSAR manual and highlights the search patterns recommended by the IAMSAR. This course also prepares you for various emergencies at sea and best practices for handling vessels.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Inclement weather is one of many troubles you may experience while on the open water. Handling your vessel in the safest possible manner is not just vital to yourself but also to your crew. Throughout this course, you will be introduced to the fundamental concepts associated with ship control methods as well as the external factors that affect vessels while in confined and coastal waters. The course explains the theoretical knowledge behind the safe operation of vessels in different weather conditions. This course is designed to help develop your skills and provide the necessary principles and practices to be carried out in cases of emergency. It explores vessel manoeuvre techniques, their procedures and appropriate situations in which they can be applied. Various search and rescue patterns, as well as actions to take in emergency situations on the sea, will also be covered in this course.</p><p>This course then explains vessel traffic services (VTS), which are shore-side systems that include the provision of simple information messages to ships. It highlights the purpose of VTS and proceeds to explore traffic separation schemes (TSS). You will learn about conflicting and complex navigation patterns of the VTS as well as difficult hydrographical, hydrological and meteorological elements. This course explains the International Aeronautical and Maritime Search and Rescue Manual (IAMSAR manual), which provides guidelines for common aviation and maritime approaches. You will also learn about organising and providing search and rescue (SAR). This course will teach you how to deal with specific search and rescue (SAR) system duties. With all these different systems how do you determine which one to use at any one time? This course will explain the various circumstances in which these search patterns are best applied.</p><p>Furthermore, this course explains emergency steering as a system that is used during the failure of the main steering system. It describes emergency steering operation and the periodical checks required. Also, you will learn about auxiliary steering procedures, their arrangements and some of the emergency operations. Emergency regulations, drills and testing carried out at sea will also be covered. This course explains squats, their causes and the formulae for calculating squat open water, canals/prismatic channels and rock cuts/diametric channels. You will also learn about propeller transverse thrust, which is necessary for vessel handling. The course explains the movements of the pivot point along with how a propeller functions. This free online course will be of great interest to students, researchers and anyone with an interest in ship handling and seamanship. So register for this course and start your next learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}