{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3089","title":"Diploma in Maritime Bearings and Lubrication","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles and types of lubrication used in bearings and lubrication in this free online course.","description":"Maritime lubrication and bearings present a unique field of expertise. This course explains the different types of bearings available and describes how various types of bearings use solid and liquid lubrication to stay functional. For example, pumps and motors use simple ball bearings and bigger pumping units use double-ball bearings to make hydraulic thrusts. Take this course and become better acquainted with maritime lubrication and bearings.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Bearings and lubricants are essential aspects of a ship’s onboarding system. This course investigates all aspects of maritime bearings and lubricants and explains the differences between each. The turbocharger is the most important roller bearing used on ships because of high speed and alignment issues related to turbochargers. For gearing with axial and out-of-balance forces, it might be good to use conical roller bearings. The gearboxes and epicyclic gearing will also have advanced roller type sleeve bearings. Learn to use different size bearings depending on the circumstance. For example, use large bearings for slow-speed diesel propulsion engines. The lubrication of bearings involves both solid and liquid lubrication methods, starting with grease to lube oil. We need to understand their properties and be familiar with various lubrication systems and their principles of operations. Various diesel engines use different lubrication system layouts for piping, pumps, filters, purifiers and so on. It is imperative to keep the lubrication system healthy at all times, under operation or when engines rest. From summer to winter climate and sea conditions, the purification system maintains the cleanliness of the oil under circulation. Ill-treatment of lube oil means destruction of the engine, leading to severe and fatal accidents on board ships.</p><p>The course begins by explaining the principles and types of lubrication used in bearings. Then, we will discuss the application of roller, ball bearings and their lubrication needs using grease or solid lubricants. The course defines bearing as a friction-reducing machine element. Bearings also support and align the rotating parts of machines. Bearings are usually located on both sides (drive and non-drive end) of the pump and motor shafts inside bearing housings. Other than the larger journal and cross-head bearings for heavy and high torque machinery, the most common bearings on board are relatively smaller sized ball and roller bearings. They can be identified from the numbers written on them. We will take you through the various types of lubrication systems employed on main and auxiliary diesel engines. Bearings are particularly important in their use on shipboard machinery. A journal bearing is essentially a cylindrical shaft in a cylindrical cavity of larger diameter and the space between them contains a liquid lubricant. This course does a great job of explaining the application of journal bearings for marine use and the various types of sliding contact or friction bearings.&nbsp;</p><p>This course then discusses the types of lube oils that need to be selected in marine diesel engines and the type of lube oil systems used for the propulsion engines. Learn about the cylinder lubrication system used for propulsion engines, the lube oil system for a 4-stroke diesel and the splash type lubrication for trunk type engines. It is crucial to understand the lube oil properties essential for lubrication. We walk you through the categorisation of lube oils used onboard and the principles governing various types of lubrication. Lubricating oils are designed to perform multiple tasks. A modern engine lubricating oil, apart from keeping the engine parts moving freely, is expected to withstand high temperatures without carbonising, neutralise acidic combustion products, keep the engine clean and prevent corrosion. This is achieved by blending oils and adding additives. This course explains in great detail the considerable importance of additives in the modern-day engine. If you are an engineering professional interested in the mechanical field, then this course from Alison will be a great fit for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}