{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2732","title":"Diploma in Technologies for Clean and Renewable Energy Production","totalEnrolled":"2,327","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online course on the production of clean energy, the gasification of coal, and various renewable sources of energy.","description":"This free online course on technologies for clean and renewable energy production teaches you about the concepts of clean energy and renewable energy, as well as the cleaner routes for energy production from coal. You will learn about the use of petroleum in energy production. You will also be able to explain the removal of impurities from liquid fuel. Start this course today to improve your understanding of clean and renewable sources of energy.","courseOutcomes":["Identify the important routes for ob...","Outline the need for clean and renew...","Discuss the concept of coal characte...","Explain the basic chemistry of gasif...","Identify the important routes for obtaining clean energy from fossils","Outline the need for clean and renewable energy","Discuss the concept of coal characterization","Explain the basic chemistry of gasification","Outline the challenges faced while producing energy from petroleum","Discuss the problems of heavy crude oil and its refinery solution","Outline some important routes for liquid fuel production from syngas","Discuss the various routes for hydrogen production from natural gas","Explain the sun and wind as a source of energy","Discuss the hydrologic cycle as a renewable energy source","Explain the mechanism of hydro energy production","Describe geothermal energy as a source of renewable energy","Discuss biomass and wastes energy conversion routes","Identify the important routes for ob...","Outline the need for clean and renew...","Discuss the concept of coal characte...","Explain the basic chemistry of gasif...","Identify the important routes for obtaining clean energy from fossils","Outline the need for clean and renewable energy","Discuss the concept of coal characterization","Explain the basic chemistry of gasification","Outline the challenges faced while producing energy from petroleum","Discuss the problems of heavy crude oil and its refinery solution","Outline some important routes for liquid fuel production from syngas","Discuss the various routes for hydrogen production from natural gas","Explain the sun and wind as a source of energy","Discuss the hydrologic cycle as a renewable energy source","Explain the mechanism of hydro energy production","Describe geothermal energy as a source of renewable energy","Discuss biomass and wastes energy conversion routes"],"courseDescription":"<p>Technologies for clean and renewable energy production is a free online course that begins by introducing you to the concepts of clean energy and renewable energy. The course will also introduce you to the cleaner routes for energy production from coal, and the concept of gasification of coal along with the direct liquefaction of coal. The origin of petroleum, how petroleum is used for energy production, as well as some petroleum products and the conversion of intermediate products will also be covered in this course.</p><p>This course then explains the processes for the removal of impurities from liquid fuel, the upgradation of petroleum residues, as well as the concept of heavy crude oil processing. You will learn about gaseous fuels, the routes for energy production from fuels, as well as the production of hydrogen and syngas from natural gas. This course will teach you about the concept of the sun as a source of energy as well as the applications of solar energy in energy production, and the future of wind energy in energy production.</p><p>Furthermore, this course will help you get familiar with the generation of energy from water otherwise known as hydro energy, as well as the roles of geothermal energy, tidal and wave energy. You will learn about biomass as one of the most important resources for renewable energy production, and the concept of energy conservation. This free online course will be of great interest to students, researchers, and anyone with an interest in clean and renewable energy production. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/2732\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2732\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Energy Production from Coal","description":"In this module, you will be introduced to the concepts of energy, as well as clean energy and renewable energy. You will also be introduced to coal as a source of energy, the characterization of coal and the route for energy production from coal.","topics":["Energy Production from Coal - Learning Outcomes","Introduction to Energy","Coal as a Source of Energy","Characterization of Coal","Conventional Route","Energy Production from Coal - Lesson Summary"]},{"name":"Module","details":"Coal Gasification","description":"In this module, you will be introduced to the cleaner routes for energy production from coal. You will also be introduced to the concept of gasification of coal along with the direct liquefaction of coal.","topics":["Coal Gasification - Learning Outcomes","Clean Route for Energy Production from Coal","Chemistry of Coal Gasification","Syngas Cooling and Conditioning","Direct Liquefaction of Coal","Coal Gasification -  Lesson Summary"]},{"name":"Module","details":"Petroleum Products","description":"In this module, you will be introduced to the origin of petroleum as well as petroleum for energy production. You will also be introduced to the characteristics of crude oil and petroleum products along with the conversion of intermediate products.","topics":["Petroleum Products - Learning Outcomes","Petroleum as a Source of Energy","Characteristics of Crude Oil and Petroleum Products","Refining of Crude Oil for Fuels Production","Conversion of Intermediate Products","Petroleum Products - Lesson Summary"]},{"name":"Module","details":"Impurities and Residues","description":"In this module, you will be introduced to the processes for the removal of impurities from liquid fuel. You will also be introduced to petroleum residues, its up-gradation as well as heavy crude oil processing.","topics":["Impurities and Residues - Learning Outcomes","Impurities Removal from Liquid Fuels","Petroleum Residue and Routes for Up-gradation","Mechanisms for Residue Upgradation","Heavy Crude Oil Processing","Impurities and Residues - Lesson Summary"]},{"name":"Module","details":"Diploma in Technologies for Clean and Renewable Energy Production - First Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Technologies for Clean and Renewable Energy Production - First Assessment"]},{"name":"Module","details":"Introduction to Natural Gas","description":"In this module, you will be introduced to gaseous fuels as well as the properties and routes for energy production. You will also be introduced to the production of hydrogen and syngas from natural gas.","topics":["Introduction to Natural Gas - Learning Outcomes","Properties and Routes for Energy Production","Syngas Production from Natural Gas","Syngas to Liquid Fuel Production","Hydrogen Production from Natural Gas","Introduction to Natural Gas - Lesson Summary"]},{"name":"Module","details":"Solar and Wind Energy","description":"In this module, you will be introduced to the concept of the sun as a source of energy as well as the applications of solar energy. You will also be introduced to wind energy in India and the future of wind energy.","topics":["Solar and Wind Energy - Learning Outcomes","Solar Energy and Radiation","Solar Energy Conversion","Wind Energy Systems","Principles of Wind Power Systems","Solar and Wind Energy - Lesson Summary"]},{"name":"Module","details":"Hydro, Geothermal and Tidal Energy","description":"In this module, you will be introduced to the generation of energy from water otherwise known as hydro energy. You will also be introduced to the concept and roles of geothermal energy, tidal and wave energy.","topics":["Hydro, Geothermal and Tidal Energy - Learning Outcomes","Hydropower Components and Mechanisms","Principles of Hydro Turbines","Geothermal Energy","Tidal Energy","Hydro, Geothermal and Tidal Energy - Lesson Summary"]},{"name":"Module","details":"Biomass and Waste","description":"In this module, you will be introduced to biomass as one of the most important resources for renewable energy production. You will also be introduced to energy conservation for the optimization of energy usage.","topics":["Biomass and Waste - Learning Outcomes","Energy from Biomass and Waste - Biological Route","Energy from Biomass and Waste - Chemical Route","Energy from Biomass and Waste - Physical Route","Energy Conservation","Biomass and Waste - Lesson Summary"]},{"name":"Module","details":"Diploma in Technologies for Clean and Renewable Energy Production - Second Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Technologies for Clean and Renewable Energy Production - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Technologies for Clean and Renewable Energy Production - Course Assessment"]}]}