{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2984","title":"Diploma in Prevention of Pollution by Oil from Ships","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about regulations and methods aimed at preventing oil pollution from ships and tankers in this free online course.","description":"‘Diploma in Prevention of Pollution by Oil from Ships’ is a free online course that provides an effective guide to understanding the protection of the marine environment. Learn about the sources, effects and conventions to curb marine pollution as you analyze the relevant equipment, regulations and up-to-date terminology of this important field.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>On 24 March 1989, the Exxon Valdez spilled over 11 million gallons / 42 million litres of crude oil into the water of Prince William Sound in the Gulf of Alaska. Although the environmental damage and massive clean up efforts were the most visible effects of this casualty, one of the most important outcomes was the enactment of the United States’ Oil Pollution Act of 1990 (OPA) by President George HW Bush. The OPA works to avoid oil spills from vessels and facilities by enforcing the removal of spilled oil and assigning liability for the cost of clean up and damage; requiring specific operating procedures; defining responsible parties and financial liability; implementing processes for measuring damages; specifying damages for which violators are liable; and establishing a fund for damages, clean up and removal costs. It amended the US Clean Water Act of 1972 and addressed the wide range of problems associated with preventing, responding to, and paying for oil pollution incidents in navigable waters of the US.</p><p>This diploma provides an in-depth analysis of the sources and effects of marine pollution by ships and oil tankers. The course also discusses the regulations, conventions and equipment that have been adopted for the prevention of oil pollution to protect fragile marine environments. You will learn about the MARPOL Annex I, which deals with the prevention of pollution by oil and came into effect on the 2 October 1983. It regulates the methods and means of controlling discharge of oil into the sea, and applies to all ships but provides for exemptions and waivers under certain conditions. ‘Ship’ here means a vessel of any type whatsoever operating in the marine environment. Some exceptions for discharges are allowed for safety of a ship or due to damage to the ship or its equipment. MARPOL Annex II is a regulation for the control of pollution by the noxious liquid substance in bulk that came into effect on 6 April 1987.&nbsp;</p><p>This free online course aims at inculcating the knowledge and values necessary for pollution prevention from shipping and tanker operations at sea. As a learner, you will study the evolution of the United Nations Law of the Sea (UNCLOS) and its relationship with marine pollution, along with the list of international conventions for oil pollution, liabilities and compensation. You will also examine the spill and pollution combating equipment that are available on board as well as the Shipboard Oil Pollution Emergency Plan (SOPEP). This course will be of significant interest to students, researchers and professionals involved in marine engineering and environmentalism. Register for this course now and begin your next learning journey today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}