{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2860","title":"Diploma in Marine Diesel Engines","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on principles of diesel engines, as well as how auxiliary engines influence the marine industry.","description":"The free online course on marine diesel engines teaches you about the constructional principles of diesel engines and the theoretical cycles of the engines. You will learn about the operation and maintenance of the auxiliary engine, as well as the features of two-stroke and four-stroke diesel engines. You will also be able to explain the principles of camless engines. Start this course today to improve your understanding of marine diesel engine.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Diploma in marine diesel engines is a free online course that introduces you to the operational cycle of diesel engines, as well as the classification of the engine into two strokes and four-stroke engines. The course will introduce you to large two-stroke engines used for main propulsion or main engine, as well as the medium-sized four-stroke engines. The course will also highlight the uses of the medium-sized four-stroke engines in power generation, the operation of the internal combustion engines, features of the piston stroke, as well as the characteristics of the supercharging, and various turbocharging terminology in the study of marine diesel engines. The course examines the thermodynamic cycles in diesel engines, various classifications of diesel engines, the important terminologies that are applicable in a marine diesel engine, as well as the theoretical cycle guiding the operation of modern diesel engines. The OTTO, diesel, and dual combustion circle operated in diesel engines in the early 1900s, as well as the advantages of diesel engines in the marine industry, how it has made steam turbines obsolete at sea, and how it consumes less fuel will be covered in this course.</p><p>This course then explains why shipowners prefer single engine/single propeller designs, as well as how the RTA96C-14 engine can achieve a maximum power output of 108,920 hp at 102 rpm, and how at the maximum economy, the engine exceeds 50% thermal efficiency. The course also explains the timing diagrams of a diesel engine, as well as how a diesel engine develops power by combustion of fuel in its cylinders. The course then analyses the engine cycle, as well as the full series of separate steps or events essential for efficient engine operation. You will also learn about monitoring the performance of engines with respect to their running efficiency and emission restrictions, as well as the construction of the cylinder cover and mountings of a two-stroke diesel engine. The course outlines the features of the safety valve, fuel valves, indicator valves as well as how the cylinder cover seals the upper end of the cylinder space. This course will also teach you about the fundamental principles of diesel engines, the types and theoretical cycles of diesel engines, as well as the constructional features of the crosshead, connecting rod, as well as bearings of a two-stroke diesel engine.</p><p>Furthermore, this course will help you get familiar with the important diesel engine terminologies, the process of the cross-head bearing, the features of the Sulzer engine bearings and lubrication, as well as the timing diagram and power efficiency process in marine diesel engines. The course also illustrates how oil can be supplied to the crosshead via telescopic pipes in MAN B&amp;W engines, and the concept of the Sulzer RTA engine connecting rod, as well as the machinery performance monitoring process, and the illustration of the typical cylinder pressure measurement. The course explains the modern methods of creating indicator diagrams and how faults in the injection process can be determined You will learn about the operation of the auxiliary engines, how the speed governing mechanism is applied in the auxiliary engine, as well as the concept of the performance assessment by indicator cards, and the procedure for taking indicator diagrams. This free online course will be of great interest to students, researchers, and anyone with an interest in diesel engines. So, register for this course and start your next learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}