{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2238","title":"Diploma in Structural Dynamics for Civil Engineers - SDOF Systems","totalEnrolled":"7,825","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the modelling and systems analysis involved in Structural Dynamics.","description":"In this free online course you will learn that structural dynamics is the study of the behavior of structures under dynamic loads. The course covers topics such as vibrations, damping and pulse excitations. You will then explore the differences between static and dynamic analysis and how to model a dynamic system. Enhance your civil engineering knowledge and skills, by studying this comprehensive online course.","courseOutcomes":["Differentiate between static analysi...","Explain the elements of a dynamic sy...","Discuss undamped free vibrations, si...","Describe viscously damped free vibra...","Differentiate between static analysis and dynamic analysis","Explain the elements of a dynamic system and degrees of freedom","Discuss undamped free vibrations, simple harmonic motion and amplitude","Describe viscously damped free vibrations","Summarise coulomb damped free vibrations","Explain resonance, force transmission and vibration isolation","Outline mass moment of inertia, initial displacement and natural frequency","Describe the response of damped systems to periodic force","List responses to arbitrary force and ramp force","Discuss the response to rectangular pulse excitations and approximate analysis for short pulses","Differentiate between static analysi...","Explain the elements of a dynamic sy...","Discuss undamped free vibrations, si...","Describe viscously damped free vibra...","Differentiate between static analysis and dynamic analysis","Explain the elements of a dynamic system and degrees of freedom","Discuss undamped free vibrations, simple harmonic motion and amplitude","Describe viscously damped free vibrations","Summarise coulomb damped free vibrations","Explain resonance, force transmission and vibration isolation","Outline mass moment of inertia, initial displacement and natural frequency","Describe the response of damped systems to periodic force","List responses to arbitrary force and ramp force","Discuss the response to rectangular pulse excitations and approximate analysis for short pulses"],"courseDescription":"<p>In this free online Structural Dynamics for Civil Engineers course, you will be introduced to the world of structural dynamics, where you will explore the behavior of structures under varying or dynamic loads over time. Calculations, illustrations, discussions, examples and assessment questions in this video-based course, provide you with a comprehensive foundation in the subject.</p><p>The course begins by introducing you to the fundamentals of structural dynamics. You will then explore the differences between static and dynamic analysis and how to model a dynamic system. The course also teaches you about undamped free vibrations, damped free vibrations, coulomb damped free vibrations, forced vibrations, and vibrations under periodic forces. You will also learn about energy, damping, responses to arbitrary excitations, responses to pulse excitations and more.</p><p>This course will be of interest to students of structural dynamics and civil engineering and those looking to broaden their knowledge and skills in the industry. Start this course today and learn more about structural dynamics for Civil Engineers.</p><a href=\"https://alison.com/resume/courses/2238\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2238\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Structural Dynamics","description":"In this module you will learn about the modelling of dynamic systems, undamped free vibration and damped free vibration.","topics":["Structural Dynamics - Learning Outcomes","Introduction to Structural Dynamics","Modelling of Dynamic System","Undamped Free Vibrations","Damped Free Vibrations","Structural Dynamics - Lesson Summary"]},{"name":"Module","details":"Forced Vibrations","description":"In this module you will learn about coulomb damped free vibrations and forced vibrations.","topics":["Forced Vibrations - Learning Outcomes","Coulomb Damped Free Vibrations","Forced Vibrations - Part I","Forced Vibrations - Part 2","Example Problems","Harmonic Vibration Examples","Forced Vibrations - Lesson Summary"]},{"name":"Module","details":"Arbitrary Excitations","description":"In this module you will learn about vibration under periodic forces, energy and damping, response to arbitrary excitations and response to pulse excitations.","topics":["Arbitrary Excitations - Learning Outcomes","Vibration Under Periodic Forces","Energy and Damping","Response to Arbitrary Excitations","Response to Pulse Excitations","Arbitrary Excitations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Structural Dynamics for Civil Engineers - SDOF Systems - Course Assessment"]}]}