{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3060","title":"Diploma in Marine Auxiliary Machinery","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches the principles and operations of auxiliary machinery and equipment used aboard ships.","description":"‘Diploma in Marine Auxiliary Machinery’ is a course that offers an in-depth understanding of the piping systems for ships, various pumping equipment and the theory of compression. Learn about the different types of crucial heat exchangers and compressed air equipment as part of the auxiliary equipment on board. Register for this course today and improve your essential marine auxiliary machinery knowledge.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course on marine auxiliary machinery introduces you to the various pumping systems found on a ship and examines extensive pipeline layouts with control valves. It explains the various types of heat exchangers necessary on board and describes the compressed air equipment as part of the auxiliary equipment on board. A ship is similar to a power plant, with a living quarter that requires an array of pipelines carrying fuel, lubricating oil, water, steam, air and other fluids meeting the power and housing needs on a ship. Understanding circuitry and how the pumping systems function, aided by various valves in facilitating the systems' function, are essential parts of knowledge for a marine engineer. This course takes a deeper look into the multiple piping systems on board, the materials used to make shipboard pipes and valves, maintenance procedures and regulatory requirements involving shipboard pipelines, types of repair procedures of shipboard valves and pipeline functions. We will discuss materials used in piping systems in great detail and you will learn about the compatibility of valves with fluids in a machine system.</p><p>Heat exchangers allow heat transfer between fluids. They are used in widespread applications, such as fuel heating, domestic water heating, lubricating oil cooling, charge air cooling and condenser cooling. In marine engineering, they design compressors to serve several needs using air under pressure. Although the various types and sizes of the compressor are available for the central air compressor, it is primarily the reciprocating tandem type used. Learning the basic principles and layout, including the air receivers, will help you operate the air compressors more efficiently. This course explains how pipes carry abrasive and corrosive fluids exposed to atmospheric corrosion and general wear and tear, along with how they sometimes operate at extremely high temperatures. The course describes the regulatory requirement used in pipeline maintenance and how classification societies have specific requirements regarding ships' piping systems that follow the general survey criteria for the rest of the vessel. Discover the maintenance procedures and troubleshooting measures for valves and pipeline systems and the basic maintenance procedures, systems, constructional features and principles of operation.</p><p>This course from Alison teaches extensively about the auxiliary machinery and equipment used at sea, from pumping systems to compressed air equipment. It describes the role of valves in a ship and how the purpose of all types of check valves is to allow flow in one direction only. It emphasises the functions of a valve and the routine maintenance that take place in the valve. The course discusses the various pump concepts, like the most common pump used to move large volumes of water and the centrifugal pump used in simple construction and operation. The course explores the classification of pumps, the principle of operation of a reciprocating pump, the constructional features of a reciprocating pump, the maintenance schedule of a reciprocating pump, how to observe the faults and their possible causes in a reciprocating pump. This course will be of significant interest to students, researchers, marine engineers and anyone seeking to learn about marine equipment and maintenance procedures. Register for this course today and improve your understanding of the principles guiding marine auxiliary equipment and the workings of the relevant systems.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}