{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2124","title":"Diploma in Fundamentals of Landscape Architecture and Site Planning","totalEnrolled":"9,727","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn landscape design and site planning in this free online diploma course to make the most out of outdoor spaces.","description":"This diploma course guides you through the basic concepts and techniques of landscape design and site planning. We explore historical landscape styles and explain how to effectively execute landform and planting design projects like a professional landscape architect. This course suits anyone who enjoys the outdoors and is interested in sculpting open spaces into beautiful gardens and parks for people to enjoy.","courseOutcomes":["Discuss the multi-disciplinary scope...","Recognize various factors influencin...","Compare the historical Oriental and ...","Analyze the architectural progressio...","Discuss the multi-disciplinary scope of landscape architecture","Recognize various factors influencing landscape styles","Compare the historical Oriental and European landscape styles","Analyze the architectural progression of Italian landscape styles through the Renaissance","Discuss the survey techniques for landscape projects","Analyze the various factors influencing landform design","Apply the methods of earthwork estimation","Outline the multiple criteria for plant selection in a botanical design project","Identify the design characteristics of plant materials","Discuss the multi-disciplinary scope...","Recognize various factors influencin...","Compare the historical Oriental and ...","Analyze the architectural progressio...","Discuss the multi-disciplinary scope of landscape architecture","Recognize various factors influencing landscape styles","Compare the historical Oriental and European landscape styles","Analyze the architectural progression of Italian landscape styles through the Renaissance","Discuss the survey techniques for landscape projects","Analyze the various factors influencing landform design","Apply the methods of earthwork estimation","Outline the multiple criteria for plant selection in a botanical design project","Identify the design characteristics of plant materials"],"courseDescription":"<p>This diploma course guides you through the basic concepts and techniques of landscape design and site planning. We examine landscape categories and materials and lay out the objectives and professional scope of landscape design projects.</p><p>We then study the historical elements of Oriental and European landscape styles from the architecture of various famous gardens. We go through the various survey methods and techniques employed for site analysis and appraisal. We break down the steps involved in landform design and investigate its driving factors. We establish multiple criteria for plant selection and study the relevant characteristics of botanical materials.</p><p>This diploma course explains the main aspects of landscape architecture and site planning. This can help potential landscape architects, gardeners and anyone who wants to understand the world of landscape design and site planning. Sign up to learn how to transform any outdoor space into a wonderland.</p><a href=\"https://alison.com/resume/courses/2124\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2124\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Landscape Design","description":"Learn more about the landscape categories and materials in landscape design projects. Also, learn about the objectives and professional scope of landscape design in architecture from this module.","topics":["Landscape Design - Learning Outcomes","Introduction to Landscape Design","Landscape - Categories and Materials","Landscape Design - Objectives and Professional Scope - Part 1","Landscape Design - Objectives and Professional Scope - Part 2","Landscape Design - Lesson Summary"]},{"name":"Module","details":"History of Landscape Design","description":"Get to learn about the landscape categories and styles. Also, learn about the history of landscape design from the historical elements of the Oriental landscape styles from this module.","topics":["History of Landscape Design - Learning Outcomes","Introduction to History of Landscape Design","History of Landscape Design - Spanish/Moorish Style","History of Landscape Design - Spanish Gardens","History of Landscape Design - Mughal Style","History of Landscape Design - Chinese and Japanese Styles","History of Landscape Design - Lesson Summary"]},{"name":"Module","details":"History of Landscape Design II","description":"Learn more about the history of landscape design from the historical elements of the European landscape styles from this module. Get to learn about the architecture of Italian, French, and English gardens.","topics":["History of Landscape Design II - Learning Outcomes","History of Landscape Design - European Styles","History of Landscape Design - Italian Gardens","History of Landscape Design - French Style","History of Landscape Design - French Gardens","History of Landscape Design - English Style","History of Landscape Design II - Lesson Summary"]},{"name":"Module","details":"Diploma in Fundamentals of Landscape Architecture and Site Planning - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["First Assessment"]},{"name":"Module","details":"Site Investigation, Analysis, and Appraisal","description":"Learn how to effectively carry out site investigation from studying survey techniques. Also, get to learn about site analysis and appraisal in landscape architecture and site planning from this module.","topics":["Site Investigation, Analysis, and Appraisal - Learning Outcomes","Introduction to Site Investigation","Site Investigation, Analysis & Appraisal","Site Analysis and Appraisal","Site Analysis Techniques","Site Investigation, Analysis, and Appraisal - Lesson Summary"]},{"name":"Module","details":"Landform Design","description":"Get to learn about the broad steps in landform design and relevant soil concepts. Also, learn more about the factors and criteria for landform design in landscape architecture and site planning from this module.","topics":["Landform Design - Learning Outcomes","Introduction to Landform Design","Landform Design - Analyses and Steps","Landform Design - Soil Concepts","Factors Governing Landform Decisions","Criteria for Landform Design","Landform Design - Lesson Summary"]},{"name":"Module","details":"Planting Design","description":"Learn more about the criteria for plant selection and features of plant materials for planting design in landscape architecture and site planning from this module.","topics":["Planting Design - Learning Outcomes","Introduction to Planting Design","Planting Design - Criteria for Plant Selection","Planting Design - Criteria for Plant Selection - Part 2","Planting Design - Plant Characteristics","Planting Design - Plant Characteristics - Part 2","Planting Design - Lesson Summary"]},{"name":"Module","details":"Diploma in Fundamentals of Landscape Architecture and Site Planning - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Fundamentals of Landscape Architecture and Site Planning - Final Assessment"]}]}