{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3101","title":"Diploma in Fiber Optic Communication Technology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about fibre-optic technology and why it is the backbone for all communication systems in this free online course.","description":"Fibre-optic communication technology is an important area of study that takes a look at the need for optical fibres. It is used by telecommunication companies to transmit telephone, cable and internet signals and by industries like the medical profession and defence because of its high bandwidth. If you want to be at the forefront of cutting-edge technology, start today to learn more about this form of communication.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Fibre-optic communication is a method of transmitting information from one place to another by sending pulses of infrared light. This process has become an essential part of our everyday lives as it is used in the telecommunication industry, therefore providing a technological foundation for societal communication. This course will introduce you to the different types of optical sources that are available, including why fibre-optic communication produces far more speed over longer distances and why it is more secure than traditional communication channels. While specific network capacities are privileged information, telecommunications investment reports indicate that network capacity has increased dramatically with fibre. Fibre optics has enabled the development of other technologies such as medical devices, ‘Internet of Things’ (IoT) devices and many others that require data to be transmitted back to a server. Even though there are many advantages to optical fibre, there are obstacles. One of the barriers is in the installation of the fibre itself, which is expensive.</p><p>Are you curious about the history of communication and how it has evolved through the ages? In this course, you will learn why we need optical communication in today’s world and discover the different wavelengths used in optical communication. In addition to this, the advantages and disadvantages of the different wavelengths used in fibre-optic communication and the various network topologies utilised for different situations will be discussed. This course will cover the different multiplexing schemes and explain how optical fibre carries information to and within data centres. Knowing the various parts of the block diagram and how to set up a link is important, along with how power is measured in a digital modulation unit. Alongside this, you will be exposed to theoretical scenarios and various formulas used to solve these scenarios and the setbacks of direct modulation lasers, specifically the chirp modulation and transient chirp and the effects when the data signal is being transmitted through a long optical fibre. Electro-optic phase modulation will also be presented. You will learn how to generate a high repetition rate. Additionally, you will learn about phase-shift keying and why it is the standard method for data modulation.</p><p>Fibre optics technology is widely used in medical procedures for non-intrusive surgical procedures; such as endoscopies. It is also being used in areas such as prosthetics to help the user perceive what they are touching. Fibre-optic cables use light signals rather than electrical signals and are far less likely to be affected by power outages and or electromagnetic interference. As a result, they are much stronger than copper wire, making them more impervious to the elements. As the use and demand for greater bandwidth and faster speed increases, there is no question that fibre optic transmission will bring more possibilities. There are many opportunities in the field of research as the need arises to expand and cater for these future needs. Fibre optics has changed our world in more ways than you can imagine and will possibly be the source of major breakthroughs, prompting greater technological evolutions. Do you like to work with computers, electronic gadgets and enjoy all types of technology? Are you curious about how things work and passionate about the digital world? Don’t wait! Begin this course today and become an expert in the field of fibre-optic communication and technology.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}