{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2999","title":"Diploma in Solar Energy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the enormous potential of solar energy and see how to make better use of sunlight with this free online course.","description":"This free online course gauges the potential of solar energy to satisfy the world's energy needs. We explain various phenomena related to the absorption of solar energy and the importance of maintaining the delicate balance of carbon dioxide (CO2) in the atmosphere. We also study the background radiation of the universe and its characteristics and conclude by teaching you the photovoltaic process of capturing solar energy.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course asserts that solar energy, which is renewable and obtained from the use of electromagnetic radiation from the Sun, is sufficient to meet the world’s energy needs. We investigate how solar radiation reaches the earth and has long been used by humans through evolving technologies. We explain how the Sun’s energy can be collected by photoelectric cells, heliostats or solar collectors before being transformed into electrical or thermal energy, thus potentially solving some of the world’s energy problems. This course explores that potential as we study what happens to the Sun, its radiation and how it relates to the Earth in the form of a wide range of phenomena related to solar energy’s absorption and release.</p><p>We then cover the importance of maintaining a delicate balance of CO2 in the atmosphere and how increased emissions can harm humanity and the environment. We unpack how solar energy intake can be affected by geographical location, season and time of day. The course breaks down the electromagnetic, solar and visible spectra before delving into the relationship between the temperature of the Earth and black-body radiation and wavelength.</p><p>The course then examines the use and characteristics of a solar cell based on the p-n junction, the fundamental structure of semiconductors. We go into the construction and efficiency of different types of solar cells, which include ‘tandem’ solar cells that can connect in series to increase the overall efficiency of the photovoltaic cell. We discuss the advantages of hydrogen production and photocatalytic water-splitting over electrolysis. The course then moves on to the recombination of electron holes, photocatalysts that convert solar energy into chemical energy on the surface of a catalyst or substrate, consisting of a semiconducting material that accelerates the speed of reaction. This course is aimed at those who want to learn a little more about solar energy and the opportunities it offers as a source of clean energy. It also suits anyone working in the energy sector who wishes to improve energy processes and equipment performance as they seek more innovative ways to harness the incredible power of the Sun.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}