{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2885","title":"Electrochemical Nature and Thermodynamics of Corrosion","totalEnrolled":"171","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Analyze the electrochemistry and causes of corrosion in this free science course.","description":"This free online course on the electrochemical nature and thermodynamics of corrosion teaches you about the concept of ‘corrosion’, as well as the various processes that can cause corrosion. You will also learn about the different forms of corrosion (uniform, galvanic, crevice, pitting, erosion, and stress-assisted corrosions), as well as how they affect the environment.","courseOutcomes":["Outline the different definitions of...","Discuss how corrosion affects the en...","Outline the different forms of corro...","Explain how each form of corrosion a...","Outline the different definitions of corrosion","Discuss how corrosion affects the environment","Outline the different forms of corrosion","Explain how each form of corrosion affects the surrounding areas","Discuss the need to build corrosion resistance","Identify the different forms of corrosion with examples","Discuss the electrochemical nature of corrosion","Outline the different aspects of the thermodynamics of corrosion","Discuss the process of entropy change in corrosion","Explain the flow of current in any medium experiencing corrosion","Outline the different definitions of...","Discuss how corrosion affects the en...","Outline the different forms of corro...","Explain how each form of corrosion a...","Outline the different definitions of corrosion","Discuss how corrosion affects the environment","Outline the different forms of corrosion","Explain how each form of corrosion affects the surrounding areas","Discuss the need to build corrosion resistance","Identify the different forms of corrosion with examples","Discuss the electrochemical nature of corrosion","Outline the different aspects of the thermodynamics of corrosion","Discuss the process of entropy change in corrosion","Explain the flow of current in any medium experiencing corrosion"],"courseDescription":"<p>The multiple types of corrosion, its electrochemical nature and its thermodynamics (relationship to heat and energy) are the main topics covered in this free course. Study the differences between pitting and erosion, for example, as well as the effect each type of corrosion has on its surroundings, especially the crevice and pitting forms.&nbsp;</p><p>The material then explains some of the forms of corrosion with real-life examples, as well as the need to understand the electrochemical nature of corrosion. You will learn about its different thermodynamic aspects, as well as how the concept of ‘free energy change’ is relevant. This course will teach you about the process of entropy change in corrosion, as well as the relationship between Delta G and the equilibrium constant.</p><p>Furthermore, this course will help you get familiar with how the electrochemical nature of corrosion is used when finding the equation of the corrosion processes, and you will study how current flows from the positive terminal to the negative terminal. If you want to deepen your knowledge of corrosion, sign up today and start studying free of charge.</p><a href=\"https://alison.com/resume/courses/2885\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2885\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Corrosion and its Forms","description":"In this module, you will be introduced to the concept of corrosion, as well as the various processes that can cause corrosion. You will also be introduced to the different types of corrosion which are uniform, galvanic, crevice, and pitting corrosion, as well as the impact of each type of corrosion.","topics":["Corrosion and its Forms - Learning Outcomes","Features and Cost of Corrosion","Process of Material Degradation","Types and Forms of Corrosion","Uniform and Galvanic Corrosion","Crevice and Pitting Corrosion","Corrosion and its Forms - Lesson Summary"]},{"name":"Module","details":"Thermodynamics of Corrosion","description":"In this module, you will be introduced to the different forms of corrosion, as well as the electrochemical nature of corrosion and its thermodynamics. You will also be introduced to the thermodynamics aspects of corrosion, the concept of free energy change, as well as the process of entropy change.","topics":["Thermodynamics of Corrosion - Learning Outcomes","Forms of Corrosion with Examples","Electrochemical Nature of Corrosion","Thermodynamics Aspects of Corrosion","Free Energy in Corrosion","Relationship Between Delta G and Equilibrium Constant","Thermodynamics of Corrosion - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Electrochemical Nature and Thermodynamics of Corrosion - Course Assessment"]}]}