{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4073","title":"Electric Power Metering - Single and 3-Phase Systems","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the physics of electrical power and how to measure single and 3-phase electrical power in this free online course.","description":"Have you ever wondered how electricity works and how its consumption is measured for your monthly power bill? This free online basic electrical course will give you detailed knowledge of AC power, its functions and how to calculate power in an electrical system containing various elements. You will learn the configuration and functioning of power-measuring instruments as well as the core principles behind single and three-phase power metering.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Power and energy are commonly used terms in physics and play an important role in understanding electrical systems and this online electrical course will teach you how to define electrical power and energy, calculate their values and convert one quantity into the other for a given electric circuit. Some of what you will learn includes how to estimate the total power consumed by an AC circuit with the help of the available voltage, current and other parameters. Power in an AC system does not remain steady, instead, it keeps on changing with time. You will be shown how to represent power graphically and calculate the initial, average and peak values of power within an AC cycle. Phasors are special types of vectors with magnitude and direction rotating at the system frequency and your learning includes how to represent voltage and current phasors with complex numbers, express them in two different forms and apply basic mathematical operations to them. There are different tools and equipment available to measure electric power consumed by a household or a building and this certificate in electrical engineering then covers tools such as a wattmeter and dynamometer.</p><p>Analog power meters measure power with the help of coils and a rotating disc while electronic meters use voltage and current transducers, analog to digital converters instead of coils, and the rotating disc. The electrical training course content moves on to studying single-phase power which includes learning about configuration, working principles and usage before analyzing instrument transformers, which is a special type of transformer used for the measurement of voltage and current. When we take three-phase power generation into account, we assume that it consists of three single-phase generators connected together on one terminal and you will learn how to add voltage vectors, check the impact of different loads and numbers of voltage and current elements for measuring power in a three-phase electrical system.</p><p>This electrical fundamentals course is designed for students in engineering, electrical power systems managers, engineers and professionals in the field of electrical power. This course is also useful for anyone who wants to understand the working of their electricity meters to get an idea of their domestic power billing. A basic understanding of single and three-phase power systems is required to take this course and the content is prepared specifically to make it interesting and understandable with the help of schematic diagrams, graphs and charts. Electricity is an integral part of modern lifestyle - we use it for lighting up bulbs, heating or cooling our homes/offices and numerous other daily uses so it’s natural to be curious to know how it reaches our homes and offices and how it is measured. Grab the opportunity to enhance your knowledge in the field of AC power by enrolling in this easy-to-grasp electrical course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}