{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4098","title":"Electrical Fundamentals","totalEnrolled":"4,106","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop a solid foundation of the basics of electrical technology in this free online course for electrical technicians.","description":"If you are looking to improve your understanding of electrical technology, then building a solid foundation is crucial. This free course takes you through the key concepts and laws of electrical technology. From basic terms and formulas to understanding circuits and electrical safety procedures, it caters to all your requirements if you want a career as an electrical engineer or technician.","courseOutcomes":["Define the key terms and formulae of...","Analyze the key circuit parameters o...","Explain the basic laws and effects o...","Describe the workings of DC circuits...","Define the key terms and formulae of electrical theory","Analyze the key circuit parameters of resistance, capacitance, and inductance","Explain the basic laws and effects of electric current","Describe the workings of DC circuits in both series and parallel","Distinguish between static and stray currents and their sources","Identify electrical hazards and discuss prevention methods and safety procedures","Define the key terms and formulae of...","Analyze the key circuit parameters o...","Explain the basic laws and effects o...","Describe the workings of DC circuits...","Define the key terms and formulae of electrical theory","Analyze the key circuit parameters of resistance, capacitance, and inductance","Explain the basic laws and effects of electric current","Describe the workings of DC circuits in both series and parallel","Distinguish between static and stray currents and their sources","Identify electrical hazards and discuss prevention methods and safety procedures"],"courseDescription":"<p>Are you aware that every substance around you is made up of the tiniest of particles called atoms? And that these atoms are responsible for creating electricity? If not, then you have come to the right place. This course provides you with all the knowledge of electrical technology fundamentals and gradually builds on those rudimentary concepts. We kick off with a basic understanding of atoms and particles that make up an atom ie charges. Concepts like valency, conductors, semiconductors, and insulators will be analyzed. Building on these concepts, the focus moves to the description of current, electromotive force (EMF), work, and energy. Along the way, we will be looking at formula charts and illustrations of how these concepts are applied, not just at the workplace but also in many appliances around us on a day-to-day basis.&nbsp;&nbsp;</p><p>Moving on with your learning, our focus shifts towards important electrical devices called resistors, capacitors, and insulators. An analysis of each of these will be carried out in detail. The key principles behind their workings, application and types will all be part of the learning material in this section. Some important laws and effects associated with these devices will also be discussed. Important items like Joule’s law, Ohm’s law, and Kirchhoff’s current and voltage law will also be discussed. Over the years, scientists also discovered some important effects of electric current during their experiments. Some of their key findings include the chemical effect of electric current. The Peltier, Thomson, and Seebeck effects were all important observations made along the way of electrical theory evolution. All these effects will be part of your course material and will be explained with illustrations in detail.</p><p>Towards the final part of the course, your attention will be directed towards DC (direct current) circuits. The sources of DC current, both in series and in parallel, will be discussed. Another key aspect of DC circuits is a voltage and current divider, which will be analyzed in-depth. Finally, static electricity and stray currents will be looked at in detail. The various sources and application of both static electricity and stray currents will be described. Are you aware of the hazards of electricity? We have all heard of cases of electrical shock by wires or lightning. This course will not only help you understand the dangers of electrical shocks and hazards but it will also provide you with the necessary safeguards and precautions necessary in order to prevent such incidents from happening. We live in a world that is hugely dependent on electricity: not just our workplaces but our houses and lives are filled with items that cannot function without electricity. Whether you want to understand the concepts of electricity in order to satisfy your curiosity or you are looking to develop a career in electrical science, this course has got you covered!</p><a href=\"https://alison.com/resume/courses/4098\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4098\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Electrical Fundamentals","description":"This module will take you through the definitions of key terms and basic formulas of electrical theory. An analysis of the key circuit parameters and an understanding of the basic laws and effects of electricity will be developed. Finally, an analysis of hazards and safety procedures will be provided.","topics":["Electrical Fundamentals - Learning Outcomes","Basic Concepts of Electrical Theory","Circuit Parameters - Resistance","Electric Circuits and Inductance","Capacitors and Capacitance","Laws of Electric Current and DC Circuits","Static Electricity and Stray Currents","Electrical Technology Fundamentals - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Electrical Fundamentals - Course Assessment"]}]}