{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4077","title":"Engineering Calculus Simplified (Derivatives)","totalEnrolled":"440","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use derivatives to find any function’s instantaneous rates of change in this free online calculus course.","description":"Have you ever wondered how changes in physical processes are measured or predicted over time? This free course explains engineering calculus and how to use it to calculate instantaneous rates of change of any given function. You will learn how to represent a function on a graph to find its slope or derivative. Also, discover how to find derivatives of different trigonometric, algebraic, logarithmic and exponential functions.","courseOutcomes":["Define functions and limits...","Compare graphically the sin function...","Explain the Cartesian coordinates sy...","Analyze algebraic and trigonometric ...","Define functions and limits","Compare graphically the sin function with its derivative","Explain the Cartesian coordinates system","Analyze algebraic and trigonometric functions with the help of the Cartesian coordinate system","Describe the continuity of a function in calculus","Explain the concept of derivatives and their purpose","Compute the values of some algebraic functions","State the squeeze theorem","List and analyze various exponential and logarithmic functions and their derivatives","Define functions and limits...","Compare graphically the sin function...","Explain the Cartesian coordinates sy...","Analyze algebraic and trigonometric ...","Define functions and limits","Compare graphically the sin function with its derivative","Explain the Cartesian coordinates system","Analyze algebraic and trigonometric functions with the help of the Cartesian coordinate system","Describe the continuity of a function in calculus","Explain the concept of derivatives and their purpose","Compute the values of some algebraic functions","State the squeeze theorem","List and analyze various exponential and logarithmic functions and their derivatives"],"courseDescription":"<p>Physical quantities such as electric current, magnetic flux, and a moving object’s velocity are not constant; instead, they keep on changing with time. Derivatives are means for finding the rates of change in physical quantities over time. This course explains differential calculus, discusses the founders of differential calculus and then probes how the concept of instantaneous rate of change applies to distance, speed, magnetic flux and current. A function is a special relationship where each input has a single output. We will show you how to represent a physical quantity using a function in an equation. Rene Descartes invented a two-dimensional plane and applied algebra to it. In this light, you will learn how to use this 2D plane, also called the Cartesian plane, to plot algebraic and trigonometric functions and represent relationships between them. We base calculus on the concept of limits as limits determine the behavior of a function. We will teach you different properties of functions and how to find the output of a function when the limit approaches a particular value.</p><p>A function is continuous if it satisfies all the values in an interval. You will acquire the knowledge to find the continuity of a function and determine the point where a function is discontinuous. The fundamental question of calculus is finding the instantaneous rate of change of a function. Since the velocity of an object is not constant and it changes over time, you will determine how to find the derivative of the function over a particular instant called the instantaneous rate of change. Next, explore how to represent a function on a graph using the independent and the dependent variables to calculate the function’s slope at any point on the graph. Then, examine how to calculate the output of a function when it is squeezed to a point from the upper and lower limits with the help of the squeeze (or sandwich) theorem. Finally, learn to prove trigonometric identities of sin(x) and cos(x) and how to find the derivatives of standard trigonometric, exponential and algebraic functions.</p><p>We have designed this course for students who are new to the field of derivatives and professionals who studied calculus at school and want to review this subject for their current jobs. This course will stimulate you as it presents the concepts of derivatives with the help of colorful graphs and diagrams to maintain your interest and maximize your learning potential. The use of derivatives is not limited to mathematics and physics. Derivatives find applications in medical science, weather forecasting, computer science, electrical engineering, machine learning and many more. Keeping in mind that there are many diverse applications of derivatives, it is essential for people in science and technology to equip themselves with derivative principles. So, don’t miss out on the opportunity to understand derivatives for your academic and professional life. Enrol now!</p><a href=\"https://alison.com/resume/courses/4077\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4077\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"How to Find Derivatives","description":"This module will introduce you to differential calculus and its applications in real life. You will learn how to find the instantaneous rate of change of a physical quantity over time. Learners will be shown how to prove trig identities of sin(x) and cos(x) and calculate the derivatives of various trigonometric, algebraic and exponential functions.","topics":["How to Find Derivatives - Learning Outcomes","Functions and Limits","Slope and Trigonometric Identities","Squeeze Theorem and Common Derivatives","How to Find Derivatives - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Engineering Calculus Simplified (Derivatives) - Course Assessment"]}]}