{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2044","title":"Evolution of Solar Photovoltaic Technologies","totalEnrolled":"2,885","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the manufacturing processes of solar photovoltaic technologies in this free online course.","description":"This free online solar photovoltaic technologies course will introduce you to the second evolution in solar PV technologies, different grades of silicon, and CdTe solar cell production. Start the course and learn about solar PV technology such as conductivity in materials, organic solar cells device design, bi-layer solar cells, bulk hetero-junction solar cells, and exciting dye sensitized solar cells.","courseOutcomes":["Discuss the second generation of sol...","Discuss the manufacturing processes ...","Examine the manufacturing and design...","Examine the third generation of sola...","Discuss the second generation of solar PV technologies","Discuss the manufacturing processes involved in making cadmium telleride solar cell devices","Examine the manufacturing and design parameters of CIGS solar cells.","Examine the third generation of solar PV technologies","Discuss in details organic solar cells, perovskite solar cells and dye sensitized solar cells","Discuss bi-layer solar cells and bulk hetero-junction solar cells","Identify the manufacturing processes of organic solar cells and the issues with them","Discuss the second generation of sol...","Discuss the manufacturing processes ...","Examine the manufacturing and design...","Examine the third generation of sola...","Discuss the second generation of solar PV technologies","Discuss the manufacturing processes involved in making cadmium telleride solar cell devices","Examine the manufacturing and design parameters of CIGS solar cells.","Examine the third generation of solar PV technologies","Discuss in details organic solar cells, perovskite solar cells and dye sensitized solar cells","Discuss bi-layer solar cells and bulk hetero-junction solar cells","Identify the manufacturing processes of organic solar cells and the issues with them"],"courseDescription":"<p>This free online course will introduce you to the evolution in solar photovoltaic (PV) technologies. You will learn about the manufacture of silicon, the production of metallurgical grade silicon and all the processes involved. The course also covers topics such as the manufacture of CdTe solar cells, spray deposition of cadmium chloride, and CIGS manufacturing.</p><p>Next, the course introduces you to third generation PV technology. You will learn about the manufacture of organic solar cells, how the conductivity in materials is determined, bulk hetero-junction solar cells, dye sensitized solar cells and how they are excited, and issues with organic solar cells.</p><p>This course will appeal to learners with an interest in engineering, specifically in solar engineering, and those who would like to understand the working principles behind solar panels and the various manufacturing processes. Start this course now to learn about how solar PV technology has evolved over time and how these solar PV devices are manufactured.</p><a href=\"https://alison.com/resume/courses/2044\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2044\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Second Generation Solar Cells","description":"In this module, you will be introduced to the manufacturing of silicon, production of metallurgical grade silicon, semi-conductor grade silicon, the Siemens process. You will also be introduced to deposition methods, manufacturing of CdTe solar cells, spray deposition, process improvements in CdTe solar cells, and CIGS manufacturing.","topics":["Second Generation Solar Cells - Learning Outcomes","Manufacturing of Si","Generation 2 Technologies - Part 1","Generation 2 Technologies - Part 2","Second Generation Solar Cells - Lesson Summary"]},{"name":"Module","details":"Third Generation Solar Cells","description":"In this module, you will be introduced to third generation PV technologies, organic solar cells, conductivity in materials, normal P-N junction cell. You will also be introduced to the theory of single layer devices, design in organic solar cells, bi-layer solar cells, bulk hetero-junction solar cells, dye sensitized solar cells, and issues with organic solar cells.","topics":["Third Generation Solar Cells - Learning Outcomes","Generation 3 Technologies - Part 1","Generation 3 technologies - Part 2","Third Generation Solar Cells - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Evolution of Solar PV Technologies - Course Assessment"]}]}