{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2147","title":"Extraction, Processing and Shelf Life Extension of Oils","totalEnrolled":"1,469","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course teaches about extraction of oil, refining of oil, modified fats, rancidity, natural antioxidants etc","description":"This free online Extraction, Processing and Shelf Life Extension of Oils course will begiin with the mechanical extraction of oil and solvent extraction, degumming or neutralization processes and bleaching and deodorization, modified fat, products containing fats and oil known as rancidity, natural antioxidants, microencapsulation technology including different methods of microencapsulation and food nanotechnology.","courseOutcomes":["Discuss the mechanical extraction of...","Describe extraction of oil from oil ...","Identify removal of impurities from ...","Describe the major steps of edible o...","Discuss the mechanical extraction of oil","Describe extraction of oil from oil seeds and solvent extraction method","Identify removal of impurities from the edible oil using degumming or neutralization processes","Describe the major steps of edible oil refining process","Discuss the process which takes place in fats and oils or the products containing fats and oil","Identify the two major types of natural antioxidants","Outline the basics and different methods of microencapsulation technology","Discuss the mechanical extraction of...","Describe extraction of oil from oil ...","Identify removal of impurities from ...","Describe the major steps of edible o...","Discuss the mechanical extraction of oil","Describe extraction of oil from oil seeds and solvent extraction method","Identify removal of impurities from the edible oil using degumming or neutralization processes","Describe the major steps of edible oil refining process","Discuss the process which takes place in fats and oils or the products containing fats and oil","Identify the two major types of natural antioxidants","Outline the basics and different methods of microencapsulation technology"],"courseDescription":"<p>This free online course will begin with the mechanical extraction of oil and solvent extraction. In the mechanical process, there are<br>processes which apply heat; there are processes which do not apply much heat. In the solvent extraction method, organic solvents like hexane, isopropyl alcohol, benzene, etc. can be used for extraction purposes.</p><p>Next you will study removal of impurities from the edible oil using degumming or neutralization processes and bleaching and deodorization. Next you will learn about modified fat. These fats and oils are usually modified using appropriate procedures in order to improve their functional properties like crystallization, melting behaviour.</p><p>Finally, you will learn about the products containing fats and oil known as rancidity, natural antioxidants,&nbsp;microencapsulation technology including different methods of microencapsulation and food nanotechnology will be studied.</p><a href=\"https://alison.com/resume/courses/2147\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2147\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Extraction and Processing of Oil","description":"In this module you will learn about extraction and processing of oil. Topics like extraction of oil, refining of oil and modified fats would be extensively discussed.","topics":["Extraction and Processing of Oil - Learning Outcomes","Extraction of Oil: Part 1","Extraction of Oil: Part 2","Refining of Oil: Part 1","Refining of Oil: Part 2","Modified Fats","Extraction and Processing of Oil - Lesson Summary"]},{"name":"Module","details":"Concept of Rancidity and Preparation of Oil Powder","description":"In this module you will learn about Concept of Rancidity and Preparation of Oil Powder. Topics like Rancidity, Natural Antioxidants, Microencapsulation, Food nanotechnology will be discussed.","topics":["Concept of Rancidity and Preparation of Oil Powder - Learning Outcomes","Rancidity","Natural Antioxidants","Microencapsulation: Part 1","Microencapsulation: Part 2","Food Nanotechnology","Concept of Rancidity and Preparation of Oil Powder - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Extraction, Processing and Shelf Life Extension of Oils Course Assessment"]}]}