{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4121","title":"Fundamentals of Electrical Three-Phase Power Transformers","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the working principles of a three-phase power transformer and its maintenance with this free online course.","description":"No transformer in practice is ideal since they all incur losses and this free online electrical engineering course covers the types of losses incurred by real transformers and how they can be minimized. The content covered will help you gain a thorough understanding of transformers, the working principles of a three-phase power transformer and its different configurations, as well as how transformers are constructed and protected from damage.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Transformers are essential for the distribution of electricity and are used for a wide variety of purposes. These purposes may include but are not limited to the transition of electric power over long distances and the reduction of voltages of conventional power circuits to operate low voltage devices such as videocassette recorders (VCRs) and smartphones. This basic electrical course focuses on the three-phase power transformers and will teach you all you need to know about them. The course starts out with a review of electromagnetism and how they relate to transformers. You will learn the terminologies of transformers such as electromagnetic induction, magnetic hysteresis and much more. This online electrical course will help you gain an understanding of the power flow and turns ratio of ideal transformers as well as why real transformers don’t function like ideal transformers. The content also explains extensively about the losses incurred by a real transformer and how they can be minimized, and all about instrument transformers, their types and uses.</p><p>Three-phase power is the ideal form of power transmission distribution. The three-phase transformer is therefore the best type of transformer for electrical systems that require high capacity distribution and high power capacity transmission. This certificate in electrical engineering will help you understand the advantages of three-phase power transformers over that of single phases. Thereafter, you will be shown the different types of connections of a three-phase transformer such as the star-star, star-delta, and delta-delta. The primary and secondary voltage of each connection type as well as their turns ratio is discussed before moving on to the vector nomenclature of transformer clock systems and how transformers are designed and constructed. Practical 2D and 3D animations are used to illustrate the construction and design of transformers so that you can grasp it easily.&nbsp;</p><p>All transformers incur losses as no transformer is truly an ideal transformer and most of the losses incurred by transformers are converted to heat. If this heat is not dissipated properly, the temperature of the transformer will rise continually which may cause damage to the insulation inside the transformer. It is therefore essential to control the temperature to ensure that the transformer lasts long by reducing the thermal degradation of its insulating system. In this electrical training course, you will learn about cooling systems such as the Air Natural (AN), Oil Natural Air Natural (ONAN) and Oil Natural Air Forced (ONAF) systems which are used to regulate the temperature of transformers. This course goes on to explore the transformer voltage classifications. Over time, as transformers are being used, they may develop faults, so there is the need to protect transformers and limit the damage. Your learning includes a good understanding of the basic transformer protection schemes and transformer relays that provide primary protection and control of transformers. You should enrol for this exciting, informative course if you want to learn the electrical fundamentals of transformers whether you are an engineer working in the electrical power industry and want to take your career to the next level or a student of engineering looking to refine your knowledge. Interactive 3D models are used extensively throughout the course to enhance learning and show you exactly how three-phase transformers work.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}