{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2900","title":"Fundamentals of MATLAB and Diffractive Optics in Optical Engineering","totalEnrolled":"2,429","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamentals of MATLAB programming styles, Python, and diffractive optics with this free online course.","description":"The material in this free course will help you get to grips with MATLAB - a computer program used to analyze data, develop algorithms and create models - as Python for modeling optical elements. Learn from MATLAB tutorials on interference as well as how diffractive optics affects complex optical systems.","courseOutcomes":["Discuss the concept of Python in opt...","Explain the variables of different t...","Analyze the interference between two...","Explain MATLAB programming in optica...","Discuss the concept of Python in optical engineering and the history of Python as a program","Explain the variables of different types of operations on the integers, Boolean values and float values","Analyze the interference between two plane waves and how to model this simulation in Python","Explain MATLAB programming in optical engineering and its programming style","Discuss the concept of interference as it relates to MATLAB programming and interference theory","Explain the concept of diffractive optics and how it affects optical systems","Discuss the contributions of the heroes of diffraction to the theory of diffraction","Analyze the basic elements of diffraction grating and their functions","Identify the different types of diffraction grafting and the problems associated with the binary diffraction grating","Discuss the concept of Python in opt...","Explain the variables of different t...","Analyze the interference between two...","Explain MATLAB programming in optica...","Discuss the concept of Python in optical engineering and the history of Python as a program","Explain the variables of different types of operations on the integers, Boolean values and float values","Analyze the interference between two plane waves and how to model this simulation in Python","Explain MATLAB programming in optical engineering and its programming style","Discuss the concept of interference as it relates to MATLAB programming and interference theory","Explain the concept of diffractive optics and how it affects optical systems","Discuss the contributions of the heroes of diffraction to the theory of diffraction","Analyze the basic elements of diffraction grating and their functions","Identify the different types of diffraction grafting and the problems associated with the binary diffraction grating"],"courseDescription":"<p>This free online course on the fundamentals of MATLAB and diffractive optics in optical engineering will begin by introducing you to the Python programming language for modeling optical elements along with optical phenomena. You will learn about the history of Python as a programming language, how Python programs are written, as well as the requirements needed to write any simple program in Python.</p><p>This course will also introduce you to the interference between two plane waves as well as how to model this simulation in Python. You will analyze the parameters needed to control interference in Python, the programming style in MATLAB, how MATLAB interprets variables along with the basic operations that are mostly used in codes. This course will also teach you how to stimulate interference using MATLAB.</p><p>Finally, it will introduce you to how diffractive optics affects optical systems. You will learn about the causes of diffraction and how to use it, plus the limitations of refractive optics in optical engineering. This course will further enhance your understanding of the components of the diffraction grating. Start this course now and improve your knowledge of Python and MATLAB programming as they relate to optical engineering today.</p><a href=\"https://alison.com/resume/courses/2900\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2900\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Python and MATLAB","description":"This module discusses the fundamentals of the Python programming language along with how to model interference simulation in Python. You will learn about the programming style in MATLAB as well as how MATLAB interprets variables in optical engineering.","topics":["Introduction to Python and MatLab - Learning Outcomes","Introduction to Python","Python","Interference in Python","Introduction to MATLAB","MATLAB Tutorial on Interference","Introduction to Python and MATLAB - Lesson Summary"]},{"name":"Module","details":"Diffractive Optics and Diffraction Grafting","description":"This module will introduce you to how diffractive optics affects optical systems. You will learn about the meaning as well as the causes of diffraction, amplitude grating in optical systems as basic diffractive elements, as well as the relationship between duty circle and efficiency.","topics":["Diffractive Optics and Diffraction Grating - Learning Outcomes","Diffractive Optics","Diffraction Grating","Diffractive Optics and Diffraction Grating - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of MATLAB and Diffractive Optics in Optical Engineering - Course Assessment"]}]}