{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2904","title":"Fundamentals of Ray Tracing Matrix and Principal Planes in Optical Engineering","totalEnrolled":"170","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn all about optical engineering and the fundamentals of the ray tracing matrix and principal planes.","description":"There are various ways in which ray tracing can occur and this free online course in Fundamentals of Ray Tracing Matrix and Principal Planes in optical engineering provides a comprehensive guide on the different techniques of ray tracing. Learn the meaning of principal planes in optical systems, how to calculate principal planes distances in optical systems, as well as the six points of interest in thick and thin lens systems.","courseOutcomes":["Explain the different techniques of ...","Discuss the concept of refraction at...","Discuss the ray tracing matrix using...","Define the concept of principal plan...","Explain the different techniques of the ray tracing matrix in optical systems","Discuss the concept of refraction at a planar boundary and its impact on a thin lens","Discuss the ray tracing matrix using reflection from the planar mirror","Define the concept of principal planes and how to calculate principal planes","Discuss the imaging equation using the ABCD matrix","Identify the six points of interest in the thick and thin lens systems","Explain the different components of the principal point, focal points, and nodal points","Explain the different techniques of ...","Discuss the concept of refraction at...","Discuss the ray tracing matrix using...","Define the concept of principal plan...","Explain the different techniques of the ray tracing matrix in optical systems","Discuss the concept of refraction at a planar boundary and its impact on a thin lens","Discuss the ray tracing matrix using reflection from the planar mirror","Define the concept of principal planes and how to calculate principal planes","Discuss the imaging equation using the ABCD matrix","Identify the six points of interest in the thick and thin lens systems","Explain the different components of the principal point, focal points, and nodal points"],"courseDescription":"<p>This in-depth free online course uses the ABCD matrix to teach you about effectively tracing rays through optical pupils and principal planes and begins with a discussion on how the depth of focus of the system is affected by the aperture stop. You will study the chief and marginal rays in optical systems, along with the straight lines at the region of homogeneous refractive index. As you work through this comprehensive engineering content, you will examine the concepts of paraxial approximation, aberration, and numerical aperture in optical systems.&nbsp;</p><p>You will also learn the techniques on how to use matrices to trace elements containing refractive and reflective surfaces, as well as how to cascade various operations using the ray tracing matrix. Some other important topics include studying the concepts of principal planes, effective focal length, the six points of interest in thick and thin lenses and you will also learn how to run an optics software for layout and optimization (OSLO) operation.</p><p>Whether you’re a researcher or student in the field of optical engineering or if you have an interest in optical systems and how the ray tracing matrix works, then this free online course will teach you all the basics and practical applications you need to further your knowledge. Enrol today and hone your skills in the field of optical engineering.</p><a href=\"https://alison.com/resume/courses/2904\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2904\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ray Tracing Matrix and Principal Planes","description":"In this module, you will be introduced to the different matrices for ray tracing as well as the meaning of principal planes. You will learn how to calculate principal plane distances. You will also learn about the six points of interest in a thick lens system.","topics":["Ray Tracing Matrix and Principal Planes - Learning Outcomes","Tracing Rays Through Optical Pupils","Tracing Rays Through Optical Pupils: Numerical Aperture","Ray Tracing Matrix","Ray Tracing Matrix: Reflection of a Mirror","Principal Planes","OSLO: Points of Interest","Ray Tracing Matrix and Principal Planes - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ray Tracing Matrix and Principal Planes in Optical Engineering - Course Assessment"]}]}