{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3042","title":"Fundamentals of Solar Radiation and Solar Cells","totalEnrolled":"1,112","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains how solar radiation and solar photovoltaic conversion can provide renewable energy.","description":"This free online course takes you through the techniques used by scientists and engineers to estimate the quality and quantity of solar radiation received on Earth. This data then helps them to devise the best means and locations to capture the maximum possible energy from the sun. We examine various devices, particularly solar photovoltaic (PV) systems, to demonstrate how they are cleverly engineered to convert solar radiation into electricity.","courseOutcomes":["Explain the importance of empirical ...","List the different correlations deve...","Compute the estimated hourly global,...","State the working principle of solar...","Explain the importance of empirical equations for predicting the availability of solar radiation","List the different correlations developed for estimating solar radiation under different climatic conditions","Compute the estimated hourly global, beam and diffuse radiation under clear skies","State the working principle of solar cells","Describe the construction of PV cells and their manufacturing process","Classify semiconductors based on their characteristics","Outline the role of a p-n junction in the generation of electricity","Identify the different generations of solar cells","Discuss the effect of insolation and temperature on the I-V characteristics of solar cells","Distinguish between solar cells, modules and arrays","Demonstrate how the effect of a shadow on a solar cell can be mitigated","Explain the importance of empirical ...","List the different correlations deve...","Compute the estimated hourly global,...","State the working principle of solar...","Explain the importance of empirical equations for predicting the availability of solar radiation","List the different correlations developed for estimating solar radiation under different climatic conditions","Compute the estimated hourly global, beam and diffuse radiation under clear skies","State the working principle of solar cells","Describe the construction of PV cells and their manufacturing process","Classify semiconductors based on their characteristics","Outline the role of a p-n junction in the generation of electricity","Identify the different generations of solar cells","Discuss the effect of insolation and temperature on the I-V characteristics of solar cells","Distinguish between solar cells, modules and arrays","Demonstrate how the effect of a shadow on a solar cell can be mitigated"],"courseDescription":"<p>This free online course on solar radiation and solar photovoltaic (PV) systems investigates some of the basic techniques and measures adopted by solar scientists and engineers to estimate and capture solar radiation. We begin by explaining the need for assessing and predicting the availability of solar radiation, not only in different parts of planet Earth but also in extraterrestrial regions. We then study various equations and relationships that report radiation values, with meteorological parameters like sunshine hours, cloud cover and precipitation. In the absence of accurate sunshine data, these correlations are used to estimate the monthly, daily and hourly average levels of radiation available on any horizontal or inclined surface under clear or cloudy skies. With the help of examples, we demonstrate how to use these equations and correlations to predict radiation availability and design efficient solar energy systems. This can help you understand some of the challenges faced by engineers and designers as the sun’s energy quickly grows in importance as the most reliable and clean available energy source.&nbsp;</p><p>The course then moves on to the design of PV systems for the conversion of solar energy into electricity for mass consumption. This includes attention to PV cell’s construction and manufacturing process, the specifications of solar modules, arrays, application and working principles. We also delve into the concepts of ‘doping’, fermi energy levels, p-n junction, drift and diffusion current, band-gap energy and energy-loss mechanisms. We also unpack electrical parameters such as the current-voltage (I-V) characteristics of solar cells, the effect of insolation and temperature on I-V characteristics, efficiency of a solar cell, equivalent circuit diagrams and theoretical maximum power. Like all systems, PV conversion has its difficulties and challenges and we take you through difficulties like cell ‘mismatch’, the effect of shadows, maximization of solar PV output and load matching. We provide solutions to these difficulties, such as mechanical and electrical tracking and the use of bypass diodes. Finally, we lay out the improvements made by different generations of PV technology.</p><p>This course suits anyone with some understanding of physics, light, electricity and thermodynamics who would like to expand their awareness of solar energy engineering and technology. Explore this exciting field to stay at the cutting edge of the latest sustainable practices. This engineering discipline will become more and more relevant as the need to find alternative energy sources on a global scale becomes more urgent. Building a career in energy engineering or a related field can be extremely rewarding as the planet faces disaster without such professionals pushing the boundaries of what’s possible. Sign up and work towards a brighter future.</p><a href=\"https://alison.com/resume/courses/3042\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3042\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Solar Radiation Estimation","description":"This module is about the estimation of solar radiation on horizontal and inclined surfaces, under different climatic conditions. You will learn some empirical equations for predicting the availability of solar radiation. You will also learn how to calculate the monthly average of daily and hourly, global and diffuse radiation.","topics":["Solar Radiation Estimation - Learning Outcomes","Estimation of Radiation Under Different Climatic Conditions","Estimation of Radiation on Horizontal and Inclined Surfaces","Solar Radiation Estimation - Lesson Summary"]},{"name":"Module","details":"Fundamentals of Photovoltaic Systems","description":"In this module, you will learn the basics of solar photovoltaic systems, starting from their construction to the principle of working, and the challenges of their proper functioning. You will get a fair idea about the methods employed worldwide to maximize the output of electricity generation from solar power. You will also learn about the recent developments in solar energy conversion techniques through the 3rd generation of PV modules.","topics":["Fundamentals of Photovoltaic Systems - Learning Outcomes","PV Cells","Semiconductor Physics","Performance Characterization of PV Cells","Photovoltaic Modules and Arrays","Fundamentals of Photovoltaic Systems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Solar Radiation and Solar Cells - Course Assessment"]}]}