{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3056","title":"Basics of Marine Boiler Operations","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about safety valves in marine boilers and explore their internal combustion with this free online course.","description":"This free online engineering course explains terms associated with safety valves, relief valves and spring-loaded relief valves and shows you how to maintain them. We take you through the different types of directly mounted boiler water-level indicators and reflex-level gauge and the categories used to classify boiler refractories. This course suits aspiring engineers who want to understand how marine boilers remain important to today’s ships.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course introduces you to the important terms associated with safety and relief valves. We lay out the characteristics and classifications of boiler safety and spring-loaded relief valves before delving into the improved high-lift safety valve used for boiler pressure of up to 25 bar. We discuss the mechanics of the improved high-lift safety valve and examine the parts required to provide higher lift. We also outline the features of the highest quality borosilicate glass, which is tempered to improve toughness against shattering, and investigate the reflex gauge glass assembly used in marine boilers. The course then goes into the maintenance of safety valves, the procedure required to set an improved high-lift safety valve and a sectional view of a ‘gagging’ boiler arrangement. We cover the waste-steam pipe configuration and the operations of the remote-control easing gear.</p><p>The course then investigates the different types of directly mounted boiler water level indicator, the reflex level gauge, prismatic water gage glasses and the classification of boiler refractories. We lay out the characteristics of fireclay, silica brick, magnesite, chromite and chrome-magnesite refractories. We demonstrate the operation of sootblowers, including those used for high-pressure boilers. We teach the fundamentals of marine boiler operation along with the operational principles of the diamond retractable sootblower. The course then describes gear train schematic components and the high-pressure boiler design while illustrating the natural circulation circuit, including the primary steam-separator in the drum. We show you how the steam-plant schematics identify the cycle of the water/steam as fluid around the plant and how that helps when considering losses that prevent the full utilization of the fuel heater. We break down the effect of density and heat distribution related to steam conditions and the importance of the waste recovery system. We also cover composite boilers, boiler thermal efficiency (including heat-transfer challenges) and reheat boilers.</p><p>We examine the exhaust gas economizer, the characteristics of air heaters and the ‘LJUNGSTRÖM’, an air preheater named after its inventor. The course discusses air heater rotor seals and the main fuel system before analyzing the combustion process in the air heater, steam atomization and the sprayer plate’s role in the boiler. We go through the function of distance pieces and diffusers in the boiler before we investigate the economizer ‘s role as a multi-pass heat exchanger. We cover the constituents of boiler fuel oil and demonstrate how fuel and air are mixed in a boiler, while unpacking the concepts of primary and secondary or ‘suspended’ flame. This free online engineering can help aspiring engineers and anyone interested in marine boilers and their important role in modern shipping.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}