{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3058","title":"Fundamentals of Diesel Engines","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course delves into the principles of diesel engines and the classifications of marine engines specifically.","description":"This course on marine diesel engines teaches you about their constructional principles and theoretical cycles. You will learn about the various classifications of diesel engines and compare the features of two-stroke and four-stroke models. You will also be able to explain the engine structure of the two-stroke. Start this course today to improve your understanding of marine diesel engineering.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Fundamentals of Diesel Engines’ introduces you to the operation of internal combustion engines and the thermodynamic cycles of diesel engines. Along with teaching you the theoretical cycle guiding the operation of modern diesel engines, we will compare how the Otto, diesel and dual combustion cycle operated in diesel engines of the early 1900s. The course introduces the various classifications of diesel engines, the features of the piston stroke, and the characteristics of the supercharging or turbocharging terminology in marine diesel engines. It will also explain the timing diagrams of a diesel engine, the engine cycle, the complete series of separate steps or events essential for efficient engine operation, and how a diesel engine develops power by fuel combustion in its cylinders. Have you ever wondered how to calculate the power of an engine? This course touches on calculating the theoretical power and measuring the brake power of an engine with a hydraulic dynamometer.</p><p>Shipowners prefer single-engine/single-propeller designs. This course explains their reasoning, how the RTA96C-14 engine can achieve a maximum power output of 108,920 hp at 102 rpm, and how the engine exceeds 50 percent thermal efficiency at the maximum economy. Explore the vital component parts of two-stroke engines; the construction of bedplate, frame box, cylinder frame; and the constructional features of two-strokes, along with detailing four-stroke engines used onboard ships. Discover how you can assemble the individual parts. In addition, the material explains the construction of the cylinder cover and the mountings of a two-stroke diesel engine, including the features of the safety valve, fuel valves, indicator valves, and how the cylinder cover seals the upper end of the cylinder space. You will also learn the constructional features of the crosshead, connecting rod and bearings of a two-stroke diesel engine.</p><p>Become an expert in the techniques for using the crosshead in large two-stroke marine diesel engines to ease the side thrust by reducing the liner wear. The course continues by explaining the concept of the Sulzer RTA engine connecting rod, the process of the cross-head bearing, the features of the Sulzer engine bearings and lubrication. Learn how you can supply oil to the crosshead through telescopic pipes in MAN B&amp;W engines. The course examines the engine structure, fixed parts that hold the engine together, support and keep the moving parts in alignment, and how the parts resist the pressures due to engine operation. It also demonstrates the internal forces resulting from engine fluctuations in torque, combustion gas forces, or guide forces. It then discusses how an engine structure offers rigidity and strength to ensure crankshaft stresses are minimal and maintain the perfect alignment of piston and running gear. This course will be of great interest to marine engineering students and anyone fascinated with diesel engines in general such as mechanical engineering students. So, register for this course and begin the learning process today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}