{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4165","title":"Basics of Electricity and DC Circuit Analysis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the basics of electricity and learn its laws, theorems and how the DC circuit works in this free online course.","description":"The history of electricity is fascinating and you find it in nature and the latest technology. This course explains how early scientists came up with laws and theorems such as Ohm’s law, Norton’s theorem and more. We examine the basic concepts of the DC circuit and how to apply them in modern life. You'll learn about electrical components such as resistors and capacitors, among others, and how to calculate voltage and current across DC circuits.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The basic concepts of electricity, dating back over two thousand years, were unveiled by early scientists. Over the years, scientists have unlocked the nifty mystery of electricity by studying and analysing the concepts of electricity using various scientific procedures or methods. Electricity has contributed immensely to the birth of civilization. Electrical energy is a common form of energy found in large amounts in power stations and small quantities in consumer devices like the calculator. Every home-based electronic device uses the basic concept of electricity in direct current (DC), which is essentially the movement of electrons through conductive materials. This course explores the fundamentals of a DC circuit. Discover the laws and theorems applied in DC circuits formulated by early scientists. Upon that, we will introduce you to the nature of electricity and go through relevant electrical equations.</p><p>Conductors, in simple terms, are materials (usually metals) that allow the free flow of electrons through them. However, several conductive materials differ in nature, which consequently affects the rate at which they allow electrons to flow through them. In this course, you will investigate several conductive materials, including those suitable in today’s application of electricity. As there are materials that allow the free flow of electrons through them, there are also materials that do not allow the free flow of electrons. Such materials are known as insulators. You will learn about insulators and why they do not allow the free passage of electrons through them. We will study Ohm’s law and how you can use it to calculate components such as current, voltages and resistors across a circuit. In addition, you will gain an understanding of the arrangements of resistors (materials that allow a certain amount of electric charge to pass through them) across a circuit and determine the total. We will also introduce you to circuit theorems such as Norton’s theorem and Thevenin’s theorem and the analytic method used to analyse several DC circuits.</p><p>The capacitor is an electrical component that stores energy in an electric field. Why does a capacitor store energy and not charge? You'll uncover the reason and how to arrange capacitors across a circuit. Conversely, magnets are materials that generate a magnetic field. Though invisible, they have forces that can attract ferromagnetic materials. However, the phenomenon associated with magnetic fields that arise from the motion of electric charges is known as 'magnetism'. This course will examine magnetism, including various equations used to calculate electromagnetism in DC circuits to determine factors such as magnetic flux, reluctance and permeability of a material. Furthermore, we will introduce you to Faraday’s law of induction and inductance. An understanding of basic mathematics and linear equations is required to take the course. It is for learners willing to understand the basic concepts of DC circuits of electricity. If you are curious and fascinated with the power of electricity, don’t hesitate: enrol and start this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}