{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2284","title":"Fundamentals of Circuit Analysis","totalEnrolled":"941","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course on using Laplace transform in circuit analysis and approaches for evaluating convolution integral","description":"This free online fundamentals of circuit analysis course will teach you about the methods to carry out circuit analysis using the Laplace transform, as well as the graphical approaches to evaluating the convolution integral.You will also learn about the concept of two-port networks in an electrical circuit and the importance of transfer functions in signal processing. Then, you will learn about analyzing the interconnection of networks.","courseOutcomes":["Identify how to perform circuit anal...","Discuss the concept of transfer func...","Explain the importance of the convol...","Discuss the graphical approach to ev...","Identify how to perform circuit analysis using Laplace transform.","Discuss the concept of transfer functions, and how to find transfer functions.","Explain the importance of the convolution integral and the convolution of two signals.","Discuss the graphical approach to evaluating the convolution integral","Explain the importance of network stability, and how network synthesis is carried out.","Explain two-port networks in an electrical circuit, and how they are characterized.","Discuss the importance of admittance parameters in electrical circuits.","Identify the need for hybrid parameters, and how they are used to describe ideal transformers.","Discuss the concept of transmission or ABCD parameters.","Explain the interconnection of network circuits, and how they can be analyzed","Identify how to perform circuit anal...","Discuss the concept of transfer func...","Explain the importance of the convol...","Discuss the graphical approach to ev...","Identify how to perform circuit analysis using Laplace transform.","Discuss the concept of transfer functions, and how to find transfer functions.","Explain the importance of the convolution integral and the convolution of two signals.","Discuss the graphical approach to evaluating the convolution integral","Explain the importance of network stability, and how network synthesis is carried out.","Explain two-port networks in an electrical circuit, and how they are characterized.","Discuss the importance of admittance parameters in electrical circuits.","Identify the need for hybrid parameters, and how they are used to describe ideal transformers.","Discuss the concept of transmission or ABCD parameters.","Explain the interconnection of network circuits, and how they can be analyzed"],"courseDescription":"<p>In this course, you will learn about the various methods to carry out circuit analysis using the Laplace transform method. The concept of transfer functions in signal processing, as well as the importance of the convolution integral, will also be covered in this course. Then, this course will teach you about the various graphical approaches to evaluating the convolution integral, and also define the concept of network stability.</p><p>Then, the course will introduce you to the concept of two-port networks in an electrical circuit. The various methods to determine the admittance parameters as well as identifying the hybrid parameters of a circuit will also be covered in this course. Lastly, this course will teach you how transmission parameters are used in electrical circuits, and how to analyse the interconnection of networks in circuits.</p><p>This course is helpful for learners who want to understand the foundation behind carrying out circuit analysis using the Laplace transform methods. Learners can also gain an understanding of how transfer functions are important in signal processing for circuits. Begin this course now to learn about important parameters in an electrical circuit, as well as how networks are connected in a circuit.</p><a href=\"https://alison.com/resume/courses/2284\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2284\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Circuit Analysis Using Laplace Transform","description":"In this module, you will be introduced to how to carry out circuit analysis using the Laplace transform, as well as the concept of the transfer function in signal processing. You will also be introduced to the importance of the convolution integral, the graphical approach to evaluating the convolution integral, and network stability.","topics":["Circuit Analysis Using Laplace Transform - Learning Outcomes","Laplace Transform of Circuit Elements","Transfer Function","Convolution Integral","Graphical Approach of Convolution Integral","Network Stability and Network Synthesis","Circuit Analysis Using Laplace Transform - Lesson Summary"]},{"name":"Module","details":"Two Port Network","description":"In this module, you will be introduced to a two-port network in a circuit, as well as how to determine the admittance parameters. You will also be introduced to the concept of hybrid parameters, as well as the uses of transmission parameters, and a look at the interconnection of networks.","topics":["Two Port Network - Learning Outcomes","Impedance Parameters","Admittance Parameters","Hybrid Parameters","Transmission Parameters","Interconnection of Networks","Two Port Network - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Circuit Analysis - Course Assessment"]}]}