{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2322","title":"Fundamentals of Value Engineering Tools and Techniques","totalEnrolled":"1,539","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course includes the classification of value engineering techniques and tools, as well as some success stories.","description":"This free online fundamentals of engineering tools and techniques course will teach you about the importance of the cost-function relationship, as well as the application and steps of value engineering in product design. You will also learn about the various tools and techniques that are available in value engineering and their classifications. This course will also teach you about the importance of the functional cost worth analysis.","courseOutcomes":["Discuss the cost-function relationsh...","Explain how value engineering can be...","Discuss the advantages of applying t...","Explain how to determine the cost ma...","Discuss the cost-function relationship of a product in value engineering","Explain how value engineering can be applied to the cost reduction of a product","Discuss the advantages of applying the FAST model in value engineering","Explain how to determine the cost matrix and feasibility matrix of a product","Identify the various value engineering tools and techniques","Discuss the importance of using industry specialists to extend specialized knowledge","Identify the project requirements and the description of the project","Explain how a functional analysis worksheet is developed for a product","Discuss the various reasons for the poor value of a product","Discuss the cost-function relationsh...","Explain how value engineering can be...","Discuss the advantages of applying t...","Explain how to determine the cost ma...","Discuss the cost-function relationship of a product in value engineering","Explain how value engineering can be applied to the cost reduction of a product","Discuss the advantages of applying the FAST model in value engineering","Explain how to determine the cost matrix and feasibility matrix of a product","Identify the various value engineering tools and techniques","Discuss the importance of using industry specialists to extend specialized knowledge","Identify the project requirements and the description of the project","Explain how a functional analysis worksheet is developed for a product","Discuss the various reasons for the poor value of a product"],"courseDescription":"<p>In this fundamentals of engineering course, you will learn about the importance of the cost-function relationship in value engineering, as well as how value engineering is applied in the cost reduction of universal testing machines. The application of value engineering in product design, as well as the various steps that are followed when performing value engineering on a product, will also be covered in this course. Then, this course will also look at various case studies that highlight the application of value engineering, as well as how to calculate the cost worth matrix and feasibility matrix.</p><p>This fundamentals of engineering course will also teach you about the various tools and techniques that are available in value engineering, as well as the different classifications of the tools and techniques that are applied in value engineering. Furthermore, the course will teach you about the different ways value engineering tools and techniques are applied and some success stories using value engineering. Lastly, this course will teach you about how to carry out a functional analysis of a project, as well as the importance of the functional cost worth analysis (FCWA) of a project.</p><p>This engineering techniques course is helpful for learners who want to gain an understanding of how value engineering is important in product design, as well as the various tools and techniques that are available in value engineering. This course is also helpful for learners who want to study some real-life examples which utilize the application of value engineering in the product design. Begin this course now to learn about the different ways value engineering can be used to improve the quality of a product without increasing the cost of production.</p><a href=\"https://alison.com/resume/courses/2322\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2322\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"VE Applications and Case Studies","description":"In this module, you will be introduced to the cost-function relationship, as well as the application of value engineering for cost reduction of universal testing machines. You will also be introduced to the steps for value engineering, as well as calculating the cost worth matrix and feasibility matrix.","topics":["VE Applications and Case Studies - Learning Outcomes","Function-Cost Relationship I","Function-Cost Relationship II","VE Applications in Product Design","Value Engineering: Case Study I","Value Engineering: Case Study II","VE Applications and Case Studies - Lesson Summary"]},{"name":"Module","details":"VE Tools and Techniques","description":"In this module, you will be introduced to value engineering tools and techniques, as well as how to identify and overcomes roadblocks. You will also be introduced to various project requirements, the flow process chart for production, and the various reasons for poor value.","topics":["VE Tools and Techniques - Learning Outcomes","VE Tools and Techniques I","VE Tools and Techniques II","VE Success Stories I","VE Success Stories II","Behavioral Roadblocks","VE Tools and Techniques - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Value Engineering Tools and Techniques - Course Assessment"]}]}