{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3323","title":"Fundamentals of Electrical Switchgear","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the functions of switchgear and the protection of induction motors, busbars and more in this free online course.","description":"In this online certificate course, you will study the protection of motors and busbars using electrical switchgear. Explore how they protect against transients and surges, arc interruption theory, types of circuit breakers and the testing, commissioning, and maintenance of relays. An understanding of protection systems is crucial in power networks, so the knowledge obtained in this course will be an invaluable addition to your resume.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course provides all the knowledge required to help you master the fundamentals of the protection systems used to safeguard motors and busbars against faults in a power system network. We use sizable high voltage (HV) induction motors to drive water pumps, fans and other auxiliary items in industries and power generating systems. We therefore cannot overemphasise the crucial roles they play. The damage of a motor due to any type of fault causes a decrease in production and loss of revenue so the protection of induction motors is essential for their reliable performance. This course will first uncover the different types of faults or abnormal conditions experienced in motors. Then we explore the types of protection commonly used for every fault. We introduce you to busbars and teach you how to protect them against faults. A busbar is the junction of an electrical network where many lines are connected. The busbar protection scheme operates and trips all the transmission lines connected to the busbar whenever a fault occurs. We explain why it is crucial to safeguard the busbar from damage and prevent potentially prolonged power outages. You will therefore learn the various protection schemes for busbars and the different ways to arrange them.</p><p>Next, we will discuss protection against transients and surges. First, discover the sources of transients and surges and the various protection schemes used for these faults. We introduce the arc interruption theory and discuss Slepian’s theory, Cassie’s theory and the theory of arc quenching. We outline how the quenching of an arc in an AC circuit requires a mechanism that converts the conduction path across the contacts of a circuit breaker into a non-conducting path. We then highlight the concept of current-chopping, which is the interruption of small inductive currents.</p><p>Finally, we describe the different types of circuit breakers that fall under two broad categories of ‘low’ and ‘high’ voltage circuit breakers. Switches, fuses, miniature circuit breakers and earth leakage circuit breakers are part of the low voltage circuit breakers, which we will break down to help you grasp the concepts. We investigate air brake circuit breakers, oil circuit breakers, vacuum circuit breakers and sulphur hexafluoride circuit breakers, collectively known as ‘high voltage’ circuit breakers. Then, to conclude, you will learn the types of tests usually performed on relays and the commissioning and maintenance of relays. The protection of motors, busbars and other critical components of a power system network is essential. This course will thus benefit professionals in power system networks seeking to refresh or expand their knowledge base and anyone considering a career in the field of power systems protection. So why wait? Start this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}