{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2816","title":"Galvanic Coupling and Corrosion Rate in Active Metals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study galvanic coupling and corrosion rate in active metals, as well as sacrificial anode effect, in this free course.","description":"Galvanic Coupling and Corrosion Rate in Active Metals is a free online course that teaches you about the different values of half-cell, anodic and cathodic reactions, as well as the sacrificial anode effect in reference to the atmosphere and the environment. You will also learn about the effect of magnesium and zinc on iron corrosion when they are galvanically coupled.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course begins by introducing you to the different values of half-cell, anodic and cathodic reactions, and the relationship between exchange current density and corrosion rate in a metal. It will introduce to you the parallel line of individual Tafel lines for hydrogen evolution reaction on zinc and platinum surfaces. The corrosion current density of zinc and the area factor effect will also be covered in this free online course.</p><p>You will then look at galvanization as another form of cathodic protection where zinc acts as a sacrificial anode and iron is protected. Learn about the sacrificial anode effect in reference to the atmosphere and the environment, as well as the effect of magnesium and zinc on iron corrosion when they are galvanically coupled. This course will also teach you about the dissolution rate of zinc and iron when separately placed or added in an electrolyte, as well as the mixed potential point of the impressed current cathodic protection.</p><p>Furthermore, you get will familiar with the effect of velocity on the corrosion rate, as well as the relationship between velocity and corrosion rate, current density and overvoltage. You will also learn about the standard hydrogen electrode and saturated calomel electrode. So, register for this course now and start your next learning journey today if you are interested in metallurgy, especially galvanic coupling in active metals.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}