{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5220","title":"Intermediate Chemistry: Halogens & Alkaline Earth Metals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online chemistry course focuses on the physical and chemical properties of halogens and alkaline earth metals.","description":"This chemistry course explains group 2 elements (alkaline earth metals) and group 17 elements (halogens), shows where they are on the periodic table and their electronic structures, and describes the physical and chemical properties of each. We explore the interactions of alkali earth metals with oxygen and water, the reactions of halogens with metals, non-metals, hydrogen and sulfuric acid, and some of their industrial applications.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Magnesium, one of the group 2 elements, is used in fireworks due to the bright white flashes formed when it burns in the presence of oxygen. Find more about magnesium and the rest of the group’s elements in this course. The first module is about alkaline earth metals, including beryllium, magnesium, calcium, barium, strontium and radium, which are located in the second column of the periodic table. Discover how they form metallic bonds, and how the atomic numbers increase going down group 2, which increases the nuclear charge. Adding an extra shell down the group increases the shielding effect, causing a decrease in the melting points. After that, we investigate the chemistry of group 2 elements and how they form basic oxides that partially dissolve in water, forming alkaline or slightly alkaline solutions.</p><p>The flame test, used to differentiate elements based on their different emission colours using a non-luminous Bunsen flame, is then described. Next, we contrast the solubilities of group 2 sulphates and hydroxides, as well as the decomposition of group 2 carbonates and nitrates, which results in the formation of oxides. Calcium carbonate occurs in nature in many forms; the two most common are limestone and marble, used in building houses for bricks or floors.</p><p>The next module covers group 17 elements, known as halogens, which are found in the column before the last on the right side of the periodic table. You'll notice that fluorine and chlorine are gases, bromine is a liquid, and iodine and astatine are solids at room temperature. Then you'll understand how, as you move down group 17, the atomic number rises, causing the atomic radius and Van der Waals forces to increase. After that, we explore the reactions of halogens with metals and hydrogen gas to form ionic compounds and halogen halides, as well as how we can use silver nitrate to distinguish between various halide ions. The course concludes with halogens industrial applications, including the chlorination of water and the production of bleach and PVC. Enrolment is free and there is optional certification available.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}