{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4075","title":"Intelligence Electrical Devices and Digital Electrical Circuits","totalEnrolled":"1,044","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the basic electronic circuits that are the building blocks of digital systems.","description":"This free online course is designed for beginners to learn about the combinational circuits and sequential circuits that form the basis of data collection and storage in today’s electronic world. As the digital circuits have only two states: on and off, referred to as 1and 0, this electronics course explores binary numbers and arithmetic operations as well as circuit elements such as logic gates, latches, and their importance in digital systems.","courseOutcomes":["Distinguish a binary number system f...","Solve the addition, subtraction and ...","Categorize the different logic gates...","Describe both positive and negative ...","Distinguish a binary number system from the decimal number system","Solve the addition, subtraction and multiplication of two binary numbers","Categorize the different logic gates into basic, universal and special","Describe both positive and negative AND and OR logic gates","Identify NAND and NOR gates and also the exclusive XNOR and XOR gates in a circuit diagram","Recognize the use of 'flip-flops', 'counters' and 'shift registers' in a digital circuit","List the different adders, half or full-adders found in computers and processors used in the arithmetic logic units","Distinguish a binary number system f...","Solve the addition, subtraction and ...","Categorize the different logic gates...","Describe both positive and negative ...","Distinguish a binary number system from the decimal number system","Solve the addition, subtraction and multiplication of two binary numbers","Categorize the different logic gates into basic, universal and special","Describe both positive and negative AND and OR logic gates","Identify NAND and NOR gates and also the exclusive XNOR and XOR gates in a circuit diagram","Recognize the use of 'flip-flops', 'counters' and 'shift registers' in a digital circuit","List the different adders, half or full-adders found in computers and processors used in the arithmetic logic units"],"courseDescription":"<p>With each passing day, our world is becoming more digital and more integrated. The word 'digital' is now a part of our everyday life with items such as digital cameras, digital weighing machines, digital signatures, digital watches, digital payments, digital art and much more. What does 'digital' mean? In the Cambridge dictionary, it is defined as ‘recording or storing information as a series of the numbers 1 and 0 to show that a signal is present or absent’. The digital world is represented in binary numbers that have only two values: 0 and 1 representing \"off\" and \"on\" or&nbsp; \"low\" and \"high\" or that a signal is ‘absent’ or ‘present’. This free online electronics tutorial on digital circuits will first introduce you to binary systems which include binary numbers and binary arithmetic. You will also learn how to distinguish and compare the binary system with the decimal system that is generally used in everyday maths. This part of the electronics course will also give you insight into how the decimal numbers are converted into binary codes and how they are used by computers and digital devices to send, receive, and store data.</p><p>A digital circuit comprises various components of which the logic gates are the primary building blocks. These gates combine in different ways to form digital circuits that are associated with different functionalities and represented as binary bits. With this free online electronics course, you will gain an understanding of the three different categories of logic gates: the basic (AND, OR, NOT), universal (NAND and NOR) and special (EX-OR and EX-NOR) gates. You will also be introduced to the negative AND and OR gates and the particular function of each gate as represented with the help of a truth table. Thereafter, you will learn how the different combinations of these gates form complex digital circuits including studying the two types of digital circuits: sequential logic and combinational logic, which are part of the digital appliances we use every day.</p><p>Digital electronics are very important in today’s life as we are increasingly relying on computers to improve our modern lives. At the end of this electronics training you will be able to analyze the different kinds of combinatorial and sequential digital systems that are present in computers, mobile phones, calculators, digital watches and much more. This course will teach you the fundamentals of electronics and is aimed at developing an understanding of digital electronic circuits and prepares anyone interested in learning digital electronics or students who wish to pursue a professional career in intelligent electronic devices. If you aspire to play a leading role in the progress of technology by developing flexible, low-cost, and dependable digital devices, then bring your basic understanding of electrical circuitry and ability to read electrical circuit diagrams and enrol for this exciting, easy-to-understand basic electronics course. Embark on your journey into the digital realm and start solving real-world problems that add value to this modern electronics and digital era.</p><a href=\"https://alison.com/resume/courses/4075\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4075\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Digital Electric Circuits","description":"This module aims to give you a basic understanding of the intelligent electronic devices that are a part of our everyday life. The electronic devices we use every day consist of digital electric circuits. In this module, you will learn about such circuits, what they are, how they work and the logic behind their functionality.","topics":["Digital Electric Circuits - Learning Outcomes","An Introduction to Number System","Binary Arithmetic","Logic Gates of Digital Electric Circuits","Multi-Vibrators and Flip-Flops","Counters and Shift Registers","Adders in Digital Circuits","Digital Electric Circuits - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Intelligent Electronic Devices and Digital Electronic Circuits - Course assessment"]}]}