{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2815","title":"Introduction to Mixed Potential Theory and Corrosion Processes","totalEnrolled":"189","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course on the mixed potential theory in corrosion, as well as the different corrosion processes involved.","description":"Introduction to Mixed Potential Theory and Corrosion Processes is a free online course that teaches you about the differences between cathodic and anodic reactions, as well as the connection between activation and concentration polarization in mixed potential theory. You will learn about the evolution of microstructure of pearlite, as well as its two phases of mixture. Start this course today to improve your understanding of corrosion processes.","courseOutcomes":["Distinguish between activation and c...","Describe the concept of mixed potent...","List the two boundary conditions in ...","Evaluate the differences between act...","Distinguish between activation and concentration polarization","Describe the concept of mixed potential theory","List the two boundary conditions in relation to concentration polarization","Evaluate the differences between activation and concentration polarization","Outline the differences between cathodic and anodic reactions","Explain the derivation of the Tafel equation and the Tafel slope","Describe the evolution of the microstructure of pearlite","Discuss the concept of galvanic coupling","Analyze the depolarization effect on the hydrogen evolution reaction","Explain the exchange current density of cathodic or anodic reactions on an active component","Distinguish between activation and c...","Describe the concept of mixed potent...","List the two boundary conditions in ...","Evaluate the differences between act...","Distinguish between activation and concentration polarization","Describe the concept of mixed potential theory","List the two boundary conditions in relation to concentration polarization","Evaluate the differences between activation and concentration polarization","Outline the differences between cathodic and anodic reactions","Explain the derivation of the Tafel equation and the Tafel slope","Describe the evolution of the microstructure of pearlite","Discuss the concept of galvanic coupling","Analyze the depolarization effect on the hydrogen evolution reaction","Explain the exchange current density of cathodic or anodic reactions on an active component"],"courseDescription":"<p>Introduction to Mixed Potential Theory and Corrosion Processes is a free online course that introduces you to electrochemical polarization and corrosion processes based on the mixed potential theory. It will also introduce you to the Tafel and Butler-Volmer equations, the differences between cathodic and anodic reactions, as well as the connection between activation and concentration polarization to mixed potential theory. The exchange current density in relation to anodic and cathodic polarization will also be covered.</p><p>The material then explains the evolution of microstructure of pearlite, its two phases of mixture, formation process, as well as its relationship to cathodic and anodic reactions. You will study the structure of the optical microscope and lamellar structure, as well as the process of etching and basics of galvanic coupling. This course will then teach you about the types of mixed potentials, as well as the equilibrium potentials of ‘E-mix’ and ‘E-mix primer’.</p><p>Furthermore, you will get familiar with the relationship between anodic and cathodic reactions on metal, as well as the exchange current density of those reactions on the active component. You will also analyze the depolarizing effect on the hydrogen evolution reaction. This free online course will be of great interest to anyone working with corrosion processes. So, register now and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/2815\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2815\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Aspects of Electrochemical Polarization and Mixed Potential Theory","description":"In this module, you will be introduced to the two important aspects of electrochemical reactions, as well as their interactions with mixed potential theory. You will also be introduced to the concepts of Tafel equation, cathodic and anodic reactions, as well as how to plot appropriate graphs representing the reactions and the formation of the Helmholtz double-layer.","topics":["Aspects of Electrochemical Polarization and Mixed Potential Theory - Learning Outcomes","Recap of Electrochemical Polarization","Activation and Concentration Polarization","Tafel Equation and Tafel Slope","Exchange Current Density in Anodic and Cathodic Polarization","Interaction between Concentration Polarization and Mixed Potential Theory","Aspects of Electrochemical Polarization and Mixed Potential Theory - Lesson Summary"]},{"name":"Module","details":"Corrosion Processes on the basis of Mixed Potential Theory","description":"In this module, you will be introduced to the evolution of microstructure in pearlite, the concept of an optical microscope, as well as their formation. You will also be introduced to the concepts of etching, equilibrium potentials, corrosion processes, galvanic coupling and depolarization effects.","topics":["Corrosion Processes on the basis of Mixed Potential Theory - Learning Outcomes","Introduction to Corrosion Processes based on Mixed Potential Theory","Evolution of Microstructure and Optical Microscope","Depolarization Effect","Equilibrium Potentials","Exchange Current Density and Galvanic Contacts","The Corrosion Processes on the basis of Mixed Potential Theory - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Mixed Potential Theory and Corrosion Processes  -- Course Assessment"]}]}