{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3001","title":"Introduction to Ocean and Geothermal Energy","totalEnrolled":"729","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Did you know we can harness green energy from the oceans, the Earth’s core and organic material from plants and animals?","description":"This course will introduce you to alternative energy sources using ocean and geothermal energy. Study the basic concepts and types of geothermal reservoirs and tidal energy. Learn how to capture these energy sources to take advantage of their benefits before studying biomass (organic animal and plant material) as an alternative source of energy.","courseOutcomes":["Describe oceanic thermal energy conv...","Discuss the challenges encountered i...","Explain geothermal energy, a form of...","Explain where geothermal energy is a...","Describe oceanic thermal energy conversion (OTEC) and its principles","Discuss the challenges encountered in harnessing this energy and the by-products OTEC","Explain geothermal energy, a form of clean energy, which can be extracted directly from the earth","Explain where geothermal energy is available","Compare the three levels of water forms that are used as sources of energy","Analyze the advantages of geothermal energy in contrast to OTEC-based energy","Analyze biomass energy and whether or not it can be considered 'clean' energy","Discuss the processes by which biomass is obtained","Describe oceanic thermal energy conv...","Discuss the challenges encountered i...","Explain geothermal energy, a form of...","Explain where geothermal energy is a...","Describe oceanic thermal energy conversion (OTEC) and its principles","Discuss the challenges encountered in harnessing this energy and the by-products OTEC","Explain geothermal energy, a form of clean energy, which can be extracted directly from the earth","Explain where geothermal energy is available","Compare the three levels of water forms that are used as sources of energy","Analyze the advantages of geothermal energy in contrast to OTEC-based energy","Analyze biomass energy and whether or not it can be considered 'clean' energy","Discuss the processes by which biomass is obtained"],"courseDescription":"<p>This free material gives you an overview of ocean thermal energy conversion (OTEC), which is the energy that is obtained by harnessing the tides using an alternator. This system can be used to generate electricity, transforming tidal energy into electrical energy, which is considered safe and profitable. Learn about the challenges of taking advantage of this energy source and the by-products of OTEC. It is considered ‘clean’ because the primary power source is not depleted by its exploitation and it is not produced in a way that creates polluting by-products of any kind. The current challenges include the relationship between the amount of energy that can be obtained with current means, and the economic and environmental cost of installing the necessary devices has prevented a massive implementation of OTEC across the globe.</p><p>Next, you will study geothermal energy, another form of clean power, which can be extracted directly from the ground without the need for sophisticated technologies or purification through hot rock bodies or conduction and convection. Learn where geothermal energy is available and how there are different levels of heat depending on the prospecting that has been carried out. You will study the first stage of geological analysis, including the use of geological, geophysical and geochemical tools to locate anomalies that can reduce the search area. Grapple with the challenges that this form of energy presents, such as the availability of reservoirs and the fact that some geothermal sources do not have a high enough temperature to produce steam. Instead, these zones of lower temperature can provide energy for the air conditioning of buildings. We will also discuss the three levels of water forms based on location, namely supersaturated steam, superheated steam and hot water. The advantages of geothermal energy in contrast to OTEC are listed for you to analyze.</p><p>Finally, you will look into biomass energy and evaluate your position on whether it is clean energy or not. The process by which plants transform the radiant energy of the sun into chemical energy through photosynthesis is discussed, including how part of that energy is stored in the form of organic matter. Chemical energy from biomass can be recovered by burning it directly or turning it into fuel. The pros and cons of extracting energy from biomass are discussed: one advantage is that it could provide substitute energies for fossil fuels, thanks to liquid, gaseous or solid agrofuels. This, however, depends on not using more biomass than the net production of the exploited ecosystem. Considerations must be made on whether any other fuel consumption is incurred in the transformation processes and that the energy conversion is the most appropriate use compared to other possible uses, such as fertilizer and food. You will study the way in which biomass provides complementary fuel to fossil fuel, helping the growth of world consumption and its corresponding environmental impacts, especially in the transport sector. Understand the processes by which it is obtained and the classification of the 10 countries that most use this alternative form of energy. This course would be of benefit to those in the agricultural industry, those interested in supplementing their current fossil fuel energy consumption with a more durable alternative or students studying environmental science and renewable energy.</p><a href=\"https://alison.com/resume/courses/3001\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3001\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"OTEC and Geothermal Energy","description":"In this module, you will be introduced to the ocean thermal energy conversion or OTEC. This will include the principle behind OTEC operation, how it is done and what are the challenges associated with this technology. Then, you will study geothermal energy and the real possibilities of obtaining and using it effectively from the crust of the earth. Finally, you will learn about the environmental aspects involved in the extraction of geothermal energy.","topics":["Ocean Thermal Energy Conversion","The OTEC Plant","Principles of Geothermal Energy","Technological Aspects","OTEC and Geothermal Energy - Learning Outcomes","Ocean and Geothermal Energy - Lesson Summary"]},{"name":"Module","details":"Biomass A From Food Perspective","description":"In this module, you will be introduced to the flapping process. This will include the variability of the boiling point according to atmospheric pressure. The concept of blinking and how it is done in the plant will also be discussed along with the different approaches by which biomass is currently used. Next, you will learn about biomass agriculture and how that is evaluated from an energy perspective and a food perspective.","topics":["Biomass From A Food Perspective - Learning Outcomes","Biomass: An Introduction","Biomass Agriculture","Biomass From Food Perspective  - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ocean and Geothermal Energy - Course assessment"]}]}