{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1389","title":"Introduction to the Electrical Trade - Revised","totalEnrolled":"41,296","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the theories, safe practices and proven procedures of the electrical trade with this free online training course.","description":"This course teaches you everything you need to know to do electrical work on residential, commercial and industrial projects. We all depend on an uninterrupted supply of electrical power in our daily lives so skilled electricians are highly valued professionals. This course lays out the theory behind electricity to explain the practices and procedures you will employ on the job so sign up to gain a valuable new skill and boost your career.","courseOutcomes":["Outline the basics of electrical wir...","Identify the job requirements of the...","Describe the effects of an electric ...","List the safety standards and requir...","Outline the basics of electrical wiring systems","Identify the job requirements of the electrical trade","Describe the effects of an electric shock","List the safety standards and requirements specified by the","Occupational Health and Safety Act (OSHA) in the United States","Explain the ‘lockout’ or ‘tagout’ rule and when it should be used","Lay out the safety rules to apply when working with ladders, overhead equipment, tools and hazardous materials","Describe electrical power, charge and current","Define Ohm's and Kirchhoff's laws for voltage","Outline the basics of electrical wir...","Identify the job requirements of the...","Describe the effects of an electric ...","List the safety standards and requir...","Outline the basics of electrical wiring systems","Identify the job requirements of the electrical trade","Describe the effects of an electric shock","List the safety standards and requirements specified by the","Occupational Health and Safety Act (OSHA) in the United States","Explain the ‘lockout’ or ‘tagout’ rule and when it should be used","Lay out the safety rules to apply when working with ladders, overhead equipment, tools and hazardous materials","Describe electrical power, charge and current","Define Ohm's and Kirchhoff's laws for voltage"],"courseDescription":"<p>This course introduces you to the most common occupational hazards that electricians face, including electric burns and shock. We examine the risks involved when working with tools, equipment, batteries and ladders, which apply around overhead equipment and in confined spaces - even more so in the absence of precautionary measures. We then establish the importance of wearing appropriate personal protective equipment (PPE).</p><p>The course explains how electrical circuits work and discusses voltage sources, source loads, volt-ohm-milliammeters and conductors. We outline the roles of voltage, current and resistance in electrical systems. We delve into electrical theory and study electric charge to explain the movement or flow of electrons in a circuit. The course also covers fundamental electrical concepts like Ohm's and Kirchhoff's Law and compares series and parallel circuits.</p><p>Every electrician needs a toolkit of knowledge and skills, whether they work on residential, commercial or industrial projects. They also require strong troubleshooting skills and to observe safe electrical practices. We provide all this in this training course that teaches you everything you need to get your career in the electrical trade off to a great start. Sign up to learn a new trade that everybody needs and values.</p><a href=\"https://alison.com/resume/courses/1389\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1389\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Electrical Trade","description":"In this module, you will be introduced to the electrical trade. You will learn about various terms associated with the electrical trade and be able to describe the significance of the electrical trade in today's times.","topics":["The Electrical Trade: Learning Outcomes","The Electrical Trade","Career Opportunities in the Electrical Trade","The Electrical Trade: Lesson Summary"]},{"name":"Module","details":"Electrical Safety","description":"This module will teach you about electrical safety. You will learn about the hazards of working with electric power and the different types of electric burns.","topics":["Electrical Safety: Learning Outcomes","Electrical Safety and Electric Shock","Practicing Safety Measures","Other Workplace Hazards and Precautionary Steps","Basic Tool Safety","Working in Confined Spaces","Handling Hazardous Materials","Respiratory Protection","Safeguarding Against Falls","Electrical Safety: Lesson Summary"]},{"name":"Module","details":"Electrical Circuits","description":"In this module, you will learn about electrical circuits and how electricity works in them. You will learn about the reaction and involvement of atoms in electric circuits. This module will also teach you about Ohm's law.","topics":["Electrical Circuits: Learning Outcomes","Electrical Circuits","Atomic Theory","Electrical Power","Electrical Circuits - Other Terminologies","Electrical Circuits: Lesson Summary"]},{"name":"Module","details":"Electrical Theory","description":"This module teaches you about the theoretical aspects of the electrical trade. You will become knowledgeable on the differences between series and parallel circuits and be able to explain Kirchhoff's law.","topics":["Electrical Theory: Learning Outcomes","Introduction to Electrical Theory","Resistive Circuits","Kirchhoff's Law","Electrical Theory: Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to the Electrical Trade - Final Assessment"]}]}