{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5212","title":"Introduction to Land Surveying","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the tools and technical skills required to practise land surveying in this free online engineering course.","description":"Before buildings are erected, land surveyors play an important role in mapping out their sites. Does this career path interest you? If so, this course is for you. We explain how to use the unique instruments used in the field and how to determine land mass. We also study relevant data processing methods and the essential safety standards used to reduce workplace risk. Sign up to pick up technical skills and begin your career as a land surveyor.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you interested in a career that takes you outdoors and engages your mathematical and observation skills? If so, you may find land surveying to be a rewarding career. This course is designed by the online education platform Skill Up to provide the training you need to become a land surveyor who determines land size as accurately as possible before any construction work can begin. We begin with an overview of the job and its requirements and earning potential.</p><p>The course then analyses the different instruments and techniques used to perform surveying tasks. We explore topographic surveying and mapping, which are surveys that locate the horizontal and vertical positions of the surface features of a specific geographic area. We then study boundary surveying. Contrary to popular belief, land surveyors do not establish boundary lines but merely act to document actual land sections and features. We explain how this works in detail.</p><p>Finally, we lay out the vital health and safety precautions you should take on the job and go through the Code of Safe Surveying Practices. The course also demonstrates how to use personal protective equipment and emphasises the importance of personal responsibility while describing the role of supervisors in keeping workers safe. Land surveying is a crucial step in the preparation of any construction project and this engineering course provides all the essential skills you need to enter this fascinating field.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}