{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2211","title":"Introduction to Digital Circuits","totalEnrolled":"1,463","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online course on the application of Schmitt triggers, basic logic operations, as well as the binary number system.","description":"This free online introduction to digital circuits course will teach you about op-amp circuits based on positive feedback, the application of the Schmitt trigger, and also the principle of operation of a sinusoidal oscillator.You will also learn about basic logical operations, simplifying logical functions, and also, the use of Karnaugh maps to minimize a given logical function. You will also learn about binary system and multiplexer operations.","courseOutcomes":["Examine the conversion of a triangul...","Discuss the principles of op-amp cir...","Identify the applications of the Sch...","Discuss the principles of operations...","Examine the conversion of a triangular input voltage to a sinusoidal output voltage","Discuss the principles of op-amp circuits based on positive feedback","Identify the applications of the Schmitt trigger and its advantages.","Discuss the principles of operations of sinusoidal oscillators","Discuss an introduction analog signal and the digital domain","Identify how to simplify logical functions and the standard forms of expression.","Examine the use of Karnaugh maps to minimize a given logical function","Identify the binary or base two number systems and its addition.","Discuss the functionality of the multiplexer and its implementation.","Discuss the binary coded decimal encoding, the 7 segment display, and the BCD-to-7 segment decoder","Examine the conversion of a triangul...","Discuss the principles of op-amp cir...","Identify the applications of the Sch...","Discuss the principles of operations...","Examine the conversion of a triangular input voltage to a sinusoidal output voltage","Discuss the principles of op-amp circuits based on positive feedback","Identify the applications of the Schmitt trigger and its advantages.","Discuss the principles of operations of sinusoidal oscillators","Discuss an introduction analog signal and the digital domain","Identify how to simplify logical functions and the standard forms of expression.","Examine the use of Karnaugh maps to minimize a given logical function","Identify the binary or base two number systems and its addition.","Discuss the functionality of the multiplexer and its implementation.","Discuss the binary coded decimal encoding, the 7 segment display, and the BCD-to-7 segment decoder"],"courseDescription":"<p>In this course, you will learn about design problems based on the conversion of a triangular input voltage to a sinusoidal output voltage. Op-amp circuits based on positive feedback, and also, the application of the Schmitt trigger will also be covered in this course. Then, you will learn about the advantages of the Schmitt trigger, as well as the principle of operation of a sinusoidal oscillator.</p><p>Then, this course will teach you about the basic logical operations, simplifying logical functions, and also, the use of Karnaugh maps to minimize a given logical function. An introduction to the binary system as well the operations of the multiplexer will also be covered. Lastly, you will learn about commonly used blocks called commercial integrated circuits (ICs).</p><p>This course is helpful for learners who want to understand the basic operations of digital circuits. The course will also be beneficial when you want to learn about the binary system of numbers, as well as commercial ICs. Begin this course now to understand the principle of operation of a sinusoidal oscillator.</p><a href=\"https://alison.com/resume/courses/2211\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2211\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Schmitt Triggers and Sinusoidal Oscillators","description":"In this module, you will be introduced to a design problem based on the conversion of a triangular input voltage to a sinusoidal output voltage, op-amp circuits based on positive feedback, and also, the application of the Schmitt trigger. You will also be introduced to the advantages of the Schmitt trigger, as well as the principle of operation of a sinusoidal oscillator.","topics":["Schmitt Triggers and Sinusoidal Oscillators - Learning Outcomes","Simulation of Triangle-to-Sine Converter","Schmitt Triggers I","Schmitt Triggers II","Schmitt Triggers III","Sinusoidal Oscillators I","Sinusoidal Oscillators II","Schmitt Triggers and Sinusoidal Oscillators - Lesson Summary"]},{"name":"Module","details":"Introduction to Digital Circuits","description":"In this module, you will be introduced to the basic logical operations, simplifying logical functions, and also, the use of Karnaugh maps to minimize a given logical function. You will also be introduced to the binary number system, a multiplexer, as well as commonly used blocks called commercial ICs.","topics":["Introduction to Digital Circuits - Learning Outcomes","Introduction to Digital Circuits","Boolean Algebra","Karnaugh Maps","Combinatorial Circuits I","Combinatorial Circuits II","Combinatorial Circuits III","Introduction to Digital Circuits - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Digital Circuits - Course Assessment"]}]}