{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3210","title":"Beginner Tug Operations and Safety","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover a tugboat’s operations, features and various welding and soldering processes in this free online course.","description":"This course on tug operations and safety teaches you about the operations of tugboats, the diverse types of tugboats operations and the modes of tug operations under different conditions of ship work. Study the characteristics of the harbour tugs, tractor tugs and Azimuth stern drive tugs. You will learn about fitting tugs for rescue and how and why you find them in higher concentrations near areas with noticeable heavy shipping traffic.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Tugboats manoeuvre large boats by pushing or pulling them and are the most powerful vessel for their size found in the oceans. This introductory course delves into tugs’ operations, operation types and safety. It discusses harbour tugs, ocean-going river tugs, their responsibilities and the various modes of tug operation under different conditions. The course will also introduce you to the characteristics of the harbour tugs, tractor tugs, Azimuth stern drive (ASD) tugs and how you fit tugs out for rescue. The course will also examine how you can find tugs in higher concentrations near areas with both heavy shipping traffic and hazardous weather conditions. We will explain how you can record training in the ship’s logbooks, precautions and guiding principles to assist the pilot in his decisions. You will also learn how an aft tug can be used to breast the ship's stern in place of the spring line and the critical manoeuvre steps. Investigate the towing arrangements and equipment you should confirm and how to carry out checks on the towing winch.</p><p>The course then explains the various river work scenarios and how to use the towing gear to connect a tug and tow. We describe the towline and terminal gear equipment of utility terrain vehicles (UTVs) and the components of the hydraulic oil system. Explore how to classify pumps into different groups and the important points on the oil properties. Learn about oil deterioration, oil contamination and oil filtration. We describe tugboats’ welding and cutting processes and the tools used to make permanent joints. We will work through the importance of the current setting, the length of the arc and the angle of travel of the arc welding. We will teach you about the oxy-acetylene gas welding process, the brazing process and the sequential operations that you should perform before making a soldered joint. Learn how to cut or enlarge a cylindrical hole in a solid material. We also cover the classification of the soldering flux, functions of the flux and application of the soldering iron. You will also learn about the essential safety precautions you should observe in the soldering process.</p><p>Furthermore, this course will help you become familiar with the windlass and mooring winch design and the winch operation process. Become acquainted with the typical complement of lines you find aboard tugs in ship work, the several key components of a towline system and the components of a functional and safe system. This course will teach you how the towing arrangements and equipment should conform and how to carry out the required checks on the towing winch. Discover the concept of soldering, the applications of soldering and the advantages and disadvantages of soldering. We will explain the application of heat and solder, flux application and how to shape and fit different metal parts together. This introductory course on tug operations and safety will help you improve your knowledge of a lathe, drilling and tapping processes for repairs. It will be of great interest to students, researchers and anyone curious about the various operations carried out on a tugboat. So register for this course and start your next learning experience today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}