{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4177","title":"Introduction to Electronic Sensors","totalEnrolled":"3,654","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study pressure sensors, photoemissive cells and fiber optics in this free course on different types of electric sensors.","description":"This free online course provides you with an understanding of what an electronic sensor is. It goes into detail about the various characteristics and uses of the sensors. Next, you will find information about photoemissive cells and fiber optic sensors. Finally, the course answers questions such as: What are pressure sensors? How do you use a U-tube manometer? How do you use an ultrasonic sensor?","courseOutcomes":["Analyze the characteristics of a sen...","Recognize the applications of an opt...","Describe various pressure sensors   ...","Explain the Bourdon gauge           ...","Analyze the characteristics of a sensor","Recognize the applications of an optical transducer","Describe various pressure sensors","Explain the Bourdon gauge","Define the U-tube manometer","Discuss the Hall effect current sensor","Label and understand multiple ultrasonic sensors","Analyze the characteristics of a sen...","Recognize the applications of an opt...","Describe various pressure sensors   ...","Explain the Bourdon gauge           ...","Analyze the characteristics of a sensor","Recognize the applications of an optical transducer","Describe various pressure sensors","Explain the Bourdon gauge","Define the U-tube manometer","Discuss the Hall effect current sensor","Label and understand multiple ultrasonic sensors"],"courseDescription":"<p>In this free online course, you study accurate information on the working principles of an electronic sensor. It explains and defines the characteristics and functions of a general sensor as well as guiding you through specific information about photoconductive cells and fiber optic sensors. Learn about pressure sensors, U-tube manometers and diaphragm pressure gauges. Next, we discuss the definition of a Bourdon gauge, a diaphragm pressure gauge and other instruments to measure pressure.</p><p>Next, the material teaches you about the Hall effect current sensor. You will learn how to correctly use instruments like a U-tube manometer and optical transducer. Furthermore, you study the application of a dissolved oxygen sensor in the work environment. Following on, the course explains what a smart sensor is. In addition, it looks at ultrasonic sensors. You will be taught how to properly use many of these sensors.</p><p>This course is excellent for those in the electrical field and electricians or technicians who would like to increase their practical and theoretical knowledge of sensors.&nbsp;</p><a href=\"https://alison.com/resume/courses/4177\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4177\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Electronic Sensors","description":"First, this module starts by explaining the characteristics of a sensor. You will view all the various applications and the working principles of the sensors. Next, the module provides information about pressure sensors. Finally, the module will provide you with information on ultrasonic sensors and how to apply them in the workplace.","topics":["Electronic Sensors - Learninig outcomes","Characteristics of a Sensor","Pressure Sensors","Other Sensors","Electronic Sensors - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Electronic Sensors - Course assessment"]}]}