{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4055","title":"Introduction to Electromagnetism","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course trains you in the basics of electromagnetic theory and its everyday practical applications.","description":"In this free online course, we will introduce you to electromagnetism. Electromagnetism describes in detail electrically induced magnetism, magnetically induced electricity, and magnetically induced force on a current-carrying wire. We will provide you with examples and illustrations in order to ensure the concepts are crystal clear. Register today for this introductory course to help improve your knowledge of electromagnetism.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>When scientists discovered in the 20th century that electricity and magnetism were not two separate topics and that they can be combined, it led to the revolutionary discovery of electromagnetism. This discovery transformed both engineering and our daily lives. If you are looking to enhance your understanding of electromagnetism, then you have come to the right place. This free online course will give you a comprehensive understanding of electromagnetism. It kicks off by looking at the magnetic effect of electric current and the various methods available for magnetization. You will be able to analyze solenoids and how to find the direction of an electrically induced magnetic field. Detailed illustrations and formulas will be provided to ensure that key concepts such as hysteresis, magnetomotive forces, and magnetic shielding can be properly understood. A description of toroids and factors that affect the strength of electromagnets will also be provided.</p><p>As the course moves on, some other key components of electromagnetism are also discussed. The phenomenon of magnetically induced electricity is a crucial component of electromagnetism. An analysis of the various methods used in inducing EMF (electric and magnetic fields) along a conductor will be carried out along with an explanation of the laws of electromagnetic induction. Faraday’s laws of electromagnetic induction, Lenz’s law, and Fleming’s right-hand rule will be explained along with illustrations and key formulas. These laws will not only help you understand how EMF is induced but also identify the direction and magnitude of that induced EMF along a current-carrying wire or coil. Next, you will discover eddy currents and the methods used to reduce them. Important instruments are used in experiments of electromagnetism and will be the focus of the next part of the course. An explanation of what a galvanometer, ammeter, and voltmeter are is provided. Their key functions and construction methods will be the main discussion points.</p><p>As the course moves towards its final section, your focus will shift to magnetically induced forces on a current-carrying wire. An explanation of Fleming’s left-hand rule, which is used to find the direction of the force on a current-carrying wire, will be provided. Another critical component is the effect of torque on a rectangular current loop placed in a uniform magnetic field. The course will guide you through this key component along with a discussion of forces between two current-carrying conductors. As mentioned earlier, the discovery of electromagnetism was revolutionary in the field of science. From day-to-day use in doorbells or audio earphones to the creation of life-saving gadgets such as MRI machines, electromagnetism changed the world that we live in. The concepts of electromagnetism form a crucial part of anyone’s understanding who is either looking to satisfy their curiosity or deciding to make a career out of them. In either case, this online course on electromagnetism has you covered so enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}