{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2209","title":"Introduction to Bode Plots and Rectifier Circuits","totalEnrolled":"498","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online course on the op-amp filter analysis and op-amp simulation, as well as the construction of Bode plots.","description":"This free online introduction to Bode plots and rectifier circuits course will teach you about the effect of resistance mismatch, as well as an introduction to op-amp filters, and also a transfer function in Bode plots. You will also learn about the construction of Bode plots, as well as op-amp filters in a simple circuit. Then, the course will teach you about the simulation of an op-amp filter and plot the magnitude of the transfer function.","courseOutcomes":["Examine the operations of the curren...","Examine the variations between the r...","Identify the effects of on bias curr...","Discuss the Bode plots, and a simple...","Examine the operations of the current-voltage converter and the integrator","Examine the variations between the real op-amp and the ideal op-amp","Identify the effects of on bias current on inverting and non-inverting amplifiers","Discuss the Bode plots, and a simple transfer function showing magnitude and phase as a function of frequency.","Examine the contribution of the pole and zero to the magnitude and phase in Bode plots","Examine how to construct Bode plots using various contributions.","Discuss the principles of the op-amp filter, and the functionality of complex circuits.","Examine the combination of an op-amp and a diode for accurate peak detection","Identify the operations of the precision, clipper and clamper circuits","Discuss the operation of precision half-wave and full-wave rectifiers","Examine the operations of the curren...","Examine the variations between the r...","Identify the effects of on bias curr...","Discuss the Bode plots, and a simple...","Examine the operations of the current-voltage converter and the integrator","Examine the variations between the real op-amp and the ideal op-amp","Identify the effects of on bias current on inverting and non-inverting amplifiers","Discuss the Bode plots, and a simple transfer function showing magnitude and phase as a function of frequency.","Examine the contribution of the pole and zero to the magnitude and phase in Bode plots","Examine how to construct Bode plots using various contributions.","Discuss the principles of the op-amp filter, and the functionality of complex circuits.","Examine the combination of an op-amp and a diode for accurate peak detection","Identify the operations of the precision, clipper and clamper circuits","Discuss the operation of precision half-wave and full-wave rectifiers"],"courseDescription":"<p>In this course, you will learn about the effect of resistance mismatch, current-voltage converter and integrator, as well as the slight variations of the real op-amp. An introduction to op-amp filters, as well as a transfer function in Bode plots will also be covered in the course. Then, the course will teach you about the contribution of the pole and the zero to Bode plots.</p><p>The course will also teach you about the construction of Bode plots, op-amp filters in a simple circuit. You will also learn about the simulation of an op-amp filter and plot the magnitude of the transfer function. Lastly, the course will teach you about the combination of an op-amp and a diode for peak detection.</p><p>This course is helpful for learners who want to learn about operational amplifier filters. Learners can also gain an understanding of how to properly simulate an op-amp filter. Start this course now to understand the combination of an op-amp and a diode for peak detection.<span style=\"font-weight: 400;\">&nbsp;This course would be of great interest to anyone studying electronics or interested in pursuing a career in electronics.</span></p><a href=\"https://alison.com/resume/courses/2209\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2209\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Instrumentation Amplifier and Bode Plots","description":"In this module, you will be introduced to the effect of resistance mismatch, current-voltage converter and integrator, as well as the slight variations of the real op-amp. You will also be introduced to op-amp filters, a transfer function in Bode plots, and also, the contribution of the pole and the zero to Bode plots.","topics":["Instrumentation Amplifier and Bode Plots - Learning Outcomes","Instrumentation Amplifier I","Instrumentation Amplifier II","Op-Amp Non-Idealities I","Op-Amp Non-Idealities II","Bode Plots I","Bode Plots II","Instrumentation Amplifier and Bode Plots - Lesson Summary"]},{"name":"Module","details":"Op-Amp Filters and Precision Rectifiers","description":"In this module, you will be introduced to the construction of Bode plots, op-amp filters in a simple circuit, and also, the simulation of an op-amp filter and plot the magnitude of the transfer function. You will also be introduced to the combination of an op-amp and a diode for peak detection.","topics":["Op-Amp Filters and Precision Rectifiers - Learning Outcomes","Bode Plots III","Op-Amp Filters","Simulation of Op-Amp Filter","Precision Rectifiers I","Precision Rectifiers II","Precision Rectifiers III","Op-Amp Filters and Precision Rectifiers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Bode Plots and Rectifier Circuits - Course Assessment"]}]}