{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2282","title":"Introduction to Network Theorems","totalEnrolled":"504","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on the derivation as well as the application of various network theorems in electrical circuits.","description":"This free online introduction to network theorems course will teach you about the types of network theorems used in circuit analysis, as well as the implication of linearity properties in circuits. You will also learn about the superposition theorem.You will also learn about the derivation steps for the maximum power transfer theorem and its application in circuit analysis and derive the equivalent circuits for the Thevenin and Norton theorems.","courseOutcomes":["Explain the linearity properties and...","Discuss how source transformation ca...","Explain the concept of duality, and ...","Identify the importance of the Theve...","Explain the linearity properties and the source transformation in electrical circuits.","Discuss how source transformation can help in resolving electrical circuits","Explain the concept of duality, and also the duality in relationship with the electrical circuits","Identify the importance of the Thevenin theorem in electrical circuits.","Identify how to solve electric circuits using the Thevenin theorem with dependent sources.","Discuss the importance of Norton's theorem in circuit analysis.","Discuss the use of Norton theorem with independent sources in circuit analysis.","Explain the concept of the maximum power transfer theorem","Identify ways maximum power transfer theorem can be used with dependent sources.","Explain the concept of the reciprocity theorem and the compensation theorem","Explain the linearity properties and...","Discuss how source transformation ca...","Explain the concept of duality, and ...","Identify the importance of the Theve...","Explain the linearity properties and the source transformation in electrical circuits.","Discuss how source transformation can help in resolving electrical circuits","Explain the concept of duality, and also the duality in relationship with the electrical circuits","Identify the importance of the Thevenin theorem in electrical circuits.","Identify how to solve electric circuits using the Thevenin theorem with dependent sources.","Discuss the importance of Norton's theorem in circuit analysis.","Discuss the use of Norton theorem with independent sources in circuit analysis.","Explain the concept of the maximum power transfer theorem","Identify ways maximum power transfer theorem can be used with dependent sources.","Explain the concept of the reciprocity theorem and the compensation theorem"],"courseDescription":"<p>In this course, you will learn about the types of network theorems used in circuit analysis, as well as the implication of linearity properties in circuits. The application of the superposition theorem and the concept of duality in electrical circuits will also be covered in this course. Then, this course will teach you how to derive the equations for Thevenin's theorem, as well as show examples of Thevenin's theorem with dependent sources.</p><p>Then, this course will also teach you about the derivation steps for Norton's theorem and solve examples of Norton's theorem with independent sources. The course will also teach you about how to derive the maximum power transfer theorem and its application in circuit analysis. Lastly, this course will teach you how to derive the equivalent circuits for the Thevenin and Norton theorems.</p><p>This course is helpful for learners who want to understand the principles of the network theorems used in circuit analysis. Learners can also gain a good understanding of how to derive the theorems used in carrying out circuit analysis. Begin this course now to learn how the equivalent circuits for the Thevenin and Norton's theorems are derived and applied in electrical circuits.</p><a href=\"https://alison.com/resume/courses/2282\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2282\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Network Theorems I","description":"In this module, you will be introduced to network theorems, and linearity properties, as well as the source transformation theorem. You will also be introduced to the concept of duality, deriving Thevenin's theorem, and Thevenin's theorem with dependent sources.","topics":["Network Theorems I - Learning Outcomes","Linearity Property and Superposition Theorem","Source Transformation","Duality","Thevenin's Theorem I","Thevenin's Theorem II","Network Theorems I - Lesson Summary"]},{"name":"Module","details":"Network Theorems II","description":"In this module, you will be introduced to Norton's theorem, as well as Norton's theorem with independent sources. You will also be introduced to the maximum power transfer theorem, the Thevenin equivalent, and the reciprocity theorem and compensation theorem.","topics":["Network Theorems II - Learning Outcomes","Norton's Theorem I","Norton's Theorem II","Maximum Power Transfer Theorem I","Maximum Power Transfer Theorem II","Reciprocity and Compensation Theorem","Network Theorems II - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Network Theorems - Course Assessment"]}]}