{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3059","title":"Introduction to Four-Stroke and Auxiliary Engines","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the principles of camless engines and the maintenance of auxiliary marine engines.","description":"This course on marine diesel engines guides you through the basic principles of camless engines and the camless engine design of Bowers and Wilkins products (B&W). You will learn about the operation and maintenance of the auxiliary engine as well as the features of four-stroke and four-stroke diesel engines. You will explain the components of a four-stroke engine with ease. Start this course today to improve your expertise in diesel engines.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the basic principles of camless engines, the camless engine design of Bowers and Wilkins products (B&amp;W), the construction and the working of a stationary reluctance type torque sensor. Discover how to measure the torque as well as the Sulzers main diesel engines. The common rail concept in the RT-Flex engine and the working principle of a Sulzer RT-engine is outlined, along with the concept of performance assessment by indicator cards and the procedure for taking indicator diagrams. The course then illustrates the types of indicator diagrams and how you can calculate the area of the indicator diagram. Explore the machinery performance monitoring process and the illustration of the typical cylinder pressure measurement. Learn the use of four-stroke engines in the marine industry, constructional features and components in a four-stroke engine, modern methods of creating indicator diagrams and how you can determine faults in the injection process.&nbsp; Gain a wealth of information on how to calculate the indicator horsepower and measure the shaft horsepower.</p><p>The course then goes on to explain why shipowners prefer single engine/single propeller designs. Understand how the RTA96C-14 engine can achieve a maximum power output of 108 920 hp at 102 rpm and that at the maximum economy, the engine surpasses 50% thermal efficiency. This course also examines the concept of the MAN trunk piston engines and the characteristics of the type VV 52/55 design. Study how the engine can be designed for residual fuel operation and cylinder head and liner features. Examine the types and various components of the auxiliary marine diesel engine, the constructional features of the engine and the broad classification of the auxiliary engine. You will appreciate the extensive features of the fixed, moving, safety devices and the lubrication oil system and the exhaust gas turbocharging system in the auxiliary engine. The course examines the characteristics of the jacket cooling water system, the four-stroke marine diesel engine, the piston oil flow process in the four-stroke diesel engine and the auxiliary engine.</p><p>Becoming familiar with the operation of the auxiliary engines, the speed governing mechanism and operating troubles will stand you in good stead. This course discusses these, the auxiliary engine’s operational starting procedure and various types of governors fitted on the auxiliary engine. The general maintenance of the auxiliary engine, the importance of cleaning the lube and fuel filters, the crankcase inspection, the crankshaft deflection and cylinder head mountings overhaul is summarised. We also examine the inspection and maintenance procedures of the piston and the connecting rod overhaul procedure in the auxiliary engine system. The course covers a broad scope of cylinder calibration, inspection procedures, exhaust gas turbocharging systems and the exhaust gas turbocharger for auxiliary engines. It gives essential detail on the overhauling procedure of the fuel pump. You will improve your understanding of the various systems in the auxiliary diesel engine and the latest developments of the auxiliary engine. This exciting course will help students, researchers and anyone who enjoys learning about diesel engines. So register for this course and start your next learning experience today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}