{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2883","title":"Introduction to Principles of Industrial Engineering","totalEnrolled":"1,235","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to apply the fundamental principles of industrial engineering in this free online course.","description":"In this free online course, you will be introduced to the chronological developments that have taken place in the field of industrial engineering, as well as the general approach and specific objectives of this specialized field that seeks to optimize systems. You will gain an understanding of the different groups and divisions, and how people interact in an organization in order to achieve set goals and objectives.","courseOutcomes":["Outline the roles of industrial engi...","Compare the general and specific obj...","Explain the functions of industrial ...","List and explain the tools and techn...","Outline the roles of industrial engineering","Compare the general and specific objectives of industrial engineering","Explain the functions of industrial engineering","List and explain the tools and techniques used","Examine the factors that constitute an organizational structure","Explain how tasks are assigned according to the layers in an organization","Explain the typical roles performed by the different functions of an organization","Evaluate the concept of 'classical organizational structure'","List the three types of organizations","Outline the different stages in a product's life cycle","Compare the product-focused and process-focused organizational structures.","Analyze the importance of a healthy organizational culture","Outline the roles of industrial engi...","Compare the general and specific obj...","Explain the functions of industrial ...","List and explain the tools and techn...","Outline the roles of industrial engineering","Compare the general and specific objectives of industrial engineering","Explain the functions of industrial engineering","List and explain the tools and techniques used","Examine the factors that constitute an organizational structure","Explain how tasks are assigned according to the layers in an organization","Explain the typical roles performed by the different functions of an organization","Evaluate the concept of 'classical organizational structure'","List the three types of organizations","Outline the different stages in a product's life cycle","Compare the product-focused and process-focused organizational structures.","Analyze the importance of a healthy organizational culture"],"courseDescription":"<p>Do you need a foundational understanding of the developments and techniques used in industrial engineering? This course will begin by breaking down the definition of an ‘industry’, as well as explaining the primary, secondary and tertiary type of industries. You will learn about the important functions of industrial engineering, which include plant design and location, management and operations, facility layout, as well as production planning and control.</p><p>Next, you will learn how to use various tools such as value analysis, work-study, inventory control and job evaluation. Then, the material analyzes the functions, groups, divisions, roles and authorities that make up a typical organizational structure. It also outlines how these different categories interact in an organization to achieve set goals and objectives. Furthermore, the classification of products (which include custom-designed, highly standardized and mixed- strategy) will also be highlighted in this course.&nbsp;</p><p>You will also learn about the three types of organizations (vertical, horizontal and matrix), as well as the differences between the process- and product-focused organizational structures. If you want to explore industrial engineering, consider this foundation course for a thorough grounding in the basic knowledge needed for this in-demand sector.</p><a href=\"https://alison.com/resume/courses/2883\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2883\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Industrial Engineering and Organizational Structure","description":"In this module, you will be introduced to the functions, tools, techniques and applications of industrial engineering. You will also be introduced to the elements that constitute an organizational structure, as well as the different layers and levels in an organization.","topics":["Industrial Engineering and Organizational Structure - Learning Outcomes","Introduction to Industrial Engineering","Developments, Objectives, and Functions","Functions and Tools","Tools of IE and Organizational Structure","Organizational Structure","Industrial Engineering and Organizational Structure - Lesson Summary"]},{"name":"Module","details":"Organizational Structure and Product Strategies","description":"In this module, you will be introduced to the relationship that exists between organizational structure, different roles, principles, types as well as cultures. You will also be introduced to the concepts of process and product organizations as well as product strategies.","topics":["Organizational Structure and Product Strategies - Learning Outcomes","Roles of Organizational Structure","Types of Organizational Structure","Product Strategies","Process and Product Organization","Organizational Structure and Culture","Principles of Organizational Structure","Organizational Structure and Product Strategies - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Principles of Industrial Engineering - Course Assessment"]}]}