{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2863","title":"Introduction to Bioengineering and Biotechnology","totalEnrolled":"1,872","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the significance of the integration of biology, engineering and medicine in this free online course.","description":"How can bioengineers and clinicians collaborate effectively to solve a range of societal problems? In this course on bioengineering and biotechnology, you will first understand the properties, roles and interactions of cells to perform bodily functions. Next, you will study various concepts within the field of biotech as well as its current and future applications.","courseOutcomes":["Identify common problems faced by bo...","Discuss the technological advancemen...","Indicate the major components of cel...","Distinguish the features of plant an...","Identify common problems faced by both biologists and engineers","Discuss the technological advancements made in the field of bioengineering","Indicate the major components of cells and their properties","Distinguish the features of plant and animal cells","List the functions of nucleic acids in DNA","Explain the importance of the structure of DNA","State the functions of RNA in protein synthesis","Summarise the fundamentals of DNA cloning","Outline the steps involved in PCR","Identify common problems faced by bo...","Discuss the technological advancemen...","Indicate the major components of cel...","Distinguish the features of plant an...","Identify common problems faced by both biologists and engineers","Discuss the technological advancements made in the field of bioengineering","Indicate the major components of cells and their properties","Distinguish the features of plant and animal cells","List the functions of nucleic acids in DNA","Explain the importance of the structure of DNA","State the functions of RNA in protein synthesis","Summarise the fundamentals of DNA cloning","Outline the steps involved in PCR"],"courseDescription":"<p>This free online course in bioengineering aims to bridge the gap between the science of engineering and medicine itself. You will consider the various global problems in which bioengineering, using the various technological advancements in the field, aims to solve. In the first section, you will be introduced to the significance of major life processes such as growth, reproduction, evolutionary adaptation and the properties of cells. You will also compare the distinguishing features of plant and animal cells.</p><p>Next, you will learn about the functions of nucleic acids, which are the basic components of DNA and RNA. You will study the different features of DNA and RNA as well as their structures and bases. The basics of gene regulation will also be analyzed and you will see the important milestones and discoveries related to nucleic acids and the central dogma of molecular biology. Thereafter, you will learn about the properties of plasmids and the fundamentals of gene cloning.</p><p>Finally, you will examine the various tools and technologies associated with biological research such as polymerase chain reaction (PCR) and agarose gel electrophoresis. See how the application of these tools can help with the duplication and the amplification of DNA. This course will be of interest to anyone in the field of bioengineering, genetic engineering, biotechnology, medicine and any other related discipline, giving you a solid theoretical grounding in aspects of biotech and bioengineering.</p><a href=\"https://alison.com/resume/courses/2863\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2863\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Bioengineering","description":"In this module, you will understand the significance of the integration of biology, medicine and engineering to address major societal problems. You will also learn about the various processes that are associated with the sustenance of life, such as growth, reproduction, evolutionary adaption and cell properties.","topics":["Introduction to Bioengineering - Learning Outcomes","Biology for Engineers","Bio-inspired Engineering","Cells and Life Processes","Clinicians Perspective: Tackling Brain Tumors","Introduction to Bioengineering - Lesson Summary","Properties of Cells"]},{"name":"Module","details":"DNA Tools and Biotechnology","description":"This module features the functionalities and Properties of DNA and DNA tools. You will learn about the various technologies involved in molecular biology research and biotechnology such as Polymerase Chain Reaction, Gene Cloning and more.","topics":["DNA Tools and Biotechnology - Learning Outcomes","Nucleic Acid and Central Dogma","Gene Cloning","Lab Demonstration: DNA Cloning","Polymerase Chain Reaction","Lab Demonstration: Polymerase Chain Reaction","DNA Tools and Biotechnology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to Bioengineering and Biotechnology - Course Assessment"]}]}