{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3211","title":"Introduction to Ship Stability and Simpson's Rules","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches the application of Simpson’s Rules in maintaining ship stability and architecture.","description":"Simpson's Rules are unique in that they help calculate irregular areas and volume in ship stability. This course explains the principal dimensions of vessels and the concept of relative density. Investigate the calculation of block, midship, prismatic and waterplane coefficients. We will outline the application and calculation of Thomas Simpson's 1st, 2nd and 3rd rules. Start this course today to understand these special rules.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course on ship stability and Simpson’s rules introduces you to the history of adaptive and variant designs in ships. We begin by explaining the contributions of computational fluid dynamics and ship model testing to improve reliable and accurate ship designs today. Next, you will discover the ship stability issues created by external forces that change the state of equilibrium and endanger the vessel. Then learn the principal dimensions used for performing basic calculations and the importance of noting a ship’s length (L), breadth (B) and draught (d). We cover the concepts and calculation of density and relative density and introduce you to the definition, functions and calculation of the wetted surface area (WSA). We study this and the relevance of the Haslar formula, Taylor’s formula and Denny’s formula. Finally, you will learn about the relationship between displacement and a wetted surface area of two similar vessels.</p><p>The following section explains hydrostatic pressure’s principles, calculations and practical applications. We outline load concepts on an immersed plane and an immersed vertical and horizontal plane. We teach you about the four coefficients of importance needed to understand the basics of ship stability, along with their formulas. Learn to identify the block, midship, waterplane and prismatic coefficients. We cover the calculation and effect of tonnes per inch on the ship’s draft before examining the plotting and characteristics of the Bonjean curves. We demonstrate how to draw predicted water lines and read drafts showing where you enter the Bonjean curves. Other important information is the stations and the types of stations that include forward perpendicular, aft perpendicular and midship stations. Explore the waterlines, sectional lines and centrelines, which are points of intersection formed when each plane intersects with the ship’s hull.</p><p>Furthermore, this course will help you become familiar with the numerical calculations for the waterplane area, sectional area and submerged volume. We summarise a brief history of Simpson’s rules and teach you the characteristics, applications and equations of Simpson’s first, second and third rules. We teach you the calculations for the moment of area, the moment of inertia and the moment of volume. You will also learn about semi-ordinates, appendages and common intervals. We cover the displacement calculation, including and excluding tonnes per inch. You will become acquainted with the formula for finding waterplane areas using Simpson’s three rules and the trapezoidal rule. This course will be of great interest to students, researchers and anyone interested in applying Simpson’s rules in ship stability. So, register for this course today and improve your expertise in this technical area.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}