{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4250","title":"Introduction to DC Motors","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the most important features and operating principles of direct current motors in this engineering course.","description":"In this online mechanical and electrical engineering course, we discuss in detail the differences between DC generators and DC engines. You will learn the working principles of a DC motor and how it converts electrical energy into mechanical energy. We look at the characteristics of DC motors and various features like speed, amperage and torque. We also consider the advantages, disadvantages and limitations of various methods of speed control.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, you will learn how to use a DC (direct current) motor, an electrical machine that converts electrical energy into mechanical energy. The basic working principles of such a motor and the differences between DC generators and DC motors will be explained. Learn how to identify the terminals of a DC compound engine. Over time, the manufacturer's information on the terminals can fade so we will cover how to perform continuity tests and the basics of identifying the six terminals on a DC compound motor.</p><p>Do you know there are different types of DC motors? This course explains three different types and their characteristics. Shunt motors are mainly used to drive constant speed shafts, lathes, centrifugal pumps, machine tools, blowers, fans and piston pumps, etc. In addition, learn how DC series motors are used to drive electric locomotives, mass transit systems, trolleys, automobiles, cranes, hoists and conveyors, etc. We will also study how a two-point starter for series motors and a three-point starter for shunt motors work. The resistance start method is the basic principle of both types of motors. Want to know how to calculate the voltage, speed-torque, and the feedback EMF? These calculations are broken down with graphs and diagrams. In order to use the motor for various purposes, the speed of the motor needs to be controlled so the methods for doing so are also explained in detail.</p><p>Want to know how to reverse the direction of rotation of a DC shunt motor? The material shows you how to control the speed of a DC shunt motor using the flux control method and a variable resistor in series with the motor. The speed of a DC shunt motor can be controlled using the various control methods unpacked in the modules. By the end, you will know more about DC motors and have taken a big step towards understanding one of the most important electrical machines that power the industrial world.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}