{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3081","title":"Introduction to Marine Auxiliary Machinery","totalEnrolled":"402","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles and operations of pipes, fittings and valves used aboard ships from this free online course.","description":"‘Introduction to Marine Auxiliary Machinery’ is a course that offers an in-depth understanding of the piping systems for ships, various pumping equipment and pipeline maintenance strategies. Learn about corrosion, the different types of pipes and valves necessary onboard, along with the piping equipment as part of marine auxiliary equipment on board. Master the knowledge of marine auxiliary machinery by registering for this course today!","courseOutcomes":["Outline the schematic layout of vari...","List the types of shipboard valves a...","Distinguish between the temporary an...","Identify the maintenance procedures ...","Outline the schematic layout of various piping systems on board ships","List the types of shipboard valves and their functions","Distinguish between the temporary and permanent repair procedures for pipelines","Identify the maintenance procedures and regulatory requirements involving shipboard pipelines","Describe routine maintenance and overhauling operations of shipboard valves","Recall the materials used for making shipboard pipes and valves","Classify the fittings of various pipes and valves","Outline the schematic layout of vari...","List the types of shipboard valves a...","Distinguish between the temporary an...","Identify the maintenance procedures ...","Outline the schematic layout of various piping systems on board ships","List the types of shipboard valves and their functions","Distinguish between the temporary and permanent repair procedures for pipelines","Identify the maintenance procedures and regulatory requirements involving shipboard pipelines","Describe routine maintenance and overhauling operations of shipboard valves","Recall the materials used for making shipboard pipes and valves","Classify the fittings of various pipes and valves"],"courseDescription":"<p>‘Introduction to Marine Auxiliary Machinery’ is a foundational course from Alison that focuses extensively on the onboard auxiliary machinery and equipment, from pumping systems to pipes, fittings and valves. The course introduces you to the various piping systems used in pipeline layouts with control valves. You will study the different pipes and valves necessary onboard and describe the pipes’ schematic layouts as part of the onboard auxiliary equipment. You can compare a ship to a power plant with a living quarter that requires an array of pipelines. An essential aspect of piping involves the circuitry and how the piping systems function, aided by various valve types. Cognisance of these functions is indispensable for a marine engineer. This course takes a deeper look into the various piping systems onboard and the materials used for making shipboard pipes and valves. Maintenance procedures, regulatory requirements involving shipboard pipelines, repair procedure types, shipboard valves and pipeline functions are all covered in this course. We will discuss materials used in piping systems and the compatibility of valves with fluids in a machine system in detail.</p><p>One of the most common pipelines found onboard a ship is the primary seawater circulating system. This course outlines the usual arrangement in seawater circulation for lubricating oil, jacket water, air coolers and other piping systems. Then it examines a phenomenon where a central cooling system that uses distilled and treated water for direct cooling is cooled by massive amounts of seawater. Discover how this is made possible by the seawater circulating pumps and the connected pipeline system. While the cooling fluid is abundant around the ship, seawater creates several problems, the most important being its adverse corrosive property. Find how the anodised pipelines and (sometimes even rubberised pipings) and sacrificial anodes on heat exchangers protect against such seawater lead corrosion. You will recognise the possible damages associated with seawater, repair strategies and the vulnerability of pipelines to be most prone to corrosion damage.</p><p>Finally, this course explains in detail the various types of pipes, fittings and valve measurements that are used onboard pipeline systems. It describes the function of valves in a ship and how the design of all types of check valves allows flow in one direction only. The importance of a valve’s function is emphasised along with the routine maintenance of the valve. You will learn about the hazards involved with the construction, operation and repair of the pipelines and the measures that you can take to prevent accidents. You will also learn how to avoid, identify and reduce potential hazards before each operation. The course discusses the various repair concepts, including the temporary and permanent repairs procedures for pipelines. Students, researchers, marine engineers and anyone seeking to learn about marine equipment and maintenance procedures will find this course engaging. Enrol today and build your knowledge of the principles of pioneering marine auxiliary equipment and the workings of the relevant systems.</p><a href=\"https://alison.com/resume/courses/3081\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3081\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pipes, Fittings, and Valves","description":"This module introduces you to the important aspects of pipes, fittings and valves used onboard ships. Learners will be familiarized with the pipelines that are used onboard together with the necessary fittings of valves that regulate fluid flow in the pipeline systems. The schematic pipeline diagrams in this module will also show the pumps that are used in creating pressures within the pipeline in transferring various fluids.","topics":["Pipes, Fittings, and Valves - Learning Outcomes","Piping Systems on Ships","Materials for Pipes and Valves","Corrosion in Valves and Pipes","Pipeline Maintenance","Valves on Ships","Pipes, Fittings, and Valves - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Marine Auxiliary Machinery - Course Assessment"]}]}