{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2716","title":"Introduction to Carbon Balance and Energy Efficient Design of Building","totalEnrolled":"730","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how building designs are optimized using genetic algorithms, carbon balance and sealant in this free online course","description":"This free online course will help you understand the energy design in buildings. You will be exposed to the net-zero building, design parameters, orientations, and solar walls. You will learn about value engineering, the factors that affect energy-efficient building design, taking into consideration the constraints and decision variables. You will also learn about the reasons behind the failure of sealants, and products based on synthetic binders","courseOutcomes":["Identify the formula for the emissio...","Identify the different types of kiln...","Identify the differences between nat...","Explain the meaning of sealants as u...","Identify the formula for the emission factor on the basis of energy","Identify the different types of kilns that are available for building","Identify the differences between natural and synthetic building materials","Explain the meaning of sealants as used in buildings","Identify the uses of sealants in building","Define paints, primers, and sealers in relation to building","Explain the meaning of a net-zero building","Explain why you must optimize before design in value engineering","Identify the factors that affect energy-efficient building designs","Define external shading multipliers in relation to the energy-efficient design of buildings","Identify the important parameters for building design","Identify the formula for the emissio...","Identify the different types of kiln...","Identify the differences between nat...","Explain the meaning of sealants as u...","Identify the formula for the emission factor on the basis of energy","Identify the different types of kilns that are available for building","Identify the differences between natural and synthetic building materials","Explain the meaning of sealants as used in buildings","Identify the uses of sealants in building","Define paints, primers, and sealers in relation to building","Explain the meaning of a net-zero building","Explain why you must optimize before design in value engineering","Identify the factors that affect energy-efficient building designs","Define external shading multipliers in relation to the energy-efficient design of buildings","Identify the important parameters for building design"],"courseDescription":"<p><span style=\"font-weight: 400;\">This course will begin by introducing you to carbon balance, sealants, and emission models. You will explore the comparison of various types of brick kilns, sealants, and the health hazards of building materials. You will learn about emission testing and emission from paint. This will lead you to the comparison between synthetic and natural building materials. You will also learn the differences between painting and coating.</span></p><p><span style=\"font-weight: 400;\">Next, in this free online course, you will be exposed to energy design in buildings. This includes net-zero building, design parameters, orientations, and solar walls. You will then explain the design optimization of buildings and building design optimization using a genetic algorithm. You will then learn about value engineering, the factors that affect energy-efficient building design, taking into consideration the constraints and decision variables.&nbsp;</span></p><p><span style=\"font-weight: 400;\">Lastly, you will be introduced to external shading multipliers, orientations, and solar walls. You will learn about the health hazards of building materials and emission models. Including the similarities between sealants and adhesives, the reasons behind the failure of sealants, and products based on synthetic binders. You will gain an understanding of urea-formaldehyde which is used in buildings. You will then learn about the important parameters for building design, backward and forward analysis of building design, thermal design of building and optimization.&nbsp;</span></p><a href=\"https://alison.com/resume/courses/2716\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2716\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Carbon Balance, Sealants and Emission Models","description":"This module discusses aspects of carbon balance, sealants, and emission models. This includes a comparison of various types of brick kilns and sealants and the health hazards of building materials. You will also learn about emission testing and emission from paint.","topics":["Carbon Balance, Sealants and Emission Models - Learning Outcomes","Comparison of Brick Kilns and Sealants","Health Hazards of Building Materials","Emission Models and Testing","Carbon Balance, Sealants and Emission Models - Lesson Summary"]},{"name":"Module","details":"Energy Efficient Design of Building","description":"This module discusses aspects of energy design in buildings. This includes net-zero building, design parameters, orientations, and solar walls. You will also discuss the design optimization of buildings and building design optimization using a genetic algorithm.","topics":["Energy Efficient Design of Building - Learning Outcome","Net Zero Building","Design Optimization of Building","Building Design Optimization Using Genetic Algorithm","Energy Efficient Design of Building - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Carbon Balance and Energy Efficient Design of Building - Course Assessment"]}]}