{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2509","title":"Introduction to Construction Materials and Calorimetry","totalEnrolled":"921","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the different construction materials used and the importance of calorimetry.","description":"This course will teach you about characterization techniques and how to investigate material failures in construction. The other part of this course is calorimetry which is the process of measuring the amount of heat released or absorbed during a chemical reaction. By knowing the change in heat, it can be determined whether or not a reaction is exothermic (releases heat) or endothermic (absorbs heat).","courseOutcomes":["Explain the need for characterizatio...","Explain the processes involved in th...","Describe the microstructure of steel...","Identify the issues that affect asph...","Explain the need for characterization of construction materials","Explain the processes involved in the heat treatment of steel","Describe the microstructure of steel as it relates to construction materials","Identify the issues that affect asphalt modelling","List the various types of asphalts in construction materials","Define calorimetry in relation to construction materials","List the different types of calorimeters used in construction","Identify the various applications of calorimetry in construction","Describe how heat of hydration is determined","Explain the influence of temperature on hydration in relation to calorimetry","Explain the need for characterizatio...","Explain the processes involved in th...","Describe the microstructure of steel...","Identify the issues that affect asph...","Explain the need for characterization of construction materials","Explain the processes involved in the heat treatment of steel","Describe the microstructure of steel as it relates to construction materials","Identify the issues that affect asphalt modelling","List the various types of asphalts in construction materials","Define calorimetry in relation to construction materials","List the different types of calorimeters used in construction","Identify the various applications of calorimetry in construction","Describe how heat of hydration is determined","Explain the influence of temperature on hydration in relation to calorimetry"],"courseDescription":"<p>Construction is going on every minute of every day in every country of the world. It is an industry that is constantly in flux and is at the mercy of the economy. It is also a lucrative industry, should you make yourself and your skills invaluable. Upskilling is a huge part of staying relevant in any industry and having in depth knowledge of different construction materials and how to use the process calorimetry efficiently will help to keep you in work in the construction industry. This course begins by teaching you about asphalt and concrete which includes durability and structure. The characteristics of each material will be valued and you will learn how to take each of these into account for different projects. Without taking in the pros and cons of a material, you cannot forecast the material to be used for different projects.</p><p>Calorimetry will be a major topic in this course and you will be taught about the processes involved in the heat treatment of materials such as steel. Along with asphalt and concrete, you will study the microstructure of steel and relate that back to a construction material. Critical thinking and applying your knowledge is an essential part of this course so be ready to apply what you have learnt as you go. On top of known materials, you will focus on different aspects of calorimetry including the various types of calorimeters, the applications of calorimetry and the various calorimetric measurements.</p><p>Heat of hydration is a topic discussed in detail in this course and relates specifically back to construction materials and calorimetry. By the end of the course, you will be able to explain the influence of temperature on hydration in relation to calorimetry. Learn how to diversify your career by upskilling and learning an important role in the construction industry.</p><a href=\"https://alison.com/resume/courses/2509\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2509\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Structure of Construction Materials","description":"This module explores the need for characterization of construction materials, characterization techniques and investigations into materials failure. You will learn about the structure of concrete, the durability problems in concrete and bituminous materials. You will also learn about asphalts, how asphalt concrete is characterized and then the microstructure of steel.","topics":["Structure of Construction Materials - Learning Outcomes","Characterization of Construction Materials","Need for Characterization and Characterization Techniques","Concrete Composition and Properties","Characteristics of Concrete","Characteristics of Asphalt","Steel Composition in Construction","Structure of Construction Materials - Lesson Summary"]},{"name":"Module","details":"Calorimetry","description":"This module explores the meaning of calorimetry, the various types of calorimeters, the applications of calorimetry and the various calorimetric measurements. You will learn about sample preparations of cement, the heat of hydration as it relates to calorimetry and the influence of temperature on hydration. Also, you will learn about the comparison of different calorimetric methods.","topics":["Calorimetry - Learning Outcomes","Introduction and Evolution of Calorimetry","Types of Calorimeters","Sample Preparation and Heat of Hydration","The Calorimetric Signal and Its Application","Application of Calorimetry","Calorimetry - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Construction Materials and Calorimetry - Course Assessment"]}]}