{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3144","title":"Beginner Ship Construction and Bulkheads","totalEnrolled":"314","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores constructional features of a ship's structure and its stresses and bulkheads.","description":"Bulkheads are designed to reduce the amount of flooding on ships. They divide functional areas into rooms and create watertight compartments. This construction and bulkhead course teaches ship dimensions and structure and its framing system. Gain knowledge regarding stowage, cargo hold inspection, cargo carriage capacity and static and dynamic stresses. You will also learn the advantages, design and construction of watertight bulkheads.","courseOutcomes":["List the ship terms for dimension an...","Describe the construction of ship fr...","Describe the general constructional ...","Describe camber, the rise of a floor...","List the ship terms for dimension and forms","Describe the construction of ship frames","Describe the general constructional feature and arrangement of various types of ships","Describe camber, the rise of a floor, flare, sheer and rake","Evaluate the cause and effect of hogging and sagging","Describe the cause and effect of racking, panting and pounding","Discuss the slamming and torsional stresses experienced by a ship at sea","Identify the proper names for various parts of the ship's hull","Describe various types of bulkheads used for the hull construction","Define the various types of bulkheads","Explain the uses of wash bulkheads and cross ties and describe procedures for testing bulkheads","List the ship terms for dimension an...","Describe the construction of ship fr...","Describe the general constructional ...","Describe camber, the rise of a floor...","List the ship terms for dimension and forms","Describe the construction of ship frames","Describe the general constructional feature and arrangement of various types of ships","Describe camber, the rise of a floor, flare, sheer and rake","Evaluate the cause and effect of hogging and sagging","Describe the cause and effect of racking, panting and pounding","Discuss the slamming and torsional stresses experienced by a ship at sea","Identify the proper names for various parts of the ship's hull","Describe various types of bulkheads used for the hull construction","Define the various types of bulkheads","Explain the uses of wash bulkheads and cross ties and describe procedures for testing bulkheads"],"courseDescription":"<p>We have all seen movies where ships sink or float depending on the damage. This introductory course on ship construction and bulkheads gives you a better insight into why this happens. We will first introduce you to the definition of ship construction, the historical background of vessels and the rapid growth and development in hydro-kinetics. You will also learn about hydrostatics and the science of materials, leading to increased size, speed, commercial value and safety of ships. Investigate the constructional features of the ship’s structure and the terms used for dimensions and structure. Explore the components used to frame a vessel, which includes frames, beams, transverses, floors, stringers, longitudinals and girders. Discover basic hull ship designs commonly used, together with their structural cross-section. The concept of general cargo ships, with the type of cargo carried by these ships, will also be covered in this course.</p><p>This course then explains the two primary standards for measuring cargo and determining the freight payable and cargo-carrying capacity. The importance of proper cargo stowage to avoid damage during a voyage, precautions to prevent damage to cargo and dunnage are all factors that you must consider. This course will teach you about cargo hold inspection, preparation of the hold, requirements for loading and precautions to be taken when handling heavy lift cargo. There are two types of ventilation: natural and mechanical. Both are discussed and we examine the concept of hold ventilation. Are you curious about oil tankers, bulk and combination carriers and the features and functions of a container, roll-on roll-off and passenger ships? You’ll become acquainted with these vessels and be taught about static and dynamic forces, hogging, sagging and static stresses. We outline the concepts of dynamic, slamming and torsional stresses, including the structural elements of a ship’s hull like deck plating, transverse bulkhead, transverse frame, keel frame and hull side beam.</p><p>Furthermore, this course will help you gain knowledge of the standard steel sections, which include H or I sections. The definition of bulkheads and their divisions as Class A, B and C are clarified. Become aware of the features and functions of the three basic types of bulkheads: watertight, non-watertight and tank. This course will help you understand the importance of testing watertight bulkheads, features of longitudinal bulkheads and the regulations governing the number and position of watertight bulkheads. This course will be of great interest to students, researchers and anyone interested in constructing ships. So register for this course and become an authority in ship construction.</p><a href=\"https://alison.com/resume/courses/3144\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3144\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ship Construction, Stresses and Bulkheads","description":"In this module, you will be introduced to the constructional features of a ship's structure, as well as ship terms for dimensions and structures. You will also be introduced to the static and dynamic forces, different shapes of steel sections, and the definition and three basic types of bulkheads. You will learn about the comparison between cofferdam, flat plate, and corrugated bulkheads.","topics":["Ship Construction, Stresses and Bulkheads - Learning Outcomes","Construction of Ships","General Cargo Ships","Ship Stresses","Bulkheads","Ship Construction, Stresses and Bulkheads - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Ship Construction and Bulkheads - Course Assessment"]}]}