{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/5135","title":"Introduction to Architectural Studies","totalEnrolled":"4,616","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the basics of architecture and the primary elements of architectural design in this free online course.","description":"very structure and building you see has its roots in architecture. Architecture is a creative, scientific and technical discipline concerned with designing and constructing facilities for human habitation. In this course, we explore ancient architectural styles that have impacted modern building design. We also teach you modern and postmodern architectural ideas and design styles and lay out the fundamentals of interior design.","courseOutcomes":["Define 'architecture'...","Distinguish between a ‘perceptual’ a...","Summarise important architectural id...","Outline the different architectural ...","Define 'architecture'","Distinguish between a ‘perceptual’ and  ‘conceptual’ space","Summarise important architectural ideas and movements","Outline the different architectural style and their features","Discuss how to ensure smooth and effective project planning in interior design","Explain colour terminologies used in interior design","Describe how to control natural lighting in the environment of a room","Recall the different types of lighting technologies","Define 'architecture'...","Distinguish between a ‘perceptual’ a...","Summarise important architectural id...","Outline the different architectural ...","Define 'architecture'","Distinguish between a ‘perceptual’ and  ‘conceptual’ space","Summarise important architectural ideas and movements","Outline the different architectural style and their features","Discuss how to ensure smooth and effective project planning in interior design","Explain colour terminologies used in interior design","Describe how to control natural lighting in the environment of a room","Recall the different types of lighting technologies"],"courseDescription":"<p>We can trace the evolution of architecture through various traditions, regions, overarching stylistic trends and historical periods. The purpose of architecture is to create the physical environment in which people live. However, it is more than just the built environment: it is an aspect of our culture. This course introduces you to the essential concepts of architectural studies, including building history, theory and design. You'll learn about its philosophy as a form of artistic expression and the primary elements of architectural design. We show you some of the significant forms of ancient architectural styles that shaped and influenced modern architecture, including the ideas and movements that affected those of our time in various ways to let architects be creative and original in their work.&nbsp;</p><p>The course then delves deeply into eight architectural styles you can find in different regions of the world. You will learn about their origin, styles, features, characteristics and historical periods. A building's outlook is as important as what it looks like on the inside. We examine interior structure and design elements and explain how to use them appropriately to meet your client's expectations. We cover the fundamental properties of various colours and investigate how their combinations affect an interior design project. We then study the concept of natural lighting and how it affects the environment of a room and interior design decisions.</p><p>If you are interested in becoming an architect, this course will serve as a gateway to further study of the various styles and periods of human building design and construction. It's perfect for architects, aspiring architects and anyone interested in architecture. We show you how to plan buildings that complement existing structures. As populations and sea levels rise, architecture is key to our planet's future. It contributes to creating solutions to poverty, overcrowding and land scarcity. There is no prerequisite to taking this course. Enrol in this free course today and make the world a better place by constructing buildings that improve the quality of life of their occupants.</p><a href=\"https://alison.com/resume/courses/5135\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5135\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Architectural Styles and Designs","description":"In this module, you’ll be introduced to the systems of architecture and the primary elements of architectural design. You’ll learn about ancient architecture, architectural theories and movements and architectural designs. Furthermore, we’ll teach you the basics of interior designing, rules of colour mixing and how to manage lighting systems.","topics":["Architectural Styles and Designs - Learning Outcomes","Architectural Ideas and Movements","Forms of Architectural Styles","Modern Architectural Styles and Interior Design","Architectural Styles and Designs - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Architectural Studies - Course Assessment"]}]}