{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4036","title":"Diploma in Introduction to Building Construction","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the modern practices for structural design and building construction in this free online civil engineering course.","description":"Add technical knowledge to your skill set with this free online course where you will learn the preliminary activities in building construction such as the excavation of footing, centre-line marking, and concrete footing readings. The practical demonstration of the most crucial aspects of building construction will be discussed along with some practical tips for innovative thinking so you can kickstart your career in civil engineering.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Civil engineers are highly skilled individuals that adopt technological principles and scientific concepts to shape and improve human lives and the environment. The structural excellence of the Empire State Building (USA), Hoover Dam (USA), and Burj Al Arab (Dubai) have proven the innovativeness and scientific capabilities of civil engineering technologies in the new millennium. Civil engineering involves the design, planning, and supervision of public work projects, including airports, bridges, dams, highways, and residential buildings. In this free online construction training course, the vital roles of civil engineers in structural engineering and quality control will be examined. Similarly, the practical application of the subjects taught in civil engineering will be demonstrated. You will be shown the sequence of a construction project from client requirements to architectural plan design. Likewise, we will present the crucial roles of a professional building contractor as well as the strategies for executing the different stages of a civil engineering project. We will highlight the preliminary procedures involved in building construction, including site clearing activity, centre point marking and the laying of the foundation.</p><p>The next section of this in-depth construction course covers the processes involved in footing excavation, centreline marking, and concrete footing readings. You will study the procedures for column layout marking on Plain Cement Concrete (PCC), systems for understanding and interpreting column layout drawing, and methods for laying PCC. Cover blocks is the following key theme and you will explore its importance and correct dimensions when erecting a structure before studying all about column reinforcements and footing reinforcements along with their drawings. This part of the construction guide also deals with the shuttering of foundation, preparation of plinth PCC and footings cost analysis.</p><p>The last part of the course is extremely important to understand because it discusses the roles of civil engineers including site investigation and feasibility studies, resolving design and development problems, as well as budgets and project resources management. Work-related activities of civil engineers also include making complex calculations, and ensuring a project complies with the requirements of the appropriate regulatory bodies. This civil engineering certificate provides important tips to help you excel at your work-related roles and enhance your skills at executing your projects. For example, we will present a practical demonstration of the process used for curing of footing before concluding with why the Bill of Quantities (BOQ) is important in civil engineering contracts. Whether you are an aspiring engineer, engineering trainee, professional building contractor or experienced structural engineer, this course is perfect for you. By enrolling in this introductory course in civil engineering, you will learn how to successfully execute your building projects and contracts with confidence.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}