{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3212","title":"Hydrostatic Curves in Ship Stability","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This marine engineering course covers concepts of displacement, hydrostatic curves and transverse statical stability.","description":"This course teaches you about all aspects of buoyancy, including reserve and center buoyancy. See how to use the content and readings of hydrostatic curves and tables to calculate a ship’s displacement. Study the moments of statical stability at small and large angle heels. Start this free course today to improve your understanding of displacement and hydrostatic curves.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the essential feature that makes for successful boat design. We unpack the concept and definition of buoyancy, together with the principle of floatation. Explore the vertical and longitudinal distance relating to the draft (or draught) of a ship, along with the law of floatation and the concepts and characteristics of displacement tonnage. We discuss the differences and relationship between displacement and the mean draft. Become familiar with displacement tables, deadweight scales, and draft curves used to relay displacement information at different levels. There are two constituents of displacement that include light and load displacement. We will also cover the concepts and functions of deadweight and discuss the relationship between the waterplane area and tons per inch, along with the effect of tons per inch on the ship’s draft.</p><p>Next, we work through the concepts, functions, calculations and moment of a ship’s trim to change it by one inch. You will study the functions of fresh watermarks for the ship. Then, analyze the relationship between freshwater allowance, displacement of the ship in saltwater, and tonnes per centimetre. You will learn how a draft increases from saltwater to dock water and vice versa plus how to calculate the change. We also demonstrate the effect of a constant draft on the ship’s displacement, and illustrate the calculation of freshwater allowance, dock water allowance, and tons per inch in various densities. You will become skilful at understanding the content, readings, and importance of hydrostatic curves and the concept and functions of the hydrostatic draft. We will reveal the roles of the hydrostatic tables and teach you the differences between the hydrostatic draft and the draft amidships.&nbsp;</p><p>Furthermore, you will learn about the position and working principle of the centre of floatation. We teach you about the calculation of BM and KM plus the calculation of BM in rectangular waterplanes, box-shaped vessels and triangular-shaped vessels. We also cover the principles of transverse statical stability; explain the stable, neutral and unstable equilibria; and teach you about the transverse metacentre. In addition, you explore the moments of statical stability at small and large angles of the heel, understand the loll angle, and the correction of the angle of loll. Finally, we discuss the free surface effect and effect of slack tanks. This maritime engineering course is useful for anyone interested in propulsion systems and load-lines.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}