{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3476","title":"Introduction to Algebra for Engineering","totalEnrolled":"656","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains various approaches and methods used for solving algebraic problems in engineering.","description":"Algebra is an important branch of mathematics that deals with symbols and the rules of manipulating those symbols. This course explains the concept of mathematical systems and their properties. It looks at the differences between commutative and non-commutative properties as well as how to solve algebraic problems. By the end, you will be more skilled in the different methods used to solve quadratic equations.","courseOutcomes":["Define a mathematical system and its...","List terms associated with mathemati...","Describe a group and its properties...","Differentiate between commutative an...","Define a mathematical system and its properties","List terms associated with mathematical systems","Describe a group and its properties","Differentiate between commutative and non-commutative properties","Define relations using ordered pairs and ranger sets","Describe a function using relations and ordered pairs","Discuss functional notation and special functions","Explain how constant functions map real numbers","Explain the graphical solution of quadratic equations","Define a mathematical system and its...","List terms associated with mathemati...","Describe a group and its properties...","Differentiate between commutative an...","Define a mathematical system and its properties","List terms associated with mathematical systems","Describe a group and its properties","Differentiate between commutative and non-commutative properties","Define relations using ordered pairs and ranger sets","Describe a function using relations and ordered pairs","Discuss functional notation and special functions","Explain how constant functions map real numbers","Explain the graphical solution of quadratic equations"],"courseDescription":"<p>There are many situations in engineering where we have to deal with algebraic symbols and equations. The aim of this course is to take young and aspiring engineers through the fundamentals of algebra in engineering. It begins by defining binary operations and explains how an operation, such as addition or multiplication is performed on a set, giving rise to two elements to combine to form a third element. It also describes some of the typical properties of a system. This course defines a Group as consisting of a non-empty set G, with a binary operation (∗) on G and properties including closure, associative, identity elements and inverse elements. It also differentiates between infinite and finite commutative groups. A Field consists of a non-empty set F, with two binary operations, (+,•).&nbsp; You will learn how it is customary to denote the two operations as (+) and (•) due to variances in their behaviour. You will study a set of numbers known as imaginary numbers or pure imaginary numbers, and learn how the imaginary unit is defined. See how to perform operations on imaginary numbers and on complex numbers.</p><p>Complex numbers combine the set of real numbers with the set of pure imaginary numbers. You will learn how a set of complex numbers form a field under the operations of addition and multiplication. Then discover how to graph complex numbers and how to perform operations on complex numbers. This course defines relations as any set of ordered pairs and ranger sets as a set of second coordinates of each ordered pair. Learn about a function, which is any relation in which no two ordered pairs have the same first element. You will also delve into functional notation and special functions. The course explains how constant functions map real numbers. It also describes the algebraic definitions of the absolute value function and the geometric definition of the absolute value function. Learn about linear functions and the greatest integer function. The material explains quadratic function as well as the concepts of parabolas and the vertex in detail. You will be introduced to the polynomial and rational functions, and be taken through the applications of exponential functions.</p><p>Finally, master performing arithmetic operations on functions. Learn about the composition of functions and how to form the composite of two or more functions. Study the meaning of the inverse of a function and how to determine when it exists. This course explains the form of a quadratic equation and explores the graphical solution of quadratic equations in more detail as well as other methods of solving such equations. Analyze how to solve quadratic equations by using the Completing the Square (CTS) method. The material explains the conditions that must exist before the CTS method can be used for solving QEs. Learn how any quadratic equation can be solved using the quadratic formula. There are different types of problems that depend for their solution on analyzing quadratic functions and/or solving quadratic equations. In this course, you will learn some of the problem types from your work in previous algebra courses. We will examine some problems whose solutions depend on quadratic functions. Start this advanced math course today, and become better equipped in solving algebraic problems for engineering.&nbsp;</p><a href=\"https://alison.com/resume/courses/3476\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3476\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Numbers and Operations","description":"In this module, you will be taken through how an operation, such as addition or multiplication is performed on a set. You will learn about fields that consist of non-empty sets. You will also learn how to perform operations on imaginary numbers and on complex numbers.","topics":["Numbers and Operations - Learning Outcomes","Binary Operations and Definitions","Groups in Algebra","Fields in Algebra","Complex and Imaginary Numbers","Complex Numbers","Numbers and Operations - Lesson Summary"]},{"name":"Module","details":"Functions in Algebra","description":"In this module, you will be taken through how to work with functions in view of relations as any set of ordered pairs, along with how constant functions map real numbers. You will learn about the quadratic functions and the application of exponential functions, as well as the composition of functions.","topics":["Functions in Algebra - Learning Outcomes","Relations and Functions","Constant and Identity Functions","Quadratic Functions","Operations on Functions","Functions in Algebra - Lesson Summary"]},{"name":"Module","details":"Quadratic Equations and Inequalities","description":"In this module, you will be introduced to the quadratic function of an equation. You will learn about how to solve quadratic equations by using the completing the square method. You will also learn about the quadratic formula and the concept of the discriminant.","topics":["Quadratic Equations and Inequalities - Learning Outcomes","General Form of a Quadratic Equation","Solving Quadratic Equations by Completing the Square","The Discriminant and Nature of Roots","Problem Solving with Quadratic Functions","Quadratic Inequalities","Quadratic Equations and Inequalities - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Algebra for Engineering - Course Assessment"]}]}