{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3035","title":"Beginner Steam Theories in Marine Boilers","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online engineering course explains the internal workings and use of marine boilers in steam production.","description":"This free online engineering course takes you inside marine boilers as we examine their components to see how they produce steam. We examine ‘D-type’ boilers, the function of various components, boiler mountings and the combination of important modes of steam engine heat transfer. Steam once drove the Industrial Revolution and remains an important source of energy so sign up to improve your understanding of its thermodynamic cycles.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online engineering course begins by introducing you to the use of high-pressure boilers to run main propulsion turbines. We take you through the replacement of high-pressure boilers with the new combined-cycle plants that utilize the flexibility of diesel and steam plants. We cover the application of steam theory, heat transfer, properties of the involved fluid, boiler features and the steam engine’s thermodynamic cycle. The course also introduces you to the technical terms that are used in the context of steam generation, the components and properties of the relevant fluid and the combination of the modes of heat transfer. We discuss the advantages offered by steam plants to provide an accurate perspective of steam’s place in global power generation. We then outline the principles of steam generation and boiler design while identifying categories of boilers and popular boilermakers.</p><p>This course then demonstrates how the marine boiler is optimized for producing steam before examining water-tube boilers and the theory of heat transfer inside them. We show you the advantages of water-tube boilers over their smoke-tube counterparts and look inside steam drums. We lay out the characteristics of ‘D-type’ boilers before delving into the working principles and design of the double-evaporation Aalborg boiler. Then comes the Foster Wheeler ‘D-4’ type boiler and the screen tubes. We compare the construction and operation of different boilers, including their steam temperature control systems: subcritical and supercritical power plants, main steam-stop valves and the feed-check valve. The course unpacks the operation of boiler mountings and the ‘feed regulatory’ system.</p><p>We then compare ‘subcritical’ and ‘supercritical’ power plants and examine various types of once-through boilers. We describe the components and mountings of ‘D-type’ boilers while analyzing the stop and feed check valve. This course explains the feed regulatory system that can be used in steam boilers of a low system and how to monitor the movement of the float. We provide examples of a float control application and unpack water-level control in high-pressure systems, including safety and relief valves and their maintenance. This free online engineering suits aspiring engineers or anyone with an interest in marine boilers and their important role in creating energy.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}