{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4350","title":"Beginner AC Motors","totalEnrolled":"1,418","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the construction, components and working principles of Alternating Current (AC) motors.","description":"An electric motor driven by an alternating current (AC) is called an ‘AC motor’. This course looks at AC motors and components. Study the types, methods of speed controls and, importantly, their protection. Explore the starting processes of AC induction motors, the tests performed on induction motors and the protection methods required to prevent motor damage. You will also learn about the effect of varying frequency and voltage.","courseOutcomes":["Explain the various components of a ...","Describe the starting methods of a s...","List down the types of connections i...","Summarise the load-torque characteri...","Explain the various components of a single-phase induction motor","Describe the starting methods of a single-phase induction motor","List down the types of connections in a three-phase induction motor","Summarise the load-torque characteristics of AC motors","Discuss the starting of slip ring induction motors using rotor resistance starter","Outline the polarity test of the induction motor by the search coil method","Summarise the various types of protection methods such as single phasing protection and thermistor protection and so on","List down the merits and limits of synchronous motor over others","Explain the variations in speed, temperature and torque in AC motors","Describe the principle of operation of synchronous motors","Explain the various components of a ...","Describe the starting methods of a s...","List down the types of connections i...","Summarise the load-torque characteri...","Explain the various components of a single-phase induction motor","Describe the starting methods of a single-phase induction motor","List down the types of connections in a three-phase induction motor","Summarise the load-torque characteristics of AC motors","Discuss the starting of slip ring induction motors using rotor resistance starter","Outline the polarity test of the induction motor by the search coil method","Summarise the various types of protection methods such as single phasing protection and thermistor protection and so on","List down the merits and limits of synchronous motor over others","Explain the variations in speed, temperature and torque in AC motors","Describe the principle of operation of synchronous motors"],"courseDescription":"<p>This course will help you learn how to work with an AC motor, an electrical machine that converts electrical energy (or alternating current) into mechanical energy by electromagnetic induction. We investigate single-phase and three-phase induction motors, how they work, methods of speed control, testing, protective measures and more. First, we will explain the construction of the most commonly used types of motors, namely the squirrel cage motor and the wound induction motor. Induction motors are divided into single-phase induction motors and three-phase induction motors. You will then learn how to reverse the direction of rotation of a three-phase motor.</p><p>The next section discusses the single-phase and three-phase induction motors in detail. Under a single-phase induction motor, we dwell deeper into its components, principle of operation, equivalent circuit, starting methods and more. We will also study how to start a single-phase induction motor using the capacitor start method, similarity to the three-phase induction motor. We will discuss its principle of operation, enclosure types, connection types, reversing operation, load-torque characteristics and more. Want to learn more about the different methods of speed control? This course looks at the different types of AC motor starters, AC motor protection, tests of AC induction motors and so on. In addition, we will also explore how the bimetallic strip is activated as overload protection in engines.</p><p>You may also want to learn about the important role of synchronous motors. We demonstrate synchronous motor operation, synchronous motor starting methods, load characteristics, power factor improvement, torque and V-curves, hunting, advantages and disadvantages and more. We will also examine how to derive the torque equation of a synchronous motor. In addition, you will learn about other types of AC motors, namely the universal motor, the repulsion motor and the AC series motor. By the end of this course, you will have taken a big step toward understanding one of the essential electrical machines powering the industrial world. So why wait? Start your learning journey today.</p><a href=\"https://alison.com/resume/courses/4350\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4350\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Induction Motors","description":"In this module, we will explain the construction of various induction motors, the principle of operation and the various components of a single-phase induction motor. We will explore the different starting methods and the methods of speed control of AC induction motors. You will also learn about the various AC motor starters used in industries.","topics":["Introduction to Induction Motors - Learning Outcomes","Construction of Induction Motors","Equivalent Circuit and Starting Methods","Three-Phase Induction Motor","Load-Torque Characteristics of A.C. Motors","A.C. Motor Starters","Introduction to Induction Motors - Lesson Summary"]},{"name":"Module","details":"Tests, Protection and Synchronous Motors","description":"In this module, we will discuss the various tests that are performed on induction motors and the protection methods of AC motors that are required to prevent damage to motors. You will also learn about the synchronous motor, how a synchronous motor can improve the power factor, the torque equation, and hunting in a synchronous motor.","topics":["Tests, Protection and Synchronous Motors - Learning Outcomes","Tests on Induction Motors","Protection of A.C. Motors","Synchronous Motors A.C","Power Factor Improvement","Tests, Protection and Synchronous Motors - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}