{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2436","title":"Introduction to Engineering System Design & Processes","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this system design course, learn how the components of a system interrelate and contribute to a project’s goals.","description":"This free online Introduction to Engineering System Design course, focuses on understanding the principles on which system design is centered. This system design course covers the principles and concepts that characterize a system and the various elements that compose the system. These elements include detail on hardware, software and firmware. It also includes information on techniques, facilities, services, and other support elements.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>An Introduction to Engineering System Design &amp; Processes is an introductory course on Engineering System Design. The purpose of this course is to establish a basic understanding of Systems Engineering and the role it plays in the design process. Learn how systems engineering can be applied to any system development, whether you are developing a household appliance, building an airplane, or implementing a sophisticated transit management system.</p><p>This course will discuss all the disciplines and specialty groups that form a structured development process that proceeds from concept to production and finally through to operation. It considers both the business and the technical needs of all customers with the goal of providing a quality product. Finally, you will look at the classification of various systems, the role system engineers play, especially in the design of a system, the requirement analysis and the six functions of the design process.</p><p>This system design course is suitable for anyone who wants to find out how complex systems can be developed and implemented successfully. It is relevant to anyone considering a career in project management, engineering, QA, logistic support, operations, management, maintenance and other areas. It enhances professional credibility, extends knowledge and skills; and prepares you for more job responsibilities. Why wait, start this course today and advance your career!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}