{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3183","title":"Introduction to Electric Vehicle Technology","totalEnrolled":"6,722","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the basic requirements for designing an electric vehicle effectively.","description":"With the rise in fuel prices and more electric vehicles on the road, the need for electrical vehicle engineers is growing. The future of the automotive industry is in electric vehicles. This course on electric vehicle technology will equip you with the necessary knowledge to start a career in electric vehicle design. So why wait! Start your path on this new and exciting field of electric vehicle technology today.","courseOutcomes":["Define ‘gradient resistance’, ‘rolli...","Compute torque and acceleration requ...","Solve for energy requirements using ...","Explain the function of the vehicle'...","Define ‘gradient resistance’, ‘rolling resistance’ and ‘aerodynamic drag’","Compute torque and acceleration requirements for engine design","Solve for energy requirements using drive cycles","Explain the function of the vehicle's drive-train","Compute charge-discharge cycles of an electric vehicle's battery","Discuss the battery capacity of electric vehicles","Define ‘gradient resistance’, ‘rolli...","Compute torque and acceleration requ...","Solve for energy requirements using ...","Explain the function of the vehicle'...","Define ‘gradient resistance’, ‘rolling resistance’ and ‘aerodynamic drag’","Compute torque and acceleration requirements for engine design","Solve for energy requirements using drive cycles","Explain the function of the vehicle's drive-train","Compute charge-discharge cycles of an electric vehicle's battery","Discuss the battery capacity of electric vehicles"],"courseDescription":"<p>As fuel prices increase and as the world’s fossil fuel deposits become depleted, governments worldwide are pushing manufacturers to design and produce more electric vehicles. As a result, car manufacturers are looking for automotive engineers who have a background in electric vehicles. Are engineering and physics your passions? This course introduces you to the field of electric vehicle technology and will help you discover how the laws of physics impact the design of any vehicle. Study how aerodynamic drag, wind resistance, gradient resistance or the resistance created by gravity as a vehicle climbs a slope affects cars. Learn how to calculate the impact of these forces to understand how much power a motor needs to produce to overcome these forces while remaining energy-efficient.</p><p>Subsequently, calculating acceleration and torque and the role these forces play in giving a vehicle traction power will be discussed. In an internal combustion engine, traction power comes from petrol or diesel but this power comes from a battery in an electric vehicle. This course will teach you how to compute the amount of energy expressed in watts. A battery needs to provide a motor to produce the torque and traction power required to accelerate and reach specific speeds. Next, you will learn about the drive cycle’s role in determining how much energy a vehicle will consume per kilometre. This energy-efficiency concept is well known in vehicles and internal combustion vehicles. It is expressed in the consumption of litres per kilometre. Electric vehicles, however, use kilo-watt hours over kilometres. A drive cycle helps a designer determine a motor’s energy efficiency through computer simulations, taking into account energy losses and a concept you will learn known as ‘regeneration efficiency’.</p><p>Finally, you will learn important concepts concerning the vehicle's battery, such as battery capacity, depth of charge and charge and discharge cycles. You will examine how to prolong the battery’s life and calculate a battery’s operational life to determine when to replace the vehicle’s battery. Suppose you are interested in a career in automotive design. In that case, this course will give you a head start in the path of electric vehicle design in the same direction the automotive industry is beginning to take. If you are already in the automotive industry as an engineer, automotive technician, or mechanic, Alison’s introductory course on electric vehicles will give you an edge and provide you with the tools needed to push your career to the next level. So why wait! Start this ‘Introduction to Electric Vehicle Technology’ course today!</p><a href=\"https://alison.com/resume/courses/3183\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3183\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Vehicle Dynamics","description":"This module will discuss which physical forces act on a moving vehicle and how to perform calculations that will help determine the power required for an engine to overcome these forces. It will also explain how to calculate the amount of energy that will be consumed by an electric vehicle, depending on driving conditions, to establish design parameters for the electric vehicle.","topics":["Vehicle Dynamics - Learning Outcomes","Acting Forces","Power and Torque for Acceleration","Calculating for Force and Power","Drive Cycles","Vehicle Dynamics - Lesson Summary"]},{"name":"Module","details":"Vehicle Subsystems","description":"This module will discuss the basic functions of the electric vehicle's subsystems, including an introduction to the very heart of the electric vehicle, the battery.","topics":["Vehicle Subsystems - Learning Outcomes","The Vehicle Drive - Train","Batteries","Vehicle Subsystems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Electric Vehicle Technology - Course Assessment"]}]}