{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3887","title":"Introduction to Electrical Technology","totalEnrolled":"2,888","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about safety methods in handling equipment and various electricity sources from this free online course.","description":"Knowledge of safety procedures to prevent electrical shocks and accidents is essential. Introduction to Electrical Technology is a free online course that provides an in-depth guide to enhancing your skillset for handling electrical equipment and analyzing electricity sources. You will also get to learn about the electrical components of resistance, conductance and inductance. Enrol today to learn all about the basics in electrical technology.","courseOutcomes":["Describe how to safely lift and shif...","Discuss the mechanism and prevention...","Analyze different artificial respira...","Define the phenomena of electromotiv...","Describe how to safely lift and shift equipment","Discuss the mechanism and prevention of electric shocks","Analyze different artificial respiration methods","Define the phenomena of electromotive force (EMF)","Indicate the polarity of AC and DC circuits","Identify different types of resistors and their applications","Analyze the effect on the total resistance of series and parallel connection of resistors","Analyze the interaction of magnetic fields","Describe the process of constructing a solenoid","Compute the capacitance in series and parallel connections","Explain the charging and discharging of capacitors in DC circuits","Describe how to safely lift and shif...","Discuss the mechanism and prevention...","Analyze different artificial respira...","Define the phenomena of electromotiv...","Describe how to safely lift and shift equipment","Discuss the mechanism and prevention of electric shocks","Analyze different artificial respiration methods","Define the phenomena of electromotive force (EMF)","Indicate the polarity of AC and DC circuits","Identify different types of resistors and their applications","Analyze the effect on the total resistance of series and parallel connection of resistors","Analyze the interaction of magnetic fields","Describe the process of constructing a solenoid","Compute the capacitance in series and parallel connections","Explain the charging and discharging of capacitors in DC circuits"],"courseDescription":"<p>Introduction to Electrical Technology is a free online course that provides a comprehensive and illustrated guide to gaining a foundational understanding of handling electrical equipment and analyzing electricity sources. It will teach the basic requirements for avoiding the dangers associated with lifting equipment and other electrical components. The material begins with a discussion of the various types of dangers due to lack of safety, artificial respiration methods, and bodily injuries when lifting equipment. It goes on to explain the ways out of such types of dangers including electrical fires and shock. This is very important in preventing the occurrence of emergencies and the facilitation of first aid. You will also learn about the causes of various hazards in the use of electrical equipment and the precautions required for the proper safety of individuals as well as their property. These learning points are crucial for every electrician and technician dealing with electricity.<br>You will learn about electricity sources from the concepts of electromotive force (EMF), voltage, current, DC sources in series and parallel, and the polarity of AC and DC sources. This forms a foundational requirement for learners involved with electronics. You will also discuss the property of resistance along with the series and parallel connection of resistors and voltage divider circuits. Then, you will study inductors from the unit of inductance, solenoid construction, and the series and parallel connection of inductors. Finally, the course concludes with an analysis of capacitors from the functions of a capacitor, factors that determine the capacitance value, and the calculation of capacitance in series and parallel connections. An understanding of these fundamentals allows learners to understand the applications of electrical concepts. Especially for electronics closest to us like the remote control in our homes or the projectors in our offices and even the fundamentals of batteries we have all around us.<br>This free online course will teach you the prerequisites of handling electricity with care as chances of accidents with electricity are higher if people with less experience and knowledge handle it. You will also learn about tricky aspects of electricity that learners find hard to grasp at fundamental levels such as direct and alternating current. Upon the successful completion of this course, it is expected that you would be able to distinguish between basic electric components. This course will be of significant interest to electrical engineering students, electricians, engineers, researchers and anyone with a need to understand the workings of basic electrical systems. Don’t miss the chance to learn about being a good professional in safely handling basic electronic components like resistors, inductors, and capacitors. What are you waiting for? Begin your learning journey into the basics of electrical technology with extra interest in the safety and handling of electrical components today!</p><a href=\"https://alison.com/resume/courses/3887\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3887\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Safety Methods","description":"In this module, you will learn about different dangers due to lack of safety, artificial respiration methods, and body injuries when lifting equipment. Electricity is friendly to users that handle it with care, hence the risks of accidents with electricity are lower if people with more experience and knowledge handle it.","topics":["Safety Methods - Learning Outcomes","Handling Equipment","Fighting Electrical Fires","Electrical Shock","Safety Around Electrical Equipment","Precautions and Emergencies","Electrical Safety Procedures","Lock Out - Tag Out Marine Systems","Safety Methods - Lesson Summary"]},{"name":"Module","details":"Electricity Sources","description":"Understanding electricity sources is a fundamental requirement of Electrical Technology. In this module, you will learn about the concepts of Electromotive Force (EMF), Voltage, Current, DC Sources in Series and Parallel, and the polarity of AC and DC Sources.","topics":["Electricity Sources - Learning Outcomes","Band Theory of Solids","EMF, Voltage, and Current","Comparing EMFs with Potentiometers","Electrical Parameters","Electrical Sources and Circuits","DC and AC Circuits","Electricity Sources - Lesson Summary"]},{"name":"Module","details":"Resistors","description":"Resistors are the electronic components used to resist the flow of current in an electrical circuit. Resistance is the property of conducting materials. This module discusses different types of resistors and their applications along with the effect on the total resistance of series and parallel connection of resistors.","topics":["Resistors - Learning Outcomes","Drift Velocity of Electrons","Mobility, Resistivity and Resistance","Temperature Dependence of Resistivity and Graphs","Joule's Law and other Properties of Resistors","Resistors - Lesson Summary"]},{"name":"Module","details":"Electric Circuits","description":"Electric circuits are required to perform various functions of electric devices around us. They are responsible for directing and controlling electric current. In this module, you will about the components of electric circuits and their workings.","topics":["Electric Circuits - Learning Outcomes","Introduction to Electric Circuits","Measuring and Calculating Resistance","Kelvin Double Bridge and Potential Divider Circuit","Resistive Circuits","Electric Circuits - Lesson Summary"]},{"name":"Module","details":"Inductors","description":"Inductors store electric energy in the form of a magnetic field when there is a flow of current through it. Learn about the interaction of magnetic fields, the process of constructing a solenoid, and the series and parallel connection of inductors from this module.","topics":["Inductors - Learning Outcomes","Inductance in AC Circuits","Mutual Inductance","Types, Measurements, and Connections of Inductors","Inductors - Lesson Summary"]},{"name":"Module","details":"Capacitors","description":"A capacitor is a device used for storing electric charges. In this module, you will analyze the functions of a capacitor, the charging and discharging of capacitors in DC circuits, and the calculation of capacitance in series and parallel connections.","topics":["Capacitors - Learning Outcomes","Capacitance","Types of Capacitors","Charging and Discharging of Capacitors","Properties and Measurement of Capacitors","Capacitors - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Electrical Technology - Course Assessment"]}]}