{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4352","title":"Introduction to Transformers","totalEnrolled":"932","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches about the working principles, features, types and properties of transformers.","description":"In this course, you will learn in detail about the construction, operation and theory of transformers. To do this, we will explore transformer oil's characteristics, types and properties. We will then explain the operation of three-phase transformers and the various testing methods. In addition, you will also learn the working of autotransformers as well as the difference between current and potential transformers.","courseOutcomes":["Explain the working principles and t...","Discuss the energy losses in transfo...","Describe the construction of transfo...","Outline the features, types and prop...","Explain the working principles and theory of transformers","Discuss the energy losses in transformers","Describe the construction of transformers","Outline the features, types and properties of transformer oil","Differentiate between current and potential transformers","Describe the various methods of testing of transformers","List out the conditions to be satisfied for parallel connection of transformers","Summarise the working of autotransformers","Describe the working of centre-tapped transformers","Explain the working of three-phase transformers","Explain the working principles and t...","Discuss the energy losses in transfo...","Describe the construction of transfo...","Outline the features, types and prop...","Explain the working principles and theory of transformers","Discuss the energy losses in transformers","Describe the construction of transformers","Outline the features, types and properties of transformer oil","Differentiate between current and potential transformers","Describe the various methods of testing of transformers","List out the conditions to be satisfied for parallel connection of transformers","Summarise the working of autotransformers","Describe the working of centre-tapped transformers","Explain the working of three-phase transformers"],"courseDescription":"<p>This course will equip you with the principles and theory of single-phase transformers. A transformer is a static device that converts electrical power from one circuit to another at the same frequency. First, you will learn how the principle of mutual induction of coils in transformers works and all about what primary and secondary windings are. Then we will demonstrate the electromagnetic fields (EMF) equation, the turns ratio of transformers, how to represent waveforms and vectors and equivalent circuit diagrams. We will also look at the open circuit characteristics of transformers and the effects of voltage and frequency changes. Want to know about energy losses in transformers and how to deal with them? The two most important losses in transformers are iron and copper. An ideal transformer is one in which there are no core and copper losses.</p><p>You may be wondering how the construction of single and three-phase transformers works. We explain this entire process and the two main types of transformers you differentiate by their construction: core and shell transformers. Then you will learn about the importance, types and properties of insulating oil used in transformers. Do you wonder how configurations of three-phase transformers work in star and delta combinations? We will also explain these topics. You'll learn about centre-tapped transformers, and the Scott or TT connections used when working with two-phase power. Next, we will look for insight into the series-parallel connection of transformers and the effects of incorrect parallel connection.</p><p>Then the course will take you through the various tests, including ratio testing, open circuit testing and short circuit testing. You will learn what ‘voltage regulation’ is and how efficiency testing works in transformers. You will further examine the winding polarity and core balance testing. You will also explore how to test transformer oil to determine its dielectric strength. The course will explain the difference between current and potential transformers and how to use them to measure voltage and power. Finally, you will learn the particular requirements for designing marine transformers. This course is ideal for those who want to gain knowledge in the use and construction of transformers. So why wait? Start your learning journey today.</p><a href=\"https://alison.com/resume/courses/4352\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4352\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Principle and Theory of Transformers","description":"In this module, you will learn the basic principles of transformers and the transformer ratio. We will study the construction of a simple transformer and the types of transformers based on the core. We will then explain the different types of transformer oil. We will also examine the operating principle of autotransformers.","topics":["Principle and Theory of Transformers - Learning Outcomes","Working Principle of Transformers","Construction of Transformers","Transformer Oil","Auto-Transformers","Voltage Regulation and Efficiency","Principle and Theory of Transformers - Learning Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}