{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2846","title":"Introduction to the Evolution of Robotics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how the evolution of robotics has improved our living, in this free online course","description":"Starting with the various applications of robotics, you will also get into the history and laws of robotics. Learn about the classification of robots, along with the uses of industrial and rehabilitation robotics. Object location and motion, technically referred to as ‘manipulator kinematics’ will be covered, along with transformation matrices and homogeneous transformations.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the evolution of robotics and covers the fundamentals of this complex engineering field and industrial technology. You will learn that, as a controversial subject, robotics is often misrepresented in the popular media by both advocates and opponents. You will also discover that a ‘robot’ used to be defined as, ‘a software-controlled mechanical device that uses sensors to guide one or more end effectors through programmed motions in a workspace in order to manipulate physical objects’. Today, this definition is outdated as robotics includes such a wide variety of perspectives and interests that no single definition can truly cover all its forms and uses. It is now generally defined as, ‘the intelligent connection of perception to action’.</p><p>Next, you will discover that robotics gave rise to three fundamental laws connected to harming humans, obeying orders and protecting a robots’ own existence. Analyze the Law of Zeroth and how the rise of robotics has given rise to various myths, and the actual facts around them. For example, is it a myth that robotics’ intention is to eliminate humans’ jobs? Is it a myth that robots are very expensive? This course will look at these myths and consider the facts around them.</p><p>Finally, you will be taught the three main categories of robots. Some robots are used in industry, especially manufacturing operations such as welding, assembly and painting. They are known as industrial robots or ‘manipulators’. Others are used in fields and services like humanoids, medical robots and walking robots. It is worthy to note that rehabilitation robotics is a field of research dedicated to understanding and augmenting rehabilitation through the application of robotic devices. Rehabilitation robotics includes the development of robotic therapies, and the use of robots as therapy aids instead of solely assistive devices. The third main category is our of use of them in entertainment and education. You will also learn about manipulator kinematics, the important position-and-velocity relationship in robotics. Finally, analyze the homogeneous transformation matrix for determining the position and orientation of an object. Students specializing in mechanical engineering or robotics will find this course particularly interesting, as well industrialists wanting to learn more about the technical aspects of industrialist robots.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}