{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2146","title":"Introduction to Shelf Life Extension of Fruits and Controlled Atmosphere Storage","totalEnrolled":"1,096","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This Free Course teaches about shelf life extension of fruits and vegetable, modified atmospheric packaging etc.","description":"This free online Shelf Life Extension course, starts with the principles of shelf life extension of fruits and vegetable particularly the respiration and ripening processes. The course then reviews topics such as modified atmospheric packaging (MAP), and the disinfestation of grains. You'll also learn about food quality analysis through hyperspectral imaging, non-destructive methods for quality analysis, and detection of spoilage in food grains.","courseOutcomes":["Discuss the principles of shelf life...","Describe how modified atmospheric pa...","Explain active packaging and how it ...","Identify the multi product controlle...","Discuss the principles of shelf life extension of fruits and vegetable particularly the respiration and ripening processes","Describe how modified atmospheric packaging for extension of shelf life of the processed food products where biological processes are likely to continue","Explain active packaging and how it changes the condition of the packed food to extend the shelf-life","Identify the multi product controlled atmosphere or modified atmosphere storage unit","Discuss grain storage and food grain production in India","Identify the different ways by which grains can be disinfested","Describe the process of food quality analysis through hyperspectral imaging and its use on grain quality analysis particularly infestation and its various aspects in the grain","Discuss the principles of shelf life...","Describe how modified atmospheric pa...","Explain active packaging and how it ...","Identify the multi product controlle...","Discuss the principles of shelf life extension of fruits and vegetable particularly the respiration and ripening processes","Describe how modified atmospheric packaging for extension of shelf life of the processed food products where biological processes are likely to continue","Explain active packaging and how it changes the condition of the packed food to extend the shelf-life","Identify the multi product controlled atmosphere or modified atmosphere storage unit","Discuss grain storage and food grain production in India","Identify the different ways by which grains can be disinfested","Describe the process of food quality analysis through hyperspectral imaging and its use on grain quality analysis particularly infestation and its various aspects in the grain"],"courseDescription":"<p>This free online course starts with the principles of shelf life extension of fruits and vegetable particularly the respiration and ripening processes. Respiration is a metabolic process that provides the energy for plant biochemical processes. Ripening is a phase in maturation process of fruits and vegetables. Next we will learn modified atmospheric packaging (MAP) for extension of shelf life of either the fresh produce or the processed food products.</p><p>Next you will study active packaging and technologies which involves some physical, chemical, or biological action for altering the interactions between the package. We will further discuss edible coating which can extend the shelf life of the food by inhibition of the microbial growth and by the improvement of the quality of the food system.</p><p>Finally, you will learn about the multi product controlled atmosphere, grain storage, disinfestation of grains, food quality analysis through hyperspectral imaging, rapid and non-destructive methods for quality analysis, and detection of spoilage in food grains.</p><a href=\"https://alison.com/resume/courses/2146\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2146\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Modified Atmospheric Packaging, Active Packaging and Edible Coating of Food and Vegetables","description":"In this module you will learn about modified atmospheric packaging, active packaging and edible coating of food and vegetables. Topics like Respiration and Ripening, Modified Atmospheric Storage, Active Packaging Technology, Edible Coating Technology and Multiproduct CA / MA Storage unit will be discussed.","topics":["Modified Atmospheric Packaging, Active Packaging and Edible Coating of Food and Vegetables - Learning Outcomes","Respiration & Ripening","Modified Atmospheric Storage (MAP)","Active Packaging Technology","Edible Coating Technology","Multiproduct Controlled Atmosphere or Modified Atmosphere Storage Unit","Modified Atmospheric Packaging, Active Packaging and Edible Coating of Food and Vegetables - Lesson Summary"]},{"name":"Module","details":"Controlled Atmosphere Storage of Food Grains; Ozone; Microwave Treatment for Disinfestation of Grains","description":"In this module you will learn about Controlled Atmosphere Storage of Food Grains. Topics like Grain Storage, Ozonation of Food Grains, Hyper Spectral Imaging for Quality Analysis of Food Grains, Non-Destructive Methods for Analysis of Grain Quality and Detection of Spoilage in Grains using Biosensors will be discussed.","topics":["Controlled Atmosphere Storage of Food Grains; Ozone; Microwave Treatment for Disinfestation of Grains - Learning Outcomes","Grain Storage","Ozonation of Food Grains","Hyper Spectral Imaging for Quality Analysis of Food Grains","Non-Destructive Methods for Analysis of Grain Quality","Detection of Spoilage in Grains using Biosensors","Controlled Atmosphere Storage of Food Grains; Ozone; Microwave Treatment for Disinfestation of Grains - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Shelf Life Extension of Fruits and Controlled Atmosphere Storage Course Assessment"]}]}