{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1553","title":"Introduction to Plumbing Tools and Drawings","totalEnrolled":"8,517","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about the essential tools, drawings, and math operations in the plumbing trade with this free online course.","description":"This free online course will teach you about the different plumbing tools, drawings, and math operations that help plumbers perform their job to the highest standard. The right tools are essential in allowing plumbers to apply their theoretical knowledge into the creation of functional water supply and sanitary systems. It is imperative that plumbers understand each of the tools at their disposal and how to operate them effectively","courseOutcomes":["Identify the hand and power tools th...","Describe the various types of tools ...","Recognize the importance of knowing ...","State the components of a constructi...","Identify the hand and power tools that are specific to plumbing","Describe the various types of tools used for measuring and layout, levelling, cutting, drilling, assembling, and holding pipes and fittings","Recognize the importance of knowing basic math skills that will help to accomplish plumbing tasks","State the components of a construction drawing","List the various types of drawings used by plumbers in the profession","Discuss the terms associated with plumbing tools and drawings","Identify the hand and power tools th...","Describe the various types of tools ...","Recognize the importance of knowing ...","State the components of a constructi...","Identify the hand and power tools that are specific to plumbing","Describe the various types of tools used for measuring and layout, levelling, cutting, drilling, assembling, and holding pipes and fittings","Recognize the importance of knowing basic math skills that will help to accomplish plumbing tasks","State the components of a construction drawing","List the various types of drawings used by plumbers in the profession","Discuss the terms associated with plumbing tools and drawings"],"courseDescription":"<p>While most of the tools plumbers work with are used by professionals from other trades, plumbing has its own tools as well. This course will introduce you to the hand and power tools that are specific to plumbing. You will study the types of tools used for measuring and layout, leveling, cutting, drilling, assembling, and holding. You will also learn the basic steps involved in using a drill and study the guidelines for working with hammers.</p><p>Knowledge of basic math skills is vital for accomplishing any plumbing task. These skills help plumbers to make precise calculations and install accurate systems. This course will teach you the math operations for calculating pipe lengths, which include addition, subtraction, multiplication, division, percentage, fractions, and conversions. You will then study the difference between thread makeup and fitting allowance in measuring pipe length. You will also learn to read and interpret construction and plumbing drawings accurately.</p><p>The plumbing profession places both physical and intellectual demands on plumbers. While the physical aspects of the job such as using tools to install and maintain plumbing systems are clearly visible, the intellectual requirements of the trade are skills that are used in the background. This course will make sure you acquire both skills to help you become a truly professional plumber. So, check out the course today and start boosting your knowledge in no time at all.</p><a href=\"https://alison.com/resume/courses/1553\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1553\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Plumbing Tools","description":"In this module, you will learn about hand and power tools, selecting proper plumbing tools, various types of tools used for measuring and layout, levelling, cutting, drilling, assembling, holding and how to use a drill.","topics":["Plumbing Tools - Learning Outcomes","Plumbing Tools","Term Associated with Plumbing Tools","Measuring and Layout Tools","Leveling Tools","Tooth-Edged Cutting Tools","Smooth-Edged Cutting Tools","Drilling and Boring Tools","Pipe Reaming","Assembly and Holding Tools","Plumbing Tools - Lesson Summary"]},{"name":"Module","details":"Plumbing Math","description":"In this module, you will learn about the importance of mathematics and calculations used in plumbing. You will also learn how to carry out math operations such as addition, subtraction, multiplication, division, percentage, fractions and difference between thread makeup and fitting allowance","topics":["Plumbing Math - Learning Outcomes","Plumbing Math","Basic Math Review","Measuring Pipe","Plumbing Math - Lesson Summary"]},{"name":"Module","details":"Plumbing Drawings","description":"In this module, you will learn about reading and interpreting construction and plumbing drawings, generating computer-aided drawings, components of a construction drawing and various types of drawings used by plumbers.","topics":["Plumbing Drawings - Learning Outcomes","Drawings","Construction Drawing Terms","Construction Drawings","Reading Plumbing Drawings","Types of Drawings","Plumbing Drawings - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Plumbing Tools and Drawings - Course Assessment"]}]}