{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2779","title":"Introduction to GCD Machine and Number Systems","totalEnrolled":"212","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Understand the operation of GCD and number systems representation in digital circuits in this free course.","description":"This is an introduction to the greatest common divisor (GCD) and number systems that teaches you about the implementation of, and problems associated with, the GCD machine. Learn about the concept and methodologies of pipelining in digital circuit design, as well as how to use pipelining in real-world systems. Sign up and start today to improve your understanding of operational computations using number systems and building algorithms in Verilog.","courseOutcomes":["Discuss the design of the greatest c...","Outline the problems associated with...","Analyze the description and connecti...","Explain the concept of pipelining in...","Discuss the design of the greatest common divisor (GCD) algorithm","Outline the problems associated with the GCD","Analyze the description and connections of a data path","Explain the concept of pipelining in digital circuit design","Analyze the methodology for pipelining circuits","Analyze the concept of pipeline interleaving and parallelism","Discuss the modeling of circuits with pipelining in Verilog","Outline the connection between pipelining, interleaving and parallelism","Discuss number representation and the positional number system","Analyze the representation of signed numbers","Discuss the purpose and uses of the ripple carry adder","Analyze the computation of number systems using the recursive doubling technique","Discuss the design of the greatest c...","Outline the problems associated with...","Analyze the description and connecti...","Explain the concept of pipelining in...","Discuss the design of the greatest common divisor (GCD) algorithm","Outline the problems associated with the GCD","Analyze the description and connections of a data path","Explain the concept of pipelining in digital circuit design","Analyze the methodology for pipelining circuits","Analyze the concept of pipeline interleaving and parallelism","Discuss the modeling of circuits with pipelining in Verilog","Outline the connection between pipelining, interleaving and parallelism","Discuss number representation and the positional number system","Analyze the representation of signed numbers","Discuss the purpose and uses of the ripple carry adder","Analyze the computation of number systems using the recursive doubling technique"],"courseDescription":"<p>Introduction to GCD Machine and Number Systems is a free course that begins by introducing you to the design and implementation of the greatest common divisor (GCD) algorithm, as well as its translation to Verilog. You will also be introduced to the problems associated with GCD, as well as top-level modules in GCD machines. Go on to learn about instantiation and Verilog syntax representation of a controller and data path, including the writing of various data path elements and data path analysis.</p><p>The course then explains pipelining in digital circuit design, as well as using it to model real-world systems, including studying the terminologies related to pipelines and the methodologies for these circuits. You will be taught about the latency and throughput of a K-pipeline, ill-formed pipelines, as well as the concept of ‘after pipelining’. The applications of assignments and the modelling of circuits with pipelining in Verilog will also be covered.</p><p>Furthermore, you will get familiar with number system representation and the operational computation of signed numbers. You will learn about ripple carry adder, as well as the computation of number systems using the recursive doubling technique. This free online course will be of great use anyone with an interest in GCD machines, pipelining and number systems. If you register for this course now, you can start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/2779\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2779\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"GCD Machine and Data path","description":"In this module, you will be introduced to the design and implementation of the Greatest common divisor algorithm, as well as its translation to Verilog for communication with hardware. You will also be introduced to the application of a controller in GCD machines, as well as the rudiments of the data path.","topics":["GCD Machine and Data path - Learning Outcomes","GCD Algorithm","GCD Machines Datapath","GCD State Machine","GCD Top Level Module","Datapath in Verilog","Datapath Elements in Verilog","FSM in Verilog","GCD Components Interlink","GCD Machine and Data path - Lesson Summary"]},{"name":"Module","details":"Pipelining and Statement Structure","description":"In this module, you will be introduced to the concept of pipelining in digital circuit design, as well as the methodology for pipelining circuits. You will also be introduced to the latency and throughput of a K-pipeline. The algorithms and syntax of assignments in Verilog will also be covered in this module.","topics":["Pipelining and Statement Structure - Learning Outcomes","Pipelining","K-Stage Pipeline","Interleaving and Parallelism","Blocking and Non-blocking Statements","Modeling Circuits with Pipelining","Pipelining and Statement Structure - Lesson Summary"]},{"name":"Module","details":"Number Representation and Arithmetic Circuits","description":"In this module, you will be introduced to number representation, as well as the operational computation of signed numbers. You will also be introduced to the fundamentals of adders, as well as the notion of carry. Multipliers and the recursive doubling technique will also be covered in this module.","topics":["Number Representation and Arithmetic Circuits - Learning Outcomes","Signed Number Representation","Signed Number Addition","Adder and Subtracter","Fast Adders","Multiplication","Number Representation and Arithmetic Circuits - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to GCD Machine and Number Systems - Course Assessment"]}]}