{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2202","title":"Introduction to Masonry Structures","totalEnrolled":"1,949","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the history and importance of masonry in this free online course on introduction to masonry.","description":"This free course will introduce you to the basic concepts of masonry, masonry components and masonry structures. This course describes masonry assemblage and the classification of masonry systems. This course differentiates the uses of masonry in ancient and present times. This course also gives an overview of the design methods in masonry. You will also learn about masonry structural systems and elements such as columns, pillars and beams.","courseOutcomes":["Discuss the basic concept of masonry...","Distinguish between reinforced and u...","Discuss the properties responsible f...","Explain masonry units and mortar...","Discuss the basic concept of masonry","Distinguish between reinforced and unreinforced masonry","Discuss the properties responsible for the overall strength and performance of masonry as a structural typology","Explain masonry units and mortar","Discuss the analysis and design of masonry","Analyze masonry assemblage and elements","Discuss the basic concept of masonry...","Distinguish between reinforced and u...","Discuss the properties responsible f...","Explain masonry units and mortar...","Discuss the basic concept of masonry","Distinguish between reinforced and unreinforced masonry","Discuss the properties responsible for the overall strength and performance of masonry as a structural typology","Explain masonry units and mortar","Discuss the analysis and design of masonry","Analyze masonry assemblage and elements"],"courseDescription":"<p>This course introduces you to the concept and meaning of masonry as a structural material. This course explains how masonry has been utilized as a structural solution in history and in the present day. This course also describes the constituents of masonry as well as the process of designing masonry structures. This course would be of great interest to bricklayers, builders and tradesmen.</p><p>This course explains in detail, the standard framework in which structural masonry is used in different countries. You will be introduced to reinforced and unreinforced masonry. You will also learn about elements such as columns, pillars and beams as well as the classification of masonry and masonry systems. This course describes the importance of diaphragms, walls and the various categories of brick floors. This course outlines the differences between modern masonry constructions and ancient masonry constructions.</p><p>This course also explains masonry structural systems and the classification of masonry based on their structural configurations. You will learn about the strength and weaknesses of masonry structures, the effect of different factors on masonry and the design methods in structural masonry.</p><a href=\"https://alison.com/resume/courses/2202\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2202\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Masonry","description":"In this module, you will be introduced to the concept of masonry as a structural material. You will also be introduced to the use of masonry as a structural solution in history and in the present day as well as the various methods of design.","topics":["Introduction to Masonry - Learning Outcomes","Reinforced and Unreinforced Masonry","Ancient and Modern Masonry Constructions","Masonry Structural System Classification","Design Methods in Structural Masonry","Introduction to Masonry - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Masonry Structures - Course Assessment"]}]}