{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3369","title":"Introduction to Trigonometry for Engineering","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the diverse areas where engineers use trigonometry to help develop solutions in this free online course.","description":"Trigonometry is primarily a branch of mathematics based on the relationship between the lengths of the sides of triangles and their angles. Discover how to solve simple trigonometric identities and first and second-degree trigonometric equations. Learn the functions of an angle and the operations of two angles using sine, cosine and tangent. Register for this course today and explore the world of trigonometry.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Learning about trigonometry can be challenging. Once you feel you mastered solutions to one trigonometry problem, you get stumped on the next. This introductory course on trigonometry for engineers has been specially prepared to help you make this journey effortless. What are trigonometric functions? How can trig functions be evaluated with the right type of scientific calculator? We answer basic trigonometry questions and provide simple definitions to help you with its processes. You can find applications of trigonometry in our day to day life. For example, triangulation is used in astronomy to measure the distances to nearby stars, in geography to measure distances between landmarks and in satellite navigation systems. This course prepares you for your trigonometry journey by taking you through examples that show the step-by-step process of how to complete different types of problems in trigonometry.</p><p>You use simple trig functions to ‘solve’ right-angled triangles. To do this, you must know the definition of particular angles. Explore how an angle determines the ratio of sides, and the ratio determines the angle. We illustrate how to solve for triangles using trig ratios. Examine the different types of angles and their classification. You will also learn about the measurement of angles and the conversion between degrees and radians. In trigonometry, each side of a right-angled triangle has a name. The ‘hypotenuse’ is the triangle’s longest side and is always opposite the right-angle. The other two sides are ‘opposite’ or ‘adjacent’, depending on which angle you refer to. Analyse the terms ‘sine’, ‘cosine’, ‘tangent’ and other reciprocal trigonometric functions and explore their cofunctions. Study the trigonometric values of quadrantal angles.</p><p>The final section explains reciprocal, quotient and Pythagorean identities. We discuss solving for sine, cosine and tangents of the sum or difference of two angles before investigating double angle and half-angle identities. Today, electrical current and computers use angles in ways that are difficult to see directly but rely on the fundamental rules of trigonometry to work correctly. We outline in detail how to solve first- and second-degree trigonometric equations and work with equations with more than one trigonometric function. The learning contents in this course is crucial and will help you understand all its fundamental concepts. It will be of great interest to students, researchers, engineers, land surveyors, or anyone interested in the working knowledge of trigonometry. So register for this course and improve your mathematical skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}