{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3221","title":"Introduction to Marine Electrical","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course analyses principles, mechanisms and applications of electricity in marine electrical systems.","description":"‘Introduction to Marine Electrical’ teaches the basic principles, workings, applications and laws of electricity used in maritime engineering. It covers the parameters, technologies and elements used in designing complex tools for energy generation, storage and transmission. Learn about the major circuits and networks used in marine electrical systems. Register for this course today and begin your next learning experience.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the electrical engineering principles we built in the world of electrical and electronics applications. This fundamental knowledge is a necessary building block before delving into a ship's electrical and electronic equipment. It will prevent accidents due to electrocution and keep you safe. The battery is the basic building block of electrical circuitry. A battery consists of electrochemical cells with external connections for powering electrical devices such as flashlights, mobile phones and even electric cars. When a battery supplies electric power, its positive terminal is the cathode and its negative terminal is the anode. The terminal marked ‘negative’ is the source of electrons that flows through an external electric circuit to the positive terminal to complete the circuit. You need an uninterrupted power supply for controlling electrical equipment but such supply is impossible without any dynamic electrical generating machinery. A battery is used as a storage system to make electrical power continuously available.</p><p>This course explores the fundamental principles of electrical components, standard symbols and units. We outline their relevance and examine the standardised uniformity of global measurement of quantities and the derivation of units. Investigate the graphical representation of different standard symbols used in electrical circuits. We will also analyse the concepts of electromotive force, current, potential energy, electrons and the effects of their movements in creating energy in electrical systems. We discuss the potential difference as a fundamental aspect of electricity and electronics. The course illustrates how arrows indicate EMF and PD from the source and toward the direction of conventional current flow. Learn about the unit of electromotive force and potential difference and the representation of resistance, voltage, current and power on a chart for reference. We will also study a different formula for calculating values of electricity quantities, including the definition of terminologies and associated technologies.</p><p>Lastly, we aim to equip you with the basic marine electrical knowledge consisting of an analysis of resistance and resistivity from their units, including the factors that affect them. Study the classification of materials based on their values of resistivities. We teach you about inductance, its measurement unit and electric current's relevance in creating a magnetic field when passed through a coil. Understand capacitance, its measurement unit, capacitors and the factors affecting the capacitance of a capacitor and the colour-coding for capacitors. Learn about the distinction between ideal/independent voltage sources, dependent voltage sources and passive and active elements in electrical circuits. Research different network elements in electricity, covering the similarities and differences between bilateral and unilateral, linear and nonlinear and lumped and distributed networks. Discuss different materials and their physical properties and characteristics relating to the flow of electricity on an atomic level, along with the flow of electricity. You will learn about non-linear resistors, including diodes, thermistors and varistors and the instruments used for measuring resistance, including the Wheatstone Bridge and the Slide Wire Bridge. The course will be of significant interest to students, researchers, marine engineers and anyone seeking to learn about marine electrical systems.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}