{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4181","title":"Introduction to Electrical Maintenance","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online electrical engineering course that breaks down crucial aspects of practical electrical maintenance.","description":"Do you want to learn how to handle practical operational problems in alternators and motors? We have specifically designed this foundational course to take you through an introductory level of electrical maintenance. Learn about the process of overhauling an induction motor and servicing a universal motor - all for free. Sign up for this course today and become confident in your ability to manage operational problems.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>With this online course, you will become a master in electrical maintenance. Do you want to learn about the types, causes, effects and corrections of misalignment in machinery? Then sign up for free today. You will study the various tools commonly used to correct misalignment and see the methods to remove bearings in different types of machinery. This course also explains how to check or measure air gap dimensions before starting the bearing of a large motor. See how to overhaul an induction motor and service a universal motor.</p><p>The material covers all aspects of testing, monitoring, fixing, and replacing elements of an electrical system. It takes you through basic electrical principles such as the causes of short circuits and common locations of earth faults. Learn about the working principles of meggers and the effect of meggering at a higher voltage. Discuss the significance of and precautions for checking the insulation resistance value of electrical machines. Then study the procedures for drying out electrical windings. This course also focuses on the classification of electrical insulation based on the temperature stability of the materials used.</p><p>You conclude by learning how to solve practical problems like failure of exciter voltage, alternators not accepting the loads, overheating of the motor, operational issues in AC motors and troubleshooting a DC regulated power supply. Furthermore, active and passive safety systems are discussed with examples. The course explains the procedures to isolate electrical equipment to work safely and the precautions to prevent any conductor from being electrically charged when it is being worked on. This course provides the learner with a thorough understanding of the methods of diagnosing, troubleshooting, and repairing industrial equipment.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}