{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3194","title":"Beginner Tugboat Tools","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course on tools used on a tugboat explains the safety guidelines for using various tugboat tools.","description":"This course teaches you about the tools you use on tug boats and the features of marking and measuring devices. You will learn about hand tools safety precautions and the characteristics of the cutting tools. We prepare you to understand the general safety guidelines for different implements and the filling and grinding machines. You will also learn about drilling machines, metal tools, external threading and internal threading.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This hands-on course on tug boat tools delves into all the features of tools needed on a tug to ensure you can handle any proper repairs needed for any emergencies on board. We begin by explaining the hand tools, safety precautions and the features of the cutting tools. Then we examine the drilling tools and the general safety guidelines for different tools before describing the filling and grinding machines. We will introduce you to drilling machines and the process of internal and external threading in metal tools. We will teach you the process of carrying out the basic marking on surfaces and then taking measurements on steel plates before measuring gauges and marking gauges. You will become familiar with handling tools to perform operations on a physical system. Investigate how to mark gauges and the important parts of the marking gauge. You will become more professional in measuring the outer diameter of a cylindrical tube using a Vernier calliper.</p><p>This course then examines the general safety precautions of the hand tools, their misuse, basic hand tool safety rules and spark-resistant tools. Explore the non-sparking tools, their importance and different types of hacksaws. We will then cover the surface finishing process, grinding machines, drilling machines applications and the significance of filing and grinding. Become adept at using a screwdriver and studying files’ shapes, the portable grinding machine and the hand grinding machine. Learn about the general precautions you should observe when using power tools and the general practices to follow before using them. Enrich your knowledge of the importance of internal and external threading before learning how to cut metal with a hacksaw and perform internal threading at a mild steel angle. Discover how to perform external threading in a mild steel pipe. The course illustrates each step in forming internal threads on two drilled holes for a mild steel angle. You will also learn about the precautions needed while performing internal threading.</p><p>Furthermore, this course will help you analyse the powered abrasive wheel tools and portable circular saw safety precautions. We will teach you the portable drill safety precautions and pneumatic-powered tools, the compressor system guidelines and contaminants in the compressor system. Study the essential materials, procedures, theories, and various practising metals tools. The course will highlight the diverse filing methods to perform the grinding process accurately and achieve the desired output. Using a file and precautions while filing, you will learn how to grind the given mild steel angle to the required dimensions. We will outline how to cut a given mild steel angle and pipe using a hacksaw and the MS flat cutting. You will learn about the importance of re-sharpening tools and precautions while using a hacksaw. This course will be of great interest to students, researchers and anyone interested in the tools used on a tugboat. So don’t delay - enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}