{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3229","title":"Introduction to Principles of Vessel Stability","totalEnrolled":"195","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles of vessel stability, hydrostatic pressure and flotation in this free online course.","description":"Keeping a ship afloat depends on many factors concerning the vessel’s architecture. The centre of gravity, hydrostatics pressure and matters of floatation all have their parts to play. Throughout this course, you will study the forces that occur during towing in both a horizontal and vertical plane. The importance of watertight hatches, along with other nautical skills and areas will be covered in this comprehensive course on vessel stability.","courseOutcomes":["Identify the basic theories on float...","Explain the principles of static sta...","Discuss the concept of watertight in...","Outline the importance of bollard pu...","Identify the basic theories on floatation, equilibrium and transverse stability","Explain the principles of static stability and the factors that influence vessel stability","Discuss the concept of watertight integrity and how it is to be maintained","Outline the importance of bollard pull that affects vessel stability","Discuss the watertight integrity and the general maintenance process","Explain the process of assigning loads on tugs, and watertight integrity","Identify the watertight doors, other openings and maintenance of watertight integrity","Discuss the standard operating procedure onboard and closure of openings","Identify the basic theories on float...","Explain the principles of static sta...","Discuss the concept of watertight in...","Outline the importance of bollard pu...","Identify the basic theories on floatation, equilibrium and transverse stability","Explain the principles of static stability and the factors that influence vessel stability","Discuss the concept of watertight integrity and how it is to be maintained","Outline the importance of bollard pull that affects vessel stability","Discuss the watertight integrity and the general maintenance process","Explain the process of assigning loads on tugs, and watertight integrity","Identify the watertight doors, other openings and maintenance of watertight integrity","Discuss the standard operating procedure onboard and closure of openings"],"courseDescription":"<p>No matter how wild or calm the sea may be, any ship that finds itself in open water must stay afloat. But how does a vessel manage such a feat? In this course, you will study the features of a ship's architecture that allows it to stay upright, such as the principles of hydrostatics pressure and flotation, as well as the forces during towing while in a horizontal plane or a vertical plane. You will learn about transverse stability, centre of gravity and the centre of gravity of a ship. This course will also teach you about the shifts in the centre of gravity that occur aboard such a vessel. The course will cover transverse statical stability, the angle of the heel due to shifting a mass and the principles of stability. But what factors can impair the stability of a vessel? You will cover such obstacles as you also learn about the process of assigning load lines to tugs, watertight integrity and high water alarms.</p><p>As you continue through this course you will determine the importance of watertight openings found across a ship, like in the hull, superstructures or deckhouses. You will learn about the maintenance of watertight integrity, watertight bulkhead and water tightness tests. The standard operating procedure on board will also be discussed. You will then learn about how the floating tugboat's stability can be influenced by its displacement. The stability of a tugboat, the risk of capsizing, the concept of girting and the remedy to down flooding will be covered in this section. You will learn about a specific area of loss of intact stability-related casualties for tugboats and the characteristics of stability casualties. The course will also cover the towline emergency quick-release mechanisms. The heeling and righting arm curves, as well as additional stability criteria for service notation of escort tug, will be covered in the course.</p><p><br>Furthermore, this course will help you appreciate how important it is for the intact stability of tugs to comply with the International Code on Intact Stability 2008. You will also learn how to ensure all watertight decks and bulkheads are inspected periodically. The course will explain how to verify that there are no unprotected openings or improper penetrations that will allow progressive flooding. You will also learn about how the watertight subdivisions can be kept to a minimum and compatible with the design and proper working of the ship. The course will illustrate how the access doors and access hatch covers are to be closed at sea. The characteristics of watertight doors, non-watertight doors, spray-tight doors and panel doors will also be covered in this course. You will learn about closure fitting, gaskets, hope bay as well as the illustration of the covers for openings into holds and deck and scuttles. This free online course will be of great interest to students, researchers and anyone with an interest in the principles of vessel stability. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3229\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3229\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Vessel Stability","description":"In this module, you will be introduced to principles of vessel stability, basic theories on floatation, equilibrium and transverse stability. You will also be introduced to the principles of statical stability, as well as the factors that influence vessel stability.","topics":["Vessel Stability - Learning Outcomes","Introduction to Vessel Stability","Transverse Stability","Factors of Stability","Vessel Stability - Lesson Summary"]},{"name":"Module","details":"Hatches and Maintenance of Watertight Integrity","description":"In this module, you will be introduced to hatches, other openings, watertight integrity, as well as the watertight doors and openings. You will also be introduced to the maintenance of watertight integrity, standard operation operating procedures onboard.","topics":["Hatches and Maintenance of Watertight Integrity - Learning Outcomes","Hatches and Other Openings","Maintenance of Watertight Integrity","Stability and Risk of Capsizing","Hatches and Maintenance of Watertight Integrity - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Principles of Vessel Stability - Course Assessment"]}]}