{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4251","title":"Introduction to DC Generators","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the working principle, theory and construction of DC generators.","description":"In this course on DC generators, you will learn the working principle, construction and different types of DC generators. DC Generators can be used in electrical devices that require DC power. We will also discuss the classification, magnetization and parallel operation of DC generators. This course will help you understand one of the most important electrical machines and its characteristics that power the industrial world.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, you will learn how to use a DC generator an electrical machine that converts mechanical energy into electrical energy. DC Generators work on the principle of electromagnetic induction. The design, construction as well as parallel operation of DC generators are very simple and the problems regarding system protection with stability are very low. DC generators can be used in electrical devices that require DC power. In this course, you will learn about the classification of DC generators, which are mainly divided into two categories, namely separately excited and self-excited. Do you want to know more about the working principle of DC generators and the differences between AC generators and DC generators? In this course, all these points will be explained in great detail. You will also learn about EMF and load voltage as well as self-excited generators which have three subtypes namely series, shunt and compound generators and there are other subtypes as well. Each generator type DC has its own unique features, circuits and advantages.</p><p>Have you ever wondered how generators on constructed? In this course, we will take a closer look at the construction of DC generators. You may want to learn about the basic components of the generator DC and the armature winding and its types. We will also talk about the components of the armature core and the use of balancing windings and interpoles in a DC generator. We will also look at the critical resistance for the shunt generator field and the concept of critical speed for DC generators. You will be able to understand the various characteristics of DC generators namely magnetization, open circuit characteristics, internal characteristics etc. You will learn what magnetization properties are and how they explain the relationship between the no-load emf generated and the field current at a constant speed. Next, you will study the internal properties that explain the relationship between the generated voltage and the load current. In this course, you will learn how the external or load characteristics show the change in terminal voltage with load current at a fixed speed.</p><p>Do you want to understand voltage build up in generators? This course will explain the concepts of voltage buildup in a separately excited generator DC, the conditions that must be met for voltage buildup, and the methods of voltage control. By the end of this course, you will know more about DC generators and will have taken a big step toward understanding one of the most important electrical machines powering the industrial world. This course is ideal for electrical or mechanical engineering students who want to expand their knowledge in this field or working engineers who want to refresh their knowledge. So why wait, start your learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}