{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2751","title":"Introduction to Design and Innovation","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the Jaipur foot innovation, user-centered design, and distribution challenges with this free online course.","description":"Introduction to Design and Innovation is a free online course that offers some great insights into the basics of Jaipur foot. You will learn about the prosthesis as an important case study for innovation and the user-centered helmet design, along with its engineering process. You will gain an understanding of the Solar Urja Lamp project, its background and purpose. Start this course today and enhance your knowledge of innovation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Introduction to Design and Innovation is a free online course that begins by introducing you to the Jaipur foot as an important case study as well as the prosthesis, which is a significant part of this innovation. You will learn about its unique design and the components of the product. You will also be introduced to the distribution of Jaipur foot and limb fitments across India and other countries in the world. You will become familiar with the three sections of Jaipur's foot as well as their advantages.</p><p>This course then explains the concept of user-centred helmet design, its engineering process, construction as well as the user requirements for comfort and ease. You will learn about the current scenario in India, the ease of storage cluster ideas for the helmets, and the ease of use cluster. This course will also teach you about product detailing as well as the advantages and disadvantages of different helmet concepts.</p><p>Furthermore, you will get familiar with the solar project known as Solar Urja Lamp project. You will learn about India's need for energy. This course will introduce you to the types of technology interventions, supply chain as well as the objectives and scope of the Solar Urja Lamp project. This free online course will be of great interest to students, researchers, and anyone with an interest in technology and innovation. So, register for this course and start your next learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}