{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3220","title":"Diploma in Power System Protection - An Introduction","totalEnrolled":"1,830","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the fundamentals of power systems and the mechanisms that protect them with this free online engineering course.","description":"This free online diploma course lays out the fundamentals of power protection, the features of current-based relaying schemes and the processes that protect transmission lines. A power system network requires protection to operate efficiently and we explain the practices and technologies that produce electricity safely. This course can hone your engineering skills and makes an invaluable addition to your résumé.","courseOutcomes":["Explain the different types of fault...","Contrast the different types of rela...","Break down the application of the di...","Calculate the plug setting and time-...","Explain the different types of faults in a power system network and the consequences of each","Contrast the different types of relays based on their construction and function","Break down the application of the different types of overcurrent protection relay","Calculate the plug setting and time-dial setting of various protection relays","Describe the three different philosophies of overcurrent relays","Outline the advantages and disadvantages of the various types of protection relays","Identify the three types of relays used in the protection of transmission lines","Explain the different types of fault...","Contrast the different types of rela...","Break down the application of the di...","Calculate the plug setting and time-...","Explain the different types of faults in a power system network and the consequences of each","Contrast the different types of relays based on their construction and function","Break down the application of the different types of overcurrent protection relay","Calculate the plug setting and time-dial setting of various protection relays","Describe the three different philosophies of overcurrent relays","Outline the advantages and disadvantages of the various types of protection relays","Identify the three types of relays used in the protection of transmission lines"],"courseDescription":"<p>We offer essential skills and insight into the protection of power system networks in this free online electrical engineering course. Power system protection addresses the safeguarding of an electrical power system from faults. Faults can cause extensive damage to equipment and result in interruption of power supply, hazards to personnel and loss of revenue to power supply companies. Power protection systems work by isolating the components that are faulty and leaving the rest of the system operable. We discuss the distinction between power protection devices and ‘switchgear’ and explain how each plays a role in protecting power systems. We then examine different faults and establish their effect on electrical components. The course then covers various types of protective relays, including the thermal, attracted armature, induction and balanced beam relays. We then delve into the materials used to make these relays, their application, advantages and disadvantages. We also demonstrate how to calculate their behaviour with the universal torque equation.</p><p>The course then covers current-based relaying schemes and the overcurrent protection of transmission lines in detail. We study the various types of overcurrent protection relays, including the instantaneous overcurrent relay, definite minimum time overcurrent relay, inverse time overcurrent relay and the inverse definite minimum time overcurrent relay. We break down the plug setting (PS) and time dial settings (TDS) of overcurrent relays and show you how to calculate PS and TDS through examples of each type of overcurrent relay. We also discuss the application of overcurrent relay and establish its advantages and disadvantages. The course then moves on to the discrimination philosophy of relays as we study current discrimination, time discrimination and current-time discrimination. We examine directional and non-directional relays before introducing you to the distance relay and breaking down the classification of relays into phase and ground variants. The course investigates the effect of fault resistance and power swings on the performance of distance relays and analyzes fault distance measurement and stepped distance.&nbsp;</p><p>We conclude with the reach of distance relays and the various types of distance relay, including the impedance, reactance, mho or admittance relay, ohm or angle impedance relay, offset mho relay and more. Power system protection is an essential aspect of the power system networks that keep our world running. If you are considering a career path in power system networks or are a professional looking to refresh or enhance your skills, then this electrical engineering course is for you.</p><a href=\"https://alison.com/resume/courses/3220\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3220\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Protective Relaying","description":"In this module, you will be introduced to the Fundamentals of Protective Relaying. You will also be introduced to the different types of faults in power system networks, the consequences of these faults, and the various types of protective relays based on their construction and functioning.","topics":["Learning Outcomes - Fundamentals of Protective Relaying","Introduction to Protective Relaying","Requirements of a Protective System","Mechanism and History of Relays","Types of Protective Relays","Relays and their Construction","Lesson Summary - Fundamentals of Protective Relaying"]},{"name":"Module","details":"Current based Relaying Scheme","description":"You will be introduced to the current-based relaying scheme in this module. You will learn about overcurrent protection of transmission lines, directional relays as well as plug setting and time dial setting of relays. The directional relay torque equation will also be discussed in this module.","topics":["Learning Outcomes - Current based Relaying Scheme","Overcurrent Protection of Transmission Lines","Numerical Examples of Overcurrent Relay","Application of Overcurrent Relay","Inverse Time Overcurrent Relay","Setting for Phase and Ground Relays","Plug Setting and Time Dial Setting of Relays","Directional Relays","Phase and Time Dial Setting of Directional Relays","Lesson Summary - Current based Relaying Scheme"]},{"name":"Module","details":"Protection of Transmission Lines using Distance Relays","description":"You will study the protection of transmission lines using distance relays in this module. The overcurrent relay, distance relay, and pilot relay will be discussed. You will also learn the advantages and disadvantages of these relays and the effects of fault resistance and power swing on distance relays.","topics":["Learning Outcomes - Protection of Transmission Lines using Distance Relays","How the Distance Relay Works","The Reach and Types of Distance Relays","Voltage and Current for Distance Relays","Distance Relay Examples","Fault Resistance and Power Swing","Lesson Summary - Protection of Transmission Lines using Distance Relays"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Power System Protection - Course Assessment"]}]}