{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4351","title":"Beginner Alternators","totalEnrolled":"418","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains the critical characteristics, theory and construction of alternators.","description":"This online course will help you learn how to work with an alternator, an electrical machine that converts mechanical energy into electrical energy. Alternators are lighter and more economical when we compare them to DC generators. You will learn in detail about the operation and construction of alternators. We will also explore the characteristics and synchronisation of alternators and output waveforms.","courseOutcomes":["Explain the theory of alternators...","Describe the construction of alterna...","Explain the three-phase voltage gene...","Summarise the steps to assemble pole...","Explain the theory of alternators","Describe the construction of alternators","Explain the three-phase voltage generation in alternators","Summarise the steps to assemble pole to the rotor frame","Describe the characteristics of the output waveform","Outline the use of fixed speed alternators","Discuss the role of automatic voltage regulators","Outline the excitation system using DC exciter","Explain the synchronisation of alternators","Summarise the load management of paralleled alternators","Explain the theory of alternators...","Describe the construction of alterna...","Explain the three-phase voltage gene...","Summarise the steps to assemble pole...","Explain the theory of alternators","Describe the construction of alternators","Explain the three-phase voltage generation in alternators","Summarise the steps to assemble pole to the rotor frame","Describe the characteristics of the output waveform","Outline the use of fixed speed alternators","Discuss the role of automatic voltage regulators","Outline the excitation system using DC exciter","Explain the synchronisation of alternators","Summarise the load management of paralleled alternators"],"courseDescription":"<p>This course will teach you about using generators, an electrical machine that converts mechanical energy into electrical energy. Alternators are lighter and more cost-effective compared to DC generators. Since the generator uses slip rings, it has a longer life than a commutator in a DC generator. There are also developments such as ‘brushless excitation’ systems that eliminate the need for brushes, slip rings and commutators. In this system, you only need a 3-phase AC exciter and a group of rectifiers to supply DC power to the generator. Both AC generators (alternators) and DC generators work on the principle of electromagnetic induction. We will introduce you to the theory of alternators and the methods used to generate EMF and Faraday's Law. You will also learn about the components and construction of alternators in particular. Want to know how to derive the equation for the EMF generated by a generator? This course will demonstrate this equation with the help of examples.</p><p>The course then explains three-phase windings and the waveform of three-phase output voltage. We will discuss the generation of three-phase voltages in alternators and star and delta circuits. We will also examine the role of rotors and damper windings in alternators. You will learn about the characteristics of alternators, the open circuit and the short circuit characteristics. Would you like to know how armature resistance, voltage regulation, synchronous impedance and synchronous reactance work? We will cover these critical topics and study the excitation system using the DC exciter. Next, we will research why we need automatic voltage regulators in a generator. You will learn about operating a generator with a carbon stack regulator and operating a generator with an oscillating contact. We will look at the phase sequence in the AC system, including how the phase sequence indicator works.</p><p>In the last section, you will learn what conditions must be met for synchronisation. Then we will define the ‘lamp’ methods for checking synchronism and generators' parallel connection or synchronisation. In addition, we will also explore the effects of faulty synchronisation. Next, we will help you understand load sharing and the parallel operation of alternators. Then you will look at additional generators' load management and alternators' power factor management. Finally, investigate the damage to generators if the required conditions are not met. This course is ideal for students or engineers who want to gain knowledge in the use of alternators. So why wait? Start learning today.</p><a href=\"https://alison.com/resume/courses/4351\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4351\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Alternators and its Features","description":"In this module, you will learn the components and construction of alternators in detail. We will discuss the generation of three-phase voltages in alternators as well as star and delta circuits. We will also look at the principles of excitation, automatic voltage regulators, and synchronizing alternators.","topics":["Introduction to Alternators - Learning Outcomes","Theory of Alternators","Three Phase Generation in Alternators","Characteristics of Alternator","Automatic Voltage Regulators","Synchronizing Conditions","Load Management of Paralleled Alternators","Introduction to Alternators - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}