{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2392","title":"Introduction to Production Planning and Control","totalEnrolled":"3,197","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the wide scope of production planning, control and the benefits of inventory control in the engineering field.","description":"This free online introductory course on production planning and control will give you a detailed guide on the scope of production planning, production control and capacity planning of industrial engineering. Learn about the specifics of inventory management, which includes the need, benefits and models associated with the optimization of resources of an organization.","courseOutcomes":["Discuss production planning and cont...","Explain the concept of capacity plan...","Discuss the crucial factor that shou...","Explain the stages of production pla...","Discuss production planning and control in industrial engineering","Explain the concept of capacity planning","Discuss the crucial factor that should be considered during capacity planning","Explain the stages of production planning and production control","Explain the concept of inventory in industrial engineering","Analyze the different methodologies of inventory","Discuss the ABC analysis of inventory","Explain the Wilson model of inventory","Discuss the gradual replenishment model of inventory","Discuss production planning and cont...","Explain the concept of capacity plan...","Discuss the crucial factor that shou...","Explain the stages of production pla...","Discuss production planning and control in industrial engineering","Explain the concept of capacity planning","Discuss the crucial factor that should be considered during capacity planning","Explain the stages of production planning and production control","Explain the concept of inventory in industrial engineering","Analyze the different methodologies of inventory","Discuss the ABC analysis of inventory","Explain the Wilson model of inventory","Discuss the gradual replenishment model of inventory"],"courseDescription":"<p>Production planning and the need for it is the main focus of this course. Learn about the activities carried out under production planning and control, and how you can engage properly in this process. Study the concepts of aggregate planning, material master production schedule, the stages of planning, and production control.</p><p>This course also introduces you to capacity planning, including different methods used to deal with long- and short-term capacity planning. You will also learn about scheduling and priority sequencing.</p><p>Following this, you will focus on inventory, especially in how it relates to engineering projects. You will learn about the ABC analysis of inventory, the QR model, and the periodic inventory models. You will also learn how to establish optimum lot size formula and how to take into account the lead time in determining the reorder point. Finally, you will be introduced to the Wilson model and the gradual replenishment model of inventory.</p><a href=\"https://alison.com/resume/courses/2392\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2392\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Production Planning and Control","description":"In this module, you will be introduced to one of the important tools used in the management of an organization, in order to realize the organization's goals and objectives. You will also learn how production planning and production control ensures that quality products are produced at the barest minimum cost.","topics":["Production Planning and Control - Learning Outcomes","Production Planning and Control: Scope I","Production Planning and Control: Scope II","Production Planning and Control: Capacity Planning","Production Planning and Control: Capacity Planning and Scheduling","Production Planning and Control: MRP, Routing, Scheduling","Production Planning and Control - Lesson Summary"]},{"name":"Module","details":"Production Planning and Control: Scheduling and Priority Sequencing","description":"In this module, you will be introduced to the concluding part of production planning and control. You will learn about scheduling, priority sequencing, and the relative performance or priority sequencing rules as it relates to production planning and control.","topics":["Production Planning and Control: Scheduling and Priority Sequencing - Learning Outcomes","Production Planning and Control: Scheduling","Production Planning and Control: Priority Sequencing","Production Planning and Control: Objectives of Scheduling","Production Planning and Control: Relative Performance of Priority Sequencing Rules","Production Planning and Control: Scheduling and Priority Sequencing - Lesson Summary"]},{"name":"Module","details":"Inventory","description":"In this module, you will be introduced to the meaning, fundamentals, and the models of inventory. You will learn about the Wilson model and the gradual replenishment model of inventory. You will also learn why inventory is important in industrial engineering.","topics":["Inventory - Learning Outcomes","Inventory: Fundamentals","Inventory: Models I","Inventory: Models II","Inventory: Wilson Model","Inventory: Gradual Replenishment Model","Inventory - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Production Planning and Control - Course Assessment"]}]}