{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3231","title":"Beginner List and Trim in Ship Stability","totalEnrolled":"132","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to calculate the list and trim of a ship, as well as its permeability and bilging, in this free online course.","description":"List and trim are two vastly important concepts to ship stability. Other concepts that we cover include the centre of gravity on a ship, the righting moment and the righting lever. You will study metacentre concepts, along with the formula used to calculate the list and trim after loading. You will also learn concepts of permeability, bilging and cross-flooding arrangements once you complete this comprehensive course.","courseOutcomes":["Evaluate the curve of intact statica...","Describe the effects on stability by...","Evaluate the concept of metacenter a...","Describe the effect of loading and d...","Evaluate the curve of intact statical stability to determine stability data","Describe the effects on stability by the movement of weights","Evaluate the concept of metacenter and its importance for ship stability","Describe the effect of loading and discharging on CG and stability","State the formula used to calculate the list","Explain the effect of slack tanks on stability","Explain the longitudinal stability terms and the effects of trim on ship stability","Outline the intact stability requirements for a ship","Explain the bilging of compartments and their effects on stability","Evaluate the dewatering process that will be necessary in case of a hull breach","Outline the importance of closing watertight doors under the partial loss of buoyancy","Explain cross-flooding arrangements","Evaluate the curve of intact statica...","Describe the effects on stability by...","Evaluate the concept of metacenter a...","Describe the effect of loading and d...","Evaluate the curve of intact statical stability to determine stability data","Describe the effects on stability by the movement of weights","Evaluate the concept of metacenter and its importance for ship stability","Describe the effect of loading and discharging on CG and stability","State the formula used to calculate the list","Explain the effect of slack tanks on stability","Explain the longitudinal stability terms and the effects of trim on ship stability","Outline the intact stability requirements for a ship","Explain the bilging of compartments and their effects on stability","Evaluate the dewatering process that will be necessary in case of a hull breach","Outline the importance of closing watertight doors under the partial loss of buoyancy","Explain cross-flooding arrangements"],"courseDescription":"<p>Keeping a vessel afloat on the open water is a challenging feat. What factors should you consider throughout a naval journey? Two measures that play a key role in your ship's stability are list and trim. In this course, you will begin studying these by first looking at the illustration, construction,and interpretation of the curve of statical stability. You will also learn about the range of stability at different angles of the keel. But what do you need to calculate to determine your ship's list and trim? You will learn about the derivation of the formula for the list, along with the internal and external factors that influence the ships’ stability.</p><p>This course will then teach you the concepts of trim and the three methods of changing it. The difference between ‘trim’ and ‘list’ will also be covered. You will learn about the stability of vessels with a deck cargo of timber. This course then explains the concepts and differences between ‘stiff’ and ‘tender’ vessels. Afterwards, you will cover the working principles of the free surface effect. You will learn about the formulas for a rectangular waterplane area with the second moment of the area around the centerline, free surface correction and free surface moment. You will also be introduced to the calculation of the free surface correction due to slack tanks. The course will discuss moving masses already on board forward or aft, as well as adding or removing masses at a position forward or aft of the centre of floatation.</p><p>Furthermore, this course explains the concepts of bilging and the four ways in which it can occur. You will learn about the bilging of the midship, intermediate side and end compartment. You will also learn about the list created by the bilging of the side compartment. This course will teach you about intact stability requirements and International Convention for the Safety of Life at Sea (SOLAS) general requirements. The importance of the damage control plan and damage stability booklet will also be covered. You will then learn about the effect of flooding and corrective actions to take and the concepts of dewatering. The functions and operations of hydraulically operated watertight doors will also be covered in this course. This in-depth look into a ship's stability will be of great interest to students, researchers and anyone with an interest in the list and trim of a vessel at sea. So register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3231\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3231\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Metacenter and Free Surface Effects","description":"In this module, you will be introduced to the curve of intact statical stability and the range of stability at different angles of the heel. You will also be introduced to the concept of metacenter, derivation of the formula for the list. The differences between the stiff and tender vessels, as well as the concepts of the free surface effect, will also be highlighted","topics":["Metacentre and Free Surface Effects - Learning Outcomes","Curves and Cross Curves of Statical Stability","Movement of Center of Gravity","Metacentric Heights","List and Vessels","Free Surface Effects","Metacentre and Free Surface Effects - Lesson Summary"]},{"name":"Module","details":"Trim and Bilging","description":"In this module, you will be introduced to concepts of pitch, and trim as well as the concepts of bilging and permeability. You will also be introduced to the relationship between the GZ curve and the intact stability requirements, as well as the concepts of dewatering, cross flooding arrangements. The functions of hydraulically operated watertight doors will also be highlighted.","topics":["Trim and Bilging - Learning Outcomes","Moment of Change Trim","Bilging and Permeability","Intact Stability Requirements","Dewatering and Cross Flooding Arrangement","Trim and Bilging -  Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to List and Trim in Ship Stability - Course Assessment"]}]}