{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3956","title":"Beginner in Circuit Analysis","totalEnrolled":"617","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the fundamentals of circuit theory for analyzing DC and AC circuits, and network theorems in this free course.","description":"Introduction to Circuit Analysis is a free online course that offers a guide to key terms and concepts for analyzing circuits and electricity sources. Learn about mesh analysis and node analysis in AC and DC circuits as well as the theories of network analysis and delta-star transformations. You will also study the important terminologiesies appropriate for network theorems. What are you waiting for? Begin your next learning journey today!","courseOutcomes":["Analyze the ideal voltage and curren...","Describe how to convert a current so...","Outline the effects of the series co...","Discuss the parallel connection of D...","Analyze the ideal voltage and current sources","Describe how to convert a current source to a voltage source and vice-versa","Outline the effects of the series connection of DC voltage sources","Discuss the parallel connection of DC current sources","State the laws used in mesh and node analysis","Describe how to transform delta-connected networks into star-connected networks, and vice-versa","Outline the advantages of three-phase systems","Identify the elements of Thevenin's theorem in AC and DC circuits","Discuss the components of Norton's theorem in AC and DC circuits","Analyze the maximum power transfer theorem","Analyze the ideal voltage and curren...","Describe how to convert a current so...","Outline the effects of the series co...","Discuss the parallel connection of D...","Analyze the ideal voltage and current sources","Describe how to convert a current source to a voltage source and vice-versa","Outline the effects of the series connection of DC voltage sources","Discuss the parallel connection of DC current sources","State the laws used in mesh and node analysis","Describe how to transform delta-connected networks into star-connected networks, and vice-versa","Outline the advantages of three-phase systems","Identify the elements of Thevenin's theorem in AC and DC circuits","Discuss the components of Norton's theorem in AC and DC circuits","Analyze the maximum power transfer theorem"],"courseDescription":"<p>Energy is very important to all of us. We are dependent on various forms of energy for heating, cooking, as well as mechanical work. Electrical energy needs to flow through a medium in order to be useful to our everyday lives. This course provides a comprehensive guide to understanding the basics of circuit analysis from network theorems and sources of electrical energy. The course examines different types of analysis for AC and DC as well as current sources. It begins with a discussion of sources where the voltage is not varying with time, which are known as ‘time-invariant voltage sources’ or DC sources. You will also be introduced to how a variation of voltage type distinguishes between which electrical circuits can be used in your home from those that should be used in your car. Upon successful completion of required modules, you would be able to memorize the important effects of both series and parallel circuits.</p><p>This has been specially curated for beginner and professional learners. You cannot afford to miss out on electrical circuit learning points in this free online course. You will be exposed to the relevant movements of electric current through the components of electric circuits. These include a source of potential difference or voltage, along with conductive paths and resistors. Next, you will learn about mesh analysis and node analysis in AC and DC circuits. You will also study star-delta and delta-star transformation along with the advantages of three-phase systems. Then, you will analyze the applications of Norton's theorem and Thevenin's theorem in both AC and DC circuits. You will also learn about the maximum power transfer theorem as well as other relevant terminology in network theory. Furthermore, you will learn about the value of internal resistance of the voltage and current sources.</p><p>Learn all about the different networks and flows through which electric currents move in circuits to become useful to us in our everyday lives. Professionals may use this course to form a better analysis of circuits in general together with the workings associated with them in different electronic devices. This course will enable you to improve upon your foundational knowledge of electrical technology and circuit analysis by analyzing time-invariant voltage sources, mesh/node analysis, and network theorems. It will be of interest to electricians, electrical engineering students and anyone seeking to understand the workings and theories of complex electrical circuits. Also, understand the importance and distinction between voltage and current in your learning. Electricity has, for a long time, become a part of our lives we cannot ignore. What are you waiting for? Begin your learning journey into introductory aspects of circuit analysis now!</p><a href=\"https://alison.com/resume/courses/3956\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3956\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"DC Sources","description":"In this module, you will learn about sources where the voltage is not varying with time which are known as time-invariant voltage sources or DC sources. These sources of electrical energy are active elements and you will learn about the types of active elements.","topics":["DC Sources - Learning Outcomes","Ideal Voltage and Current Sources","Series Connection of DC Voltage Sources","Parallel Connection of DC Current Sources","DC Sources - Lesson Summary"]},{"name":"Module","details":"Analysis of Circuits","description":"Mesh analysis and node analysis apply to both DC and AC circuits. In this module, you are going to learn about mesh analysis and node analysis in AC and DC circuits. Star-Delta transformation is also explained in detail here.","topics":["Analysis of Circuits - Learning Outcomes","Mesh Analysis","Nodal Analysis and Phases","Star and Delta Networks","Analysis of Circuits - Lesson Summary"]},{"name":"Module","details":"Network Theorems","description":"In this module, you will learn about Norton's theorem and Thevenin's theorem in AC and DC circuits. You will study the maximum power transfer theorem as well as other relevant terminology in the network theorems.","topics":["Network Theorems - Learning Outcomes","Thevenin's Theorem – DC and AC Circuits","Norton's and Superposition Theorem","Reciprocity and Millman's Theorems","Maximum Power Transfer and Tellgen's Theorem","Network Theorems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Circuit Analysis  - Course Assessment"]}]}