{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3427","title":"Low Voltage Circuit Breaker Designing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the working principles of different types of circuit breakers and their specifications in this free online course.","description":"Master the basics of various circuit breakers, the working principles of these vital electrical switches as well as their different parts at your own pace in this free online course. You will find out about different specifications and be taught how to calculate the size of an appropriate breaker. Enroll today to find out more about circuit breakers and how they are used in domestic, commercial and industry settings.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course, you will learn about the working principles of electrical switches and protective devices known as circuit breakers. We will explain the fundamentals of a circuit breaker and teach you about the different types and their specifications. We will also show you how to select an appropriate size for the connected load. A circuit breaker is an automatically operated electrical switch designed to protect an electrical circuit from damage caused by excess current from an overload or short circuit. It will act like a normal switch under normal conditions that can be used to trip the circuit for the purpose of maintenance. The basic function of all circuit breakers is to interrupt heavy current flow after a fault is detected in an electrical circuit. Unlike a fuse, which operates once and then must be replaced, these electrical switches can be reset, either manually or automatically, to resume normal operation.</p><p>This short course will not only give you an idea of how to select an appropriate circuit breaker based on the type of electrical load but you will also come to know the working principles of a miniature circuit breaker in detail. You will familiarize yourself with the size calculation of the circuit breaker as per the US National Electrical Codes’ (NEC) rule. On finishing this course, you will know the definition of a circuit breaker and the difference between short circuit and overload current. After explaining the technical specifications, the material moves to arc extinction, where you will learn more about high and low resistance interruption. As you will see, a suitable energy dissipating device must be incorporated in the design, as the arc can lead to the danger of fire or explosion. You will find out what an arc consists of, what methods are used in the arc extinction process, what forms of protection may be employed to reduce the rate of erosion of contacts, and how the blast principle - where we use air, oil, gas or water - works.</p><p>By the end, you will be able to understand and design a circuit breaker for any low voltage electrical system projects and know the correct way to make a selection. You will also be amazed to find out how much information you can receive in a bite-sized course like this one! To reinforce the information obtained in these topics, you will have the chance to test your knowledge by going through several questions before the final assessment.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}