{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2300","title":"Machining Processes: Finishing Processes and CNC Machine","totalEnrolled":"5,401","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn what a computer numerical controlled (CNC) machine does and how to program one for the machining process.","description":"This course covers the finishing processes produced by a CNC machine. These machines are primarily used in the manufacturing industries like mills and the focus will be on the services it provides in these industries. On top of learning about the type of finishes this machine can achieve, you will also study the more fundamental part of programming the machine. This is vital for an operator to know.","courseOutcomes":["Differentiate between machining and ...","Discuss surface finishing in machini...","Describe CNC machines and CNC progra...","Discuss the non-traditional machinin...","Differentiate between machining and finishing","Discuss surface finishing in machining","Describe CNC machines and CNC programming","Discuss the non-traditional machining processes","Identify where the chemical reaction takes place","Describe the abrasive jet machining process","Identify what law governs electrochemical machining","Differentiate between machining and ...","Discuss surface finishing in machini...","Describe CNC machines and CNC progra...","Discuss the non-traditional machinin...","Differentiate between machining and finishing","Discuss surface finishing in machining","Describe CNC machines and CNC programming","Discuss the non-traditional machining processes","Identify where the chemical reaction takes place","Describe the abrasive jet machining process","Identify what law governs electrochemical machining"],"courseDescription":"<p>The first part of this course will teach you about surface finish and how the CNC machine is programmed to meet the exact dimensions demanded by the operator. This leads on to the programming of a CNC machine including why it is important and how to work with it.</p><p>Advanced machining processes are next on the course agenda. Machining is a process that involves removing material from a workpiece to create the desired shape, size and/or surface finish. In traditional machining, the tool makes physical contact with the workpiece and produces contact stresses that cause fractures on the surface of the workpiece. See how a distinguishing feature of advanced machining processes is that they do not use a well-guided wedge-shaped tool to remove the material relative to the workpiece.</p><p>The final part of this course talks about chemical machining in which material is removed by using a chemical etchant. There are several variants of the process such as chemical blanking, milling, photochemical machining and engraving. This course will teach you about many different types of finishing processes. Through using a CNC machine, advanced machining processes and chemical machining processes, you will learn all you need to know about finishing processes in the manufacturing industry.</p><a href=\"https://alison.com/resume/courses/2300\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2300\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Advanced Machining Processes","description":"In this module you will learn about machining processes. In mechanical processes, there is a physical contact between the workpiece and another material. Along with learning about electrochemical machining is the process governed by the Faraday’s law of electrochemistry.","topics":["Introduction to Advanced Machining Processes - Learning Outcomes","Introduction to Advanced Machining Processes","Introduction to Advanced Machining Processes - Lesson Summary"]},{"name":"Module","details":"Finishing Processes and CNC Machine","description":"In this module you will learn about the finishing processes and CNC machine, difference between machining and finishing. Along with learning about numerical control.","topics":["Finishing Processes and CNC Machine - Learning Outcomes","Abrasive Machining and Finishing Operations","CNC Machines and CNC Programming","Finishing Processes and CNC Machine - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Machining Processes: Finishing Processes and CNC Machine Course Assessment"]}]}