{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3226","title":"Maintenance and Repair of Marine Electrical Equipment","totalEnrolled":"1,850","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to maintain and repair electrical equipment in the marine environment.","description":"‘Maintenance and Repair of Marine Electrical Equipment’ is a course that delves into the general maintenance and repair procedures of electrical components used in the marine environment. We discuss the functions and the performance tests of electrical equipment in addition to machinery alignments. Register for this course today and enhance your knowledge of the maintenance and repair of marine electrical equipment.","courseOutcomes":["Explain the methodology of electrica...","Discuss the maintenance of switchboa...","Analyze the detection of an electric...","Outline the measures employed to pre...","Explain the methodology of electrical maintenance","Discuss the maintenance of switchboards","Analyze the detection of an electric malfunction and locate faults","Outline the measures employed to prevent electrical damage","Outline the function, configuration and performance tests of marine electrical devices","Discuss the interpretation of electrical and simple electronic diagrams","Analyze the function test of the monitoring system and protective devices","Translate simple electrical diagrams","Discuss the principle of gas detection systems","Discuss the maintenance of generators, motors and circuit breakers","Outline the tools used for alignment","Explain the methodology of electrica...","Discuss the maintenance of switchboa...","Analyze the detection of an electric...","Outline the measures employed to pre...","Explain the methodology of electrical maintenance","Discuss the maintenance of switchboards","Analyze the detection of an electric malfunction and locate faults","Outline the measures employed to prevent electrical damage","Outline the function, configuration and performance tests of marine electrical devices","Discuss the interpretation of electrical and simple electronic diagrams","Analyze the function test of the monitoring system and protective devices","Translate simple electrical diagrams","Discuss the principle of gas detection systems","Discuss the maintenance of generators, motors and circuit breakers","Outline the tools used for alignment"],"courseDescription":"<p>The equipment used in control systems must be maintained and tested regularly. It is necessary to perform functional and performance tests for monitoring systems, automatic control devices and protective devices. This course delves into these systems and illustrates how power, lighting and communication details for engineering projects use technical and electrical drawing. The electrical drawings’ lines, symbols, dimensions and notations convey the engineering design to the electrical system workers installing the equipment. Electrical installations are continuously subjected to structural and climatic changes, which cause wear and tear. Investigate these electrically induced stresses causing volumetric changes that contribute to the wear and tear of electrical equipment. Analyze common faults in electrical installations on ships from short circuits and earth faults. Accurate alignment is vital to the working life of rotating equipment. Bearings, mechanical seals, packing and couplings are all directly affected by the alignment of shaft center lines. The goal of the alignment process is to create a straight line through the coupling.</p><p>This course offers an understanding of the mechanisms of electric circuits relevant to marine communication systems. You will explore the methodology and classification of the general maintenance of electrical equipment. We introduce you to fault detection and the various troubleshooting techniques of electrical equipment. We also discuss testing, calibration and maintenance of the control system and offer an extensive guide to the benefits and facilities of switchboards. You will learn to discuss safety considerations, inspection, tests for switchboard maintenance, detection, location and prevention of electric malfunctions. Research different types of frequency meters and study the functions of the electrical monitoring systems of the marine environment. Then you will master the functions and performance tests of the protective devices.</p><p>Lastly, you will learn to interpret the American National Standards Institute (ANSI) numbers, wiring diagrams and other simple electrical diagrams. We outline how to maintain generators, motors and circuit breakers. Examine the insulation resistance measurement, operation tests and other tests for the circuit breaker. Study the machinery alignment of electrical equipment and air gaps between the machine parts. Then consider the overhauling of bearings and the active and passive safety methods in marine electrical systems. Lastly, you will learn about the safe isolation of all electrical plants and equipment required before work. This course will be of significant interest to students, researchers, marine engineers, environmentalists and anyone interested in the electrical arrangements of the marine environment. Enroll today!</p><a href=\"https://alison.com/resume/courses/3226\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3226\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Methodology of Maintenance","description":"This module discusses the methodology and classification of general maintenance of electrical equipment. You will also study the guides to switchboard maintenance, benefits, and facilities. The construction and operation of electrical testing and measuring equipment will also be covered in this module.","topics":["Methodology of Maintenance - Learning Outcomes","General Maintenance","Maintenance of Switchboards","Construction and Operation of Electrical Testing","Methodology of Maintenance - Lesson Summary"]},{"name":"Module","details":"Electrical Equipment Function and Performance Tests","description":"This module explains the functions and performance tests of electrical equipment in addition to monitoring systems. Get to learn about the interpretation of electrical and simple electronic diagrams. The maintenance of generators, motors, circuit breakers as well as machinery alignment will also be discussed in this module.","topics":["Electrical Equipment Function and Performance Tests - Learning Outcomes","Monitoring Systems","Interpretation of Electrical and Simple Electronic Diagrams","Maintenance of Generators, Motors, and Circuit Breakers","Machinery Alignment","Electrical Equipment Function and Performance Tests - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Maintenance and Repair of Marine Electrical Equipment - Course Assessment"]}]}