{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3729","title":"Managing Arduino Power Consumption","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn various techniques for reducing the power consumption of an Arduino board in this free online course.","description":"This free online course will show you the various ways you can save power while using an Arduino board. Improve the board's power efficiency by following our easy step-by-step video instructions to understand how to remove or replace certain unwanted parts, add external circuits, put the Arduino to sleep, or slow down its clock frequency. You'll also learn how to build your board from scratch with low power consuming components.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you are a hobbyist or a professional working with electronic devices and using Arduino boards such as Uno or Mini, you would know these boards are not built to be energy efficient. In situations where you have to run them on batteries, the board may be drawing as little as 15 milliamps of current, but this adds up and quickly drains the battery. You probably also know that the boards come with many parts, some of which you won't require for your project. These parts consume power unnecessarily, making your device a power guzzler. Wouldn't it be nice if you could reduce your Arduino's power consumption to a minimum? This course provides you with many tips and techniques to manage your Arduino's power consumption without additional expense or damaging any parts. You will also learn to build your own Arduino board with only the parts you need, thus consuming less power.</p><p>The course is divided into two modules. The first module demonstrates at least ten ways to reduce your Arduino's power consumption, and the second shows you how to build your own Arduino board. You will begin by learning about the hardware and software you will need to work on your Arduino board. Then, we will guide you on downloading and installing the software packages. We will look into simple techniques of lowering power usage, such as reducing the voltage supply and replacing specific power-consuming components. Next, more complex tricks are outlined, such as writing codes in Arduino IDE for wake up modes. You'll be able to use this to wake the Arduino from sleep under different conditions. Another crucial skill covered in this course is saving power by putting the Arduino into a deep sleep or turning the board off and on at set intervals. Determine how to set up a solar-powered battery system to power your Arduino board, build an external sensor circuit to control the power supply to the board, reduce the clock speed, and use other power reduction options.</p><p>Are you ready to sign up yet? If you've been using only ready-made Arduino boards purchased from the market, the second module will be even more helpful to you. Familiarise yourself with the different components of an Arduino and understand its functions. Practise how to wire up your Arduino using a breadboard and connect its various parts. The Atmega chip is the brain of your board and how it is connected and bootloaded for use is imperative to understand. This course will teach you almost everything you need to know about Arduino boards and give you more control over your devices. Start now and become an Arduino expert within a couple of hours.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}