{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3213","title":"Manoeuvring and Control of Marine Vessels","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the various manoeuvering methods and calculations of the rate of turn of a vessel.","description":"The art of maintaining correct control of a ship while underway, particularly in harbours, around docks and piers, is known as ‘ship handling and manoeuvering’. This course teaches you all you need to know about ship handling principles and different manoeuvering methods and procedures. We outline the traffic separation schemes (TSS) and vessel traffic services (VTS) and calculate the rate of turn and squats of a vessel.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Introduction to Manoeuvering and Control of Marine Vessels’ is a course that introduces you to ship control methods. We detail ways to help improve safety at sea by providing you with knowledge and skills for the safe operation of ships in confined and coastal waters. Investigate berthing and unberthing operations in different weather/sea conditions. This course comprises two modules alongside various topics. Accompanying media illustrations provides you with a comprehensive understanding of the different manoeuvering methods, manoeuvering procedures and manoeuvering safety. Discover the effects of external forces on vessels and the external factors that affect vessel handling. We outline the Kempf manoeuver, weave manoeuver, unberthing and berthing manoeuvers. We teach you how to berth and unberth a ship under various wind and current conditions. We highlight the loading effect, tugs’ impact, and bend negotiation.</p><p>This course then explains traffic separation schemes (TSS) as a maritime traffic management route system ruled by the international maritime organisation. We illustrate some of the terms associated with TSS, such as traffic lane, separation zone or line, and inshore traffic zone. Explore the precautionary areas and explain them. We also introduce you to the vessel traffic services (VTS), a shore-side system that ranges from simple information messages to ships. The course teaches you about the position of other traffic or meteorological hazard warnings and extensive management of traffic within a port or waterway. We stress the purpose of VTS, high traffic density, and traffic carrying hazardous cargoes. Become familiar with conflicting and complex navigation patterns and difficult hydrographical, hydrological and meteorological elements. Learn about shifting shoals and other local hazards and environmental considerations amongst others as the generally appropriate areas for VTS. The traffic organisation service, information service and navigational assistance service are some of the services offered by the VTS. We demonstrate the constant rate of turn and show how to calculate the rate of turn.</p><p>Furthermore, this course explains squats, which reduce the clearance between the keel and the seabed. We discuss what causes squats and the formulae for calculating squats. You will become an authority on some of the factors governing ships' squat and how squats’ effect influences ships in restricted water. The course outlines the use of bank suction and cushion effects to advantage in a current. We describe the causes and effects of interaction between vessels caused by the changes in pressure. You will also learn about the interference between the pressure fields surrounding ships. Finally, we clarify how overtaking and head-on encounter situations occur when vessels pass during the interaction. We research the precautions to take during interactions, such as in narrow channels when manoeuvring at close quarters and stopping in shallow basins. This course will be of great interest to students, researchers and anyone interested in manoeuvering and controlling marine vessels. So register for this course and become equipped with a new skill set.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}