{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2407","title":"Manufacturing Processes - Heat Treatment and Surface Properties","totalEnrolled":"1,195","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online course about the importance of the heat treatment process and surface modification processes.","description":"This free online course 'Manufacturing Processes: Heat Treatment and Surface Properties' covers the importance of the heat treatment process in joining metals. Learn about improving surface properties and surface modification processes. You will also discuss the factors that affect the properties of molding sand, the Gating System, and the coating process. Start this course today and improve your knowledge of manufacturing processes.","courseOutcomes":["Evaluate the purpose of heat treatme...","Discuss the approaches used for surf...","List the steps required in order for...","Discuss the different methods relate...","Evaluate the purpose of heat treatment in the joining of metals","Discuss the approaches used for surface modification to improve mechanical properties and wear resistance","List the steps required in order for surface engineering to take place","Discuss the different methods related to the coating process in improving surface properties","Discuss the limitations of the thermal spray process","Explain how the properties of steel are modified in the annealing process","Discuss the different processes of the annealing process with regards to heat treatment","Evaluate the purpose of heat treatme...","Discuss the approaches used for surf...","List the steps required in order for...","Discuss the different methods relate...","Evaluate the purpose of heat treatment in the joining of metals","Discuss the approaches used for surface modification to improve mechanical properties and wear resistance","List the steps required in order for surface engineering to take place","Discuss the different methods related to the coating process in improving surface properties","Discuss the limitations of the thermal spray process","Explain how the properties of steel are modified in the annealing process","Discuss the different processes of the annealing process with regards to heat treatment"],"courseDescription":"<p>Manufacturing Processes: Heat Treatment and Surface Properties is a free online course that will teach you about the fundamental aspects of the heat treatment process in the joining of metals as well as aspects of improving surface properties. You will learn about the types of tempering processes through heat treatment and the processes of coating to improve surface properties of a finished product.</p><p>This course begins by introducing you to the fundamentals of the heat treatment process, the basic principles used for the heat treatment of steel, and the annealing process. You will learn about the normalizing and hardening of materials, the stress-relieving process, and critical annealing processes. Furthermore, you will learn about types of tempering processes. You will also learn about the processes for changing the chemical composition and coating processes.</p><p>This free online course will increase your knowledge about the heat treatment process and surface properties. Lastly, you will learn about enhancing surface layers through mechanical properties for improved performance of a product. This course will be of great interest to engineering students, as well as manufacturers. Start this free course today and increase your knowledge of successful manufacturing processes through heat treatment and improving surface properties.</p><a href=\"https://alison.com/resume/courses/2407\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2407\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Heat Treatment","description":"In this module, you will learn about the mechanisms and principles of heat treatment. You will also learn about heat treatment processes, the annealing process, and different applications of tempering.","topics":["Fundamentals of Heat Treatment - Learning Outcomes","Introduction to Heat Treatment","Heat Treatment - Mechanisms and Principles","Heat Treatment Processes","Normalizing and Hardening","Tempering","Fundamentals of Heat Treatment - Lesson Summary"]},{"name":"Module","details":"Improving Surface Properties","description":"In this module, you will learn about improving surface properties through surface modification processes. You will also discuss processes for changing the chemical composition and coating processes for improving surface properties.","topics":["Improving Surface Properties - Learning Outcomes","Introduction to Improving Surface Properties","Surface Modification Processes","Changing Chemical Composition","Coating","Improving Surface Properties - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Manufacturing Processes - Heat Treatment and Surface Properties - Course Assessment"]}]}