{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2402","title":"Manufacturing Processes - Casting","totalEnrolled":"472","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about casting processes, terminologies, the steps involved and how to clean castings from this free online course.","description":"This free online course on Manufacturing Processes - Casting offers a comprehensive guide to the different casting processes, terminologies, and steps involved in the casting process. Learn about the process of cleaning castings as well as the defects and how to prevent them. Learn about the factors that affect the properties of the moulding sand and the Gating System. So, begin this course today and enhance your knowledge of casting processes.","courseOutcomes":["Identify the requirements for removi...","List the different types of the patt...","Define the commonly used terms for t...","Explain the process of pattern mould...","Identify the requirements for removing and/or cleaning a casting","List the different types of the pattern allowances","Define the commonly used terms for the casting process","Explain the process of pattern mould in the casting process","List the steps involved in the casting process","Describe the important properties and characteristics needed in the sand mould","List the advantages and limitations of the casting process in manufacturing","Identify the requirements for removi...","List the different types of the patt...","Define the commonly used terms for t...","Explain the process of pattern mould...","Identify the requirements for removing and/or cleaning a casting","List the different types of the pattern allowances","Define the commonly used terms for the casting process","Explain the process of pattern mould in the casting process","List the steps involved in the casting process","Describe the important properties and characteristics needed in the sand mould","List the advantages and limitations of the casting process in manufacturing"],"courseDescription":"<p>There are multiple types of processes that manufacturers can use in the manufacturing of a product such as the casting process. Manufacturing Processes - Casting Processes is a free online course that will teach you about the casting process, what it is used for and the important steps of the casting process. This course will teach you about how to maintain castings as well as it's defects and how to prevent them.</p><p>This course begins by introducing you to the casting process and what it is used for. You will learn about the material properties that matters for successful casting as well as the important steps of the casting process. Furthermore, you will learn about the factors that affect the properties of the moulding sand and the Gating System. Lastly, you will learn about the casting defects and their prevention, shell mould casting as well as investment/permanent mould casting.</p><p>This free online course will give you an in-depth understanding of the different casting processes involved in the manufacturing of goods. You will learn the importance of achieving the desired size, shape, and properties of a product. This course will be of great interest to individuals in the automotive industry and the cement industry. Start this free course today and improve your knowledge of casting processes.</p><a href=\"https://alison.com/resume/courses/2402\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2402\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Casting Processes - Steps and Terminology","description":"In this module, you will be introduced to the different terminologies of the casting process. You will also discuss the steps involved in casting processes, pattern allowances, and the process of sand molding.","topics":["Casting Processes - Steps and Terminology - Learning Outcomes","Casting - Introduction and Suitability","Steps of Casting Processes","Casting - Terminology","The Pattern Allowances I","The Pattern Allowances II","Casting Processes - Steps and Terminology - Lesson Summary"]},{"name":"Module","details":"Casting Processes","description":"In this module, you will learn about the factors that affect the properties of the moulding sand and the Gating System. You will also study the Core, Core Prints of casting, as well as the Yield and Riser Design.","topics":["Casting Processes - Learning Outcomes","Sand Moulding l","Sand Moulding II","Core and Core Prints","The Gating System","Yield and Riser Design","The Riser Design","Casting Processes - Lesson Summary"]},{"name":"Module","details":"How to Maintain Castings","description":"In this module, you will learn about the process of cleaning castings. You will gain an understanding of the casting defect and their preventions. You will also learn about shell mould casting as well as investment and permanent mould casting.","topics":["How to Maintain Castings - Learning Outcomes","Cleaning of Castings","Casting Defects and Prevention","Shell Mould Casting","Investment and Permanent Mould Casting","How to Maintain Castings - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Manufacturing Processes - Casting - Course Assessment"]}]}