{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3133","title":"Marine Electronics - Principles of Electricity and Circuit Parameters","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the principles of electricity relevant to electronic components used in shipping.","description":"This course, ‘Marine Electronics - Principles of Electricity and Circuit Parameters’, offers a comprehensive guide to the principles of electricity and the workings of different circuit parameters relevant to marine electronics. The course covers fundamental parameters and elements used in electrical components, including resistors, inductors and capacitors for required energy output, manipulation, quick storage and current pathing.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>We can owe the recent advancement observed in watercraft to implementing marine electronics on ships, vessels and other vehicles relevant to the maritime environment. These developments have helped improve the design of boats, ships and other vessels’ design, performance, practicality and safety. The improvements have brought about communication systems, collision detection technology, IT management software for cargoes and passengers and so on. This transformation is built on electricity principles and circuit parameters discussed in this course. The course highlights the fundamentals from electrical engineering relevant to marine electronics, including the standard symbols and units of electricity elements alongside the relationship between their theories and their many applications in marine electronics. You will analyse the building blocks of circuits, breaking down the different parameters that make electronic circuits relevant to all forms of electronic technologies applied in computers, wristwatches, light bulbs, fans, electric rotors, radars, accumulators and more. Advanced circuit units like the unit of inductance ‘henry’ (H) are explained. We include illustrations alongside advanced concepts of inductance like flux linkages.</p><p>This course offers an understanding of the workings, principles and applications of different electronic circuit parameters. These include the parameters and elements used in designing complex tools for required energy output, manipulation, quick storage and pathing. The course details the essential electrical components in maritime electronics, including resistors, inductors and capacitors, with valuable lessons on electronic components for capacitor charging and discharging, self-inductance and mutual inductance. We explain the time constant of RL circuits, classification of materials, colour coding resistors and the electrical sources like independent and dependent sources. Investigate how to identify electrical network elements, including active and passive elements. Distinguish between the different electronic networks relevant to marine electronics, including bilateral and unilateral networks and linear and nonlinear networks.&nbsp;</p><p>The course’s final section outlines the fundamental principles and the more advanced circuits and network element concepts. Our lives are continually reliant on the logistics of products. This process requires the use of complex maritime transport technologies supported by electronics. For that significant reason, the knowledge of electrical principles and circuit parameters is paramount. The course will be of considerable interest to students, researchers, marine engineers or anyone seeking to learn about marine electronics and its workings. Enrol today to improve your understanding of the principles of electricity and circuit parameters, their workings and their applications in relevant marine systems.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}