{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3134","title":"Marine Electronics - Resistance and Batteries","totalEnrolled":"592","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the principles and basic electrical laws for electronic components in maritime technology from this free course.","description":"This course on ‘Marine Electronics - Resistance and Batteries’ offers a comprehensive understanding of the mechanism, principles and applications of electric resistance in circuits and battery maintenance. Sharpen your knowledge and skills on the basics of electrolysis, lead-acid cells, battery usage, resistance and resistivity along with various types of resistors. Register for this course and begin your next learning journey today!","courseOutcomes":["Discuss the principles and basic law...","Analyse DC circuits and their variou...","Evaluate electronic principles invol...","List electronic circuit elements suc...","Discuss the principles and basic laws of electricity","Analyse DC circuits and their various applications","Evaluate electronic principles involving resistors, capacitors and inductors","List electronic circuit elements such as the semiconductor, thyristor, diodes, rectifier, filters and so on","Categorise electrostatically sensitive components and the effects of static electricity","Describe the working of transistor circuits","Identify the application of digital electronics in communication systems and devices on board","Discuss the principles and basic law...","Analyse DC circuits and their variou...","Evaluate electronic principles invol...","List electronic circuit elements suc...","Discuss the principles and basic laws of electricity","Analyse DC circuits and their various applications","Evaluate electronic principles involving resistors, capacitors and inductors","List electronic circuit elements such as the semiconductor, thyristor, diodes, rectifier, filters and so on","Categorise electrostatically sensitive components and the effects of static electricity","Describe the working of transistor circuits","Identify the application of digital electronics in communication systems and devices on board"],"courseDescription":"<p>The maritime engineering field has continuously evolved, enhancing efficiency and effectiveness in operations, some of which have been directed at marine electronics. We have created different applications for various electronic components, including batteries, cells and resistors. Resistors, for instance, play a crucial part in controlling the flow of electric current in virtually all marine electronic circuits found on board boats, ships and vessels. This course seeks to reveal the workings of resistance and batteries applied in marine electronics, applications of which are seen in different circuits onboard ships. These can be essential for the operation of ships and vessels. Discover the technical aspects and other functionalities of non-linear resistors, including thermistors and varistors. Illustrations explaining the voltage-current graphs for these non-linear resistors are also presented in this course to help you better understand important marine electronic components.</p><p>This course offers an understanding of the workings, principles and applications of electric resistance in circuits. We will cover basic knowledge of battery usage, applications and properties relevant to marine electronics and we will introduce materials, resistance and resistivity related to types of resistors. Electrolysis, lead-acid cells, types of batteries and the applications of batteries are discussed. This course offers valuable lessons on aspects of batteries relevant to marine electronics, including battery efficiencies and ratings, internal resistance and polarity as well as battery performance and maintenance. We encourage you to identify linear resistors and distinguish other resistors from them. Different techniques and instruments for measuring electric resistance are also well explained.&nbsp;</p><p>Finally, we aim to equip you with a vision of electronics, consisting of basic electronic technology concepts in resistance to the more advanced elements of batteries applied by mariners and people involved in maritime technology. We propose several materials, resistance and resistivity, studying fundamental principles of how resistances work. The course will further introduce batteries and electrolysis, observing how they are involved in energy generation, storage and transmission. Students, researchers, marine engineers and anyone seeking to learn about marine electronics and its different workings will find this course invaluable. Our lives are increasingly dependent on the movement of commodities from our homes to foreign shores. Both use complicated maritime transport technologies backed by electronics. For this important reason, working knowledge of electric resistance and batteries is essential. So, register for this course today and gain a wealth of expertise in resistance and batteries in marine electronics, their workings and applications in relevant marine systems.</p><a href=\"https://alison.com/resume/courses/3134\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3134\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Resistance","description":"In this module, you will learn about different materials, their different properties relating to the flow of electrons on an atomic level and the flow of electricity. Also, you will learn about measuring resistance and the different instruments used for measuring it.","topics":["Electric Materials and Resistance - Learning Outcomes","Introduction to Materials, Resistance, and Resistivity","Non-Linear Resistors","Measuring Resistance","Electric Materials and Resistance - Lesson Summary"]},{"name":"Module","details":"Batteries","description":"In this module, you will learn about the basics of batteries relevant to electricity, their characteristics, factors affecting their performance and their different ratings, as well as their applications. Also, you will learn about electrolysis alongside its applications in developing batteries.","topics":["Batteries - Learning Outcomes","Introduction to Batteries and Electrolysis","Lead Acid Cell","Battery Efficiencies and Ratings","Types of Batteries","Internal Resistance and Polarity","Applications of Batteries","Battery Performance and Maintenance","Batteries - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Marine Electronics - Resistance and Batteries - Course Assessment"]}]}