{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3222","title":"Marine Electronics - Battery Maintenance and Safety Procedures","totalEnrolled":"670","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes the performance of batteries and safety measures in marine electrical systems.","description":"This course offers an in-depth understanding of types of batteries as well as their maintenance and proper application in marine electrical systems. Learn about the factors that increase the risks of electric shock as well as crucial safety management requirements. Register for this course today and improve your knowledge of marine battery maintenance and safety.","courseOutcomes":["Explain the theory of electrolytic s...","Analyze secondary cells and their wo...","Recall internal resistance and polar...","Outline the application of batteries...","Explain the theory of electrolytic solution","Analyze secondary cells and their working principles","Recall internal resistance and polarity of batteries","Outline the application of batteries","Describe the components and working of a battery","Discuss the concept of efficiency","Discuss the danger of electrical high voltage and electrical shocks","Outline the steps to rescue someone from electrical shocks","Outline the methods that can prevent electrical shocks","Describe the basic safety and first aid measures that can be applied onboard ships","Explain the theory of electrolytic s...","Analyze secondary cells and their wo...","Recall internal resistance and polar...","Outline the application of batteries...","Explain the theory of electrolytic solution","Analyze secondary cells and their working principles","Recall internal resistance and polarity of batteries","Outline the application of batteries","Describe the components and working of a battery","Discuss the concept of efficiency","Discuss the danger of electrical high voltage and electrical shocks","Outline the steps to rescue someone from electrical shocks","Outline the methods that can prevent electrical shocks","Describe the basic safety and first aid measures that can be applied onboard ships"],"courseDescription":"<p>The battery is the heart of any electrical system because an uninterrupted power supply is needed for controlling electrical equipment. Batteries are used as the electric power in them is continuously available in a storage system. Another advantage of batteries is that they are portable. The course begins by discussing electrical hazards leading to injuries such as shocks, burns, or even death. Hazards can lead to shipboard fires, explosions, and the disabling (through blackouts) of essential equipment and services on board, compromising safety. Ensuring that the proper controls and mitigation measures are in place is critical for maintaining safe operations. Control measures need to be developed at the organizational, technical, and individual levels to be effective. Organizations must ensure that control measures, work practices, and procedures are in place to eliminate electrical hazards. Although policies and procedures provide for safe working practices, the culture within the organization and onboard each ship must support the desired behaviors.</p><p>This course also introduces you to the basics of batteries, their relevance to electrical systems, and their applications. We explain their components such as cases, plates, separators, and other important features. You will learn about efficiency, the causes of energy loss during charging and discharging, and the methods for measuring the efficiency of a battery. We delve into primary and secondary batteries with their different characteristics and relevant examples. You will investigate alkaline and lead-acid batteries as secondary batteries, from their properties and mechanisms. Explore internal resistance and the components and characteristics of opposition to the flow of current within a cell. Discover the applications of different primary and secondary batteries in addition to the attributes of sealed batteries. You will also study the plate area, impurities, electrolyte level, overcharging, undercharging, temperature, and conditions that affect battery performance. You will study the terminologies and techniques associated with batteries.</p><p>This course teaches you the dangers of high voltage, defines the benchmark for a high voltage, and outlines high voltage equipment. We evaluate the factors that increase the risk of electric shock and the safety management requirements of systems. We discuss methods of rescue from electrical shocks and injuries. The course explores body impedance, the means to prevent electric shock, and the difference between a DC and an AC shock. Learn the essential safety measures to take when operating electrical equipment and the first aid given to a victim in an electric accident. There are standard methods of artificial respiration that you can administer to a victim of electrical shock. This course will be of significant interest to anyone seeking to learn about maintaining marine batteries and safety procedures.</p><a href=\"https://alison.com/resume/courses/3222\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3222\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Battery Maintenance","description":"In this module, you will learn about the basics of batteries relevant to electricity from their characteristics, factors affecting their performance, and their different ratings. Also, you will learn about electrolysis and its applications in developing batteries.","topics":["Batteries Maintenance - Learning Outcomes","Electrolysis","Secondary Cells","Applications of Batteries","Battery Performance and Maintenance","Batteries Maintenance - Lesson Summary"]},{"name":"Module","details":"Safety from Electrical Shocks","description":"This module discusses the factors that will increase the risk of electric shock and the safety management requirements of systems. This module also analysis the various steps to take in the prevention of electrical shock and body impedance. The basic safety measures to take when operating electrical equipment as well as the first aid given to a victim in case of an electric accident will also be covered in this module.","topics":["Safety from Electrical Shocks - Learning Outcomes","Dangers of High Voltage","Rescue from Electrical Shocks and Injuries","Basic Safety and First Aid","Safety from Electrical Shocks - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Marine Electronics - Battery Maintenance and Safety Procedures - Course Assessment"]}]}