{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3091","title":"Marine Lubrication Principles and Systems","totalEnrolled":"568","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles of lubrication and the use of lube oils in marine engines in this free online course.","description":"Lube oil and its properties are essential for the proper lubrication of machinery in shipping. This course on ‘Marine Lubrication Principles and Systems’ takes you through the fundamental properties of lube oil. It explains their categorisation used onboard and the principles of various types of lubrication. By the end of this course, you will understand why you use additives in lubricants and lube oils selected for marine diesel engines.","courseOutcomes":["Describe the lube oil properties tha...","Explain the categorisation of lube o...","Discuss the principles of various ty...","Explain the reasons for the use of a...","Describe the lube oil properties that are important for lubrication","Explain the categorisation of lube oils used on ships","Discuss the principles of various types of lubrication","Explain the reasons for the use of additives in lube oil","Describe the types of lube oils that need to be selected for use in marine diesel engines","Describe the cylinder lubrication system used for propulsion engines","Describe the splash type lubrication for trunk type engines","Describe the lube oil properties tha...","Explain the categorisation of lube o...","Discuss the principles of various ty...","Explain the reasons for the use of a...","Describe the lube oil properties that are important for lubrication","Explain the categorisation of lube oils used on ships","Discuss the principles of various types of lubrication","Explain the reasons for the use of additives in lube oil","Describe the types of lube oils that need to be selected for use in marine diesel engines","Describe the cylinder lubrication system used for propulsion engines","Describe the splash type lubrication for trunk type engines"],"courseDescription":"<p>In an engine system, a lubricant will reduce friction and wear between the moving parts, keep metal surfaces clean by carrying away possible deposits and provide a seal to keep dirt out. Lubricating oil will also carry away the heat generated in bearings and gears, thereby preventing overheating, seizure and possible breakdown. ‘Marine Lubrication Principles and Systems’ is an exciting course that explains how lubricants preserve machinery health for small and large equipment. Solid lubricants, like grease, are vital in allowing long-term use of roller and ball bearings. The focus of this course is on liquid lube oils and their applications in modern diesel engines. We describe how the lubrication system of an engine supplies lubricating oil to the various moving parts in a machine. We will introduce you to the lubricating oil’s primary function to enable the formation of a film of oil between the moving parts of a lubricating system. Discover the uses of lubricating oil as a cleaner and a coolant.</p><p>In this course, you will study the properties of various lubricants, the lubrication of medium-speed 4-stroke diesel engines and the lubrication of low-speed 2-stroke diesel components like the main bearing, cross-bearing, thrust bearing and cylinder liner. Analyse the purification process and the associated testing and treatment of lube oil in keeping it suitable for shipboard use. Rolling friction is the resistive force that slows down the motion of a rolling ball or wheel. We will take you through the definition of ‘oil’, including its functions in an engine system, before explaining the importance of viscosity in an engine and how varying temperatures affect viscosity. We outline the different classifications of lube oil and the advantages of synthetic oils over mineral oils. Additives are chemical compounds added to protect the machinery and increase the life of the oil. Understand the reason for adding additives to lube oils and the process they add them.&nbsp;&nbsp;</p><p>Finally, the course emphasises the various functions of a lubricating system, including cleaning lubrication, cooling and corrosion inhibition. There are types, categories and classifications of lube oils. The central lubrication system consists of storage tanks for storing lubricating oil. The main engine lubricating oil sump receives oil from the storage tank. Investigate how the main lubricating oil supply pump draws suction from the sump and supplies it to the various components of the engine. We demonstrate the properties of a lubricant in reducing friction and wear and how lubricants carry the deposits or dirt and take away the heat generated in bearings as a working medium. This course illustrates the principle of piston oil flow and how internal lubrication works in a medium-speed engine. It describes the frequent inspections and sampling of lubricating oil to ensure that the correct quantity of the ideal lubricant is in an engine. ‘Marine Lubrication Principles and Systems’ is a course that will be of enormous interest to students, researchers, maritime engineers or personnel and anyone seeking to learn about the mechanisms and principles of lubrication in maritime systems. Start this amazing course today and improve your knowledge of the underlying principles of lubrication in mechanical systems.</p><a href=\"https://alison.com/resume/courses/3091\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3091\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Lubrication Principles","description":"Learn about the properties of various lubricants from viscosity and temperature as well as the major lubrication principles in this module. You will also study lube oil additives, types of lubrication, and the theory of hydrodynamic lubrication.","topics":["Lubrication Principles - Learning Outcomes","Introduction to Lubrication Principles","Lubrication by Oil","Lube Oil Properties","Categories and Classification of Lube Oil","Types of Lubrication","Lubrication Principles - Lesson Summary"]},{"name":"Module","details":"Lubrication Systems","description":"This module will take you through the various types of lube oil systems used in propulsion engines. You will also discuss the reasons for using additives in lube oil and various measures taken on board ships to maintain the lube oil in an engine.","topics":["Lubrication Systems - Learning Outcomes","Introduction to Lubrication Systems","Main Lubrication Systems","Lubrication Equipment and Systems","External Lubrication Systems","Internal Lubrication Systems","Wartsila Guidelines for Lube Oil","High Speed Diesel Engine Systems","Lubrication Systems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Maritime Lubrication Principles and Systems - Course Assessment"]}]}