{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3082","title":"Marine Auxiliary Machinery - Pumps, Fans, and Blowers","totalEnrolled":"1,316","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles and operations of pumps, fans and blowers used on ships in this free online course.","description":"This course teaches the rudiments of marine auxiliary machinery used on ships. Learn about the basic principles of pumps, centrifugal fans and axial fans, along with the working principles of reciprocating and rotary pumps to help circulate the fuel. We will discuss the categorisation of fan blade types, blade movement and troubleshooting and maintenance schemes. Register for this course today and begin your next learning journey!","courseOutcomes":["Describe the characteristics and app...","Identify the components of various p...","Identify the faults in the pumps and...","Explain system resistance and the sy...","Describe the characteristics and application of various types of fans and blowers","Identify the components of various pumps and state their functions","Identify the faults in the pumps and their maintenance schemes","Explain system resistance and the system resistance curve","Indicate multiple energy efficiency options for fans","Explain construction and maintenance requirements of fans and blowers","Identify the classification of pumps that are used onboard for shipboard duties","Describe the characteristics and app...","Identify the components of various p...","Identify the faults in the pumps and...","Explain system resistance and the sy...","Describe the characteristics and application of various types of fans and blowers","Identify the components of various pumps and state their functions","Identify the faults in the pumps and their maintenance schemes","Explain system resistance and the system resistance curve","Indicate multiple energy efficiency options for fans","Explain construction and maintenance requirements of fans and blowers","Identify the classification of pumps that are used onboard for shipboard duties"],"courseDescription":"<p>Marine auxiliary machinery, such as pumps, fans and blowers, are essential equipment for all ships. This course introduces you to the various pumping systems using extensive pipeline layouts with control valves. We will delve deeply into the different classifications of pumps onboard and the materials used to make shipboard pumps, fans and blowers sustainable. Learn about maintenance procedures, regulatory requirements and repair procedures involving shipboard pumps. Materials used in pumping systems are diverse. We discuss this in detail and the differences in fans with blowers in a machine system. Although rotary pumps may not have the capability of lifting a fluid from a low position, they are used in widespread applications such as fuel heating, domestic water heating, lubricating oil cooling, charge air cooling and condenser cooling. In marine engineering, fans are designed to serve various needs using air under pressure. The many types and sizes of the blowers are available for the central air fans, even if it is mostly the reciprocating tandem type that is used. Gain an understanding of the basic principles and layout, including the air receivers, which will help operate the air pressure.</p><p>This course explains how pumps aid in carrying abrasive and corrosive fluids exposed to atmospheric corrosion along with general wear and tear. Learn how these pump aids can operate at extremely high temperatures. The course describes the regulatory requirement used in centrifugal and axial fan maintenance. You will determine how the classification of societies has specific requirements regarding ships' fan systems that follow the general survey criteria for the rest of the vessel. Furthermore, you will learn about the maintenance procedures and troubleshooting measures for pumps and mechanisms. Discover the basic maintenance procedures, systems, constructional features and principles of operation. This course discusses the reciprocating pump as a positive displacement pump where the movement of the piston displaces the fluid. Explore the effect of a constant volume of liquid drawn into the pump cylinder through the suction valve on the suction stroke. Gain knowledge about the discharge of fluids under positive pressure through the delivery valves on the discharge stroke. We will take you through the classification of reciprocating pumps based on their working principles.</p><p>If you are intrigued about how devices that produce a current of air by the movement of broad surfaces can be called a ‘fan’, this extensive course on marine auxiliary machinery is a must for you. Fans fall under a general category of turbomachinery and have a rotating impeller at least partially encased in a stationary housing. This course describes the similarity of fans and in many respects their resemblance to pumps: both are turbomachines that transfer energy to a flowing fluid. Distinguish between fans and pumps and understand the function of a fan and how it moves air or gas. Appreciate the role of fans in a ship and discuss how the purpose of all types of checks is to allow proper functioning. The course examines the various pump concepts, like the most common pump used to move large volumes of water and the centrifugal pump used in simple construction and operation. This course will be of significant interest to students, researchers, marine engineers and anyone seeking to learn about marine equipment and maintenance procedures. Register for this course today and become an expert in the principles guiding marine auxiliary equipment and the workings of the relevant systems.</p><a href=\"https://alison.com/resume/courses/3082\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3082\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Various Types of Pumps","description":"In this module you will be introduced to the various types of pumps that are used onboard. You will discuss the basic principles of suction and delivery heads in a pumping system together with the working principles of reciprocating and rotary pumps. In this module, you will also study the components of various pipes and the state of the pumps, along with easy identification of faults in pumps and their maintenance scheme.","topics":["Various Types of Pumps - Learning Outcomes","Introduction to Pumps","Reciprocating Pump","Rotary Positive Displacement Pumps","Constant Displacement Pumps","Variable Delivery Pump","Rotary Axial Flow Propeller Pumps","Rotary - Centrifugal Pump","Various Types of Pumps - Lesson summary"]},{"name":"Module","details":"Fans and Blowers","description":"In this module you will be introduced to the system characteristics of fans and fan laws that are used onboard. You will discuss the basic principles of centrifugal fans and axial fans, the categorization and limitations of fan blade types, and their blade movement. In this module, you will also study the energy efficiency opportunities, along with where the system resistance curve and the fan curve intersect in determining the performance and efficiency of a fan.","topics":["Fans and Blowers - Learning Outcomes","Introduction to Fans and Blowers","System Characteristics and Fan Laws","Types of Fans and Blowers","Energy Efficiency Opportunities","Fans and Blowers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Pumps, Fans and Blowers - Course Assessment"]}]}