{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3224","title":"Marine Electrical - Distribution System and Maintenance","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to interpret distribution systems and perform common onboard maintenance tasks in this free online course.","description":"This marine engineering course explains the maintenance of marine electrical systems and provides you with ample knowledge of electrical distribution systems and ships' navigation light circuits. It also explains the maintenance of alternators, induction motors, transformers, including other electrical equipment in vessels in the marine environment.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The electrical distribution systems in ships demonstrate the sources of electrical power and the essential loads found onboard. These systems describe the selection of plants for generating electric power on vessels. Electrical maintenance helps to keep the equipment in excellent running condition, reduces downtime and increases cost savings. Generally, we follow a time-based maintenance procedure. However, we can also apply condition-based maintenance for large moving machines where periodic stoppage and dismantling may cause problems. Shipboard maintenance of electrical and electronic devices is limited to regular monitoring and basic maintenance. This entails conducting regular watchkeeping checks, investigating abnormal running conditions, and changing worn-out or defective parts per the SOP (standard operating procedure) and the manufacturer's instructions. In the case of a total failure or breakdown, you require a shipboard crew member to change a motor, starter parts, or electronic cards that control certain operations based on time sequence or logic ingrained in the circuitry. This course includes basic maintenance procedures that build your troubleshooting capability and basic maintenance skills.</p><p>It then discusses the causes of short-circuits and earth faults and the common locations of earth faults in systems. Explore the direct current wire distribution system and each section's content of the direct current switchboards. Study the main electrical power sources on ships and the main switchboard functions, maintenance of DC machines and the performance load test of a direct current generator. Learn about the rewinding of the field coil and the rewinding of the DC machine armature. We investigate the open and short circuit tests of an alternator in addition to the maintenance of alternators. You will become familiar with the load performance test on three-phase alternators and the measurement of the insulation resistance value.</p><p>The last section enables you to gain a sound understanding of high- (HV) and low-voltage (LV) distribution on board ships. We outline the dangers of working with high-voltage equipment and the risk assessments and the safety requirements of such systems. Compare the HV supply and LV supply onboard ships in addition to the emergency power distribution of vessels. We cover the methods and procedures for maintaining the induction motor and enable you to determine the slip for a three-phase squirrel cage induction motor and the brake test for a three-phase induction motor. Analyze the reconditioning of the silica in a transformer's breather and the estimation of voltage regulation and efficiency. Study the periodic maintenance of transformers, the rewinding of small transformers, and transformer oil tests. Discover how to service a universal motor and the maintenance of cables, safety procedures for busbar inspection and maintenance. Lastly, you will learn about the care of carbon brushes and other associated technology of electrical maintenance.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}