{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3223","title":"Marine Electrical - Electricity Laws and Circuits","totalEnrolled":"340","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free marine engineering course explains electromagnetism, circuitry and the laws that cover ships' AC electricity.","description":"This course on the electrical laws and circuits of marine electrical systems teaches you about the characteristics of components in the marine environment. It also discusses the different types and operational computations of circuits and the concept of electromagnetism while defining what specific terms mean. Register today and improve your knowledge of marine electrical systems and circuits.","courseOutcomes":["State the basic laws of electricity...","Discuss energy and power...","Recall Ohm's Law and how it relates ...","Define direct current (DC)...","State the basic laws of electricity","Discuss energy and power","Recall Ohm's Law and how it relates to the basic laws of electricity","Define direct current (DC)","Describe the effects of series and parallel connections of DC voltage sources","Discuss the alternating current theory","Discuss the generation of AC current and voltage","Distinguish between the phasor representation and phase difference of AC quantities","Describe circuits consisting of a resistor, inductor, and capacitor","Describe series and parallel connection of AC circuits","Explain sinusoidal waveform","State the basic laws of electricity...","Discuss energy and power...","Recall Ohm's Law and how it relates ...","Define direct current (DC)...","State the basic laws of electricity","Discuss energy and power","Recall Ohm's Law and how it relates to the basic laws of electricity","Define direct current (DC)","Describe the effects of series and parallel connections of DC voltage sources","Discuss the alternating current theory","Discuss the generation of AC current and voltage","Distinguish between the phasor representation and phase difference of AC quantities","Describe circuits consisting of a resistor, inductor, and capacitor","Describe series and parallel connection of AC circuits","Explain sinusoidal waveform"],"courseDescription":"<p>Electric current can be classified as direct or alternating based on its direction of flow. We use direct current (DC) and alternating current (AC) in different locations based on the requirements of a system. CD is obtained using batteries, DC generators and solar cells etc. The current is unidirectional (it will not change its direction for every half-cycle as alternating current does). In this course, you learn about the effects of connecting DC sources in series and parallel. The flow of charges results in an electric current. In a wire, electrons carry the charges. However, in an electrolyte, both electrons and ions carry the charges. The SI unit of electric current is an ampere. In an electric current, the particles that carry electric charge are charge carriers. AC is the current running through the wires and appliances on most ships. An AC waveform can be sinusoidal, square, or sawtooth-shaped. Alternating current electricity is the type of electricity commonly used worldwide, including onboard large vessels. The voltage of an AC power source changes from instant to instant in time.</p><p>The course begins by analysing Ohm's Law and the voltage, current, and resistance in the relationship that gives rise to this law. Investigate the series connections of power source, resistances, inductances, and capacitors along with the effects of such connections. You will understand power, its SI unit, and how it relates to the rate of work and energy. We illustrate potential dividers and their use in electrical circuits. We also walk you through the characteristics of electric current flow in parallel circuits, alongside voltage and resistance quantities. The effects and limitations of Ohm's Law and the series-parallel connections of electric circuits are outlined. You will study Kirchhoff's Current Law (KCL), relating complex circuits with different power sources and branches that you cannot solve with Ohm's Law. We examine Kirchhoff's Voltage Law and its application to circuits with voltage supply. The direction, source, and the comparison of DC and AC is analysed. You will also learn about a magnetic field's basic concepts, properties, and effects on a conductor in the section about electromagnetism.</p><p>This course provides an understanding of electromotive force (EMF) generation, Faraday's Laws, and the methods of producing induced EMF. By taking it, you will study the practical AC generator in addition to the quantity of the instantaneous value of induced EMF. We also examine the frequency of EMF induced in a generator and the formula used to determine the magnitude of induced EMF. Study the concepts used in waveform and the sinusoidal variation of EMF, and the step-by-step process of calculating the average values of sinusoidal current. You will also study an alternating current's root mean square (RMS) value. Master the concepts of phasors representation, addition, subtraction, and J operators. Lastly, you will learn about AC circuits with resistors along with the power in a resistive circuit.</p><a href=\"https://alison.com/resume/courses/3223\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3223\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"DC Circuits","description":"The direct current is obtained using batteries, DC generator, solar cells etc. Direct current is one in which the current is unidirectional (i.e. it will not change its direction for every half-cycle as alternating current). In this module, you will learn about the basic laws of electricity involving Kirchoff's laws, Ohm's law, energy, and power. Also, you will learn about series and parallel connections using DC voltages in different electrical circuits.","topics":["DC Circuits - Learning Outcomes","Ohm's Law","Energy, Series Circuits, and Potential Divider","Parallel Circuits","Kirchhoff's Laws","DC Circuits - Lesson Summary"]},{"name":"Module","details":"AC Circuits","description":"This module discusses the basic concepts of electrical currents and electromagnetism. You will analyze the practical AC generator and the sinusoidal variation of EMF. The RL series and parallel circuit combinations will also be covered in this module.","topics":["AC Circuits - Learning Outcomes","Alternating Current Theory","Magnetic Induction","AC Generator","AC Voltages, Currents and P.F","Phasors and j Operator","AC Circuits With Single Parameters","AC Circuits With RLC Combinations","AC Circuits - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Marine Electrical - Electricity Laws and Circuits - Course Assessment"]}]}