{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3083","title":"Marine Auxiliary Machinery - Heat Exchangers and Air Compression","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains the principles and operations of heat exchangers and air compression used on board.","description":"Ships use various heat exchangers and compressors on board to help with each system’s working conditions. The basic principles of heat exchange, fluid flow arrangements, constructional features of tube shells, plate types of heat exchangers and principles of compression cycles are discussed. Heighten your skills by studying this course on heat exchanger maintenance and marine instruments used in the control-air installation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course on marine auxiliary machinery extensively covers the various heat exchangers and compressors used on board ships. It describes the basic principles of heat circulation of fluid in adjacent spaces, the different types of heat exchangers necessary onboard and the compressed air equipment, all of which fall under the category of ‘auxiliary equipment’. The heat exchangers allow heat transfer between fluids. They are used in widespread applications, such as fuel heating, domestic water heating, lubricating oil cooling, charge air cooling and condenser cooling. In marine engineering, compressors are designed to serve various needs using air under pressure. Although several types and sizes of the compressor are available for the central air compressor, it is primarily the reciprocating tandem type used. Learning about the basic principles and layout, including the air receivers, will help you operate these air compressors efficiently. This course explains how heat exchangers carry abrasive and corrosive fluids exposed to atmospheric corrosion along with general wear and tear and describes how they sometimes operate at extremely high temperatures.</p><p>Heat flows from an object with a higher temperature to an object with a lower temperature. In general, wherever there is a heat transfer between two fluids across a medium, it is essential to know the quantity of heat transferred to optimise the performance of the heat exchanger by adjusting the factors that govern them. This course outlines the typical shell-type exchanger, which consists of a series of tubes through which one of the fluids runs. Discover the method by which fluid runs over the tubes needed to be heated or cooled. Heat transfer takes place due to the difference in temperature between the two fluids. We will introduce you to the general wastages of materials due to corrosion and erosion. You will determine how to reduce the thickness of the tubes, which can lead to leakages and reduce the strength of the tubes. These wastages come with the normal operation of the heat exchangers. You will be taken through plate heat exchangers and how they work using the same principle as shell and tube type heat exchangers.</p><p>Finally, this course describes the main air compressors, including those of the reciprocating type and the process in which high-pressure air is developed. The control air compressors are used for low-pressure air requirements of control systems. Screw compressors are used in some ships for low-pressure air requirements like service air for the deck, where a large amount of air is consumed. Detail is provided on how compressed air should be free of moisture and oil and why air bottles are drained periodically to remove condensed water and oil mixture. The course also explains the principles of the air drier and its role in the control air system in eradicating moisture. You will learn how specific control air compressors and piston rings are made of self-lubricating materials so that the supplied air will be oil-free. We will take you through the classification of air compressors, including positive displacement and dynamic type air compressors. If you are a student, researcher or marine engineer and you are seeking to learn about heat exchangers and compressors, then register for this course today and broaden your knowledge base as well as your career skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}