{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3092","title":"Maritime Equipment for System Maintenance","totalEnrolled":"940","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about oil contamination and the maintenance of equipment used in maritime systems from this free online course.","description":"Are you a marine engine engineer or technician looking for the perfect equipment required to maintain engines correctly? Look no further! This course on the maintenance of maritime systems investigates the purification and testing of lubes and positive displacement pumps in depth. By the end of this course, you will be self-confident and better equipped to carry out maintenance procedures on diesel engine systems.","courseOutcomes":["Describe the principles of filters, ...","Describe the various types of contam...","Explains the uses of filters and gau...","Discuss the centrifugal purification...","Describe the principles of filters, strainers and centrifuges","Describe the various types of contaminants and oil maintenance","Explains the uses of filters and gauges","Discuss the centrifugal purification of lubricating oils systems","Describe how to start a gear pump with all the necessary precautions","Describe the checks to be done during watchkeeping on a running pump","Describe the principles of filters, ...","Describe the various types of contam...","Explains the uses of filters and gau...","Discuss the centrifugal purification...","Describe the principles of filters, strainers and centrifuges","Describe the various types of contaminants and oil maintenance","Explains the uses of filters and gauges","Discuss the centrifugal purification of lubricating oils systems","Describe how to start a gear pump with all the necessary precautions","Describe the checks to be done during watchkeeping on a running pump"],"courseDescription":"<p>You can clean basic mineral oil using a purifier with water washing and remove water and solid contaminants. However, for detergent lubricating oils with low water, clarification is needed. As these oils contain oil-soluble detergent additives, there is a risk of emulsification during water washing. ‘Maritime Equipment for System Maintenance’ is a course that takes a comprehensive look at these procedures, explaining how purification should be used only in consultation with an oil supplier. We teach you the different maintenance requirements relating to the propulsion engine, auxiliary machinery and cargo handling equipment. Discover how the maintenance of lubricating oil occupies one of the essential roles in the care of engines. We will lead you through a regular examination and testing of circulating oil in the engine system. You will also learn about the installation and post-installation processes you carry out after a major system overhaul. We explain the types of contaminants you should remove immediately from a system and the oil maintenance procedures used for their removal.</p><p>Filters on board ships are provided in all ancillary systems such as cooling water, lubricating oil, fuel oil and air systems. You will study how filters aid the removal of foreign dirt particles and ensure the smooth flow of fluids. Gauges and meters are measuring instruments that you use for measuring parameters like pressure, temperature, the volume of flow, level measurement, speed, velocity and so on. This course describes how gauges and meters are employed on shipboard to control and monitor various ship machinery’ parameters. As a marine engineer, it is necessary to identify symbols representing filters, gauges and meters described in this course. You will get to know more about lubricating oil purifiers for diesel or turbine lubrication plants, typically arranged to operate on a continuous bypass system. We illustrate the concept of representative sampling, vital for carrying out onboard tests. You will investigate how to take oil samples from the main supply line before entering into the engine because the condition of the oil supplied to the engine is incredibly important.&nbsp;</p><p>Lastly, this online course takes you through the idea behind the rotary pump. This positive displacement pump moves liquid by using a rotating assembly called rotors in the static casing. The pump traps liquid in its closed casing with the help of rotors and discharges a smooth flow. Determine how a rotary pump handles almost any liquid that does not contain hard and abrasive solids, including viscous liquids. We will introduce you to the concept of self-priming and its capability in creating a high vacuum. The rotary pump consists of a static casing and one or more rotors actuated by relative rotation of the driving shaft. It does not require suction and delivery valve arrangement as in the reciprocating pump. The most common rotary pump used onboard is a gear pump. We will steer you through the various classification of the rotary pump and the principles of the rotary pump code. You will learn about the static casing in a rotary pump and the main component of a rotary gear pump. This course discusses the importance of particular checks when the pump starts, while it runs and when it stops. ‘Maritime Equipment for System Maintenance’ is a course of significant interest to students, researchers, maritime personnel and anyone seeking to improve their knowledge and skills in managing maritime systems. Enrol today and begin your next learning experience!</p><a href=\"https://alison.com/resume/courses/3092\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3092\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Equipment for System Maintenance","description":"This module discusses aspects of equipment necessary in maintaining maritime systems effectively. Learn about oil contamination and maintenance strategies as well as the purification process. You will also study rotary pumps as a positive displacement pump.","topics":["Equipment for System Maintenance - Learning Outcomes","Oil Contamination and Maintenance Strategies","Filters and Gauges","Purification of Lube Oil","Testing of Lube Oil","Rotary Pumps","Equipment for System Maintenance - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Maritime Equipment for System Maintenance - Course Assessment"]}]}