{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3477","title":"Maths for Engineering - Conic Sections and Logarithmic Functions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course takes you through essential mathematical concepts required in engineering.","description":"Every successful engineer needs to be well equipped in certain aspects of mathematics to excel. This course provides a solid foundation in understanding the mathematical principles behind the study of conic sections and logarithmic functions as well as their applications in real life. By the end, you will have built on your foundational knowledge of mathematics for engineers. Get started with this useful course today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course describes how conic sections are created when a plane cuts a random slice through a three-dimensional cone (also called a ‘double napped’ cone). It discusses parabolas, which is a curve where any point is at an equal distance from a fixed point (the focus) and a fixed straight line (the directrix). This course explores the various ways of deriving equations of parabolas with horizontal and vertical orientations. It also shows you how to write equations of parabolas in standard and general form. Learn about graphing parabolas and analyzing parabolas from data. Analyze a circle, which is the set of all points on a plane that are a fixed distance from a centre. You will then see how to derive equations of circles centred at the origin. Also, you will learn about graphing circles and the process of analyzing circles from data, including finding centre and radius as well as writing the appropriate equations. The course explains the applications of circles, especially in real-world situations.</p><p>Next, the material takes you through the world of ellipses, which are the set of all points in a plane, the sum of whose distance from two fixed points, called the foci, is a constant. You will study the circle, which is a special type of ellipse where both focal points are at the same point, the centre. The course goes on to explain how to derive equations of ellipses with horizontal and vertical orientations. It also describes how to write equations of ellipses in standard and general form. You will learn about graphing ellipses and study how to analyze ellipses from data: that is, finding vertices and foci along with writing the appropriate equations. You will be taken through how to write the equation of ellipses using specific conditions. Learn how the orbits of the planets around the sun are elliptical and see how the sun is positioned at the focus of the ellipse. If you have heard about hyperbolas before and you are interested in knowing more about their formation and their applications, then you are taking the right course. The material discusses in detail how hyperbolas are formed and their importance in the development of satellites. You will also learn how radio systems' signals employ hyperbolic functions.</p><p>Finally, the course explains the importance of exponential functions and how they are used in many real-world situations. Be introduced to the definition and properties of exponential functions, and study how they are used to find the exponential decay or exponential growth or, in some cases, compute investments. You will also be introduced to the possible ways of using exponential functions to model populations and so on. The course describes graphing exponential functions and solving exponential equations. Study in great detail the application of the inverse of exponential functions. Another interesting aspect of exponential functions you will get to learn is the logarithmic function which is of the form y = logax where x is a real number variable, and a is a constant (a &gt; 0, a ≠ 1). The course gives the definition and properties of logarithmic functions, and you will learn about graphing logarithmic functions and solving logarithmic equations. Get to know how mathematicians manipulate logarithmic expressions by changing the functions from one base to another. This course comes highly recommended if you have an interest in engineering and seek to solidify your knowledge of mathematical concepts used for this exciting field.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}