{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3034","title":"Mechanisms of Gas Turbines","totalEnrolled":"1,440","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online engineering course explains the functions and inner workings of gas turbines and epicyclic gears.","description":"This free online engineering course breaks down the mechanisms of gas turbines and teaches you the features and functions of electric and pneumatic starting systems. We go through various lubrication systems and examine the components of the lube oil subsystem. We also cover automated central operating systems (ACOS). This course suits those interested in using natural gas to create relatively clean energy.","courseOutcomes":["Describe the starting system procedu...","Evaluate the pneumatic starting syst...","Outline the hydraulic starting syste...","List the types of lube oil used for ...","Describe the starting system procedures and precautions for a gas turbine","Evaluate the pneumatic starting system components and procedure","Outline the hydraulic starting system and components including precautions for starting","List the types of lube oil used for gas turbine lubrication","Evaluate the lube oil system and its functions","Identify the types of fuel oil to use in a gas turbine engine","Compare parallel and epicyclic gearing for a gas turbine plant","Describe the clutch and reversing gear as used in such a plant","Explain the purpose of the ‘bleed air’ system","Break down the air ‘intake and exhaust’ system of a gas turbine","Evaluate the automated central operating systems (ACOS) of a gas turbine system for propulsion","Discuss the gas turbine control and instrumentation philosophy","Describe the starting system procedu...","Evaluate the pneumatic starting syst...","Outline the hydraulic starting syste...","List the types of lube oil used for ...","Describe the starting system procedures and precautions for a gas turbine","Evaluate the pneumatic starting system components and procedure","Outline the hydraulic starting system and components including precautions for starting","List the types of lube oil used for gas turbine lubrication","Evaluate the lube oil system and its functions","Identify the types of fuel oil to use in a gas turbine engine","Compare parallel and epicyclic gearing for a gas turbine plant","Describe the clutch and reversing gear as used in such a plant","Explain the purpose of the ‘bleed air’ system","Break down the air ‘intake and exhaust’ system of a gas turbine","Evaluate the automated central operating systems (ACOS) of a gas turbine system for propulsion","Discuss the gas turbine control and instrumentation philosophy"],"courseDescription":"<p>This free online course introduces you to the fundamental principles of gas turbine starting systems, as well as their procedures and safety precautions. We break down start-up control features along with the characteristics of electric starters, including new advances to their technology. We explore the functionality and features of General Electric’s starting systems (the engine start, motoring purge, water wash and borescope) before examining pneumatic starters. This course investigates the components of the hydraulic start system and establishes its disadvantages: complexity, system weight, flammability of hydraulic fluids and the existence of high-pressure hydraulic lines. We study hydraulic start-system operation alongside functions of the hydraulic oil charge pump, charge pump filter and main hydraulic oil pump. This includes the hydraulic starter motor, centrifugal starting clutch and pre-start inspection steps.</p><p>This course then shows you how to work out much lubricating oil a gas turbine requires and consumes. We compare the two types of lubricating oil for gas turbine applications: standard and corrosion inhibiting. We demonstrate the harsh conditions experienced by lubrication oil in gas turbines: extreme heat, high contamination and inadvertent mixing with other substances. We cover two types of lubrication systems (wet sump and dry sump) while using a lube oil system schematic to explain the lube oil flow and components of the lube oil and lube scavenge subsystems. We lay out the characteristics, requirements, maintenance and handling of fuel before comparing its types: liquified natural gas (LNG), liquified petroleum gas (LPG), ethane and pure hydrogen. After establishing the functions and components of the fuel system, the course teaches you the requirements for a marine gas turbine engine: starting, steady running requirements and engine acceleration and deceleration.</p><p>We can help you to master detection methods used for typical transducer faults like speed and temperature transducers. This course also teaches you the spark ignition system’s working features and functions as you become familiar with power turbines and the significance of the synchro-self-shifting (SSS) clutch in starting them up. We unpack epicyclic gears (star, planetary and solar) and demonstrate the advantages of using multiple-planet wheels. We then take you through more clutches: twin-disk, airflex, hydraulic and sprag. We explain the purpose of the ‘bleed air’ and ‘intake and exhaust’ systems before delving into the data-processing aspect of the automated central operating systems (ACOS). This free online engineering course suits anyone interested in the inner workings of gas turbines, particularly those who care about the planet and want to keep it powered with clean energy.</p><a href=\"https://alison.com/resume/courses/3034\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3034\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Starting, Lubrication and Fuel Systems","description":"In this module, you will be introduced to starting system procedures, electric starting methods, as well as pneumatic starters, and operations of a pneumatic starter. You will also be introduced to the two types of lubricating oil, types of lubricating systems which include; dry-sump and wet-sump lubrication. As well as types of fuels oil to use in a gas turbine engine, fuel injection system, and spark ignition system.","topics":["Starting, Lubrication and Fuel Systems - Learning Outcomes","Starting Systems","Lubrication Systems","Fuel System","Starting, Lubrication and Fuel Systems - Lesson Summary"]},{"name":"Module","details":"Systems in Marine Gas Turbines","description":"In this module, you will be introduced to the different arrangements in GT which include; single-shaft, split-shaft, and dual-shaft as well as the use of gears, gear teeth design, and the basic elements of epicyclic gears. You will also be introduced to the advantages of multiple planets, functions of the bleed air system, intake and exhaust systems of a gas turbine. As well as components, functions, and data processing systems of the ACOS.","topics":["Systems in Marine Gas Turbines - Learning Outcomes","Drive System","Epicyclic Gearing","Bleed Air Systems","Instrumentation and Control Systems","Systems in Marine Gas Turbines - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Mechanisms of Gas Turbines - Course Assessment"]}]}