{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2786","title":"Mechanical Measurement Systems for Advanced Measurements","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to conduct advanced, accurate measurements using mechanical measurement systems in this free online course.","description":"The free online course on Mechanical Measurement System for Advanced Measurements teaches you how to correctly conduct advanced measurements for pressure, force, torque, displacement, acceleration, soundwaves, thermal conductivity, viscosity, humidity and air pollution using the elements and functions of different mechanical measurement system instruments with relevant examples for each quantity. You will also learn about using shadowgraphs.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Mechanical Measurement Systems for Advanced Measurements is a free online course that covers the elements, functions and applications of mechanical measurement systems in conducting advanced accurate measurements for pressure, force, torque, displacement, acceleration, soundwaves, thermal conductivity, viscosity, humidity and air pollution. It will equip you with many important instrumentation skills and teach you the general concepts of conducting measurements for those quantities correctly. The course begins by introducing you to the general concept of ‘pressure measurement’ and the instruments for measuring pressure, including the pressure gauge used in conducting accurate readings for usual pressure quantities in engineering and science.</p><p>You will also be introduced to strain gauges and their relevance to conducting measurements by using force and displacement. The course distinguishes between force and torque, as well as the difference in measuring displacement and acceleration. You will learn about sound waves under different conditions, their amplitude, frequency, periods and other properties, with relevant examples. Next, you will study conducting measurements using different instruments for thermal conductivity, viscosity and humidity. Furthermore, the course will teach you experimental techniques of flow visualization, interference of flows, optical techniques of flow visualization, shadowgraphs, schlieren, interferometer, and the laser Doppler anemometer (LDA). Lastly, learn about using the Orsat apparatus and sampling techniques for measuring air pollution, as well as the different units used in measuring air pollution in samples.</p><p>This free online course provides the important skills and techniques of mechanical measurement systems relevant to conducting advanced and accurate measurements for research and experiments. It will be of significant interest to anyone who uses mechanical measurement readings for the analysis of scientific theories and their applications in industry. Start your next learning journey today by registering for this course now and upgrading your mechanical measurement knowledge and skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}