{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1738","title":"Mechanical Engineering - Internal Combustion Engine Basics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how internal combustion engines work to rotate pumps, generator rotors, fans and more in this free online course.","description":"This free online Mechanical Engineering course will familiarise you with the inner workings of Internal Combustion (IC) engines. Internal Combustion engines are at work all around us, used to power a wide variety of machines. But how do these astounding and often complex machines work? This course uses 2D and 3D models to bring the inner workings of internal combustion engines to life. Start this course today to learn more about the IC engine.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Internal combustion (IC) engines are not only used in the automotive engineering and automobile engineering industries, they are used to rotate pumps, generator rotors, fans and many other machines. But what are internal combustion engines? Why do we use petrol/gasoline and diesel fuels instead of just one type of fuel? And how do these astounding machines work? This course will answer all of these questions and many more!</p><p>Irrespective of your background, learning about internal combustion engines will benefit you greatly. They are used as prime movers in cars, vans, trains, motorbikes, scooters, lawnmowers, leaf blowers and many other machines. So even if you are not an engineer, or training to become one, the knowledge you gain will always be useful, because a combustion engine is never far away!</p><p>This course is taught by an engineer with 17 years experience... you're in good hands! Interactive 3D models have been used to show you every engine component in detail, and 2D images have been used to highlight areas of interest.</p><p>This free online course will be of great interest to all learners wishing to expand their knowledge of Internal combustion (IC) engines, such as those interested in mechanical engineering as a career or those interested in working in the automotive and automobile industries. So, start this course today and improve your mechanical engineering knowledge!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}