{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2512","title":"Microscopy Techniques used in Construction Materials Analysis","totalEnrolled":"302","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online course on image analysis, different methodologies and sequence of techniques involved in data extraction.","description":"This free online Microscopy Techniques in Construction Materials Analysis course will enlighten you on the different methodologies, the sequence of techniques that are involved in extracting data from an image. You will gain an understanding of spectroscopy, as well as the kinds of interactions possible in spectroscopy and the techniques of spectroscopy. You will also be exposed to new infrared spectrometers, interferograms and signals in NMR.","courseOutcomes":["Explain the meaning of image analysi...","Define stereology in image analysis...","Explain the meaning of image process...","Identify the steps involved in image...","Explain the meaning of image analysis as it relates to construction materials","Define stereology in image analysis","Explain the meaning of image processing in image analysis","Identify the steps involved in image analysis","Explain the meaning of digital images in relation to image analysis","Describe image resolution as it relates to image analysis","Explain the meaning of Spectroscopy in relations to construction materials","Analyze the phenomena involved in interaction of electromagnetic radiation","Identify the various techniques of spectroscopy","Explain the meaning of Absorption as a phenomenon of electromagnetic radiation","Describe absorption spectroscopy as it relates to construction materials","Explain the meaning of image analysi...","Define stereology in image analysis...","Explain the meaning of image process...","Identify the steps involved in image...","Explain the meaning of image analysis as it relates to construction materials","Define stereology in image analysis","Explain the meaning of image processing in image analysis","Identify the steps involved in image analysis","Explain the meaning of digital images in relation to image analysis","Describe image resolution as it relates to image analysis","Explain the meaning of Spectroscopy in relations to construction materials","Analyze the phenomena involved in interaction of electromagnetic radiation","Identify the various techniques of spectroscopy","Explain the meaning of Absorption as a phenomenon of electromagnetic radiation","Describe absorption spectroscopy as it relates to construction materials"],"courseDescription":"<p>This course will begin by introducing you to image analysis involving calculations to determine the size and shape of a particular image. You will be introduced to different methodologies, the sequence of techniques that are involved in extracting data from an image. You will explore cracking study using microscopy and phase mapping from image analysis. You will also be exploring what can be done to further enhance images. You will learn about the common types of operations performed on images known as Kernel operations. Next, the course will explain smoothing in image analysis, examples of smoothing and the software for image analysis.</p><p>The course then explains spectroscopy, as well as the kinds of interactions possible in spectroscopy and its techniques. You will gain an understanding of the principles of these techniques and using the information obtained from absorption. You will be able to explain scattering or transmission of the radiation from different types of species. This will lead you into new infrared spectrometers and interferograms. You will learn the meaning of interferometer, interferogram and how infrared spectrum is obtained from the interferogram by using the Fast Fourier Transform - FFT.&nbsp;</p><p>Finally, you will learn about Fourier transform, the application of FTIR to materials research, OPC studies, slag hydration and time dependence. You will then explore the several ways to conduct nuclear magnetic resonance experiment, how the number of signals in NMR shows how many kinds of protons are present and the NMR signals with respect to chemical shifts. Also, you will learn more about magic angle spinning (MAS), MAS spectra; chemical shift and silica polymerization. Start learning today!</p><a href=\"https://alison.com/resume/courses/2512\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2512\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Image Analysis","description":"This module explores image analysis which involves performing calculations to determine the size and shape of that particular image. You will be introduced to different methodologies, the sequence of techniques that are involved in extracting data from an image. Next, you will also be exploring cracking study using microscopy and phase mapping from image analysis.","topics":["Image Analysis - Learning Outcomes","Introduction to Image Mapping","Features of Image Mapping","Basic Operations in Image Mapping","Segmentation in Image Mapping","Image Analysis - Lesson Summary"]},{"name":"Module","details":"Spectroscopy Techniques","description":"This module explores spectroscopy, as well as the kinds of interactions possible in spectroscopy and the techniques of spectroscopy. You will learn about the principles of these techniques and how to make use of the information that is gotten from absorption. You will also learn about scattering or transmission of the radiation from different types of species.","topics":["Spectroscopy Techniques - Learning Outcomes","AAS and AES Spectrums","Atomic Absorption Spectroscopy Instrumentation","Application of AAS and AES","Absorbance Studies and IR Techniques","Infrared Spectrometers","NMR Spectrometer","Principle of NMR Spectroscopy","Spectroscopy Techniques - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microscopy Techniques used in Construction Materials Analysis - Course Assessment"]}]}