{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3241","title":"Motors and Controllers for Electric Vehicles","totalEnrolled":"5,864","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to design a motor and controller for electric vehicles in this free online engineering course.","description":"It seems that the electric motor will replace the internal combustion engine within the next few decades and this free online course helps you to take advantage of the opportunities created by such a change. Aspiring automotive engineers must understand how to design electric motors for electric vehicles and we can train you to implement the engineering principles that drive this fascinating process.","courseOutcomes":["Define Kirchhoff's first and second ...","Explain the flow of electrical and m...","Calculate torque inside a PMDC motor...","Discuss the role of magnetic flux in...","Define Kirchhoff's first and second law","Explain the flow of electrical and magnetic energy inside an electric motor using Ohm's law","Calculate torque inside a PMDC motor","Discuss the role of magnetic flux inside a PMSM","Summarize how to design a field-oriented control","Analyze the ‘Clarke and Park transform’","Demonstrate how to use Norton's Theorem to design a thermal circuit","Discuss the static and dynamic balancing of a motor","Define Kirchhoff's first and second ...","Explain the flow of electrical and m...","Calculate torque inside a PMDC motor...","Discuss the role of magnetic flux in...","Define Kirchhoff's first and second law","Explain the flow of electrical and magnetic energy inside an electric motor using Ohm's law","Calculate torque inside a PMDC motor","Discuss the role of magnetic flux inside a PMSM","Summarize how to design a field-oriented control","Analyze the ‘Clarke and Park transform’","Demonstrate how to use Norton's Theorem to design a thermal circuit","Discuss the static and dynamic balancing of a motor"],"courseDescription":"<p>Many major car-manufacturing companies have declared that most if not all of the vehicles they produce will be electric within the next two decades, which could render the internal combustion engine obsolete, a relic kept around only for car enthusiasts and collectors. This means that automotive engineers require familiarity with the new technology and this course provides the tools you need to take your career to the next level. We begin with energy flow as every electrical and mechanical engineer needs to understand Ohm’s and Kirchhoff's laws and how they apply to the flow of electric, thermal and magnetic energy. We demonstrate how to convert the electric energy from a battery into mechanical energy inside a motor. We explain how this energy is used to produce torque inside an electric motor, how a gearbox multiplies torque and how to calculate energy loss and efficiency.</p><p>We then analyse the production of torque in more detail using a permanent magnet direct current motor (PMDC), which creates a magnetic field for operation. We investigate the physics that creates torque inside this motor by calculating torque using the different force vectors produced by the electric current and magnetic flux. We also consider the role that computation plays in the production of torque inside an electric motor. This brings us to the permanent magnet synchronous motor (PMSM), which has higher torque, smaller frame size and no rotor current. We examine two types of PMSM motors, how they operate using alternating current and how electronic switching is used to control commutation, making the PMSM ideal for electric vehicles. We study how torque is produced inside a PMSM motor using the d-q frame theory to show you how to design a field-oriented control and calculate three-phase circuits. We also cover the role of ‘Park and Clarke transforms’ and their inverse to calculate currents.</p><p>This helps you to create a thermal profile for your motor. We reference Ohm’s law and combine it with Norton’s theorem to calculate the flow of heat to improve resistance along the way. This thermal profile lets you judge whether your motor’s peak temperatures meet international standards. This course helps anyone pursuing automotive engineering, whether they are studying or seeking a career boost in this exciting and expanding field. With electric vehicles taking over the market, studying their motors and controllers can only enhance your prospects.</p><a href=\"https://alison.com/resume/courses/3241\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3241\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Electric Vehicle Motors","description":"This module will discuss how to design an electric vehicle motor, how to optimise for torque inside a motor, and why electric vehicles use a PMSM motor instead of a PMDC motor.","topics":["Electric Vehicle Motors - Learning Outcomes","Flow of Energy","Understanding Torque","Motor Dynamics","Electric Vehicle Motors - Lesson Summary"]},{"name":"Module","details":"Electric Vehicle Controllers","description":"This module will discuss how to design controllers for the motor of an electric vehicle. It will also discuss the importance of an excellent thermal design, and it will explain engineering concepts useful for designing both motors and controllers.","topics":["Electric Vehicle Controllers - Learning Outcomes","Field Oriented Control","Thermal Design","Engineering Considerations","Electric Vehicle Controllers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Motors and Controllers for Electric Vehicles - Course Assessment"]}]}