{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2987","title":"Oil in Refrigeration and Air Conditioning Systems","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course on the importance of safety devices in refrigeration plants and the effects of oil contamination.","description":"This free online course on oil in refrigeration and air-conditioning (AC) systems teaches you about safety devices on refrigeration plants and compressors, types of leak tests and electronic leak detectors. You will learn about three basic methods of refrigerant recovery and defrosting, and be able to explain the detrimental effects of oil in a system.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Oil in Refrigeration and AC Systems’ is a free online course that begins by introducing you to the safety devices on refrigeration plants and compressors, the single-stage vapour-compression refrigeration cycle, as well as fluorocarbon refrigerants based on methane and ethane. The types of leak tests (such as using soap, fluorescent dye and nitrogen) as well as electronic leak detectors (like ultrasonic, heated diode, heated electrolyte, infrared and corona discharge) are also vital to your knowledge. This course will teach you about leakage rectification systems and the recovery of refrigerant gas, as well as three basic methods of recovery (liquid, vapour and push-pull). Cautions when charging gas in a reefer and refrigerant system as well as the procedure for charging ship’s manual will also be covered in this course. You will learn about the HVAC (heating, ventilation and air conditioning) unit, details of HVAC gauges, types of manifold gauges (which include R410A, R22, and R134a) as well as how to connect HVAC gauges to refrigeration. The difference between ozone depletion potential (ODP) and global warming potential (GWP), as well as alternative, secondary, and future refrigerants, will also be explained.</p><p>Do you know how air and oil are handled in a refrigeration and air conditioning system, how to safely isolate the system, as well as how to purge air from it? You will also learn about the management of oil return; the functions, working principles, and components of a single compressor system; and all about multi-compressor systems. The process of oil return in the suction collector and to the crankcases, centralized oil return as well as the efficiency of the oil separator using one separator per compressor will also be covered in this course. You will master high-pressure oil return, as well as the proper processes required when adding oil to the system. You will also learn about the steps involved in cleaning the oil strainer, as well as the key functions of oil in a refrigeration system and the classification of lubricating substances like natural mineral oil, synthetic oil and half-synthetic oil. The detrimental effects of oil in a system, once it gets past the compressor, as well as how oil contamination in the refrigerating system reduces its overall efficiency, will also be covered by the material.</p><p>Furthermore, this course will help you get familiar with preventive treatment and methods to avoid the introduction of moisture into the system. The harmful effects of oil in a system, which include mechanical breakdown, modification of thermodynamic properties of the refrigerant, as well as decrease in the efficiency of exchangers, will also be covered. Learn how to test compressor suction as well as the functioning of discharge valves. Study the definition of and reasons for defrosting, as well as defrosting systems like water wash, hot gas, electric, manual shutdown and warm brine defrosting. The various methods to defrost brine systems, cargo fridge defrosting, as well as methods of defrosting will also be demonstrated to you.&nbsp;</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}