{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4164","title":"Per Unit Analysis; Single and 3-Phase Systems","totalEnrolled":"253","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to perform per-unit analysis on complex single and three-phase power systems in this free online course.","description":"Have you ever looked at a complex electrical system and found the idea of analyzing the system challenging? The good news is that you are not alone and this course will help you analyze power systems using 'per unit analysis'. You will be shown how manufacturers of equipment use 'per unit analysis' to rate their equipment and various examples of working with this method are presented in this crisp, clear presentation.","courseOutcomes":["Describe per-unit and per-phase anal...","Outline the normalization process fo...","Estimate base values of systems incl...","Compute line current and load voltag...","Describe per-unit and per-phase analysis of power systems","Outline the normalization process for per unit analysis of a system","Estimate base values of systems including power, voltage, current and impedance","Compute line current and load voltage supplied by a generator","List characteristics of three-phase systems","Estimate the total apparent power in a system","Define the turn ratio of a transformer","Classify transformers on the basis of their configurations","Compare voltages in different transformer configurations","Describe per-unit and per-phase anal...","Outline the normalization process fo...","Estimate base values of systems incl...","Compute line current and load voltag...","Describe per-unit and per-phase analysis of power systems","Outline the normalization process for per unit analysis of a system","Estimate base values of systems including power, voltage, current and impedance","Compute line current and load voltage supplied by a generator","List characteristics of three-phase systems","Estimate the total apparent power in a system","Define the turn ratio of a transformer","Classify transformers on the basis of their configurations","Compare voltages in different transformer configurations"],"courseDescription":"<p>Per-phase analysis is the reduction of a balanced three-phase system to single-phase quantities to simplify electrical system calculations. Performing calculations on complex three-phase systems is a challenging and time-consuming activity. To make computations easier, you will be taught how to convert a three-phase system to a single-phase circuit, perform calculations and convert the circuit back to the original three-phase system. The per-unit analysis is a tool that is used in the simplification process of power system analysis. It involves removing transformers and expressing system quantities as fractions of a defined base unit quantity. You will be shown how to assign arbitrary base values to different system variables to easily perform per unit analysis with a step-by-step approach called the normalization process. You will also be taught different characteristics of a three-phase system and how it is related to a single-phase system. Having learned this, you will gain an understanding of how to calculate apparent power in single-phase circuits and establish a relation between apparent power in single-phase and three-phase circuits.</p><p>Three-phase transformers can be connected together in four different ways, having different voltage behavior at the high and low sides of the transformers. You will be taught the four transformer configurations, their workings, the behavior of voltage and the relationship of currents and voltages in different transformer connections. You will be shown how to represent a three-phase transformer as a single-phase transformer graphically to make the circuit analysis simpler and more understandable. Generators come with pre-defined base values of voltages, power and impedances from the manufacturer. You will see how to assign new values to these quantities and calculate the actual impedance from the base values. Per unit analysis, in theory, appears easier than actually performing per unit analysis on a complex power system. To elaborate further on the PU analysis on complex electrical systems, you will be taught how to break down complex systems into simple circuits and perform calculations with the help of solved examples.</p><p>This course is designed for electrical engineering students and professionals working in the power sector to sharpen their knowledge and skills in the area of per-unit analysis of single and three-phase systems. It contains lectures with industry-oriented knowledge aided by colorful graphics, schematic diagrams and resolved problems to grasp the attention of learners and maximize understanding of complex electrical systems. This course is also useful for people who studied electrical engineering and can serve as a refresher course for their current job designations. Basic knowledge of the laws and theorems related to three-phase electrical power systems is required. The power industry is a booming field and everyone is dependent on electricity in carrying out their routine activities. The industry offers jobs to a number of people living in any part of the world and requires system analysis skills from the employees. Grab the opportunity to build and improve your per-unit system analysis skills today!</p><a href=\"https://alison.com/resume/courses/4164\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4164\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Simplified Power System Analysis","description":"This module will introduce you to the per-phase and per-unit analysis of electrical systems. You will learn how to break down complex power systems into small and easily understandable circuits for analysis and calculations. Learners will be taught transformer configurations, voltage-current relationships and how they function in power systems.","topics":["Per Unit Analysis; Single and 3-Phrase Systems - Learning Outcomes","Per Unit Analysis and the Normalization Process","Three Phase PU Analysis and Transformer Configurations","Per Unit Circuits and Examples","Per Unit Analysis; Single and 3-Phrase Systems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Per Unit Analysis; Single and 3-Phrase Systems - Course assessment"]}]}