{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3322","title":"Power Protection Schemes","totalEnrolled":"1,589","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you the systems and designs applied to protect cables, transformers and generators.","description":"A power protection scheme is needed to keep a power system stable. This course will teach you the carrier-aided schemes used to protect transmission lines, auto-reclosing and the synchronising schemes employed for clearing faults. You will also study the systems used in protecting transformers and generators. Protecting these key components of a power system is essential and this knowledge is a crucial addition to your profile.","courseOutcomes":["Outline the carrier-aided schemes us...","Explain the types of pilot communica...","State the advantages and disadvantag...","List the different types of tripping...","Outline the carrier-aided schemes used in the protection of power transmission lines","Explain the types of pilot communication based on signal and frequency","State the advantages and disadvantages of the various protection schemes","List the different types of tripping schemes","Describe how auto-reclosing works and state its advantages","Identify the types of transformer faults and protection mechanisms","Explain the types of schemes used for the protection of generators","Outline the carrier-aided schemes us...","Explain the types of pilot communica...","State the advantages and disadvantag...","List the different types of tripping...","Outline the carrier-aided schemes used in the protection of power transmission lines","Explain the types of pilot communication based on signal and frequency","State the advantages and disadvantages of the various protection schemes","List the different types of tripping schemes","Describe how auto-reclosing works and state its advantages","Identify the types of transformer faults and protection mechanisms","Explain the types of schemes used for the protection of generators"],"courseDescription":"<p>The protection of the pivotal components of a power system network consists of transmission lines, transformers and generators. The safety of these elements from faults is critical to ensure the stability of the power system network. It also guarantees a stable power supply and prevents damage to the components, which can occur due to faults in the power system. This course will help you acquire all the necessary skills and knowledge required for their protection. First, you will study the carrier-aided schemes used to protect transmission lines. Then you will learn auto-reclosing and synchronising schemes used for restoring power connection after fault clearance. We introduce the three types of transmission line protection: current-based, distance relaying and pilot protection schemes. Moreover, we will explore the wire pilot relaying scheme, phase comparison scheme and carrier blocking schemes. We follow this with detailed explanations of the carrier-aided transfer tripping schemes, consisting of underreach and overreach transfer tripping schemes.</p><p>Next, you will study the designs used to shield transformers from the various types of faults. Three types of faults (incipient faults, internal faults and external faults) affect transformers. We examine these in detail, together with the power protection schemes used to safeguard transformers against them and the six factors for transformer protection. After that, we teach you how to protect generators, which are the most expensive power plant components. You will investigate the different types of protection and how they work. These include differential protection, stator ground fault protection, rotor earth fault protection, field winding protection and many more. Finally, you will study the concept of reverse power protection and the effect of power reversal on turbine prime movers.</p><p>The protection of the critical components of a power system network is paramount in ensuring the stability and reliability of a power system, thereby minimising power outages. It also ensures that the components, consisting of power lines, transformers, and generators, are safeguarded against potential damage that would cost power utility companies vast sums of money to repair or replace. Besides, power protection prevents potential harm to personnel and saves lives. This course will benefit professionals in power system networks seeking to refresh or expand their knowledge base, as well as anyone considering a career in the field of power systems protection. Start this course today and grow your skills and knowledge in power systems protection.</p><a href=\"https://alison.com/resume/courses/3322\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3322\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Carrier Aided Schemes for Transmission Lines","description":"In this module, you will be introduced to the concept of carrier-aided schemes for transmission lines. You will also learn about the various types of carrier-aided protection schemes, how they work, as well as their advantages and disadvantages.","topics":["Learning Outcomes - Carrier Aided Schemes for Transmission Lines","Introduction to Carrier Aided Schemes","Types of Protection Schemes","Directional Comparison and Carrier Blocking Schemes","Carrier Aided Transfer Tripping Schemes","Lesson Summary - Carrier Aided Schemes for Transmission Lines"]},{"name":"Module","details":"Autoreclosing and Protection of Transformers and Generators","description":"In this module, you will study the history of auto-reclosing, its advantages, and its classifications. You will also study how auto-reclosing works and the factors to be considered during reclosing. Finally, you will discover protection schemes for transformers and generators, and how they work.","topics":["Learning Outcomes","Introduction to Autoreclosing","How Auto-reclosing Works","Characteristics of Reclosing","Transformer Faults","Protection of Transformers","Protection of Generators","Types of Generator Protection","Lesson Summary - Autoreclosing and Protection of Transformers and Generators"]},{"name":"Module","details":"Course assessment","description":"","topics":["Power Protection Schemes - Course Assessment"]}]}