{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4099","title":"Primer on Electrical Transducers","totalEnrolled":"197","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free electrical science course specialises in transducers and measurements for technicians and engineers.","description":"This course helps you understand what a transducer is and you will discover more about the resistive strain gauges. Next, you will find information about capacitive and differential transducers as well as load cells. Finally, the course will explain how to measure levels and speed. You will learn how to measure torque and see what instruments measure acceleration, humidity, and moisture.","courseOutcomes":["Analyze the characteristics of trans...","Define temperature transducers...","Recognize a resistive strain gauge...","Define the linear variable different...","Analyze the characteristics of transducers","Define temperature transducers","Recognize a resistive strain gauge","Define the linear variable differential transformer","Describe the load cell and how to measure level and speed","Distinguish how to measure torque and force","List and explain the measurement of acceleration and vibration","Categorize the measurement of humidity and moisture","Summarize the permanent and temporary mounting of a transducer","Analyze the characteristics of trans...","Define temperature transducers...","Recognize a resistive strain gauge...","Define the linear variable different...","Analyze the characteristics of transducers","Define temperature transducers","Recognize a resistive strain gauge","Define the linear variable differential transformer","Describe the load cell and how to measure level and speed","Distinguish how to measure torque and force","List and explain the measurement of acceleration and vibration","Categorize the measurement of humidity and moisture","Summarize the permanent and temporary mounting of a transducer"],"courseDescription":"<p>In this primer, you will learn about electrical transducers and get accurate knowledge of the working principle of a transducer. This course explains and defines the parts and functions of a thermistor and a thermocouple. It will also give you information about resistance temperature detectors. You will see how to use a resistive strain gauge, learn what a capacitive transducer is and understand linear variable differentials. Next, we will discuss the definition of a load cell and a flow transducer. This course also assesses the various measurements of levels and speeds using instruments such as a float level indicator and a stroboscopic tachometer.</p><p>Next, it teaches you about the accurate measurement of torque, force, and acceleration. You will learn how to correctly use instruments like piezoelectric and magnetostrictive transducers. Furthermore, you will learn about the various measurements of acceleration to properly use tools like a linear variable transformer. Following on, the material explains how to measure vibration. In addition, you will discover how humidity is measured through the use of devices such as a hygrometer. You will be taught how to properly employ a Dunmore cell to measure humidity. The course ends by describing the working principles for measuring moisture and the installation of a transducer.</p><p>This course provides you with a better understanding of electrical transducers, giving you clear and precise methods to apply it in your field. It will help you understand the necessary instruments for measuring electronics and electricity.</p><a href=\"https://alison.com/resume/courses/4099\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4099\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Types of transducers","description":"First, this module starts by explaining what is transducers and resistive strain gauge is. Next, the module provides knowledge about Capacitive Transducers. You will learn what is differential Transformer and Load Cell. Finally, the module provides information on the measurement of levels, speed, torque force, acceleration, humidity and moisture.","topics":["Primer on Electrical Transducers - Learning Outcomes","Transducers & Resistive Strain Gauge","Capacitive Transducers, Differential Transformer and Load Cell.","Levels and Speed","Torque, Force and Aceleration","Humidity and Moisture","Primer on Electrical Transducers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Primer on Electrical Transducers - Course assessment"]}]}