{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3410","title":"Principles of Cathodic Protection","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the basic principles of cathodic protection of engineering structures in this free online course.","description":"Does the fact that you can prevent corrosion attacks on metal by applying the basic principles of cathodic protection intrigue you? This course gives you a solid grounding in these principles. It examines the types of external anodes for cathodic protection available, along with other forms of corrosion control and prevention techniques. Complete this course and learn to control or prevent corrosion on many engineering structures.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Cathodic protection prevents corrosion on numerous engineering structures such as pipelines, tanks, offshore structures and ships. This course aims to give you the details of cathodic protection principles and explains corrosion control and preventive measures. We demonstrate specific aspects of cathodic protection as applicable to storage tanks, offshore structures and ships. The first section begins with a discussion on the various types of storage tanks, the National Association of Corrosion Engineers (NACE) standards governing those tanks and the simplifications involved in managing the tanks. We teach you specific issues concerning storage tanks, help you understand how anodes perform and examine their functions and requirements. We investigate the two types of anodes for cathodic protection and show a schematic of the polarization of good and bad sacrificial anodes and how to develop an efficient sacrificial anode.</p><p>Next, we analyze some equations to understand the cathodic protection concepts. We illustrate this using four worked-out examples. These examples emphasize the role of electrochemical parameters in cathodic protection engineering. We look at the stray current corrosion of buried structures, one of the main problems affecting the structural integrity of those pipelines, storage tanks and so on. In this section, discover the sources, detection and mitigation of stray current corrosion occurring in these engineering structures. This course component will focus on AC interference related to the deterioration of engineering structures. We highlight the cause factors affecting AC interference, mitigation and AC sources on pipelines. We outline the protective coatings used to treat engineering structures to provide cathodic protection and the quality of the coatings. We introduce the transformer rectifier unit, the concepts involved in the selection and the types applied for the cathodic protection of structures.</p><p>The course explores the internal corrosion of oil, gas and water pipelines, which is not directly related to cathodic protection. Cathodic protection methodology is entirely different from the methodology to control corrosion of internal pipeline surfaces. However, it is relevant to these structures because whether it is a pipeline or storage tanks, they face corrosion externally, due to soil and internally due to the various products they store or transport. Research the anodic protection method that does not have much in common with cathodic protection engineering even though both use electrochemical techniques to prevent corrosion of metallic structures. We will teach you the origin, the underlying principles, how you can apply them in the field and their limitations. Lastly, you will compare the anodic and cathodic protection concerning corrosion of metallic surfaces. Learning the principles of cathodic protection will help you understand and know the best control and preventive technique required for the protection and maintenance of any engineering structure. So start learning this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}