{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4108","title":"Principles of Winding","totalEnrolled":"895","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles, terms and techniques of winding in this free online electrical engineering course.","description":"This course illustrates the principles and techniques of winding in real terms. Learners will be exposed to the working principles of direct current machines, armature winding and the terminals of induction motors. The procedures involved in the rewinding and transformation of a transformer will also be covered.","courseOutcomes":["Discuss the construction of DC gener...","Outline the terminal identification ...","Outline the key tools and materials ...","Analyze the theory, application and ...","Discuss the construction of DC generators","Outline the terminal identification of a DC compound motor","Outline the key tools and materials as well as the procedures to rewind the DC motor field coil","Analyze the theory, application and the two major types of armature winding","Discusses the operating principle of induction motor","Identify the terminals of a single-phase induction motor","List the requirements and procedures for rewinding ceiling and table fans","Discuss the polarity test of the induction motor","Discuss the basic working principles and the terminal identification of a transformer","Analyze the working principles, advantages and the phasing-out test of a three-phase transformer","Define the application of the dot convention","Discuss the additive and subtractive polarity in addition to the application of the right-hand thumb rule","Discuss the construction of DC gener...","Outline the terminal identification ...","Outline the key tools and materials ...","Analyze the theory, application and ...","Discuss the construction of DC generators","Outline the terminal identification of a DC compound motor","Outline the key tools and materials as well as the procedures to rewind the DC motor field coil","Analyze the theory, application and the two major types of armature winding","Discusses the operating principle of induction motor","Identify the terminals of a single-phase induction motor","List the requirements and procedures for rewinding ceiling and table fans","Discuss the polarity test of the induction motor","Discuss the basic working principles and the terminal identification of a transformer","Analyze the working principles, advantages and the phasing-out test of a three-phase transformer","Define the application of the dot convention","Discuss the additive and subtractive polarity in addition to the application of the right-hand thumb rule"],"courseDescription":"<p>This course provides learners with a solid guide to the principles and techniques of winding. Are you having difficulty understanding the construction of direct current (DC) generators? Do you want to be able to quickly identify the basic components and working principles of a DC machine? Then this course is for you! The types and circuit descriptions of DC generators will be discussed and you will also analyze the terminal identification of a DC compound motor in practical terms. Learn about some of the causes of damage to DC machines and the rewinding of field coils as a possible solution. Learners will be taught the key tools and materials as well as the procedures to rewind a DC motor field coil. Learn about the theory, application and two major types of armature winding. Study the procedures and methods for efficient rewinding of the armature coil of a DC machine.&nbsp;</p><p>Furthermore, the material discusses the operating principle of induction motors and the double field revolving theory in developing running torque. The procedure to identify the terminals of a single-phase induction motor are outlined. Study the requirements and procedures used in rewinding a split-phase type motor. Learn about the requirements and procedures for rewinding ceiling and table fans. You will also explore the principles of operations of a three-phase induction motor and the production of rotating magnetic flux by three-phase currents. The identification of the terminals of a three-phase induction motor will be explained. See the procedures required to rewind a three-phase IM single layer wound motor and a three-phase IM double layer winding motor. Learn about the polarity test of the induction motor by the search coil and the unbalanced current test methods.</p><p>Lastly, the basic working principles and the terminal identification of a transformer are covered. If you want to master rewinding the coil of a small size transformer, this course is for you. Moreso, topics such as the working principles, advantages and the phasing-out test of a three-phase transformer will be analyzed extensively. You will learn about the different methods available for transforming three-phase voltage to higher or lower three-phase voltages. Taking this course gives you insight into the application of the dot convention with reference to the input voltage polarity in the primary winding. Learn about the additive and subtractive polarity including the application of the right-hand thumb rule. This course will greatly benefit electrical engineering students and electrical technicians who have an interest in motor winding principles and techniques.</p><a href=\"https://alison.com/resume/courses/4108\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4108\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Direct Current Machines","description":"This module analyses the construction, basic components and working principles of DC generators. Learn about the causes of damages to the DC machines, the rewinding of field coils and the procedures of armature winding.","topics":["Direct Current Machines - Learning Outcomes","Construction of DC Generators","Rewinding of the Field Coil of DC Motors","Armature Winding","Direct Current Machines - Lesson Summary","Direct Current Machines - Assessment"]},{"name":"Module","details":"Single-Phase Induction Motor","description":"In this module, you will discuss the operating principle and terminals of a single-phase induction motor. Learn about the procedures used in rewinding a Split Phase Type Motor and the production of rotating magnetic flux by three-phase currents. Study the rewinding of a three-phase IM single and double layer wound motor.","topics":["Single-Phase Induction Motor - Learning Outcomes","Principle of Operation","Rewinding of a Split-Phase Type Motor","Three-Phase Induction Motor","Rewinding of Single Layer Wound Motor","Single-Phase Induction Motor - Lesson Summary","Single-Phase Induction Motor - Assessment"]},{"name":"Module","details":"Basics of Transformers","description":"This module analyses the working principles, rewinding, and terminal identification of a transformer. This module also discusses the methods available for transforming three-phase voltage and the application of the dot convention.","topics":["Basics of Transformers - Learning Outcomes","Basic Principle of Transformers","Three-Phase Transformers","Polarity of Windings - Dot Convention","Basics of Transformers - Lesson Summary","Basics of Transformers - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Principles of Winding - Course Assessment"]}]}