{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2879","title":"Principles of Industrial Engineering - Forecasting","totalEnrolled":"601","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to apply the useful forecasting techniques of industrial engineering as taught in this free online course.","description":"Forecasting is a critical keystone of industrial engineering because, without it, no planning can proceed. In this free online course, you will be taught the techniques, methods and applications of forecasting in operations management. Go on to discover the components of demands, forecasting errors, the importance of a tracking signal, the seasonality factor for forecasting and the use of the correlation coefficient in calculating predictions.","courseOutcomes":["Define the role of forecasting in in...","Explain the principles, techniques a...","Outline the methods used for forecas...","Explain the quantitative methods of ...","Define the role of forecasting in industrial engineering","Explain the principles, techniques and applications of forecasting in operational management","Outline the methods used for forecasting possible demands and their applications","Explain the quantitative methods of forecasting","Identify the components of demand","Explain forecasts using the exponential smoothing method","Analyze the methods of forecasting using the seasonality factor","Discuss how to relate independent variables with dependent variables","Define the role of forecasting in in...","Explain the principles, techniques a...","Outline the methods used for forecas...","Explain the quantitative methods of ...","Define the role of forecasting in industrial engineering","Explain the principles, techniques and applications of forecasting in operational management","Outline the methods used for forecasting possible demands and their applications","Explain the quantitative methods of forecasting","Identify the components of demand","Explain forecasts using the exponential smoothing method","Analyze the methods of forecasting using the seasonality factor","Discuss how to relate independent variables with dependent variables"],"courseDescription":"<p>What are the principles and techniques of forecasting and why is it such a vital determinant factor in operational management and industrial engineering? This course breaks down the importance and applications of different forecasting techniques, as well as their advantages and disadvantages in different scenarios.</p><p>The material explains the quantitative methods of forecasting and identifies the components of demand as well as its determinant factors. It also explains the exponential smoothing method and the calculation of the forecast considering the known trends. You will be taught the functions of the ‘forecasting error’ and ‘tracking signal’, and the simple moving and weighted covering averages will also be analyzed. Lastly, you will learn the method and procedural analysis of forecasting considering seasonality as well as how to relate independent variables to dependent variables.</p><p>Learn about the approaches used by the casual method of forecasting as well as the calculation of tracking signals using correlation coefficient and the track effectiveness of the tracking signal methodology. By registering for this course now, you can boost your knowledge of forecasting today and go on to have a positive impact on overall operational management.</p><a href=\"https://alison.com/resume/courses/2879\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2879\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Forecasting","description":"In this module, the principles and techniques of Forecasting, as well as its role as a determinant factor, will be analyzed. This module will also introduce you to the methods of forecasting and their applications. Identification of the components of demand, forecasting error, and tracking signal will also be covered in this module.","topics":["Forecasting - Learning Outcomes","Introduction to Forecasting","Basics of Forecasting Methods","Quantitative Methods and Approaches","Exponential Smoothing Method","Seasonality Factors and Forecasting Error","Casual and Tracking Signal Method","Forecasting - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Forecasting - Final Assessment"]}]}