{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2083","title":"Productivity and Waste Management - Lean and Environmental Perspectives","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course learn about waste and productivity from environmental and lean perspectives.","description":"The free online course on Productivity and Waste Management explains waste with respect to lean and the environment. Different types of lean wastes and environmental wastes are explained, along with their impact on productivity and the environment. Learn about the effective tools used in lean such as 5S, A3 tool, and Gemba to manage lean wastes, as well as the use of 3R, zero waste system & management of land fills for environmental wastes.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course Productivity and Waste Management - Lean and Environmental Perspectives, you will learn about waste and productivity in terms of two popular concepts i.e. lean and environmental perspectives. The course discusses the types of environmental wastes, the types of lean wastes, sub-classification within lean waste which is Muda, and it also discusses TIMWOODs philosophy.&nbsp;</p><p>The course begins with an introduction to waste related to lean and environmental considerations. Then it discusses the environmental wastes and lean deviations. The subsequent topics discuss lean wastes as Muda. You'll learn about environmental wastes such as solid and liquid waste and other important types. Next, it discusses the importance of waste management along with the tools employed within lean and environmental systems.</p><p>Whether you work in Operational Excellence or an Environmental department, or you're considering working in any of the two as a future career, or if you’re a professional seeking to learn about the different waste management tools, then this clear and simple course is for you. Understanding these core concepts is of vital importance for all professionals working in any industry. So, start this course today and in just 2 hours you’ll learn valuable skills related to lean and environmental wastes.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}