{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3146","title":"Propulsion Systems and Load Lines","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains marine propulsion systems and load lines and covers the Voith-Schneider system.","description":"The course on propulsion systems and load lines teaches you about power transmissions used on ships, as well as the construction features of rudders and propellers. Discover the working principles of the Voith-Schneider system and Azimuthing propulsion. In addition, this course will help you understand the functions of the ship's load lines. Start this course today to improve your understanding of propulsion systems and load lines.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>There are several marine propulsion systems. This course on propulsion systems and load lines introduces you to the definition and elements of a propulsion system, which include: propellers, drive shafts, clutches and the steering gear. We will teach you about the division of tug steering and propulsion systems: power source, power transfer and control system, thrust creation and directional control mechanism. Become familiar with the characteristics of tugs and the operations of the tug’s horsepower. Learn about the application of high-speed diesel and the use of direct drive engines in deep-sea merchant marine vessels. We will cover the operations of the main propulsion slow-speed diesel engine, along with the components of a transmission system. Investigate the components of the stern tube and the constant airflow type of stern tubes. We outline the purpose of the hydrodynamic drivers and the two kinds of hydrodynamic drivers. We will identify the driver rotating around a horizontal axis (propellers) and which driver rotates around a vertical axis (Voith-Schneider cycloidal).</p><p>This course then demonstrates the features, operations, working principles and designs of propellers. Study the historical background, structure and functions of propulsion nozzles and the steerable nozzle type. Recognise rudders’ functions and constructional features, including rudder stock, rudder post, pintle, rudder carrier and gudgeons. Learn about the balanced, unbalanced and semi-balanced rudders, along with essential factors to consider when inspecting a rudder during drydock. We will also compare the characteristics of propeller blades from 3, 4 and 5 and the classification of blades based on the solid fixed-pitch and constructional-pitch propellers. We will guide you in distinguishing the operations of the right-handed and left-handed propellers. We define terms related to propellers and the formulas for propeller pitch, propeller slip, efficiency and pitch ratio. We will use formulas to calculate the propeller’s pitch by measuring drydock, disc area, blade area ratio, wake and the true slope. This course will then teach you about the construction and operations of a bow thruster, along with the process of pitch control by thruster blades.</p><p>The Voith-Schneider Propeller (VSP) is a unique propulsion system. This course will help you become familiar with this system’s functions, mechanisms and working principles. You will analyse the controls in the Voith-Schneider tractor tugs before studying the operations and mechanisms of the Azimuthing propulsion drives and its functions in stern-drive tugs. We will also discuss the salient features of the International Articles of the Consolidated Load Line Convention of 2018. Explore the purpose of the ship’s load line, the deck line, freeboard and buoyancy and scrutinise the margin line, forward and aft perpendicular, sub-divisional load line, the factor of sub-division, sheer and bow height. Learn the characteristics and differences between ‘type B’ and ‘type B‘ ships, as well as the concept of a ship’s ‘tonnage’. This course will significantly appeal to students, researchers and those interested in propulsion systems and load lines. So register for this course and start today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}