{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4122","title":"Protection and Control: High-Voltage Power Circuits","totalEnrolled":"2,968","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to keep high-voltage power circuits protected so that they operate optimally.","description":"Delivery of electrical energy to the end-user is a critical service and must be appropriately managed. Discover how to set up power stations, configure switches correctly, the elements of system protection, relay schemes, breaker control and electrical faults with this course. In addition, you will learn about electrical system structure, the different types of fuses, and how transformers are configured, connected and cooled.","courseOutcomes":["Outline the elements of a substation...","Explain high-voltage switch configur...","Describe protection relay schemes, t...","Analyse electrical devices and basic...","Outline the elements of a substation","Explain high-voltage switch configuration and elements of system protection and control","Describe protection relay schemes, the failure of protective schemes and types of electrical faults","Analyse electrical devices and basic electrical system structure","Discuss different types of transformers and how they are configured, connected and cooled","Analyse the functions of surge protective equipment","Discuss the operation of different types of fuses","Describe the operation of different types of circuit breakers, breaker control and auto reclosing","Discuss instantaneous overcurrent protection and timed overcurrent protection","Explain differential protection and impedance relaying","Outline the elements of a substation...","Explain high-voltage switch configur...","Describe protection relay schemes, t...","Analyse electrical devices and basic...","Outline the elements of a substation","Explain high-voltage switch configuration and elements of system protection and control","Describe protection relay schemes, the failure of protective schemes and types of electrical faults","Analyse electrical devices and basic electrical system structure","Discuss different types of transformers and how they are configured, connected and cooled","Analyse the functions of surge protective equipment","Discuss the operation of different types of fuses","Describe the operation of different types of circuit breakers, breaker control and auto reclosing","Discuss instantaneous overcurrent protection and timed overcurrent protection","Explain differential protection and impedance relaying"],"courseDescription":"<p>Electricity can be destructive when handled inappropriately and the importance of prioritising safety cannot be over-emphasized. This course will give you a good overview of managing electrical systems efficiently, thereby ensuring that value is delivered to the end-user safely. You begin by exploring the elements of a substation, and how they are segmented and configured for optimal operation. Supervisory control and data acquisition (SCADA) is essential to the modern-day operation of power substations, so you will learn how it works. You will be shown the open profile for air-insulated switchgear (AIS) and enclosed or gas-insulated switchgear (GIS) under high voltage switch configuration. Investigate the effect of cost, reliability, flexibility, and maintainability for optimal selection and setup. Then xxplore system protection and control elements, including breakers, switches, battery banks and relays.&nbsp;</p><p>The purpose of protective relaying is to ensure that faulty power equipment is removed from service quickly to minimise equipment damage, limit the effects of disturbance and maintain the stability of systems. This course will take you through an extensive study of relaying in general. You will examine the purpose of protective relaying, protection requirements for systems, failure of protection schemes, fault characteristics and types of electrical faults. You will also study basic electrical system structure, devices in a power system, instrument transformers, potential transformers and polarity. Three-phase power distribution has become standard, and knowing how it works will help you understand its advantages over single-phase power. You will discover what causes the failure of high voltage transformers, as well as learn about transformer construction review, voltage classification and cooling. Surge protectors guard against voltage spikes in electrical equipment. In contrast, circuit breakers keep wires from catching fire due to an overload of amps (amount of electrical current). In this light, you will review surge protective equipment and types of breakers and their characteristics. Study the schematics and general requirements of control circuits. This includes control closing, control tripping, trip-free, anti-pump and reliability in breaker control circuits.&nbsp;</p><p>The next step up from protection by fuses and involving relays is the instantaneous and time overcurrent protection. You will learn what differentiates the two and where you can best apply them in the power grid. The final stage of the delivery of electricity to the end-user is distribution. Understand how distribution networks operate and the schematics of low voltage feeder protection. You will also learn about the causes of feeder faults and protection essentials for transmission lines such as graded overcurrent protection, differential protection and more. This course examines the different aspects of impedance relaying, the mho type distance relay, impedance zone tripping and permissive overreach transfer trip (POTT). Finally, look at the working of some relays that are in use across different utilities. Empower yourself by enrolling in this course now.</p><a href=\"https://alison.com/resume/courses/4122\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4122\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Power Systems Operation","description":"In this module, you will be introduced to the layout of the elements of a substation. You will study high voltage switch configuration, elements of protection and control, protection of relay schemes and faults that cause the failure of protective schemes. You will also learn about electrical system structure and relaying terminology.","topics":["Power Systems Operation - Learning Outcomes","Overview of Stations","Protective Relaying","Transformers","Power Systems Operation - Lesson Summary"]},{"name":"Module","details":"Power System Protection","description":"Safety of lives and property is key in power systems operation. In this module, you will study the functions of surge protective equipment, the operation of fuses, circuit breakers, breaker control and auto reclosing. You will also learn about instantaneous overcurrent protection, timed overcurrent protection, differential protection and relaying.","topics":["Power System Protection - Learning Outcomes","Surge Protection","High Voltage Breakers and Auto Reclosing","Overcurrent Protection","Differential Protection","Relay Operation","Power System Protection - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Protection and Control: High-Voltage Power Circuits - Course Assessment"]}]}