{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3714","title":"Repair your Electronic Projects with Ease","totalEnrolled":"4,183","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will show you how to repair your electronic projects with expertise and efficiency.","description":"Would you like to learn to repair your electronic projects with minimal effort? Then look no further than this free online course. We will start by exploring passive and active electronic components, along with electrical components. We will explain laboratory experiments and practical current measurement, and introduce you to capacitors and inductors. And don't forget the key theoretical foundations of Ohm's Law, diodes and transistors.","courseOutcomes":["Summarise common electronic and elec...","Discuss the electronic components in...","List troubleshooting safety concerns...","Compare direct current to alternatin...","Summarise common electronic and electrical components","Discuss the electronic components in an electronic project","List troubleshooting safety concerns","Compare direct current to alternating current","Describe voltage measurement","Explain practical aspects of current measurement","Discuss the experimental testing of resistors","Recognize what a resistor does","Explain power dissipation","Describe the testing of capacitors","Contrast inductors to transistors","Distinguish Zener diode from Light-emitting diode","Summarise common electronic and elec...","Discuss the electronic components in...","List troubleshooting safety concerns...","Compare direct current to alternatin...","Summarise common electronic and electrical components","Discuss the electronic components in an electronic project","List troubleshooting safety concerns","Compare direct current to alternating current","Describe voltage measurement","Explain practical aspects of current measurement","Discuss the experimental testing of resistors","Recognize what a resistor does","Explain power dissipation","Describe the testing of capacitors","Contrast inductors to transistors","Distinguish Zener diode from Light-emitting diode"],"courseDescription":"<p>Are you working on electronic projects? Do you find it difficult to repair these electronic projects? If you answered 'yes' to any of these questions, this is the right course for you. We have specifically designed this course to improve your electronic projects dramatically. As repairing electronic projects starts with troubleshooting, we will first show you everything you need to know as a troubleshooter by emphasizing electronics. Following circuit analysis and the essential electrical and electronic components, we will take you through the necessary tools for repair and maintenance procedures. The video-based lessons will cover wiring tools, multimeters, screwdrivers and many other instruments used in electronic projects. Likewise, you will discuss the various electronic components. Addressing laboratory equipment's effective and efficient working conditions, we will help you understand features such as servicing, troubleshooting, repairing, and maintenance. It is worth noting that maintenance is a continuous process. This is why we study both hardware and software in this course. Looking at the hardware parts of the equipment, we will uncover the four main steps that you will need to follow when servicing your project.&nbsp;</p><p>Delving deeper into the course, we will explore the free-flowing of electrons, referred to as current. We will discuss concepts such as voltage and resistance, direct current, alternating current, and basic circuits. For instance, you will better understand that voltage is the force pushing electrons through a wire. And when measuring voltage, you place the meter probes across the voltage source. Conversely, resistance impedes the free flow of electrons through a conductor, and all materials exhibit some resistance - even the best conductors. The course will explore the direct current, the alternating current, and measurement practice necessary to repair your electronic projects. Resistors are parts of electronic projects. There are many resistors, and their parameters include resistance value in Ohms and power handling capabilities in watts. More importantly, you will also be taught circuit diagram basics and symbols along with mixing theory with practice.</p><p>Lastly, we'll take a look at other devices, capacitors and inductors. A capacitor possesses two conductive plates separated by a non-conductive material allowing it to store energy. We will explain why most electronic devices use capacitors with a tiny fraction of a farad, the unit of capacitance. An inductor is a coil of wire through which electrons move, and energy is stored in the resulting magnetic field. Whereas inductors temporarily store energy in a magnetic field, capacitors store energy in an electric field. A \"henry\" is a measure of the intensity of the magnetic field that is produced. The amount of inductance is influenced by several factors. This comprehensive course will equip you with valuable knowledge, enabling you to repair your electronic projects quickly. Students specializing in electronics will find the course exciting. If you're a technician in electronics, you will find this course very useful to improve your knowledge and be far more efficient. Start this course today and take your understanding of electronics to the next level.</p><a href=\"https://alison.com/resume/courses/3714\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3714\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Troubleshooting","description":"This module is about troubleshooting. The various tools you need to become a troubleshooter will be unravelled. You will be taught passive and active electronic components, along with electrical components. You will also be taught how to test transformers and resistance","topics":["Troubleshooting – Learning Outcomes","Introduction","Build and Test Circuits","Troubleshooting","Tools Needed for Troubleshooting","Electronic Components","Testing Devices","Safety and Concerns in Troubleshooting","Troubleshooting – Lesson Summary"]},{"name":"Module","details":"Electronic Components","description":"In this module, you will be introduced to electronic components, along with the digital multimeter. The different circuits and the voltage measurements are disclosed. Explanations are provided as to laboratory experiments and practical current measurements. You will learn about resistors and colour banding.","topics":["Electronic Components – Learning Outcomes","Voltage and Currents","Digital Multimeters","Measuring Currents","Measuring Resistance","Electronic Components – Lesson Summary"]},{"name":"Module","details":"Testing Various Components","description":"In this module, you will be introduced to resistors, along with the power dissipation and Ohm’s law. You will be taught the behaviour and testing of capacitors. You will also be taught about inductors and how to test and measure coils. An introduction to diodes, transistors and their basic types will be addressed.","topics":["Testing Various Components – Learning Outcomes","Using Resistors","Introducing Capacitors","Introduction to Inductors","Introduction to Transistors","Testing Various Components – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Repair your Electronic Projects with Ease - Course Assessment"]}]}