{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4552","title":"Revit 2017 for MEP Engineers (Introduction)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will walk you through the process of designing complex building systems using Revit software.","description":"Revit is a design and documentation platform that supports the design, drawings and schedules required for building information modelling (BIM) and allows coordination among all team members. To quantify and analyse the components and materials utilised in a project, Revit provides plans, quantities and materials takeoffs. Use the suggestions in this course to your advantage and learn how to use Revit effectively.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course helps mechanical, electrical and plumbing engineers to get up-to-speed with Revit software. It starts by introducing the Revit and building information modelling (BIM) technology. First, you will explore the steps to install the program. Next, you will discover how to open the software and recognise the user interface. This modelling software enables us to control the ‘saving’ reminder alert, assign default view discipline to ‘display’, select the ‘discipline’ tool to display in the ribbon, apply colour theme and customise the keyboard shortcuts. It is also possible to control the working of a double-click mouse, improve the performance of graphics and place the location of ready-made templates and ‘library’ files. All of these are available in the ‘options’ dialogue and you will discover how to manage and use them properly. Finally, investigate the different methods of opening a standalone file and the option for specifying starting view at the ‘project’ user interface.</p><p>The following section examines the various elements in Revit. You will discover the three types of elements in the project and how to make relations between them using constraints. Every feature you place in a drawing has two sets of properties that control their appearance and behaviour and you will explore how to use them properly. Next, we explain the methods of selecting elements in a linked model and how to prevent them from moving. In addition, we discuss the ways of choosing them by face, using a filter. One of the most important keys on the keyboard is the ‘tab’ key and you will use it to speed up work on a project. Following that, learn how to create, save and modify a selection.</p><p>Become familiar with the creating and editing tools in Revit software to navigate a model, orient a 3D view, control view, create and manipulate elements. Use the ‘modify’ tools to adjust and manipulate elements in the drawing area and achieve the desired design for the building model. Many of these tools are available on the ‘modify’ tab of the ribbon, including the ‘move’, ‘copy’, ‘delete’, ‘trim’ and ‘mirror’ tool, which we will describe. Learn how to set up a project by adding project information and linking it to a ‘host’ model. Discover how to copy and monitor levels to track any changes in the model and create ‘floor’ and ‘ceiling plan’ views. We finally end by teaching you to create new views using three types of duplicating options. Sign up for this course right away and put the knowledge you acquire to work for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}