{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2848","title":"Robotics and the Geometry of Motion","totalEnrolled":"873","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how the geometry of motion and kinematicsare used in industrial robotics in this free online course.","description":"This free online course covers robotics and the geometry of motion. Starting with direct forward kinematics, inverse kinematics problems will be also addressed, along with specific examples. The course highlights differential motions and statics, allowing you to learn about the calculations of the Jacobian matrix. You will also learn about the manipulator Jacobian, analyzing the computational method, along with the related algorithm.","courseOutcomes":["Discuss forward kinematics...","Recognise a six-articulated arm...","Contrast alpha two arm to a six-axis...","Discuss inverse kinematics...","Discuss forward kinematics","Recognise a six-articulated arm","Contrast alpha two arm to a six-axis articulated arm","Discuss inverse kinematics","Explain the solvability of a manipulator","List the necessary condition for the solvability of a manipulator","Define differential kinematics","Contrast tool configuration Jacobian and manipulator Jacobian","Compare boundary singularity to interior singularity","Discuss the computational method for Jacobian","Explain the static analysis of the manipulator Jacobian","Contrast force mapping to singularities","Discuss forward kinematics...","Recognise a six-articulated arm...","Contrast alpha two arm to a six-axis...","Discuss inverse kinematics...","Discuss forward kinematics","Recognise a six-articulated arm","Contrast alpha two arm to a six-axis articulated arm","Discuss inverse kinematics","Explain the solvability of a manipulator","List the necessary condition for the solvability of a manipulator","Define differential kinematics","Contrast tool configuration Jacobian and manipulator Jacobian","Compare boundary singularity to interior singularity","Discuss the computational method for Jacobian","Explain the static analysis of the manipulator Jacobian","Contrast force mapping to singularities"],"courseDescription":"<p>This course is about understanding robotics and the geometry of motion, and covers kinematics and differential relations. You will start the course by learning how a homogeneous matrix maps frame K coordinates to (k-1) coordinates, along with the four fundamental operations that are involved in making (k-1) frame coincident with k frame. You will also learn how, given the values of joint variables, you can solve for the end-effector location in the Cartesian space of the robot base frame. You will be taught how to find the position and the orientation of the tool at the soft home position of, for instance, the six-axis articulated arm, Intelledex 660T, which involves three steps. Consider how to assign the coordinate frame, calculate the DH (Diffie-Helmann) parameters and, finally, find the arm matrix. The course will cover the formulation of manipulator tasks whether a systematic closed form solution applicable to robots in general is available.</p><p>Next, you will learn how to solve a manipulator if all the sets of joint variables can be found corresponding to a given end-effector location, subject to three conditions. Analyze how these conditions relate to tool points within the workspace, what values a number has to have to have any arbitrary orientation of a tool, and how the status of joint limitations is important. You will be taught the complex differences between a closed form solution and a unique solution, as well as the difference mathematical approaches for deriving closed form solutions.</p><p>Finally, you will learn that the robot path planning problem is formulated in a tool-configuration space, and the robot motion is controlled at the joint space. What do you need to calculate the Jacobian? What is one of potential problems for solving for joint space velocity? When does a Jacobian lose rank in joint space? You will also be taught why the interior singularity is potentially troublesome and how it is formed. Students of mechanical engineering, especially those specializing in robotics, will find this course particularly interesting. Start this course how and better your understanding of robotics and the geometry of motion today.</p><a href=\"https://alison.com/resume/courses/2848\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2848\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Kinematics","description":"This module is about Kinematics. The direct forward kinematics introduces the problem of the case of the Alpha II Arm and that of six-axis articulated Arm. You will learn how to cross-check to make sure that the formulation you got for the forward kinematics is correct. The inverse kinematics problems will also be addressed. Specific examples will be given, along with the most commonly used equations and their solutions.","topics":["Kinematics – Learning Outcomes","Forward Kinematics","Forward Kinematics - Examples","Inverse Kinematics - Concept","Inverse Kinematics - Example","Kinematics – Lesson Summary"]},{"name":"Module","details":"Differential Relations","description":"This module covers differential motions and statics, allowing you to learn about the calculation of the Jacobean. You will also learn about the singularities, along with the generalized inverses. The module addresses the Manipulator Jacobian, highlighting the computational method, along with the related algorithm. The numerical computation of the Jacobian will be unravelled.","topics":["Differential Relations – Learning Outcomes","Differential Motions and Statics","Manipulator Jacobian and Statics","Differential Relations – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Robotics and the Geometry of Motion - Course Assessment"]}]}