{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4209","title":"Rotating Machinery","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the configuration and working principles of AC and DC in rotating electrical machines in this free online course.","description":"Have you ever considered what a rotating machine is made of and how it works? This course will help you understand the complex construction of rotating machines as well as their working principles. You will learn about the different types of single- and three-phase AC and DC machines and their sub-types. You will also gain an understanding of synchronous motors and generators, and the use of several generators in large power systems.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Electrical machines are devices that convert mechanical energy to electrical energy and vice versa. This course starts off with an introduction to electrical machinery principles, explaining various terms used in this area of electrical engineering. The fundamental concept of all generators and motors is the fact that a current flowing in a wire will produce a magnetic field around the wire. You will be taught the construction and working of generators and motors as well as the application of the two main types of induction motor rotors. A magnetic field causes a loop of wire to rotate or twist depending upon the angle of the applied force and the length of the wire. See how to calculate this twisting effect, called torque, and understand which factors influence torque and how to solve related mathematical problems. You will also be shown the difference between AC (alternating current) and DC (direct current) machines and how to solve some common problems that are faced by them.</p><p>There are two main classes of AC machines: synchronous and induction machines. You will be shown the difference between the two, their respective configurations, sources of power, workings and their sub-types. Single-phase induction motors are classified and named according to the method employed to make them self-starting. Since single-phase induction motors suffer from problems at starting, you will learn how to make a single-phase induction motor self-start by adding extra windings to the motor rotor. Three-phase induction motors are used extensively in industrial and commercial applications and are simple, rugged, low priced and easy to maintain. You will study their advantages, drawbacks, types, how they work and how to perform flux analysis on these motors. Synchronous generator motors are those AC motors in which the movement of the armature is synchronised with the input current. You will learn about their sources of energy, generation of magnetic flux and their overall working as part of a power system, gaining an understanding of the parallel operation of synchronous generators and the benefits of using several generators in a power system.</p><p>This course is designed for electrical engineers, students and professionals who work in the power sector. This is also a refresher course for people who want to review and upgrade their knowledge of electrical rotating machines. This course contains lectures on up-to-date industrial knowledge explained with the help of colourful graphics and schematic diagrams. Every attempt has been taken to keep the calculations as easy as possible, with thorough explanations for each. Grab the opportunity to sharpen your analytical and problem-solving skills in the areas of generators and motors - join the course now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}