{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3787","title":"Safety in Construction: Fall Hazards","totalEnrolled":"2,473","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"See how safety guidelines guard against major hazards in construction in this free online course that focuses on falls.","description":"The complexities of construction work demand sustained attention to safety. Engineers, construction professionals and amateurs planning on building something can benefit from this free online course as it lays out protocols to promote safety in construction work. We emphasize fall hazards, one of the major causes of worksite fatalities, and examine the specific dangers facing workers in trenches and tunnels.","courseOutcomes":["Describe the anatomy of a fall and d...","State the hazards related to fatal f...","Compare ‘fall restraint systems’ and...","Identify the steps of concreting ope...","Describe the anatomy of a fall and differentiate between their two types","State the hazards related to fatal falls in construction work","Compare ‘fall restraint systems’ and ‘fall arrest systems’","Identify the steps of concreting operations","List the precautions to be taken before carrying out demolitions","Explain cave-ins and the precautions that can minimize them","Outline the hazards of working in a confined space","Describe the anatomy of a fall and d...","State the hazards related to fatal f...","Compare ‘fall restraint systems’ and...","Identify the steps of concreting ope...","Describe the anatomy of a fall and differentiate between their two types","State the hazards related to fatal falls in construction work","Compare ‘fall restraint systems’ and ‘fall arrest systems’","Identify the steps of concreting operations","List the precautions to be taken before carrying out demolitions","Explain cave-ins and the precautions that can minimize them","Outline the hazards of working in a confined space"],"courseDescription":"<p>Safety is crucial to everyone working in construction, be they professional or amateur. This free online course covers the major hazards workers face while carrying out specific construction jobs, beginning with one of the leading causes of worksite fatality: falls. We study the anatomy of falls and consider how they can be prevented through ‘fall restraint systems’ and ‘fall arrest systems’. We then discuss the hazards associated with two common construction jobs: concreting and demolition. Concreting dangers can be minimized by taking specific precautionary measures when erecting formwork. Demolitions are inherently dangerous and require proper planning to ensure the safety and protection of workers and the general public. We also highlight the proper procedures for the removal of debris and other materials.</p><p>The course then moves on to the safety concerns associated with the construction of trenches and tunnels. Dangers associated with excavation work like cave-ins demand their own safety procedures and we explain how they combine with specialized equipment to guard against these lethal hazards. We discuss the different methodologies available for tunnel construction work and the safety systems they require to preserve safety. We then introduce you to the Occupational Safety and Health Administration (OSHA) guidelines for carrying out specific construction tasks in the United States.</p><p>We then provide and evaluate practical examples of actual construction work to reinforce lessons learnt throughout the course. As populations grow, so does the demand for construction and for competent professionals to complete it safely. Innovation, creativity and technological advances are increasing the dynamism of projects and thus sharpening the need for safety. Whether you are attempting your own home renovation or looking to break into the construction industry, the safety skills you acquire in this course are essential for anyone completing a project as they can help to keep you and your peers safe.</p><a href=\"https://alison.com/resume/courses/3787\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3787\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fall Hazards","description":"This module will be an introduction to fatal falls in construction. You will learn about fall hazards when carrying out concreting, demolitions, and general construction work. Also, you will examine practical examples that apply safety against these hazards.","topics":["Fall Hazards - Learning Outcomes","Introduction to Fatal Falls","Fall Hazards in Concreting","Fall Hazard in Demolition Work","Safety in Demolition Work - Practical examples","Fall Hazards - Lesson Summary"]},{"name":"Module","details":"Trench and Tunnel Hazards","description":"This module will discuss trench cave-ins and tunneling safety. You will learn the hazards of excavations and the procedures for protection against cave-ins. Study the different methodologies for creating tunnels and the standard operating procedures for ensuring safety when working in confined spaces.","topics":["Trench and Tunnel Hazards - Learning outcomes","Trench Cave-ins","Tunneling Safety","Trenches and Tunnel Hazards - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Safety in Construction: Fall Hazards - Course Assessment"]}]}