{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3051","title":"Diploma in Sensory Virtual Reality","totalEnrolled":"833","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore new worlds as we explain how sensory experiences are designed for virtual reality in this free online course.","description":"This free online course delves into sensory experiences in virtual reality (VR). We show you how audio signals can be manipulated to mimic acoustic behavior encountered in the real world and how the sense of touch can be engaged to enhance the experience of interacting with onscreen interfaces. We also introduce you to VR interfaces, the evaluation of VR systems and experimental designs that can create an immersive sense of realism.","courseOutcomes":["Define ‘haptics’...","Explain human haptics...","Discuss the use of kinesthetic devic...","Outline the effect of haptic interfa...","Define ‘haptics’","Explain human haptics","Discuss the use of kinesthetic devices and systems","Outline the effect of haptic interfaces on real and virtual objects","Break down the concept of audio in VR","Upack auditory perception","Analyze the concept of sound rendering","Define ‘interfaces’","Evaluate VR systems","Demonstrate how to create realism","Discuss the concepts of manipulation and locomotion","Define ‘haptics’...","Explain human haptics...","Discuss the use of kinesthetic devic...","Outline the effect of haptic interfa...","Define ‘haptics’","Explain human haptics","Discuss the use of kinesthetic devices and systems","Outline the effect of haptic interfaces on real and virtual objects","Break down the concept of audio in VR","Upack auditory perception","Analyze the concept of sound rendering","Define ‘interfaces’","Evaluate VR systems","Demonstrate how to create realism","Discuss the concepts of manipulation and locomotion"],"courseDescription":"<p>Vision is a powerful sense and displays provide stimuli for the eyes so this course investigates their connection to the human visual system. We also cover haptics, the sense of touch that helps humans intuitively experience their immediate environment and use tools. We study the sense of touch as part of the body’s somatosensory system as we combine physiology, perception and engineering technology to create immersive virtual realities. This course teaches you the basic principles behind haptic rendering, tactile receptor types, the sensitivity threshold of mechanoreceptors and the kinesthetic system. We also show you various haptic devices that enable manual interaction with virtual environments while we explain how haptic feedback technology works.</p><p>The course then moves on to sound sources and attenuation. Developers of VR systems tend to focus mainly on vision because it is our strongest sense but the audio component of VR is powerful and technology that can bring high fidelity audio experiences into VR exists and sound is often crucial to art, entertainment and communication. This course unpacks the physics of sound in terms of waves, propagation and frequency analysis as hearing is an important sense for VR. We examine the physiology of human hearing and discuss the parts of the human ear and their function to help you understand auditory rendering, which can produce sounds synthetically from models or by reproducing captured sounds.</p><p>We then take a close look at VR systems and consider questions such as: ‘Which headset is better?’, ‘Which VR experience is more comfortable over a long period of time?’, ‘How many fields of view is enough?’ and ‘What is the most appropriate interaction mechanism?'. Engineers and developers crave answers to such questions but are hindered by the ways that human physiology and perception interact with engineered systems. We debate these questions and show you examples of perceptual training to demonstrate how you can create an experimental design to achieve realism. We introduce you to general motor learning and control, including manipulation, locomotion and ways in which users may interact with other objects in the virtual world. A background in computer science, electrical/mechanical engineering, neuroscience and psychology would be useful coming into this course. This course offers great opportunities to those interested in creating their own VR system or who want to learn how this cutting-edge technology creates compelling virtual experiences. VR could well be the ‘next Big Thing’ in terms of gaming, storytelling and education so sign up to ride the crest of the new wave.</p><a href=\"https://alison.com/resume/courses/3051\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3051\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Haptics","description":"In this module, you will learn about haptics. This module covers touch, or more generally, the somatosensory system. This includes physiology, perception and engineering technology that stimulates the somatosensory system. You will be taught tactile receptor types, sensitivity threshold of mechanoreceptors and the kinesthetic system. Furthermore, you will be shown various haptic devices that enable manual interaction with virtual environments and how the haptic feedback technology works.","topics":["Haptics - Learning Outcomes","Haptics","Haptic Devices and Interfaces","Haptics - Lesson Summary"]},{"name":"Module","details":"Audio for VR","description":"This module will cover audio for VR. You will be taught the physics of sound in terms of waves, propagation and frequency analysis. Furthermore, you will be shown the parts of the human ear and their function. After this, learners will gain an understanding of the concept of auditory perception. You will learn about auditory rendering, which can produce sounds synthetically from models or reproduce captured sounds.","topics":["Audio for VR - Learning Outcomes","Audio","Audio for VR - Lesson Summary"]},{"name":"Module","details":"Interfaces for VR","description":"In this module, you will be introduced to interfaces for VR and the evaluation of VR systems. You will be shown examples of perceptual training and how you can carry out an experimental design to achieve realism. You will be further introduced to general motor learning and control concepts. You will be taught manipulation and locomotion and ways in which users may interact with other objects in the virtual world.","topics":["Interfaces for VR - Learning Outcomes","Interfaces","Manipulation and Locomotion","Interfaces for VR - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Sensory Virtual Reality - Course Assessment"]}]}