{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3281","title":"Shipboard Safety - General Safety and Safe Working Practices","totalEnrolled":"1,381","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain insight into safe working practices and general safety to prevent shipboard hazards with this free online course.","description":"Shipboard safety is essential at sea to prevent loss and damage. This course on general safety and safe working practices comprehensively evaluates the different hazardous areas in ships carrying cargo, crew and passengers. It provides references to adopted conventions for the general safety of ships against possible hazards that may arise before, during and after ship voyages. Register for this course today and begin learning!","courseOutcomes":["Explain the importance of adhering t...","Describe different hazardous areas i...","Recall concepts of safe working prac...","Analyze the concept of job safety pl...","Explain the importance of adhering to safe working practices","Describe different hazardous areas in ships","Recall concepts of safe working practices on board ships","Analyze the concept of job safety planning and its implementation","Recognize safe lifting techniques","Outline the procedures for safe entry to an enclosed space","Identify the key concepts related to occupational safety and health on board ships","Explain international and local efforts designed for the protection of seafarer well-being following MLC 2006","Explain the importance of adhering t...","Describe different hazardous areas i...","Recall concepts of safe working prac...","Analyze the concept of job safety pl...","Explain the importance of adhering to safe working practices","Describe different hazardous areas in ships","Recall concepts of safe working practices on board ships","Analyze the concept of job safety planning and its implementation","Recognize safe lifting techniques","Outline the procedures for safe entry to an enclosed space","Identify the key concepts related to occupational safety and health on board ships","Explain international and local efforts designed for the protection of seafarer well-being following MLC 2006"],"courseDescription":"<p>Shipboard safety must be a priority for everything machine-related onboard. Machines do not understand human error or negligence during operations. Machines are set and will continue operations regardless of the danger they pose to life and property. This essentially holds for all machines on and around ship vessels, making it necessary to understand the safety measures adopted by marine stakeholders. A safety mindset is thus beneficial for all crew members and we analyze the relevant conceptual frameworks to ensure shipboard safety. We deliver a comprehensive understanding of general safety and provide essential practices for working safely on various boats and ships.</p><p>This course will help marine professionals discover the most hazardous areas on board ships and gain valuable safety knowledge to avoid possible hazards. We critically analyze case studies conducted by global maritime conventions. These include cases from the highly reputable International Convention for the Safety of Life at Sea (SOLAS) and those conducted by U.S. maritime regulators. We outline some fundamental concepts surrounding novice crew and staff in the maritime sector and provide extensive information on a range of safety activities ship stakeholders undergo to maintain physical safety before, during and after ship voyages across the seas. We explore aspects relating to safety adoptions against fires, hot work and chemical hazards ever-present on board every type of watercraft.</p><p>How do you control shipboard dangers? What can you do if you get trapped in a confined space or tank? What are the chances of surviving stormy weather? We investigate these scenarios and enable you to protect yourself, those around you and the conveying ship or vessel from maritime hazards. These include those arising from improper usage of wires, fiber ropes, lifting gears and electrical equipment. The content in this course is crucial for students, logistic entrepreneurs, researchers, marine operations managers, ship crew, marine engineers and anyone seeking to learn about general shipboard safety. Register for this online course today and improve your understanding of general safety and safe working practices on board ships.</p><a href=\"https://alison.com/resume/courses/3281\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3281\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"General Safety","description":"In this module, you will learn about precautions and methods necessary for ensuring the general safety of the crew members, cargo, and ships against dangers. You will also learn about emergency procedures, hazardous areas in ships, and procedures for working on ship decks and bad weather.","topics":["General Safety - Learning Outcomes","Introduction to General Safety","Hazardous Area in Ships and Safe Working Practice","Emergency Procedures - Entering Enclosed or Confined Spaces","Lifting Heavy Loads and Handling Tools","Working on the Deck and Bad Weather","Working with Electrical Equipment","Ship Specific Hazards and Water Transportation","General Safety - Lesson Summary"]},{"name":"Module","details":"Observing Safe Working Practices","description":"In this module, you will learn about the importance of adhering to safe working practices relevant to firefighting and shipboard safety. You will also learn how best to handle shipboard hazards alongside the implementation of job safety planning.","topics":["Observing Safe Working Practices - Learning Outcomes","Introduction to Safe Working Practices","Controlling Shipboard Hazards","Electrical Hazards","Chemicals","Areas of Entrapment - Tanks and Confined Spaces","Pre-Job Safety Planning","Occupational Safety and Health Hazards","Observing Safe Working Practices - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Shipboard Safety - General Safety and Safe Working Practices - Course Assessment"]}]}