{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4207","title":"Short Circuit Analysis of a Three-Phase HV System","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to analyze short circuit fault types in high voltage three-phase systems by taking this free online course.","description":"A good understanding of the basics of short circuit analysis will enhance the performance of power systems operators at various levels. In this course, you will be taught the fundamentals of fault studies on a high voltage three-phase system. You will learn about transformers, per-unit analysis, symmetrical components and asymmetrical three-phase fault analysis. The modeling of generators, transformers and transmission lines will also be covered.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Electrical power systems are often large, complex and sophisticated, always requiring specialized knowledge to be managed properly so that they are safe and yield optimum value to the end-users. These systems, no matter how good they are, cannot function without faults occurring from time to time. It is important that technicians and engineers who operate them have a good understanding of how they are manufactured to function, what regular maintenance should be carried out on them, how different fault types manifest and how they should be managed depending on the prevailing circumstances at the time of occurrence. This course focuses on faults and you will gain an understanding of the fundamentals of short circuit analysis. In order to examine high-voltage systems, you will be taught electrical circuit fault types such as phase-to-ground, phase-to-phase, phase-to-phase-to-ground and three-phase short circuit faults. Alongside this, you will be shown what short circuits are, the need for short circuit analysis and the benefits derived from it.</p><p>Next, to analyze system faults, certain methodologies are employed. With the help of an examination of ‘per phase’ and ‘per unit’ methodologies, you will discover how system faults are analyzed with the use of symmetrical components. Manufacturers rate the equipment they produce according to their own MVA rating, specifying impedance as a percentage rather than per unit. Since their rating is in isolation (ie not connected to a system) when the equipment is eventually connected to a system it is necessary to work in another base. The course teaches you how to change bases and will examine per-unit analysis in transformers and the three-phase normalization process. Any set of asymmetrical three-phase quantities can be re-written as the sum of three symmetrical components. You will learn how to use symmetrical component equations in balanced and unbalanced systems with regard to positive, negative and zero sequences. Other properties you will study in relation to this will include the A operator, B-phase sequence and C-phase sequence.</p><p>In order to examine the asymmetrical three-phase fault analysis tool, this course shows you assumptions commonly made in three-phase fault studies and analyzes how they are applied to the different electrical fault types to derive useful equations. In power system analysis, mathematical models are a set of equations or relationships which appropriately describe the interaction between different quantities of a system. In this course, they will be used to symbolize and simulate single-line network diagrams for generators, transformers and transmission lines which are our symmetrical components of interest. Do you ever wonder why electrical faults occur? Are you curious as to the makeup of short circuits? Then this course is for you, especially maintenance personnel, electrical engineers, technologists and technicians working in the electrical power protection industry. To make the most of this course you should have a good understanding of per-unit analysis, symmetrical components, and laws and theorems related to three-phase electrical systems.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}