{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2303","title":"Soil Science and Technology - Soil Properties and Chemical Processes","totalEnrolled":"615","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about soil properties, clay mineral structure, and chemical processes in the soil from this free online course.","description":"Soil Science and Technology - Soil Properties and Chemical Processes is a free online course that enables you to understand and manage soil processes to improve soil productivity. Learn about the physical soil properties such as soil temperature and water, along with the chemical properties such as cation exchange capacity. Begin the course today and improve your knowledge of soil properties and processes today!","courseOutcomes":["Recall the indices and classes of pl...","Describe the structure and propertie...","Identify the models of water distrib...","Discuss the types of water movement ...","Recall the indices and classes of plasticity","Describe the structure and properties of water","Identify the models of water distribution","Discuss the types of water movement within the soil","Identify the processes of gaseous exchange","Indicate various processes affected by soil temperature","Identify the types of soil colloids","Describe the sources of charges in the soil","Discuss the adsorption of cations and anions to colloidal surface","Recall the indices and classes of pl...","Describe the structure and propertie...","Identify the models of water distrib...","Discuss the types of water movement ...","Recall the indices and classes of plasticity","Describe the structure and properties of water","Identify the models of water distribution","Discuss the types of water movement within the soil","Identify the processes of gaseous exchange","Indicate various processes affected by soil temperature","Identify the types of soil colloids","Describe the sources of charges in the soil","Discuss the adsorption of cations and anions to colloidal surface"],"courseDescription":"<p>The chemical and physical properties of the soil are important to soil fertility, plant growth, and the sustainable use of soil. Soil Science and Technology - Soil Properties and Chemical Processes is the second in a suite of free online courses that provides a comprehensive guide to essential soil properties. This course begins with a discussion on soil-water interactions and the method of measuring soil water content.</p><p>Next, you will study the technicalities of water movement within the soil as well as the factors affecting available water content. You will also learn about the processes of gaseous exchange in soil aeration and the effects of soil temperature. Then, you will take a look into soil colloids and silicate clays, along with the mineral structure of clay minerals. Finally, you will discuss x-ray diffraction analysis and the elements of Cation Exchange Capacity (CEC).</p><p>This free online course provides you with expert knowledge on the physical and chemical properties of the soil as well as important processes necessary for soil functions. This course will be of great interest to students, researchers, agriculturists, and anyone with an interest in understanding soil mechanisms as well as improving soil productivity. Begin this course today and improve your knowledge of managing soil properties and chemical processes.</p><a href=\"https://alison.com/resume/courses/2303\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2303\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Soil Consistency and Soil Water","description":"Learn about important aspects of soil consistency and soil water from this module. You will get to study plasticity indices, soil-water interactions, and various methods for measuring soil water content.","topics":["Soil Consistency and Soil Water - Learning Outcomes","Introduction to Soil Consistency and Soil Water","Soil Water","Methods for Measuring Soil Water Content","Soil Consistency and Soil Water - Lesson Summary"]},{"name":"Module","details":"Soil Water and Temperature","description":"Learn about soil water movement and soil temperature control from this module. You will study various factors affecting available water content and thermal productivity. You will also discuss various processes affected by soil temperature.","topics":["Soil Water and Temperature - Learning Outcomes","Soil Water Movement","Qualitative Description of Soil Wetness","Soil Air","Soil Temperature","Soil Temperature Tutorial","Soil Water and Temperature - Lesson Summary"]},{"name":"Module","details":"Soil Chemical Processes","description":"Learn about chemical processes in the soil and soil colloids from this module. You will also study the mineral structure of silicate clays, sources of charges in the soil, and methods of determining the Cation Exchange Capacity (CEC).","topics":["Soil Chemical Processes - Learning Outcomes","Introduction to Silicate Clay","Structure of Clay Minerals","Sources of Charges in Soil","Cation Exchange Capacity","Soil Chemical Processes - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Soil Properties and Chemical Processes - Course Assessment"]}]}