{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2021","title":"Soil and Water Conservation Engineering - Introduction to Erosion Control Measures","totalEnrolled":"1,294","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to effectively use bunds and terraces in soil and water conservation engineering in this free online course.","description":"This free online course on erosion control measures will guide you through methods to curtail soil and water erosion. Start the course today and learn about engineering methods of water erosion control from the classifications and design parameters of bunds and terraces. This course will teach you how to effectively design erosion control structures and improve your conservation practices.","courseOutcomes":["Discuss the general features and ada...","Identify the various types of bunds ...","Utilize the available data for desig...","Discuss how to evaluate various soil...","Discuss the general features and adaptability of bunds and terraces","Identify the various types of bunds and terraces","Utilize the available data for designing soil and water conservation structures","Discuss how to evaluate various soil conservation measures","Solve real-life soil and water conservation problems","Discuss the limitations of bunds and terraces in erosion control","Discuss the general features and ada...","Identify the various types of bunds ...","Utilize the available data for desig...","Discuss how to evaluate various soil...","Discuss the general features and adaptability of bunds and terraces","Identify the various types of bunds and terraces","Utilize the available data for designing soil and water conservation structures","Discuss how to evaluate various soil conservation measures","Solve real-life soil and water conservation problems","Discuss the limitations of bunds and terraces in erosion control"],"courseDescription":"<p>The free online course, Soil and Water Conservation Engineering - Introduction to Erosion Control Measures, will enable you to recognize soil and water conservation practices and problems. You will learn about erosion control methods from bunds and terraces as engineering methods of water erosion control.</p><p>In this course, you will learn about the types and characteristics of bunds such as contour bunds and graded bunds, including the design parameters and problems with contour and graded bunds. You will then learn about the types and features of terraces from bench terraces and broad-base terraces, as well as various problems with the design of bench terraces and broad-base terraces.</p><p>This course on erosion control measures aims at teaching the importance and practices of erosion control. This course is aimed at students, researchers, professionals, conservationists, and anyone with an interest in soil and water conservation practices. Start the course today and learn about engineering methods of water erosion control that will improve your conservation practices.</p><a href=\"https://alison.com/resume/courses/2021\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2021\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Soil and Water Conservation Engineering - Using Bunds","description":"Learn about bunds in this module from the theory, application, adaptability, and design of graded bunds and contour bunds.","topics":["Bunds - Learning Outcomes","Introduction to Bunds","Contour Bunds","Problems on Contour Bunds","Graded Bunds","Problems on Graded Bunds","Bunds - Lesson Summary"]},{"name":"Module","details":"Soil and Water Conservation Engineering - Using Terraces","description":"Learn about the types of terrace in soil and water conservation engineering from this module.","topics":["Terrace - Learning Outcomes","Introduction to Terrace","Bench Terraces","Problems on Bench Terraces","Broad-Base Terraces","Problems on Broad-Base Terraces","Terrace - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Erosion Control Measures - Course Assessment"]}]}