{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4043","title":"Diploma in Structural Engineering and Construction Site Safety","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches the principles of structural engineering and construction site safety.","description":"Most people involved in construction works think architectural drawings and structural designs are challenging to understand. In this free online course, we will show the step-by-step process of understanding structural plans and drawings. We will also explain how to take adequate safety measures on a construction site. By taking this course, you will gain a much better understanding of structural engineering. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Structural engineering principles are built on designing a structure that will not collapse or a structure that can serve for an extended period without damage or disintegration. It also entails the development of affordable structures that provide economical solutions without sacrificing functionality. The applications of these principles largely depend on the accurate interpretation of structural drawings. Generally, the guidelines, measurements, and materials for a construction project are often highlighted in the structural drawings. A professional structural engineer must interpret and apply the contents of the drawings for building the required edifices. This free online course begins by teaching some important principles and tenets of structural design and building construction. Then, we will examine the procedures for beam bottom arrangements, slab centring, and slab casting. We’ll study different kinds of reinforcements and the appropriate lengths to be used for their centre-to-centre spacing.</p><p>Next, we will explain beam reinforcement arrangements. You will learn how to read, interpret, and translate the recommended reinforcement arrangements from structural drawings. We will discuss the sizes of the steel rods used in building reinforcements. Then, we’ll explain how to circumvent cracks in bricks and concrete blocks via the use of vertical rod reinforcements. Learn how to translate staircase construction from structural drawings. We’ll also discuss the practical procedures for marking the risers and threads to be used for the flight steps of a staircase. The effective practice for setting the slabs to be used for placement of plumbing pipelines, and wire cables for electrical installations, will be examined. Furthermore, we’ll demonstrate the practical detailing of beam reinforcements, including tension and compression reinforcements in concrete slabs.</p><p>Finally, you will learn more about the safety precautions to be followed when executing building projects at a construction site. Likewise, you will dissect safety from the construction and design points of view. Additionally, we’ll take you through the reasons for building failures and how you can avoid the pitfalls as a building engineer. What are the major causes of building failures? What are the safety measures to be followed at the construction site? We’ll address these questions and provide practical solutions to these challenges. By completing this course, you will learn how to apply structural engineering principles to advance your work efficiency and improve your professionalism. So, why wait? Enrol now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}