{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3145","title":"Structural Arrangement of Midship and Hull Fittings","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course uncovers the bow, stern and midship structures’ structural arrangements and functions of a ship.","description":"This course on structural arrangements of midship and hull fittings teaches you about the different components of the midship section of a ship. Investigating these constructional features and the functions of the bow, stern and midship structures will enable you to explain the bilge and ballast piping systems. Start this course today to improve your knowledge of the structural arrangements of midship and hull fittings.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The midship region of a ship plays an integral part in its longitudinal strength and helps with the structural layout, depending on the type of cargo it will carry. This course covers the basics of the different functions of the components present in the midship region. We introduce you to the midship structural arrangement for a general cargo ship and container ship. We investigate the impact loadings have on the external surface of a ship. The definition of concepts like ‘slamming’, ‘pounding’ and panting during ship navigation are explored before introducing the duration and nature of slamming pressure. Learn about the damage sustained by a vessel due to hydrodynamic impact loading, along with the different forms in which it can manifest. Next, we discuss the division of the ship structure into the bow, stern and midship structures, together with the functions of the different strengthening members of the bow, midship and aft sections of the ship. Examine further division of the ship’s structure into the longitudinal, transverse, combination and double hull system.</p><p>This course then demonstrates the varying characteristics of a ship’s forward and aft constructions. The components of the ship’s forepart, including collision bulkhead, Spurling pipe and cofferdam, will be covered in this course. We delve into the structural arrangement, features and components of the aft. This course also explains the features of watertight and weathertight doors and their types and operations. We outline the necessity of a watertight door, why you must keep it in closed mode at sea and the safety precautions while operating the doors. This course will teach you the maintenance of watertight doors, functions and proper routine maintenance of hatch covers. The three methods to check the water tightness of hold covers (hose water, ultrasonic and the chalk test) are described. The openings in oil tankers (which include manifolds, tank valves, cargo pipes for tanks, hatchways and butterworth cover) are simplified.</p><p>Become familiar with the features of different openings on deck and the concepts and functions of piping. Study how to secure the anchor to the cable and the last link of the anchor cable to the chain locker. You will know the concepts, provisions and common problems experienced with bilge piping systems. The differences between the two bilge piping systems include: hold and engine. We will also cover room bilge systems in this course. We present the importance of a leak test in a bilge piping system and help you understand the operations and functions of a ballast system for the stability of a ship. You will also learn about the functions and the differences between air and sounding pipes. This course will be of great interest to students, researchers and anyone interested in structural arrangement midship and hull fittings. So enrol for this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}