{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4037","title":"Superstructure Activities in Building Construction","totalEnrolled":"1,944","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the skills for structural design and building of superstructures in this free online civil engineering course.","description":"Superstructures are engineering wonders in their own right and in this free online course, the activities involved in the construction of superstructures including translating beam reinforcement drawings and placing beam reinforcements will be explained. Learn the theory and practicality of slab centring, procedures for cube casting and slump tests, and the modern practices for structural design and construction of world-class superstructures.","courseOutcomes":["Explain the procedures for placing t...","Discuss the process for the ground f...","Explain slab centring and placing of...","Differentiate the practicality and t...","Explain the procedures for placing the starter concrete and shuttering for the ground floor column","Discuss the process for the ground floor beam bottom arrangement and shuttering","Explain slab centring and placing of beam reinforcements in building construction","Differentiate the practicality and theory of one-way and two-way slabs","Outline the techniques for laying electrical conduit and MEP works in a building construction site","Indicate the protocols for cube casting and slump tests in structural engineering","Explain the procedures for placing t...","Discuss the process for the ground f...","Explain slab centring and placing of...","Differentiate the practicality and t...","Explain the procedures for placing the starter concrete and shuttering for the ground floor column","Discuss the process for the ground floor beam bottom arrangement and shuttering","Explain slab centring and placing of beam reinforcements in building construction","Differentiate the practicality and theory of one-way and two-way slabs","Outline the techniques for laying electrical conduit and MEP works in a building construction site","Indicate the protocols for cube casting and slump tests in structural engineering"],"courseDescription":"<p>A building project has two major components, which are known as the substructure and superstructure. The substructure of a building is the section below the ground level (also known as the natural ground level). Whereas the topmost section of a building, which is above the ground level, refers to the superstructure. The latter includes the beams, slabs, lintels, doors, windows, flooring, columns, etc. In this free online construction training course, we will examine the procedure for placing the starter concrete for constructing the ground floor column of a building. Similarly, the topic on shuttering for the ground floor column will consider the procedures for placing the cover blocks, as well as the techniques for performing the concrete column casting. You will be shown a practical demonstration of the methods used by structural engineers for carrying out ground floor beam bottom arrangement and shuttering including the process of making the inner side and outer side shuttering of the ground floor beam.</p><p>The civil engineering certificate moves on to discussing the importance of the slab centring plates in slab centring before covering in-depth the two major types of beams used in construction where you will be taught how you can analyze and translate beam reinforcement drawings and techniques for setting beam reinforcements. The effects of compression, tension, and shear forces in building construction will be explained along with the importance of the ductility of steel (also known as rebar) used in building reinforcements. The next section covers the various kinds of slabs, how to differentiate between them and how to decide which to use in your construction project.</p><p>The last part of this civil engineering online course discusses mechanical, electrical, and plumbing (MEP) activities which considers the procedures for laying electrical conduit, fan hook fixing, and the quality checks to be done before slab casting. Studying theory is one thing but learning in practice is very important and some practical demonstrations of cube casting and slump tests which are done at a construction site will be shown. Some other tests you will learn all about are strength testing of concrete cubes, and how to adapt the outcomes of the process for constructing equipotent substructures and superstructures. The important roles of structural engineers include crafting structural drawings, preparing design reports, identifying the appropriate construction materials, and providing professional advice. As such, several important tips that will help young structural engineers become successful in their chosen careers as builders will be highlighted. If you want to master the modern practices for structural design and construction of notable substructures and superstructures then enrolling for this course will set you on the path towards a successful career in engineering.</p><a href=\"https://alison.com/resume/courses/4037\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4037\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Understanding Superstructures","description":"In this module, learn about ground floor starter concrete, column casting, and column curing practices. The procedures for placing the first-floor beam bottom, beam shuttering, slab centring plates, and staircase shuttering will be demonstrated. The theory and practicality of slab centring, cranking of bar, and MEP works, will also be considered.","topics":["Understanding Superstructures - Learning Outcomes","Ground Floor and Slab Centering Activities","Beam Reinforcement and Slab Types","Understanding Slab Centering and Cranking of Bar","MEP, Slab Casting and Deshuttering Activities","Understanding Superstructures - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Superstructure Activities in Building Construction - Course Assessment"]}]}