{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2460","title":"Sustainable Architecture: Energy Efficiency and Quality","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this online architecture course, learn about architectural design considerations for energy efficient buildings.","description":"This free online energy efficient building course discusses the specific requirements of energy efficient building design in terms of materials, equipment and practices. This includes the different compliance criteria and the calculations involved. You will also learn about Net Zero Energy buildings as well as the design considerations for safe and healthy indoor air quality, including materials used, ventilation design and airflow provisions.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online energy efficient building course discusses the architectural design strategies for low-energy, pollution-free, healthy and comfortable indoor environments. It begins by looking at the current energy consumption scenario and the related terminologies and definitions. This leads you to the specific requirements for energy-efficient building design in terms of materials, equipment and practices. You will learn about the different factors and components of a building which contribute towards heat gain and how they can be optimized through design and material selection. You will also learn about the electricity-consuming equipment installed inside a building which can be controlled and made to consume less electricity; in compliance with the Green Building Rating Programs.</p><p>Next, you will be introduced to the concept of Net Zero Buildings with examples and case studies. This will be followed by the concept of indoor pollution, the causes, the effects and how it can be managed to meet the indoor air quality regulatory standards. You will learn about the unhealthy volatile organic compounds released by the materials used on indoor surfaces and the role of natural and mechanical ventilation in maintaining the indoor air quality.</p><p>Finally, you will learn how to design building interiors for thermal and visual comfort. The importance of health, safety and general well-being of the occupants are taken into consideration through the various parameters, standards and compliance approaches. This includes the design of the space, furniture, acoustics, aesthetics and connectivity between the indoor and outdoor areas. Although largely addressed towards undergraduate students, all others who want to learn about sustainable and green building concepts and who are planning to go ahead in the field of green building design and implementation, will greatly benefit from this energy efficient building course. Why wait, start this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}