{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4124","title":"Symmetrical Components in Three-Phase Systems","totalEnrolled":"415","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you about three-phase networks and how to analyse short-circuit fault conditions.","description":"This course introduces you to the concept of symmetrical components developed by pioneering electrical engineer Charles Fortescue. Explore three-phase networks and the analysis of short-circuit fault conditions with the help of symmetrical components. By studying this course, you will discover what symmetrical components are, their benefits and how equipment manufacturers use them.","courseOutcomes":["Explain Fortescue's theory of symmet...","Distinguish the notation used to rep...","Identify an unbalanced and a balance...","Recall the properties of the positiv...","Explain Fortescue's theory of symmetrical components","Distinguish the notation used to represent the phases and sequence components","Identify an unbalanced and a balanced three-phase power system","Recall the properties of the positive, negative and zero sequence components","Describe the properties of the ‘a’ operator and transform the b and c phases sequences into the 'a' phase sequence","Analyse an asymmetrical system by converting the three unbalanced phases into the sum of three balanced phases or symmetrical components","Explain Fortescue's theory of symmet...","Distinguish the notation used to rep...","Identify an unbalanced and a balance...","Recall the properties of the positiv...","Explain Fortescue's theory of symmetrical components","Distinguish the notation used to represent the phases and sequence components","Identify an unbalanced and a balanced three-phase power system","Recall the properties of the positive, negative and zero sequence components","Describe the properties of the ‘a’ operator and transform the b and c phases sequences into the 'a' phase sequence","Analyse an asymmetrical system by converting the three unbalanced phases into the sum of three balanced phases or symmetrical components"],"courseDescription":"<p>This course provides a relatively simple understanding of symmetrical components used to analyse a steady-state three-phase electrical system using a per-phase equivalent circuit. But this method is only valid when you balance the voltages and currents, with each phase having the same impedance. The analysis becomes more complicated when the phase voltages and currents are unbalanced during faults and short circuits. You use the symmetrical components to analyse asymmetrical currents and voltages in such conditions. It is a powerful mathematical technique in power system protection and helps analyse power system faults. Discover how to represent a set of unbalanced phasors into three independent sets of balanced phasors or symmetrical components and analyse the fault conditions. First is an overview of the symmetrical components, who developed them, and how to describe the phasors in terms of these components.</p><p>Next, be introduced to the basics of symmetrical components as described by Charles Fortescue and learn the standard notation used to represent the components. Then, investigate the properties of an electrical system’s positive, negative, and zero sequence components and their mathematical interpretations. You will learn to resolve an unbalanced network of three related vectors into three sets of independent vectors. As there are three sets of symmetrical components and three phases, you will learn about the 3X3 = 9 different ways of representing the unbalanced fault condition. You will see how equations are developed with symmetrical components and used to analyse other unbalanced faults. Become familiar with the properties of the ‘a’ operator, used to re-describe the phasors of the various components in terms of the ‘a’ phase that simplifies the analysis. The course also helps you understand how to use symmetrical components to analyse electric systems through problems and solutions.</p><p>You will analyse complex system problems using computer algorithms. This course helps you understand how the symmetrical components are applied to solve such issues in the power system. Anyone with a knack for learning new skills can take this course but basic maths is essential to understand the laws and theorems related to three-phase electrical power systems. It will be most beneficial to electrical engineers, technologists, substation engineers, maintenance workers in the electrical power protection industry and others who want to understand how to model electric power systems. Understanding the use of the symmetrical components technique will also enable you to work on all the fundamentals of power system protection and control. This course will also help you study power protection systems for a career in power engineering and electrical engineering. So why wait? Register now and learn for free!</p><a href=\"https://alison.com/resume/courses/4124\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4124\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Symmetrical Components of Power System","description":"This module will introduce you to Fortescue’s symmetrical components and their use in the power protection system. You will learn the standard notations used in a phasor sequence and the use of the “a” operator to transform one phasor into another. You will also be taught how to form equations and solve problems on unbalanced 3-phase systems.","topics":["Symmetrical Components of Power System - Learning Outcomes","Symmetrical Components Overview","Transformation of Symmetrical Components with \"a\" Operator","Synthesis Equations","Problems and Solutions","Symmetrical Components of Power System - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Symmetrical Components in Three-Phase Systems - Course Assessment"]}]}