{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2105","title":"Thermal Processing of Foods: Food Packaging and Regulations","totalEnrolled":"2,588","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about packaging considerations and regulations in the food industry in this free online course.","description":"This course takes you through the guidelines used in the food industry regarding its packaging. We examine the mechanical properties of materials used to pack food, which present very important manufacturing considerations. We compare biocomposite and bionanocomposite food packaging materials to help you understand the technical aspects of keeping food fresh and safe to eat before delving into the regulatory aspects of food processing.","courseOutcomes":["Establish the importance of food pac...","Describe the shapes and design of pa...","Explain biopolymers and how bio-base...","Outline the important unit operation...","Establish the importance of food packaging that protects and preserves food","Describe the shapes and design of packaging materials appropriate for food products","Explain biopolymers and how bio-based materials are usually called ‘environmentally friendly’ and ‘biodegradable’","Outline the important unit operations in food processing and preservation","Highlight the relationship between product packaging and the type of processing used in thermal processing","Describe the 3-A sanitary standards and other regulatory standards","Compare standardized and non-standardized regulatory considerations","Describe how osmotic pressure is found in fluid solutions","Establish the importance of food pac...","Describe the shapes and design of pa...","Explain biopolymers and how bio-base...","Outline the important unit operation...","Establish the importance of food packaging that protects and preserves food","Describe the shapes and design of packaging materials appropriate for food products","Explain biopolymers and how bio-based materials are usually called ‘environmentally friendly’ and ‘biodegradable’","Outline the important unit operations in food processing and preservation","Highlight the relationship between product packaging and the type of processing used in thermal processing","Describe the 3-A sanitary standards and other regulatory standards","Compare standardized and non-standardized regulatory considerations","Describe how osmotic pressure is found in fluid solutions"],"courseDescription":"<p>This course begins by establishing the importance of packaging in protecting and preserving food. We then show you how manufacturers choose the shape and design of food packaging materials. You will learn about biopolymers and how bio-based materials are often called ‘environmentally friendly’ and ‘biodegradable’.</p><p>We then cover cellulose nanofibers and glycerols and trace their impact on the packaging of food materials that conform to the relevant standards and regulations. We examine diversified packaging materials, design and equipment used in the food industry. You will also learn about the protection and preservation of food materials.</p><p>The course lays out strategies to protect food meant for human consumption from contamination. We explain how organizations use the global 3-A sanitary standards to protect consumers from any risk associated with contaminated and unhealthy food. We demonstrate how osmotic pressure is found in fluid solutions. This course takes a close and sometimes technical look at the packaging technology and laws that keep food safe to eat.</p><a href=\"https://alison.com/resume/courses/2105\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2105\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Food Packaging Materials and their Properties","description":"In this module, you will learn about packaging considerations in the food processing industry. You will learn about the mechanical properties of food materials and the basic characteristics of packaging materials.","topics":["Food Packaging Materials and their Properties - Learning Outcomes","Food Packaging Materials and their Properties","Biocomposite/Bionanocomposite Materials for Food Packaging Applications","Food Packaging Materials and their Properties - Lesson Summary"]},{"name":"Module","details":"Sanitary Components and Regulatory Considerations & Special Lecture on Membrane Separation","description":"In this module, you will learn about sanitary components and regulations in the food industry. You will also learn about the regulatory considerations in food processing and packaging, and the industrial applications of membrane separation.","topics":["Sanitary Components and Regulatory Considerations & Special Lecture on Membrane Separation - Learning Outcomes","Sanitary Components and Requirements","Regulatory Considerations","Special Lecture - Membrane Separation","Sanitary Components and Regulatory Considerations & Special Lecture on Membrane Separation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Thermal Processing of Foods: Food Packaging and Regulations - Assessment"]}]}