{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2103","title":"Thermal Processing of Foods: Separation processes and Heat Exchangers","totalEnrolled":"421","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, you will learn about the various food separation processes and how heat exchangers are used.","description":"This free online course on separation process and heat exchangers in thermal food processing is for you if you wish to understand the methods and processes that are used in separating food products in the food industry. You will learn about commonly used separation processes including ultrafiltration and reverse osmosis. By the end of this course, you will be able to determine the most suitable type of heat exchangers used for thermal processing","courseOutcomes":["Explain the fundamental aspects of f...","Discuss the types of membrane separa...","Describe ultrafiltration, microfiltr...","List the applications, advantages an...","Explain the fundamental aspects of food separation process;","Discuss the types of membrane separation processes;","Describe ultrafiltration, microfiltration and reverse osmosis;","List the applications, advantages and limitations of reverse osmosis","Define heat exchangers;","Describe the temperature range suitable for achieving a commercially sterile product;","Explain dehydration as a water removal process in food via evaporation","Discuss the movement of fluids in continuous heat exchangers","Explain the extensive use of heat exchangers in the food industry","Explain the fundamental aspects of f...","Discuss the types of membrane separa...","Describe ultrafiltration, microfiltr...","List the applications, advantages an...","Explain the fundamental aspects of food separation process;","Discuss the types of membrane separation processes;","Describe ultrafiltration, microfiltration and reverse osmosis;","List the applications, advantages and limitations of reverse osmosis","Define heat exchangers;","Describe the temperature range suitable for achieving a commercially sterile product;","Explain dehydration as a water removal process in food via evaporation","Discuss the movement of fluids in continuous heat exchangers","Explain the extensive use of heat exchangers in the food industry"],"courseDescription":"<p>This free online course begins by introducing you to the basic separation processes and how to determine which one is suitable for use in the separation of food components. You will learn about ultrafiltration as a membrance filtration process that uses the concept of hydrostatic pressure. You will also learn about the process of microfiltration.&nbsp;</p><p>The course goes on to explain reverse osmosis and its advantages and disadvantages which is very crucial when making decisions on which type of separtion process to use. You will get know about about nanofiltration and electrodialysis and their suitability in deployment for membrane separation and also their limitations.</p><p>Finally, you will learn about how heat exhangers are used in tranferring heat from one fluid to another. You will learn about the design of heat exchangers which focuses on the several ways in which heat is tranferred including conduction, convection and radiation. After completing this course, you will become very familiar with major processing equipment used in the food processing industry.</p><a href=\"https://alison.com/resume/courses/2103\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2103\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Advanced Seperation Processes","description":"In this module, you will learn about the fundamentals of separation processes, and how membrane separation is an alternative to thermal processing. You will also learn how to conduct calculations around concentration polarization and gel polarization.","topics":["Advanced Separation Process - Learning Outcomes","Advanced Separation Process","High Pressure Dialysis, Ultrafiltration, and Reverse Osmosis","Nanofiltration, Electrodialysis, and Membrane Separation","Advanced Separation Processes - Lesson Summary"]},{"name":"Module","details":"Heat Exchanging Equipment","description":"In this module, you will learn about various types of heat exchangers for food processing engineering. You will also learn about the application of heat exchangers in the food processing industries and the various types of dryers for the food processing industry.","topics":["Heat Exchanging Equipment - Learning Outcomes","Various Types of Heat Exchangers for Food Process Engineering","Various Types of Driers for Food Process Engineering","Heat Exchanging Equipment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Thermal Processing of Foods: Separation processes and Heat Exchangers - Assessment"]}]}