{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2098","title":"Thermal Processing of Foods: Aseptic and Novel Food Processing Technology","totalEnrolled":"996","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about packaging of food products using novel technologies in this free online course on food technology.","description":"In this free online course you will learn how aseptic processing is used in packaging food products using the sterilization technique in order to extend the storage life and improve the quality of the food products. Start the course and learn about how novel food processing technologies such as high pressure processing are used in providing high quality and healthy food products.","courseOutcomes":["Discuss the aseptic process and it's...","List the characteristics of aseptic ...","Explain the latest methods used in a...","Define the various techniques used i...","Discuss the aseptic process and it's being used in packaging food products","List the characteristics of aseptic processing","Explain the latest methods used in aseptic processing","Define the various techniques used in aseptic processing","Describe the impact of aseptic processing to microbial growths in food products","Explain how effective the microwave and radio frequency heating can be","Explain the applications of ohmic heating","List the non thermal processing technologies that are used in food processing","Discuss the aseptic process and it's...","List the characteristics of aseptic ...","Explain the latest methods used in a...","Define the various techniques used i...","Discuss the aseptic process and it's being used in packaging food products","List the characteristics of aseptic processing","Explain the latest methods used in aseptic processing","Define the various techniques used in aseptic processing","Describe the impact of aseptic processing to microbial growths in food products","Explain how effective the microwave and radio frequency heating can be","Explain the applications of ohmic heating","List the non thermal processing technologies that are used in food processing"],"courseDescription":"<p>This free online course starts by explaining the fundamental aspects of aseptic processing including the processing and packaging of sterlized products into sterilized containers and ensuring no access to micro-organims growth in the packaged products. You will learn about the main products of aseptic processing, and what type of packages are suitable for aseptic processing.&nbsp;</p><p>The course further explains how microwave and radio frequency heating is a suitable technology used for food processing due to its very high heat penetration. You will be introduced to early usage of microwave heating technology and how it has been developed over the years and applied to food processing. You will also learn about the mechanims behind microwave and radio frequency heating.</p><p>Finally, you will learn about ohmic heat and how it can be used in achieving tremendous results in providing high quality food. You will learn how the various heat transfer mechanisms are directly used for heating food products. You will be able to determine the relationship between temperature and electrical conductivity and how ohmic heating can be used for blanching and pasteurization. Start the course and learn about packaging of food products using novel technologies.</p><a href=\"https://alison.com/resume/courses/2098\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2098\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Aseptic Processing","description":"In this module, you will learn about the fundamentals of aseptic processing, aseptic equipment design and aseptic process design. You will also be able to compare and contrast normal canning procedures with the aseptic process.","topics":["Aseptic Processing - Learning Outcomes","Fundamentals of Aseptic Processing","Aseptic Process Design","Aseptic Equipment Design","Aseptic Processing - Lesson Summary"]},{"name":"Module","details":"Novel Food Processing Technology","description":"In this module, you will learn about microwave and radio frequency heating. You will also learn about the basics of ohmic heating, and the two types of scale systems available for ohmic heating.","topics":["Novel Food Processing Technology - Learning Outcomes","Microwave and Radio Frequency Heating","Ohmic Heating","Overview of Non Thermal Processing Technologies","Novel Food Processing Technology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Thermal Processing of Foods: Aseptic and Novel Food Processing Technology - Assessment"]}]}