{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1704","title":"Understanding Thermodynamics for Science and Engineering","totalEnrolled":"5,122","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about the laws of thermodynamics, Avogadro's number, and the ideal gas law with this science course.","description":"In our free online thermodynamics for science and engineering course you will learn about the core concepts of thermodynamics, such as the relationship between pressure, volume, and temperature. Thermodynamics is an essential branch of science and engineering that studies heat and its relation to energy and work. In this online course we look at examples and solve problems that will help you better understand the concepts of thermodynamics.","courseOutcomes":["Outline the essential properties of ...","Calculate an ideal gas P x V = K, wh...","Define temperature and how it affect...","Calculate absolute zero and degrees ...","Outline the essential properties of gases and liquids","Calculate an ideal gas P x V = K, where P = Pressure, V = Volume and K = Kinetic constant","Define temperature and how it affects pressure and volume","Calculate absolute zero and degrees Celsius in degrees Kelvin","Describe the mole and Avogadro’s Constant","Convert between different scales of temperature","Outline the essential properties of ...","Calculate an ideal gas P x V = K, wh...","Define temperature and how it affect...","Calculate absolute zero and degrees ...","Outline the essential properties of gases and liquids","Calculate an ideal gas P x V = K, where P = Pressure, V = Volume and K = Kinetic constant","Define temperature and how it affects pressure and volume","Calculate absolute zero and degrees Celsius in degrees Kelvin","Describe the mole and Avogadro’s Constant","Convert between different scales of temperature"],"courseDescription":"<p>Thermodynamics is the branch of physics that describes how thermal energy is converted to and from other forms of energy and how it affects matter. This course will first discuss the essential properties of gases and liquids. You will learn that an ideal gas has a pressure and temperature and is in a container with volume. If the temperature increases, the pressure can be kept constant by increasing the pressure of the container.</p><p>Temperature is defined as the average kinetic energy per molecule in a sample of matter and is expressed in terms of units or degrees designated on a standard scale. This course will teach you how temperature affects pressure and volume. You will learn that absolute zero is equivalent to -273 degrees Celsius and study how to calculate absolute zero and degrees Celsius in degrees Kelvin. You will also study the mole and Avogadro's Constant.</p><p>The study of thermodynamics is important to help you understand the relationship between work, heat, and energy. You will learn how to convert energy from one form to another and the interaction of a system and its surroundings. It is also essential for working in many scientific and engineering disciplines such as physics, chemistry, chemical engineering, petroleum engineering, and materials science. So, check out this course and expand your knowledge of physics today!</p><a href=\"https://alison.com/resume/courses/1704\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1704\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Thermodynamics for Science and Engineering","description":"Thermodynamics is the study that deals with the relationship between heat and energy. In this module, the learner is introduced to the core principles of Thermodynamics. The concepts of pressure, volume and temperature are explained and the relationships between each are outlined. This module outlines how to convert between different scales of temperature and breaks down how to use physics formulas to solve real world problems.","topics":["Introduction to Thermodynamics | Learning Outcomes","Thermodynamics - Part 1","Thermodynamics - Part 2","Thermodynamics - Part 3","Thermodynamics - Part 4","Thermodynamics - Part 5","Introduction to Thermodynamics | Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Thermodynamics for Science and Engineering - Assessment"]}]}