{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2983","title":"Understanding the Characterization of Geomaterials","totalEnrolled":"974","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to describe and classify materials that come from the earth with this free online geology course.","description":"This free online course examines the categorization of geomaterials, which include most extracts from the ground. We demonstrate the use of scanning electron microscopy to understand the surface features of soil and take you through the process of categorizing geomaterials according to shape, size, dimensions and regularity. We also investigate various methods used to analyze soil contamination. This course suits anyone interested in geology.","courseOutcomes":["Outline the major issues concerning ...","Identify the techniques for characte...","Summarize the concepts of geotechnic...","Explain how SEM can be utilized to u...","Outline the major issues concerning the use of industrial byproducts","Identify the techniques for characterizing geomaterials","Summarize the concepts of geotechnical and mineralogical characterization","Explain how SEM can be utilized to understand the surface features of the soil","Describe the process of categorizing geomaterials based on morphology","Discuss the methods of determining the specific surface area of geomaterials","Define ‘chemical characterization’","Unpack various field and laboratory sampling techniques","Demonstrate the role of lysimeters","Describe how to analyze the contamination of soil","Recognize the significance of determining the chloride and sulphate levels of soil","Explain the ‘remediation’ techniques used to remove contaminants","Outline the major issues concerning ...","Identify the techniques for characte...","Summarize the concepts of geotechnic...","Explain how SEM can be utilized to u...","Outline the major issues concerning the use of industrial byproducts","Identify the techniques for characterizing geomaterials","Summarize the concepts of geotechnical and mineralogical characterization","Explain how SEM can be utilized to understand the surface features of the soil","Describe the process of categorizing geomaterials based on morphology","Discuss the methods of determining the specific surface area of geomaterials","Define ‘chemical characterization’","Unpack various field and laboratory sampling techniques","Demonstrate the role of lysimeters","Describe how to analyze the contamination of soil","Recognize the significance of determining the chloride and sulphate levels of soil","Explain the ‘remediation’ techniques used to remove contaminants"],"courseDescription":"<p>This free online course explains how to classify geomaterials. We address the major issues concerning the usage of industrial byproducts as a man-made geomaterial and the stabilization of the soil using fly ash, which is produced by the burning of coal. You can study the course material on offer at your own pace as we take you through the intricacies of arranging extracts from the earth in their proper categories.</p><p>We outline the process of dealing with industrial byproducts through handling, utilizing, disposing and transporting them. The course then demonstrates the need for geomaterial characterization and illustrates how it can help protect our environment. We examine the use of scanning electron microscopy (SEM) to understand the surface features and composition of soil.&nbsp;</p><p>Finally, we show you how the chemical composition of geomaterials can affect their characterization. We discuss the influence of cation-exchange capacity (CEC) on soil and the various direct and indirect methods for analyzing its contamination. This course can help students, researchers, aspirant civil engineers and anyone who wants to know more about the ground beneath their feet.</p><a href=\"https://alison.com/resume/courses/2983\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2983\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Characterization of Geomaterials","description":"This module presents the Characterization of Geomaterials. You will learn how Scanning Electron Microscopy can be utilized to understand the surface features of the soil and the process of categorizing the Geomaterials based on their shape, size, dimensions, regularity and irregularity.","topics":["Characterization of Geomaterials– Learning Outcomes","Major Issues Regarding the Application of Industrial Wastes","Application of Industrial By-Products","Geotechnical and Mineralogical Characterization","Mineralogical Characterization of Original and Activated Ash Samples","Morphological Characterization","Attributes of Physical Characterization","Characterization of Geomaterials– Lesson Summary"]},{"name":"Module","details":"Chemical Characterization of Geomaterials","description":"This module presents the Chemical Characterization of Geomaterials. You will learn how the Geomaterials are characterized based on their Chemical composition, various methods for analyzing the contamination of soil and the remediation techniques used for their removal.","topics":["Chemical Characterization of Geomaterials – Learning Outcomes","Specific Surface Area of Geomaterials","Chemical Characterization","Pore-Solution Sampling","Lysimeters","Lysimetric Studies and Laboratory Sampling","Methods of Assessing Soil Contamination","Soil Salinity Sensors","Soil Contaminants and Corrosion Potential","Chemical Characterization of Geomaterials – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding the Characterization of Geomaterials - Course assessment"]}]}