{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2514","title":"Understanding Construction Materials with X-Rays","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course on the background, application and production of x-rays and XRD qualitative phase analysis.","description":"This free online understanding construction materials with X-Rays course will expose you to the X-rays can be used to analyze construction materials. You will learn about the geometry, structure of crystals and what enables them to diffract from X-rays. You will gain an understanding of qualitative phase analysis of X-ray diffraction, how X-ray diffraction patterns can be used for qualitative analysis and X-ray diffraction data analysis software.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will begin by introducing you to the background of X-rays, as well as the applications and production of X-rays. You will be exposed to radiography, diffraction, crystals and symmetry. You will learn about symmetry operators in crystallography, the discovery of X-ray diffraction and diffractogram. You will gain an understanding of how X-rays are produced and the contents of X-ray tubes. This will lead you into radiography, diffraction and the discovery of the phenomenon of X-ray diffraction by crystals. Also, you will be able to explain geometry, the structure of crystals and what enables them to diffract X-rays.</p><p>Next, you will be enlightened on the qualitative phase analysis of X-ray diffraction, how X-ray diffraction patterns can be used for qualitative analysis and using the XRD data analysis software. You will be exposed to practical difficulties in phase analysis, sample preparation for X-ray diffraction and application of XRD in cement-based materials. This will further lead you to the reason why XRD is used for cement and how to prepare samples for X-ray diffraction.&nbsp;</p><p>Lastly, you will learn about the critical steps involved in sample preparation, the reasons for stopping hydration in cement mixing and the different techniques for hydration stoppage. Also, you will gain an understanding of sample preparation for XRD and sample mounting for X-ray diffraction. Then, you will learn about the practical difficulties in qualitative phase analysis. You will also learn about the Reitveld method as the most important method used in minimizing the difference between measured and calculated patterns at each data point in the diffraction pattern, using a least-squares approach. Start learning today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}