{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/1555","title":"Understanding Drainage and Water Distribution Systems","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about drainage, water distribution systems, and water treatment and purification with this online course.","description":"This free online Drainage and Water Distribution Systems course will introduce you to how drainage and water distribution systems work, as well as how water is purified and treated in water treatment plants. Within any building, the drainage, waste, vent, and water distribution systems are installed and maintained by plumbers. With this course, you will gain a thorough understanding of how these plumbing systems work.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Knowing how drainage systems work is essential for every plumber. This course will first discuss how waste enters the Drain Waste Vent(DWV) system from the fixture drain and into the building's sanitary pipe systems. You will learn the basic parts of a P-trap, the different types of DWV fittings used by plumbers, and the basic components of a conventional septic tank system. In addition to that, you will study the health issues related to the improper design, installation, and maintenance of DWV systems.<br><br>Water supply and distribution play a very important role in plumbing systems. This course will discuss the components of the water distribution system including pipes, valves, and water heating and treatment equipment. You will study the purification process that city water undergoes before it reaches the faucet, the common types of valves used in water distribution systems, and the steps involved in bringing water from the main into the building.<br><br>Access to clean water is only possible through proper plumbing. By the end of this course, you will have gained a strong understanding of how drainage and water distribution systems work, which will be an essential boost for your plumbing skills. This will open up a much wider range of job opportunities to you, and give you real assistance in your road to becoming a professional plumber. So why wait? Check out the course today and keep your learning journey moving forward.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}