{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3104","title":"Understanding Optical Sources in Fiber-Optic Communication","totalEnrolled":"1,279","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the processes that take place in fiber-optic cables to enable optic communication.","description":"‘Understanding Optical Sources in Fiber-Optic Communication’ is an exciting course that introduces you to the multiple processes involved in optical communication. The different internal operations that take place in the fiber-optic cable that makes communication so seamless will be revealed. Additionally, you will learn what makes LEDs and laser diodes a preferred choice over other optical sources.","courseOutcomes":["Discuss the optical source used for ...","List some critical parameters for op...","Discuss how light-matter interacts i...","Distinguish between LED and laser di...","Discuss the optical source used for designing optical transmitters","List some critical parameters for optical sources","Discuss how light-matter interacts in semiconductors","Distinguish between LED and laser diode structures","List possible reasons for loss of photons","State the emission patterns of LED","Indicate the most commonly used transmitters","Discuss the limitations of LED that can be overcome using a laser diode","Summarise the characteristic features of a Fabry-Perot Cavity","Discuss the optical source used for ...","List some critical parameters for op...","Discuss how light-matter interacts i...","Distinguish between LED and laser di...","Discuss the optical source used for designing optical transmitters","List some critical parameters for optical sources","Discuss how light-matter interacts in semiconductors","Distinguish between LED and laser diode structures","List possible reasons for loss of photons","State the emission patterns of LED","Indicate the most commonly used transmitters","Discuss the limitations of LED that can be overcome using a laser diode","Summarise the characteristic features of a Fabry-Perot Cavity"],"courseDescription":"<p>‘Understanding Optical Sources in Fiber Optic Communication’ is a free online course that seeks to enlighten learners on how optical sources in fibre-optic communication works. In optical communications, there is a device that converts an electrical signal into an optical signal. For fibre-optics with glass fibres, light in the infrared region is used because the contracting of the fibre is far less at those wavelengths. In the course, you will discover the different optical sources used, specifically light-emitting diodes (LED) and laser diodes. An LED is a directional light source with the maximum emitted power in the direction perpendicular to the emitting surface. A semiconductor device, similar to a light-emitting diode in which a diode-pumped directly with electrical current can create lasing conditions at the diode's junction, will be discussed. Laser diodes are the most common type of lasers produced, with a wide range of uses that include fibre-optic communications, barcode readers, laser pointers and light beam illumination.</p><p>Next, you will compare the major difference between lasers and LEDs. Lasers are more powerful, operate at faster speeds and can also transmit light farther with fewer errors. However, a laser is also far more expensive than LEDs. You will go on to learn about the modulation bandwidth of LEDs and what limits their bandwidth. You will also study how efficiently a device converts electrons to photons and allows them to escape, otherwise known as ‘external quantum efficiency’. This course gives you an understanding of the processes that take place between devices to enable optical communication to be successful. Fibre-optic cables work by applying the basic principles of reflection and refraction. When light strikes a shiny or mirrored object, it bounces. When light travels between two substances that are of different thickness or density, it refracts, depending on the angle at which it strikes the substance. At a certain angle, light no longer travels between the substances but reflects into the original substance altogether. The boundary now acts as a mirror, keeping the light inside. This is called ‘total internal reflection’’ and is the foundation of fibre-optic technology.</p><p>Fibre-optic cables have changed the world in many ways. You may have seen plastic fibres carrying coloured lights in decorative applications. You might not know that the unique properties of fibre-optic technology have allowed medical personnel to see places in the human body with greater ease and comfort to the patient, or that real glass fibre-optic cables are now the foundation of our communication and computer network systems. Many thousands of kilometres of installed fibre-optic cables carry different types of information underground, through tunnels, building walls, ceilings and many other places. Humanity enjoys the everyday benefits of optical communication when watching favourite shows, calling a friend via video call or even sitting around a computer or on a phone doing this course - all examples of optical communication. We are in a modernised era where technological development is increasing every day. Everything we have achieved so far is impressive and was unimaginable to earlier generations. What is yet to be achieved we cannot possibly fathom. Do you want to be a part of this exciting opportunity in an ever-changing world? Start this course today and take a step into this compelling world!</p><a href=\"https://alison.com/resume/courses/3104\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3104\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Optical Sources in Fiber Optic Communication","description":"This module will discuss LED's You will learn about LED parameters and their efficiency as well as LED and laser diode structures.","topics":["Optical Sources in Fiber Optic Communication - Learning Outcomes","Optical Sources","Semiconductor Gain Media- Structure, Spectrum","Optical Sources: LED","External Quantum Efficiency","Modulation Bandwidth of LED","Optical and Electrical Bandwidth of LED","Emission Pattern of LED","Optical Sources: Laser Diodes over LEDs","Laser Diodes: Resonator Concepts","Optical Sources in Fiber Optic Communication - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Optical Sources in Fiber Optic Communication - Course Assessment"]}]}