{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2847","title":"Understanding Robotics Architecture","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Kinematics, degrees of freedom, manipulator joints and links, and much more are covered in this free online course.","description":"Improve your understanding of robotics architecture with this free course. The material will being by addressing the degrees of freedom a robot may have. Next, look at robot anatomy, with an emphasis on the joints and links of a manipulator. You will be taught configurations for industrial robots and the characteristics of the Scara robot. Study the DH algorithm and direct forward kinematics, along with specific examples.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Begin with kinematics in robotics, after which the DH (Diffie-Hellman) algorithm is addressed. A main thrust of the course is the degrees of freedom given to robots. In general, degrees of freedom (DOF) is the set of independent displacements that specify completely the displaced or deformed position of the body or system. You will learn that in robotics, DOF is a phrase that is often used to describe the number of directions that a robot can move a joint. You will also grapple with what ‘holonomic’ and ‘non-holonomic’ mean. Learn how links are rigid sections between joints and the specific type of motion joints can provide.</p><p>Next, move onto robot manipulators and their specific sections. Study how the robot’s body and arms position objects in its work volume and what the wrist assembly is used for. Robotics architecture is the combination and disposition of the different kinds of joints that configure the robot kinematical chain, and you will analyze the five common body-and-arm configurations for industrial robots, the last of which is the selective compliance assembly robot arm (or SCARA). SCARA robots are similar to jointed-arm robots except that the vertical axes are used for shoulder and elbow joints to be compliant in the horizontal direction for vertical insertion tasks.</p><p>Finally, you will be taught that the relative position and orientation of the axes of two successive joints can be specified by two link parameters, link length and link twist angle. Are the two link parameters always constant and specified as part of the mechanical design? How can the orientation of a tool can be represented in joint coordinates by the YPR (yaw, pitch and roll) convention? What are the differences between approach vectors and sliding vectors? This course covers robotics architecture in great detail and will be of special interest to mechanical engineers specializing in robotics.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}