{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/3705","title":"Understand Electronic & Microcontroller Circuit Design and Simulation","totalEnrolled":"2,188","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the components involved in Electronic Circuit Design and Simulation.","description":"This free online course will teach you to master circuit design and simulation of microcontrollers and electronics using a free and easy-to-use application. We will show you how to design, code and build your own virtual circuits. You will also study the interfacing and simulation of your first circuit, comprising of different types of components. Kickstart your electronic circuit design and simulations skills by signing up for this introductory","courseOutcomes":["Outline the main types of breadboard...","Describe the role of a resistor in a...","List the different types of componen...","Define the concept of Ohm's Law...","Outline the main types of breadboards used in circuits","Describe the role of a resistor in a circuit","List the different types of components that you can add to your circuit","Define the concept of Ohm's Law","Discuss the fundamental types of circuits","Evaluate the two methods of coding your circuit","Recall the importance of the analogue write function","Distinguish between pull-up and pull-down resistors","Explain the fundamental goal of a serial monitor","Outline the main types of breadboard...","Describe the role of a resistor in a...","List the different types of componen...","Define the concept of Ohm's Law...","Outline the main types of breadboards used in circuits","Describe the role of a resistor in a circuit","List the different types of components that you can add to your circuit","Define the concept of Ohm's Law","Discuss the fundamental types of circuits","Evaluate the two methods of coding your circuit","Recall the importance of the analogue write function","Distinguish between pull-up and pull-down resistors","Explain the fundamental goal of a serial monitor"],"courseDescription":"<p><br>Are you interested in mastering the art of Electronic and Microcontroller Circuit Design and Simulation? Then look no further than this free online course. This course has been specially designed to guide you through the interfacing and simulation of your first circuit, with added components in both 2D and 3D design. It's a fantastic opportunity to become proficient in editing and wiring 3D simulation. Understanding the different parts will ensure that you use them in the right combinations to run your circuit efficiently. You will discover the usefulness of resistors in your circuits which helps reduce the current in the circuit so that the LED does not exceed its maximum rated current. Gain insight into the editing and wiring of components correctly in your circuits by ensuring that you pick the correct battery and resistors from the list of essential elements. You will also master working with the breadboard by ensuring that power flows through both sides of the board and correctly connects other components.<br>Starting off, we will introduce you to the breadboard, a powerful prototyping tool that will help you take your electronic skills to the next level. The breadboard allows you to connect multiple components. Moving on, we will explore the principles behind correctly connecting your breadboard to the power source. To do this, you will need to understand that the electricity flows from the positive side of the power source to the negative side in all circuits. You will also learn how to add an RGB LED to your circuit, allowing you to produce different colours in one package. Most importantly, the course will highlight the importance of connecting the RGB LED cathode terminal to the ground through a resistor to regulate the current running through the LED. This course will explore the different kinds of breadboards available to use in your circuits under other circumstances.<br>You will also learn about a fundamental concept in circuit design known as Ohm's Law and how you can apply it to ensure that you can safely light up any LED in your circuits. There are two types of fundamental circuits. We will apply them to ensure that you can most efficiently utilise them and light up multiple LEDs. You will become comfortable using the Arduino board, which you can program to listen to electrical signals and take actions based on these inputs. Finally, you will study the primary goal of using serial monitors. We will cover dealing with RGB LEDs with Potentiometers, reading the analogue value, Arduino dealing with multiple LEDs and breadboards. This course will interest Electronics and Microcontroller Circuit designers or learners enthusiastic about studying circuit design and simulation. Why wait! Sign up for this course today and learn to design your first circuit.</p><a href=\"https://alison.com/resume/courses/3705\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3705\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Circuit Design","description":"In this module on Circuit Design, you will learn how a resistor helps to reduce the current in the circuit so that the LED does not exceed its maximum rated current. You will also gain insight into the different types of breadboards and the two methods of coding your circuit.","topics":["Circuit Design - Learning Outcomes","Microcontroller Circuit Design - Introduction","Basics of Dealing with Electronic Components","Breadboard and RGB LEDs","Arduino Output and Input Basics","Circuit Design - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understand Electronic & Microcontroller Circuit Design and Simulation - Course Assessment"]}]}