{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2808","title":"Urban Transport and Sustainability","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, study the process of achieving sustainability through advances in urban transportation.","description":"This free online course introduces you to the process of implementing sustainable strategies in urban transport systems. You will be taught the significance of good parking management strategies and the factors that drive the trend towards transit-oriented development (TOD). Further, the significance of public bicycle-sharing systems in facilitating the sustainable development of transportation in urban areas is also discussed.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course introduces you to the significance of developing affordable, economically viable, people-oriented and environmentally friendly urban transport systems. Firstly, it explains the concept of travel demand management (TDM) and its growing relevance to contemporary transport systems. You then will be taught the limitations of the supply-side approach and the push-and-pull classification measures of TDM. Discover how the TDM acts as a fundamental solution to the problem of traffic congestion in urban areas, and get an in-depth understanding of the need for parking pricing and vehicular restriction for minimizing congestion. You will explore the role of push measures in reducing the volume of motorized vehicles and managing the demand for travel in urban areas. The various pull measures of managing travel demand and their role in helping to improve the efficiency of the existing system without creating new capacity or new supply, are explained.</p><p>Next, the course goes on to identify the various strategies of TDM measures for attracting users towards sustainable modes of transport and also improving their sustainability. The different types of parking facilities, the merits and disadvantages of parking systems, and the need for parking studies to analyze the supply and demand of parking space, are discussed. You will discover the significance of good parking management strategies to maximize the advantages of on-street and off-street parking facilities. In addition, the various components and scales of transit-oriented development (TOD), the factors that drive the trend towards it, and the guiding and supporting principles of TOD, are explained. The interdisciplinary and state-of-the-art advances in transportation systems are highlighted. You will explore the various methods of intelligent transportation systems (ITS) data collection and the process of achieving sustainable transportation through ITS. The course emphasizes the role of remote sensing and geographical information systems, alongside ITS, for interagency co-operation and visualization through informed decision making.</p><p>Finally, you will learn about the classification of ITS based on their positioning and the role of traffic management centres. This includes different types of vehicular communications and the usage of big data in understanding the activity locations. The course provides a breakdown of the basic ideas about the architecture of ITS and the subsystems pertaining to it. You will also explore the various service packages of ITS that are deployed in Indian cities, specifically. Further, you will be taught how electronic toll collection is a beneficial tool with numerous benefits to the users, operators and the government. Lastly, the significance of public bicycle-sharing systems in facilitating the sustainable development of transportation in urban areas is emphasized. Urban Transport and Sustainability is an informative course which will interest students studying civil Engineering, transportation engineering and urban planning. Sign up for this course now and you can start learning today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}