{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4230","title":"Utility Distribution Stations and Feeder Protection","totalEnrolled":"1,186","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the fundamentals and protection of utility distribution stations and feeders.","description":"Did you know that using voltage directly from a power station without substations and transformers can cause electrical and electronic components to fail? This course teaches you how power is supplied to consumers in rural and urban regions via distribution stations as well as showing you the basic types of distribution. You will also be taught per phase analysis in the power system and ways to protect distribution substations.","courseOutcomes":["Recall the basic types of distributi...","Explain per-phase analysis and recal...","Identify substation components...","Define feeder protection ...","Recall the basic types of distribution in substations and feeders","Explain per-phase analysis and recall the procedures for carrying out this analysis","Identify substation components","Define feeder protection","State Kirchhoff's current law","Discuss the advantages and disadvantages of fuses, circuit switchers and breakers","Describe the factors affecting transformer protection","List the types of transformer faults","Recall the basic types of distributi...","Explain per-phase analysis and recal...","Identify substation components...","Define feeder protection ...","Recall the basic types of distribution in substations and feeders","Explain per-phase analysis and recall the procedures for carrying out this analysis","Identify substation components","Define feeder protection","State Kirchhoff's current law","Discuss the advantages and disadvantages of fuses, circuit switchers and breakers","Describe the factors affecting transformer protection","List the types of transformer faults"],"courseDescription":"<p>Did you know that electrical power is reduced twice at different stages before it is consumed by users? The distribution substation connects the transmission system and lowers the transmission voltage to medium voltage, ranging from 2kV to 35kV. Primary distribution lines carry this voltage to distribution transformers located at consumers’ premises, where it is lowered to the quantity that can be used. In this course, you will learn about power distribution as well as the methods and techniques required to protect distribution substations. You will be taught the procedure for per phase analysis and how it is used in a power system. In per phase analysis, you'll learn about the notion of a balanced system and how it can be used to convert a three-phase system to a single-phase system and then back to a three-phase system. Alongside this, this course examines the phase relationship of phase-to-phase quantities and phase-to-neutral quantities.</p><p>One of the fundamental laws used in electricity studies is Gustav Kirchhoff's current law. You will gain an understanding of Kirchhoff’s current law and how it applies to the protection of distribution substations. Thereafter, you will learn about feeder protection and how it relates to the time-current curve. Overcurrent protective devices are basically electrical devices or equipment used to protect power lines or feeders against the dangerous effect of overcurrent, such as an overload current or a short circuit current that will create a fault current. This course explores the categories of feeder protection, the objective of the protective scheme regarding distribution substation and the proper application of overcurrent protective devices such as relays, fuses and circuit switchers.&nbsp;</p><p>A fuse is an overcurrent protective electrical device that is used to provide protection for electrical circuits against overcurrent. You will be shown different types of fuses, the components that make them up as well as how fuses operate to provide overcurrent protection for feeders. Fuses are not the only protection device needed in an electrical circuit. This course examines more overcurrent protective devices such as circuit switchers and breakers, what they are made up of and how they function to provide overcurrent protection to electrical circuits or substations. After that, you will be shown the advantages and disadvantages of using such overcurrent protective devices. The course further discusses the relationship between the time-current curve and relays as well as the function of surge protective devices. You'll be shown the reasons for transformer protection, factors affecting it, the requirements for transformer protection and the types of transformer faults. Basic knowledge in electrical circuitry is required to take this course. This course is for civil engineering and electrical engineering students, technicians, technologists and supervisors or anyone interested in how distribution stations and feeders work. Understanding utility distribution stations and feeder protection is essential for maintenance and meeting the energy demands of customers.</p><a href=\"https://alison.com/resume/courses/4230\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4230\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Distribution Substation, Feeder and Transformer Protection","description":"This module introduces you to the protection and control principles of distribution stations as well as the basic type of distribution. This module examines the components of substations, feeder protection as well as protection used for transformers. You will learn about time-current curves and overcurrent protective devices.","topics":["Substation, Feeder and Transformer Protection - Learning Outcomes","Per Phase Analysis, Substations and Feeder protection","Surge Protective Equipment and Transformer Protection","Substation, Feeder and Transformer Protection - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Utility Distribution Stations and Feeder Protection - Course Assessment"]}]}