{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2420","title":"Wave Equation and Propagation of Sound","totalEnrolled":"720","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about sound propagation and the human perception of sound in this free online course.","description":"Wave Equation and Propagation of Sound is a free online course that teaches you about the equation of states, mass and force. You will also learn about the propagation of sound. You will also be introduced to diffraction, refraction as well as the transmission of sound. You will also be introduced to the human perception of sound and the calculations of sound speed. Begin this course and improve your audio sound propagation knowledge and skills.","courseOutcomes":["Discuss the propagation of sound...","Define velocity of sound...","Analyze the perception of sound in h...","Discuss the propagation of spherical...","Discuss the propagation of sound","Define velocity of sound","Analyze the perception of sound in humans","Discuss the propagation of spherical waves and its mathematical expressions","Discuss the concepts of interference, refraction and diffraction","Determine the equations of state","Discuss the propagation of sound...","Define velocity of sound...","Analyze the perception of sound in h...","Discuss the propagation of spherical...","Discuss the propagation of sound","Define velocity of sound","Analyze the perception of sound in humans","Discuss the propagation of spherical waves and its mathematical expressions","Discuss the concepts of interference, refraction and diffraction","Determine the equations of state"],"courseDescription":"<p>This course begins by explaining how sound is being propagated and the derivation of acoustic wave equations. You will also learn about condensation, relaxation, some acoustic variables and the necessary differential equations required to obtain a wave equation. You will be introduced to the derivation of the equation of force as well as fluid acceleration. You will also learn about the Linear Continuity Equation as well as the Linear Force Equation otherwise known as Euler’s equation.</p><p>You will be introduced to velocity potential and the variation of sound speed with temperature. You will learn about the concept of energy in sound as well as harmonic plane waves. You will also learn about plane wave propagation. You will learn about the propagation of spherical waves as well as the spherical wave propagation equation. You will also learn about two functions of wave including converging wave and diverging wave.</p><p>You will be introduced to the human perception of sound and the step-by-step process of hearing. You will learn about sound pressure level loudness, intensity and the transfer functions at the periphery. You will also learn about the derivation of the oblique incidence and normal incidence. You will learn about the power transmission coefficient, the mathematical expressions of refraction and important physical properties in acoustics wave transmission.</p><a href=\"https://alison.com/resume/courses/2420\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2420\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Acoustic Wave Equation and Sound Transmission","description":"In this module, you will be introduced to the equation of states, mass and force as well as the propagation of sound. You will also be introduced to the transmission of sound, diffraction and refraction.","topics":["Acoustic Wave Equation and Sound Transmission - Learning Outcomes","Acoustic Wave Equation","Force and Linear Wave Equation","Plane Waves and Energy","Spherical Waves Propagation","Perception of Sound","Sound Transmission","Incidence and Refraction of Sound","Acoustic Wave Equation and Sound Transmission - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Wave Equation and Propagation of Sound - Final Assessment"]}]}