{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/4053","title":"Wiring Practice Essentials","totalEnrolled":"3,372","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the cables, joints, and schemes used in buildings and cars with this free electrical engineering course.","description":"Wiring is the arrangement of insulated conductors used to carry electricity. This course unpacks components such as cables, joints and wooden battens that make up wiring schemes and lighting circuits. Wiring in buildings, testing, and pipe earthing are also explained. Finally, this course teaches you about the electrical wiring of cars. Are you an aspiring electrician who wants to learn about wiring practice essentials? Register for free!","courseOutcomes":["Explain the procedures for removing ...","Identify the type and size of cables...","Describe the different types and con...","Explain the procedures to solder cop...","Explain the procedures for removing cable insulation and measuring wire gauges","Identify the type and size of cables for industrial wiring installation","Describe the different types and construction of cable joints","Explain the procedures to solder copper conductor joints and lugs","Describe the construction of wood battens required for electrical wiring","Describe the construction of general wiring schemes, for a lamp and a socket, for controlling four sockets, and for a bell","Describe the construction of special wiring schemes, having two or more controls for an electrical system","Describe the special lighting circuits used in prisons, hospitals, warehouses, and corridors for operating lights and saving power","Explain the wiring in buildings, the distribution of power, three-phase concealed wiring, and the estimation of materials","Describe the use of energy meters on a mains board in domestic and industrial environments, related to energy consumption and distribution board","Explain the polarity and insulation tests used in domestic wiring insulation, the use of a Megger, and the necessity of fuses and pipe earthing in buildings","Describe the electrical circuitry of automobiles including the lighting, color of cables, and the earthing system","Explain the procedures for removing ...","Identify the type and size of cables...","Describe the different types and con...","Explain the procedures to solder cop...","Explain the procedures for removing cable insulation and measuring wire gauges","Identify the type and size of cables for industrial wiring installation","Describe the different types and construction of cable joints","Explain the procedures to solder copper conductor joints and lugs","Describe the construction of wood battens required for electrical wiring","Describe the construction of general wiring schemes, for a lamp and a socket, for controlling four sockets, and for a bell","Describe the construction of special wiring schemes, having two or more controls for an electrical system","Describe the special lighting circuits used in prisons, hospitals, warehouses, and corridors for operating lights and saving power","Explain the wiring in buildings, the distribution of power, three-phase concealed wiring, and the estimation of materials","Describe the use of energy meters on a mains board in domestic and industrial environments, related to energy consumption and distribution board","Explain the polarity and insulation tests used in domestic wiring insulation, the use of a Megger, and the necessity of fuses and pipe earthing in buildings","Describe the electrical circuitry of automobiles including the lighting, color of cables, and the earthing system"],"courseDescription":"<p>Wiring is the arrangement of insulated conductors (the wires) used to carry electricity to various devices and appliances. In this free online course, you will learn about the essentials of wiring practice. How do we carry electricity and signals from one place to another? This course will explain the transfer of electric current and signals through cables. A cable is a flexible and lengthy assembly that consists of twisted or bonded wires surrounded by an insulating material. You will learn the theories and procedures for removing cable insulation, measuring wire gauges, and cable selection. You will also study the procedures to connect the cable ends to a plug, and the techniques to crimp the cable ends. The cable may need to be joined by using joints, for making connections. This course will guide you through the different types of cable joints, such as a straight joint, and Britannia T joint. How do we prevent oxidation of the joints? This course teaches you about the soldering process with a metal that has a lower melting point than that of the wires. Wooden structures are often required for electrical wiring. Do you want to know how to make battens from teak? This course will guide you on the making of common batten joints such as straight or corner, and also will teach you about non-commercially available joints like cross and bridge joints.</p><p>Do you know how to make layout diagrams and wiring diagrams for installing electrical systems? This course explains how to make general wiring schemes that are used to take power from the main supply to the required load. Some of them include wiring cables run on the wood battens for lamps and wiring circuits for the bell and a buzzer in a PVC conduit. Following that, the material breaks down special wiring schemes used in unusual applications that are not accomplished by the general wiring schemes, such as controlling a light from two different places. What do we use in places that have a set of rooms in which different lights are located? This course guides you through special lighting circuits for places like hospitals, prisons, godowns (warehouses), and corridors of houses and hotels. Electrical wiring is used in buildings for power distribution. Do you want to know how we estimate the required materials for wiring a building? The course explains three-phase wiring and the seven steps involved in estimating materials.</p><p>Next, it teaches you how to measure the electrical energy consumed for a period of time. The energy meter on the main board is explained, together with the distribution board. Following that, the material discusses testing domestic wiring installation for polarity and insulation. The necessity of correct fuses, and pipe earthing, are also presented. You will learn about the Megger instrument, and the safety measures while using it. In the last section, the course delves into the automobile electric circuit. The lighting of cars, like head-lights and tail-lights, is presented too. This course will be useful to people who want to learn the principles of electrical wiring and distribution systems. Wiring must provide safety and protection from electrical shocks and fire hazards. It is very important to design and construct error-free wiring to avoid these incidents. The construction of electrical wiring must be done only by certified electricians. This course will be very useful to trainee or apprentice electricians who want to gain an in-depth understanding of wiring practice essentials.</p><a href=\"https://alison.com/resume/courses/4053\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4053\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cables, Joints, and Wiring Schemes","description":"In this module, you will be introduced to cables, cable joints, and wiring schemes. You will learn the procedures for removing cable insulation, and various types of cable joints. Also, you will be introduced to the soldering process and the construction of teak wood batten joints. Moreover, you will learn about general & special wiring schemes.","topics":["Cables, Joints, and Wiring Schemes - Learning Outcomes","Cables and Procedures","Types of Cable Joints","Soldering Process","Teak Wood Batten Joints","General Wiring Schemes","Special Wiring Schemes","Cables, Joints, and Wiring Schemes - Lesson Summary"]},{"name":"Module","details":"Lighting Circuits in Buildings and Automobiles","description":"In this module, you will be introduced to special lighting circuits in buildings. Also, you will learn about the three-phase wiring & estimation of materials. You will be introduced to the use of energy meters and the tests in wiring. The necessity of fuses & pipe earthing is presented too. Moreover, you will learn about the lighting of cars.","topics":["Lighting Circuits in Buildings and Automobiles - Learning Outcomes","Lighting Circuits","Building Wiring","Mounting of Energy Meter and Main Board","Test a Domestic Wiring Installation & Pipe Earthing","Electrical Circuitry of Automobiles","Lighting Circuits in Buildings and Automobiles - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Wiring Practice Essentials - Course Assessment"]}]}