{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2985","title":"Working Principles of Marine Ventilation","totalEnrolled":"375","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course covers the ventilation of shipboard spaces, as well as the operation of centrifugal and axial fans.","description":"This free online course on the working principles of ventilation teaches you about optimal air circulation on marine vessels. Study two different types of ventilation and the kinds of ‘sweat’ that occur onboard. Learn about system resistance as well as centrifugal and axial fans, and the most important factors to consider when selecting an efficient fan.","courseOutcomes":["Discuss the different needs of venti...","Describe the ventilation systems use...","Analyze the differences between natu...","Discuss the type of fans and blowers...","Discuss the different needs of ventilation for spaces onboard ships","Describe the ventilation systems used onboard","Analyze the differences between natural and mechanical ventilation","Discuss the type of fans and blowers used on ships for ventilation","Explain the ER ventilation arrangements","State the issues concerning ventilation related to cargo carrying","Evaluate the cargo heating and ventilation needs on a tanker ship","List the maintenance steps for ventilation system on ships","Discuss the different needs of venti...","Describe the ventilation systems use...","Analyze the differences between natu...","Discuss the type of fans and blowers...","Discuss the different needs of ventilation for spaces onboard ships","Describe the ventilation systems used onboard","Analyze the differences between natural and mechanical ventilation","Discuss the type of fans and blowers used on ships for ventilation","Explain the ER ventilation arrangements","State the issues concerning ventilation related to cargo carrying","Evaluate the cargo heating and ventilation needs on a tanker ship","List the maintenance steps for ventilation system on ships"],"courseDescription":"<p>This comprehensive free course begins by introducing you to the functions of shipboard ventilation systems, the definition of ‘ventilation’, as well as the what ventilation controls and the components of such a system. It will also familiarize you with the three basic sections of a ship, as well as the air-circulation problems aboard that could occur in crew accommodation, laundries and galleys, hazardous material storerooms, and double-bottom and deep tanks. Oil tanker and cargo tanker air circulation as well as the two types of ventilation - natural and mechanical - will be covered by the material. The concept of ‘cargo sweat’, changes in cargo sweat from colder to warmer climatic conditions, condensation on the ship’s structure, as well as the condensation on the surface of the cargo are also part of what you will study.</p><p>This course then explains the essential functions of the cargo ventilation system, including the supply of fresh air, prevention of cargo sweat, stopping the build up of poisonous gases and removing any odours from previous cargo. You will learn about the importance of ventilation on ships for both hygroscopic cargo (ie items with natural water or moisture content like vegetables and grains) and non-hygroscopic cargo (ie items that do not contain water, such as steel). The terms related to humidity such as ‘water vapour’, ‘evaporation’, ‘condensation’, ‘saturation’, ‘dew point temperature’, ‘absolute humidity’, ‘dry air’ and ‘saturated air’ will be covered. You will then analyze the restriction of ventilation on voyages from cold to warm climates using four cases in the northern and southern Atlantic Ocean. Ventilation rules, as well as the six relevant temperatures in relation to ventilation, will be explained. You will also learn about the problems associated with combined cargoes, cargo holds’ ventilation requirements for container ships and the need for an elaborate cargo-heating system in ships.</p><p>Furthermore, this course will help you get familiar with the concept and functions of cargo tank venting, as well as EPA (Environmental Protection Agency) emission factors. Controlled venting systems, which can be done by mast-riser venting, as well as high-velocity venting will also be covered. Study combined venting arrangements, and the functions, importance and components of engine-room ventilation, including cooling air and combustion air. Mist eliminators for engine vents, as well as fire dampers, are a crucial part of the material. You will also analyze the functions and differences among fans, blowers and compressors, as well as the components of fan systems. The relationship between system resistance and the volume of airflow, as well as centrifugal and axial fans, will also be covered. This free online course will be of great interest to marine studies or engineering students and those with an interest in the working principles of shipboard ventilation.&nbsp;</p><a href=\"https://alison.com/resume/courses/2985\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2985\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ventilation Systems","description":"In this module, you will be introduced to ventilation systems and the two types of ventilation controls, as well as the two types of sweat that can occur on a vessel. You will also be introduced to a typical ventilation engine room arrangement, as well as the components of an engine room ventilation system. The differences between fans, blowers and compressors, as well as the factors to consider when selecting a fan will also be highlighted in this module.","topics":["Ventilation Systems - Learning Outcomes","Introduction to Ventilation Systems","Cargo Space Ventilation","Cargo Tank Venting and Ventilation of Engine Room","Fans and Blowers","Ventilation Systems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Working Principles of Ventilation - Course Assessment"]}]}