{"subjectName":"Engineering & Construction","subjectDescription":"The engineering and construction industries are essential to building a sustainable future. From civil and mechanical engineering to computer engineering to design engineering and more, Alison has a wide selection of free online engineering and construction courses to suit your nee... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/engineering.jpg","resumeLink":"https://alison.com/resume/courses/2998","title":"Worldwide Energy Sources","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains the impact of different sources of energy on humanity and the planet we inhabit.","description":"This free online course covers the world’s main sources of energy. We examine the wide range of units of measurement used to estimate how much energy we currently consume and the often-catastrophic impact that it can have on the environment. The course compares ‘renewable’ and ‘clean’ energy to investigate the use of such technologies to protect the planet. Finally, we consider the complicating factor of poverty in the energy debate.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course introduces you to energy-use and the impact it has on the environment in the context of global climate change. We explain basic energy calculations and examine some renewable energy technologies. We investigate the feasibility of moving away from carbon-based energy sources and meeting our energy requirements with sustainable sources that don’t pollute the atmosphere. The course establishes the importance of energy in terms of social, economic and technological development as we unpack its sources and the consequences of its consumption. We also define ‘sustainable development’ and determine its scale, indicators and importance.</p><p>The course establishes the difference between ‘unconventional’, ‘renewable’ and ‘clean’ energy and lays out the different types available. ‘Conventional’ energy sources are finite and include oil, coal and natural gas. We cover unconventional ‘clean’ energy sources that include biomasses, the sea, small hydroelectric facilities, wind, geothermal, solar and nuclear energy. We then break energy consumption down by country, sector and population group as you learn how statistical knowledge provides clarity on energy production, consumption and shortages. This means paying close attention to such details within specific sectors like industrial, transportation and domestic.</p><p>We then move on to the alarming impact that current methods of generating energy have on the planet. Harmful industrial practices are producing changes not seen by humanity and understanding the relationship between energy and the environment is essential for sustainable development. We look closely at the effect of energy’s consumption of environmental resources like water, food and fuel amid a drastic increase in population and demand. We then review the consequences of such changes and seek possible solutions. This free online course is aimed at anyone who wants to understand the world’s energy sources and the ongoing quest for energy solutions to save both the planet and its people.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}