{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3046","title":"Advanced Diploma in Literature, Culture and Media","totalEnrolled":"1,235","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides a framework in which to explore the intersections of literature, culture and media.","description":"This free online course covers the impact of literature, culture and media on public trends, beliefs and debates. We guide you through the complex ways that one influences the other and the theories that explain these links. We look at social movements like feminism through the lens of the interwoven disciplines of cultural, political and media studies to appreciate the influence of changing information technology on our public narratives.","courseOutcomes":["Explain various theories addressing ...","Appraise shifts in literary thinking...","Summarize theoretical arguments surr...","Discuss theories of Modernism, postm...","Explain various theories addressing literature, culture and the impact of media","Appraise shifts in literary thinking","Summarize theoretical arguments surrounding the interconnections between literature, culture and media","Discuss theories of Modernism, postmodernism and post-colonialism","Outline the origins of feminism and key theories and development of feminist arguments","Link feminist arguments to the genesis of gender, masculinity and queer studies","Describe Marxist theories of ideology, the linkage between culture and identity and culture as a means of mass deception","Critique the interdependency of culture and media and the impact of technology on both","Unpack the latest developments in media and cultural studies","Explain various theories addressing ...","Appraise shifts in literary thinking...","Summarize theoretical arguments surr...","Discuss theories of Modernism, postm...","Explain various theories addressing literature, culture and the impact of media","Appraise shifts in literary thinking","Summarize theoretical arguments surrounding the interconnections between literature, culture and media","Discuss theories of Modernism, postmodernism and post-colonialism","Outline the origins of feminism and key theories and development of feminist arguments","Link feminist arguments to the genesis of gender, masculinity and queer studies","Describe Marxist theories of ideology, the linkage between culture and identity and culture as a means of mass deception","Critique the interdependency of culture and media and the impact of technology on both","Unpack the latest developments in media and cultural studies"],"courseDescription":"<p>This free online course investigates the socio-political impact of the evolution of literature, culture and media and the technology that connects them. From Johann Gutenburg’s fifteenth century printing press to today’s e-books, mass media have evolved from word-of-mouth to online comments sections and virtual reality. Culture has absorbed these changes and rapidly adjusted to suit its social climate and rejects tradition to embrace postmodernism.</p><p>This course unpacks the complex ways in which society and culture form new perspectives and ideologies. We begin with theories that examine various philosophical and cultural topics. This enables you to deconstruct literature in a critical way and appreciate why the idea of a ‘text’ is often redefined. We follow various theoretical discussions of contemporary culture, literature and the power dynamics that affect their reception.</p><p>We study a number of shifting social, political and artistic perceptions that drive postmodernism in the twenty-first century. This course helps you to understand the profound influence of these three subjects on each other over the centuries. We consider the role of technological advancement on mass media and the movement of narratives and ideas to offer you a richer understanding of the complex relationship between literature, culture and media. This course suits anyone working in the fields of media and communication or who simply wants to understand how our lives are affected by the stories we tell to make sense of the world and ourselves.</p><a href=\"https://alison.com/resume/courses/3046\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3046\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Definitions and Linkages","description":"In this module, you will get an insight into the aims and objectives of this course. It defines literature and culture, highlighting the changing perceptions. It explains the influence of cultural, social and philosophical forces on media forms and literature. This module introduces the linkages between literature, culture, media and technology.","topics":["Definitions and Linkages: Learning Outcomes","Introduction, Aims and Objectives","Defining Literature","Defining Culture","Relationship between Literature and Culture","Literature, Culture and Media","Definitions and Linkages: Lesson Summary"]},{"name":"Module","details":"Cultural Studies","description":"This module describes the linkages and developments between literature and cultural studies. It discusses the contributions and philosophies of some major theorists such as – Raymond Williams, a Welsh Marxist theorist and Stuart Hall, a Jamaican born, British Marxist sociologist. It also highlights and describes the differences between the concepts of high culture, popular culture, subculture and counterculture.","topics":["Cultural Studies: Learning Outcomes","Introduction to Cultural Studies","Cultural Studies I: Raymond Williams","Cultural Studies II: Stuart Hall","High Culture and Popular Culture","Subculture and Counterculture","Cultural Studies: Lesson Summary"]},{"name":"Module","details":"Postmodernism–Development and Impact","description":"This module introduces and explains some theories of modernism and postmodernism and provides the differences. It also describes the peripheral aspects of the theoretical groundings including metanarratives, knowledge and power and post-structuralism and deconstruction by in-depth analysis of the works of Lyotard, Foucault, Saussure and Derrida.","topics":["Postmodernism – Development and Impact: Learning Outcomes","Modernism and Postmodernism I","Modernism and Postmodernism II","Lyotard's The Postmodern Condition: A Report on Knowledge","Foucault's Notion of Knowledge and Power","Poststructuralism and Deconstruction","Postmodernism – Development and Impact: Lesson Summary"]},{"name":"Module","details":"Feminism and Gender Studies","description":"Feminism and gender are two words which are often discussed and are a part of our daily vocabulary. This module focuses on discussions related to feminism and gender issues. It traces the origins of feminism, describes key theories and development of feminist arguments. It will cover the beginnings of gender, masculinity and queer studies.","topics":["Feminism and Gender Studies: Learning Outcomes","Introduction to Feminism I","Introduction to Feminism II","Theories of Gender","Men's and Masculinity Studies","Queer Studies and Representation of Gender in Media","Feminism and Gender Studies: Lesson Summary"]},{"name":"Module","details":"Intersectionality and Postcolonialism","description":"Postmodernist thoughts led to the development of feminism and gender studies which gradually intersected with race. This module focuses on intersectionality. It explores how the theoretical approaches for gender, race and ethnicity have developed in the late 20th century, taking a specific shape and leading to a particular idea for our worldview.","topics":["Intersectionality and Postcolonialism: Learning Outcomes","Intersectionality","Introduction to Postcolonial Theory","Key Concepts in Postcolonial Theory","Said, Spivak and Bhabha","Postcolonial Reading of Achebe and Amitav Ghosh","Intersectionality and Postcolonialism: Lesson Summary"]},{"name":"Module","details":"Culture – Ideology, Identity and Linkages","description":"The terms culture and ideology have multiple meanings and interpretations. So, it is difficult to identify their point of convergence. Both these terms embrace the non-material and subjective aspect of human existence. This module focuses on culture and explains the abstract and intricate theories of ideology, identity and culture industry.","topics":["Culture – Ideology, Identity and Linkages: Learning Outcomes","Theories of Ideology","Adorno and Horkheimer on Culture","Culture Industry, Mass Deception and Walter Benjamin","Interconnection between Literature, Culture and Identity: Woolf and Deshpande I","Interconnection between Literature, Culture and Identity: Woolf and Deshpande II","Culture – Ideology, Identity and Linkages: Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"This is an assessment on the previous six modules on this course. You will need 80% to pass.","topics":["First Assessment: Literature, Culture and Media"]},{"name":"Module","details":"Media","description":"We can trace the beginnings of media to the human temperament of communicating with each other in order to pass on our messages to feel connected and be a part of society. This module focuses on media and explains the interconnections between culture, media and literature. It describes how they are being continuously shaped by each other.","topics":["Media: Learning Outcomes","The Evolution of Media: Print Forms","Media and Culture I","Media and Culture II","Media, Culture and Technology","Harold Innis","Media: Lesson Summary"]},{"name":"Module","details":"Media in the 20th Century","description":"In the 20th century, Marshall McLuhan was a profound voice in the context of media theories within which he analysed the development of human history. This module introduces you to McLuhan's works and the impact of new electric media. It also discusses the postmodern media and highlights the work of Baudrillard and the influence of social media.","topics":["Media in the 20th Century: Learning Outcomes","Introduction to Marshall McLuhan","Media and the Electric Age","Hot and Cool Media","Postmodern Media","Postmodern Media and Formation of Public Opinion","Media in the 20th Century: Lesson Summary"]},{"name":"Module","details":"Culture and Media","description":"People have always tried to link words with certain images in their desire to express emotions and sensibilities. This module takes you on a journey from cave drawings to the projection of moving images, to highlight the interdependency of culture and media. It explores the development of art of cinema and explains some technical terms associated with films. The module concludes with a critical analysis of a film– 12 years a Slave, to understand how films and literary text enrich each other.","topics":["Culture and Media: Learning Outcomes","Word and the Image: Drama, Photography, Birth of the Cinema","Film and Literature I","Film and Literature II","Language of Films: Mise-en-scene, Types of Shots, Camera Angles and Movements, Montage","Reading of 12 Years a Slave: Film and Text","Culture and Media: Lesson Summary"]},{"name":"Module","details":"Development of Media","description":"The journey of media began with handwritten novels, printed newspapers and books and progressed through the development of radio, television, internet and now we are living in a world of digital media and social media. This module traces the development of media, beginning with radio and television, in the context of its influence on culture and literature. It looks at the views and theories of technologys impact on literary genres and concludes with a discussion on media in the 21st century.","topics":["Development of Media: Learning Outcomes","Development of Media: Radio","Development of Media: Television","Film, Television and Literature","Impact of Technology on Literary Genres: Novel","Media in the 21st Century","Development of Media: Lesson Summary"]},{"name":"Module","details":"Media and Literature","description":"Many literary scholars believe that the meaning of literature should be comprehended within the specific medium of its production, transmission and consumption. The media through which literary text is communicated is as important as its form or content. This module explains the approaches to digital forms of media and addresses the shifts and new possibilities offered by the emerging technologies. It concludes with a case study to establish the linkage between media, culture and literature.","topics":["Media and Literature: Learning Outcomes","Approaches to Digital forms of Media","Literature, Internet and Culture","Digital Culture, Media and Literature","Representation of Partition in Different Media: A Historical and Cultural Analysis I","Representation of Partition in Different Media: A Historical and Cultural Analysis II","Media and Literature: Lesson Summary"]},{"name":"Module","details":"Developments in Cultural Studies","description":"This module provides an insight into the gamification and ludification of our culture, described in detail in the topic of game studies. The module also covers body culture studies which explains how the composition of our body affects the psyche of the people and representation of a body through different media. You will also be introduced to the concept of how gender conditioning is important when we use language.","topics":["Developments in Cultural Studies: Learning Outcomes","Game Studies I","Game Studies II","Body Culture Studies and Representation of Women in Media","Media and Gender","Media and Language, Glass Ceiling in Media","Developments in Cultural Studies : Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"This is an assessment on the previous six modules on this course. You will need 80% to pass.","topics":["Second Assessment: Literature, Culture and Media"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}