{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5471","title":"Advanced Chemistry: Introduction to Electrochemistry","totalEnrolled":"173","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online advanced chemistry course covers electrolysis, electrode potential and the Nernst equation formula.","description":"Did you know that photosynthesis (the reaction of water and carbon dioxide to produce glucose and oxygen) is a redox reaction in which water becomes oxidised and carbon dioxide becomes reduced? This electrochemistry course explains redox reactions in electrolysis cells, how to measure the electrode potential and how to utilise the Nernst equation to determine the cell potential under non-standard conditions. Sign up to master electrochemistry.","courseOutcomes":["Define ‘electrolysis’, ‘redox reacti...","Describe the electrolysis cell compo...","Calculate the amount of a substance ...","Explain how to write the oxidation-r...","Define ‘electrolysis’, ‘redox reactions’, ‘standard electrode potential’, ‘redox equilibrium’, ‘half-cell’ and ‘cells and batteries’","Describe the electrolysis cell composition, redox reactions in the electrolysis cell, the galvanic cell components and the Nernst equation formula","Calculate the amount of a substance produced during electrolysis, the Avogadro constant by an electrolytic method and the cell potential under non-standard conditions","Explain how to write the oxidation-reduction reaction and the half-cell","Summarise the galvanic cell components, primary and secondary batteries and their components","Discuss hydrogen cell components and their chemistry","Identify the voltage measured under standard conditions using a standard hydrogen electrodes","List the advantages and limitations of hydrogen fuel cells and the various types of half-cells","Define ‘electrolysis’, ‘redox reacti...","Describe the electrolysis cell compo...","Calculate the amount of a substance ...","Explain how to write the oxidation-r...","Define ‘electrolysis’, ‘redox reactions’, ‘standard electrode potential’, ‘redox equilibrium’, ‘half-cell’ and ‘cells and batteries’","Describe the electrolysis cell composition, redox reactions in the electrolysis cell, the galvanic cell components and the Nernst equation formula","Calculate the amount of a substance produced during electrolysis, the Avogadro constant by an electrolytic method and the cell potential under non-standard conditions","Explain how to write the oxidation-reduction reaction and the half-cell","Summarise the galvanic cell components, primary and secondary batteries and their components","Discuss hydrogen cell components and their chemistry","Identify the voltage measured under standard conditions using a standard hydrogen electrodes","List the advantages and limitations of hydrogen fuel cells and the various types of half-cells"],"courseDescription":"<p>This advanced chemistry course delves into electrochemistry and explains electrolysis, electrode potential, cells and batteries. We begin by discussing redox reactions found in two types: oxidation and reduction reactions. We then describe the chemical reactions influenced by a passing current (called ‘electrolysis’), the electrolysis cell with its components and reactions at the anode and cathode. We then explain how to use quantitative electrolysis to determine the amount of metal deposited when passing a specific current. The course shows you how to calculate the Avogadro constant using an electrolytic method.</p><p>The course then moves on to electrode potential and lays out the method of measuring the electrode potential of a half-cell using a reference electrode (for example, a standard hydrogen electrode with a known potential). We also investigate galvanic cells (voltaic cells), which use spontaneous redox reactions to produce electricity, and their constituent parts. We also compare electrolytic and galvanic cells. The course then examines standard cell potential, cell voltage (standard cell potential) and how temperature, pressure or concentration affect the electrode potential.</p><p>We then cover the Nernst equation, which relates the electrode potential to the temperature and concentration of an electrode. The course investigates primary batteries (non-chargeable disposable batteries), including cylindrical and button primary batteries along with their components, and some secondary batteries (rechargeable) such as lead and Lithium-ion batteries, along with their usage in cars and electronics. We also discuss hydrogen-oxygen fuel cells that power automobiles by generating energy through a redox reaction. Finally, we outline the use of molten electrolytes and aqueous electrolytes. This advanced chemistry course suits chemistry students and aspiring electrical engineers. Sign up to learn more about batteries and electrochemistry.</p><a href=\"https://alison.com/resume/courses/5471\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5471\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Electrolysis","description":"This module covers the electrolysis cell, its composition and quantitative electrolysis. You will learn about redox reactions in the electrolysis cell and how to calculate the amount of a substance produced during electrolysis using charge, current & time triangle for the amount of charge “Q”.","topics":["Electrolysis - Learning Outcomes","Redox Reactions","Electrolysis Cell","Quantitative Electrolysis","Electrolysis - Lesson Summary"]},{"name":"Module","details":"Electrode Potential","description":"This module looks at standard electrode potential, different types of half-cells, and how to measure half-cell electrode potential. You'll investigate the galvanic cell components and the voltage measured under standard conditions with a standard hydrogen electrode.","topics":["Electrode Potential - Learning Outcomes","Redox Equilibrium","Galvanic cells (Voltaic Cells)","Predicting the Occurrence of a Reaction","Electrode Potential - Lesson Summary"]},{"name":"Module","details":"The Nernst Equation","description":"In this module, we discuss the Nernst equation formula used to calculate the cell potential under non-standard conditions. We also explore primary and secondary batteries and the differences between them, as well as the components, chemistry, and benefits of hydrogen-oxygen fuel cells.","topics":["The Nernst Equation - Learning Outcomes","Nernst Equation","Cells and Batteries","Molten Electrolytes Electrolysis","The Nernst Equation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Chemistry: Introduction to Electrochemistry - Course Assessment"]}]}