{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1425","title":"Aflatoun Refresher Training for Teachers","totalEnrolled":"1,731","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This Aflatoun Refresher training course for teachers will provide you with a face-to-face instruction experience.","description":"This Life Skills and Financial Literacy With Active-Learning Methods online course is a refresher training course for teachers and all those who have previously completed a face-to-face training workshop with a minimum three-day duration from Aflatoun International. Aflatoun International is an NGO that offers social and financial education to children and young people worldwide. They reach 5.4 million people each year in more than 100 countries.","courseOutcomes":["Outline how Afaltoun was founded and...","Discuss the role of the clubs in edu...","Explain why learning to save at an e...","Discuss the need for gender equality...","Outline how Afaltoun was founded and how it evolved","Discuss the role of the clubs in educating children","Explain why learning to save at an early age is important","Discuss the need for gender equality","Describe the different learning methods","Outline how Afaltoun was founded and...","Discuss the role of the clubs in edu...","Explain why learning to save at an e...","Discuss the need for gender equality...","Outline how Afaltoun was founded and how it evolved","Discuss the role of the clubs in educating children","Explain why learning to save at an early age is important","Discuss the need for gender equality","Describe the different learning methods"],"courseDescription":"<p>Aflatoun International is based in the Netherlands. Through a strong network of 200 partners and 30 governments, the organization creates high-quality curricula for different age groups which can be contextualized to local needs or specific circumstances. This course will teach you, as a teacher, how to deliver the different Aflatoun curricula to children to the required professional standards. It will help you enhance your understanding of the Aflatoun concept, program, and network.</p><p>You will then learn how to use different types of active learning methods, whether you are using Aflatoun lesson plans or teaching other key subjects in your country's national curriculum. The course will describe how the Aflatoun program helps to develop strong life skills and make students financially literate. You will learn of the different types of training that are provided to teachers as well as have the opportunity to be a part of the research programs that help evaluate the quality and effectiveness of curricula.</p><p>In this rapidly changing and complex world, it is more important than ever before that the young generation is equipped with social and financial skills. This will help ensure that they learn to get along and get ahead in life. This refresher course echoes many of the sessions delivered as part of Aflatoun International's standard training for teachers and adds some additional material to encourage continuous professional development. Make sure to take this course and be recognized in a global community of Aflatoun teachers.</p><a href=\"https://alison.com/resume/courses/1425\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1425\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Implementing a Varied Aflatoun Program","description":"Implementing a varied aflatoun programme with a balance of social and financial education that focuses on quality of education, gender equality, clubs and elections, savings activities and enterprise projects.","topics":["About this course","Clubs in the Aflatoun Program","Core Program Activities","The United Nations Convention on Human Rights","Children and Saving","Child Social and Financial Enterprise","Gender Equality in the Classroom","Programmatic Issues Summary"]},{"name":"Module","details":"Child-Centered Pedagogies with Active Learning Methods","description":"This module builds the capacity of teachers to use a child-centred pedagogy characterised by active-learning methods. Those active-learning methods appear regularly in the curricula. Teachers are also encouraged to use them while teaching critical subjects in their national curricula.","topics":["Brainstorming","Problem Tree","Image Theatre","KWL Charts","Memory Cards","Jigsaw Strategy for Structured Group Work","Teacher Talking Time vs Student Talking Time (TT vs ST)","Pedagogies Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Aflatoun Final Assessment"]}]}