{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1776","title":"Aggregate Supply and Demand","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study how aggregate supply and demand helps economists interpret economic events with this free macroeconomics course.","description":"Aggregate supply and demand are key concepts in macroeconomics. Determining the supply and demand for services can help economists interpret events in the past, provide a basis for price determination in a market, and even facilitate forecasts of the economy's future. This course will teach you the fundamentals of modelling aggregate supply and demand, and why a single event can have a significant effect on these models.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will introduce you to the business cycle, where you will learn that the local economy is constantly expanding and contracting because it responds to changes in the global economy, technology, and national and international politics. You will then study the concept of aggregate demand, how it shifts, and how it is modelled. You will also look into aggregate supply and learn why changes in supply can be slower than changes in demand.</p><p>Go on to study how demand-pull inflation arises when the aggregate demand curve shifts to the right. You will learn that the productivity measure commonly reported through the media is based on the ratio of GDP (gross domestic product) to total hours worked in the economy during the measuring period. This course will discuss the ‘long run’, which is a period of time wherein firms are able to adjust or negotiate all costs associated with the business.</p><p>By the end of this course, you will have a much stronger understanding of the aggregate supply and demand curve models. These are both crucial tools for understanding the direction and status of a nation's local and global economy. Once you have a stronger grasp of them and the differences between the short run and long-run supply, you will be much much closer to predicting potential changes and inflation in specific economies.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}