{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4597","title":"Agricultural Science - Soil Science and Plant Nutrition","totalEnrolled":"7,259","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Delve into the best farming practices and the vital nutrients needed for plants to grow with this free online course.","description":"Are you a farmer struggling with productivity? Do you wish to eliminate pests and weeds? We have designed this course to help you achieve optimal productivity by guiding you on the best farming practices for high-quality crops. You will learn about seed planting methods and crop management. We’ll teach you the characteristics and properties of the soil that contribute to fertile soils and the necessary control measures for pests and weeds.","courseOutcomes":["Identify various planting patterns a...","Explain the seed germination process...","Discuss the sexual and asexual metho...","Recall the importance of horticultur...","Identify various planting patterns and sowing methods","Explain the seed germination process and the factors determining germination","Discuss the sexual and asexual methods of plant propagation","Recall the importance of horticulture in plant propagation and cultivation","Enumerate the basic environmental requirement for plant growth","List the factors that determine the establishment of a nursery","Outline and describe the layers of the soil","Differentiate between micronutrients and macronutrients","Examine how to control pests and weeds on the farm","Identify various planting patterns a...","Explain the seed germination process...","Discuss the sexual and asexual metho...","Recall the importance of horticultur...","Identify various planting patterns and sowing methods","Explain the seed germination process and the factors determining germination","Discuss the sexual and asexual methods of plant propagation","Recall the importance of horticulture in plant propagation and cultivation","Enumerate the basic environmental requirement for plant growth","List the factors that determine the establishment of a nursery","Outline and describe the layers of the soil","Differentiate between micronutrients and macronutrients","Examine how to control pests and weeds on the farm"],"courseDescription":"<p>Over time, our interaction with the soil has influenced our ability to produce food affecting our economic growth. The relationship between humans, the earth and food sources proves that the soil is the bedrock of agriculture. Soil and water have given humanity the ability to generate food for our survival through agriculture. This course explores the link between soil and agriculture by focusing on the major soil properties that help make the soil fertile. First, we introduce you to the basic ideas of 'agriculture' and 'agronomy' that will help you to understand the several techniques used for seeds and crop management. We introduce you to horticulture, which will in turn help you gain insights into different types of nursery production. Explore the factors essential for setting up a productive nursery and the concept of plant propagation, how it works and the two common methods used in plant propagation.&nbsp;&nbsp;</p><p>Soil is a mixture of different materials including minerals, rock, water and air and lies on top of the land containing living and dead matter. It offers structural support for agricultural plants and is a source of water and nutrients. We help you gain an in-depth knowledge of soil classification, soil fertility and plant nutrition. We discuss the physical properties of the soil, such as soil texture, structure and pH. Natural cycling of nutrients from the earth to plants and animals and then back to the ground has occurred throughout Earth's history, primarily through biomass breakdown. This cycle aids in the preservation of vital nutrients for plant development in the soil. We will provide you with insight into the essential soil minerals for plants. Discover the chemical elements necessary for plant nutrition and nutrient deficiency symptoms.&nbsp;</p><p>Pests are organisms that can compete with or damage plant species. They reduce plant density, cause stunted growth in plants, reduce production capacity and in many other ways reduce the quality of farm produce. This course will show you the necessary measures for controlling pests, including pesticides and their applications. On top of that, we review other pest control measures such as insecticides, fungicides, rodenticides and more. Weeds reduce yields, increase production costs, interfere with harvesting and reduce product quality. They also impede the flow of irrigation water and harbour disease-causing organisms. In light of this, we will help you understand weeds and their classification. Discover the different weed-controlling methods to implement depending on the situation at hand. This course is open to farmers, students and anyone who wishes to learn more about crop production, plant nutrition and agricultural science. A world without agriculture is dismal as our primary food source stems from this practice. Why not take part in securing tomorrow and enrol now!</p><a href=\"https://alison.com/resume/courses/4597\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4597\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Agricultural Practices","description":"In this module, you'll be introduced to the basic ideas of agriculture and agronomy. We will discuss the methods of sowing and plant propagation. You will gain insights into the different types of nursery, soil and its characteristics. We'll cover the essential mineral soil minerals for plants and the necessary measures for controlling pests.","topics":["Agricultural Practices - Learning Outcomes","Introduction to Agriculture","Soil Science and Plant Nutrition","Pest and Weed Control","Agricultural Practices - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Agricultural Science - Soil Science and Plant Nutrition"]}]}