{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1842","title":"Algebra in Mathematics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a good understanding of the fundamentals and key aspects of Algebra in mathematics","description":"This free online algebra course offers a comprehensive introduction to algebra and carefully and clearly explains the concepts of algebraic fractions. Have you ever asked yourself why algebra is so complicated? Well, you're not alone. This Algebra in Mathematics course is designed to make studying mathematical symbols much easier for you. Take this free online course today and make your math studies a lot less stressful!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you know that the word algebra came from the Arabic word al-jabr. This word dates back to the title of a 9th-century manuscript written by the mathematician Al-Khwarizmi, who is known as the Father of Algebra. Now that you know whom to thank Algebra for, it's time to learn it. First, this course will clearly explain how to simplify your algebraic expressions, with expansion of brackets and factorising.</p><p>The course starts off with teaching you how to factorise an algebraic equation, and the two different methods for expanding brackets, how to rearrang simple formulae, what a surd is and how binomial expansion works. In the second module you will be learn about solving different types of quadratic equations, along with what simultaneous equations are and how to solve them. The module ends with explain hidden quadratics, the discriminant and how to solve equations with indices.</p><p>In the following module you will be taught about how to solve logarithmic and exponential equations, along with the factor and the remainder theorems. The third module finishes with explaining how to find the root of a cubic equation and what modulus is and how to work it out. Next you will learn about inequalities in quadratic equations and linear equations, and how to solve them using either the trial and error method, the algebra method or the graphical method.</p><p>In the last module you will learn about complex numbers and what they are, imaginary numbers and the meaning of I, converting numbers to the polar form and multiplying and dividing in the polar form. The module finishes by showing you how to prove De Moivre’s theorem, complex numbers when solving quadratic equations, complex roots and cube roots.</p><p>This course would be of great interest to any one looking to further or upskill their mathematical knowledge and capability.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}