{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3680","title":"An Introductory Course on Alcoholic Spirits","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Cocktails, production techniques, aging processes and more are covered in this fascinating course on alcoholic spirits.","description":"This free online course in spirits and distillation outlines the definition of ‘spirits’, their unique manufacturing process, the raw materials required to produce various types, and their aging processes. You will study the industry-specific terms used in the hospitality arena, specialist bartending gear and liquor-related equipment. The course also explains various blends of classic and other cocktails.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This introductory course looks at the different classifications of alcoholic beverages and their production processes. Liquor or spirit (also called distilled alcohol) is an alcoholic drink produced by the distillation of various raw materials. These first undergo a process of alcoholic fermentation by the addition of biological catalytic agents. The distillation procedure concentrates the liquid to improve its alcohol content. As liquors contain significantly more alcohol (ethanol) than other alcoholic drinks, they are considered ‘harder’. The term ‘hard liquor’ is used to distinguish distilled alcoholic drinks from non-distilled ones. Examples of liquors or spirits include gin, absinthe, whisky and many more. The course will conclude by exploring the different equipment and utensils used in bartending.</p><p>The earliest known evidence of alcohol production comes from Akkadian tablets (now central Iraq) that are dated at approximately 1 200BC. They provide textual evidence that an early form of alcohol refinement was known to the Babylonians of ancient Mesopotamia. Like other alcoholic drinks, liquor is typically consumed for the psychoactive (mind-affecting) effects to the person who consumes it. The word ‘spirits’ generally refers to distilled beverages low in sugars and containing at least 35% alcohol by volume. You may consume liquor on its own, typically in small amounts. In an undiluted form, distilled beverages are often slightly sweet, somewhat bitter and naturally impart a burning mouthfeel, with a strong odour from the alcohol itself. Liquor is also typically enjoyed in diluted form or as a mixed drink, with cocktails being a common beverage that use liquor.</p><p>Ordinarily, cocktails are a mixture of one or more spirits mixed with other ingredients such as flavoured syrup, fruit juice or even cream. Cocktails vary widely across regions of the world and may be as unique as the bartenders who make them. Whether you’re a pro behind the bar or just exploring becoming a bartender, to be accomplished you must never stop learning and always jump at the chance to up your game. Delivering exceptional customer service at small or large functions ensures that you spark more significant sales. Using state-of-the-art bartending equipment also ensures that you deliver the best client service to all your guests.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}