{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2851","title":"An Introduction to Good Lab Practices","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the systems and principles involved in good laboratory practices.","description":"What are the guidelines and standards that are considered to be good laboratory practice (GLP)? In this free course, learn the definition of good laboratory practices before moving on to look at buffer solutions. A buffer solution, which refers to a liquid mixture in which the minor component is uniformly distributed within the major component, will be discussed in detail.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course, you are introduced to the world of good laboratory practices (GLP), which embodies a set of principles that provide a framework within which laboratory studies are planned, performed, monitored, recorded, reported and archived. The three levels of categorization from the Rosch approach, will also be discussed. You will be introduced to the concept of ‘buffer capacity’, a quantitative measure of the resistance to change of pH by a solution, containing a buffering agent with respect to a change in the acid or alkali concentration. You will learn that the Organization for Economic Co-operation and Development (OECD) published the principles of GLP as guidelines for any professionals that carry out experiments in a lab. You will discover why there is list of recommended appropriate personal protection equipment (PPE) to always wear in a laboratory. Demonstrations, problems, examples and assessment questions in this instructor-led video-based course, are designed to provide you with a comprehensive foundation in everything connected to GLP.</p><p>The material introduces you to the definition of GLP and the different levels of categorization. Then, the material safety data sheet (MSDS) will be discussed, which is a document provided by the manufacturer that contains information about the potential hazards of their material. You will explore the buffer solution, which is used during experiments as a means of keeping the pH at a nearly constant value in a wide variety of chemical applications. You will discover the fact that at a fixed centrifugal force and liquid viscosity, the sedimentation rate of a particle is proportional to its size and the difference between the particle density and the density of the solution. It will be clarified that the term, ‘solution’, refers to a liquid mixture in which the minor component is uniformly distributed within the major component during a laboratory experiment. You will discover that the sterilization decontamination action is appropriate to use after handling microbes that fall under biosafety level three and four because these microbes can cause serious or potentially lethal diseases through respiratory transmission in human beings.</p><p>Next, you will learn that all scientists should prepare written reports on the results of their experimental work, and this information is derived from the data recorded under the various sections of the laboratory notebook. You will gain insight into the fact that the definitional approach to categorization proposes that category memberships are determined by comparing possible exemplars to a typical member of the category whilst the exemplar approach to categorization involves determining whether an object is similar to a standard object or not. You will then discover that sedimentation refers to a physical water treatment process where high-density particles are made to settle at the bottom of a water solution. You will be taught the factors that have an influence on centrifugation, are the density of both samples and solutions, temperature, the distance of particle displacement and the rotation speed. Finally, you will study liquid handling systems, types of centrifuges, laboratory safety guidelines and the operation of laboratory instruments. This course will be of interest to biotechnology students, or those professionals in any scientific field where lab practices are of prime importance.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}