{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3791","title":"An Introduction to Philosophy","totalEnrolled":"2,912","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the History of Western Philosophy from Ancient Greece to Contemporary Societies in this free online course.","description":"This free course is for those who are interested in Philosophy. It will provide an overview of Western Philosophy from Ancient Greek through to our modern-day contemporary societies. You will learn about the main domains of Philosophy and several concepts such as Neoplatonism, Modernity, Rationalism and more. Also, you will be introduced to the most prominent philosophers through history and examine their works and contributions. Enrol today!","courseOutcomes":["Define the term philosophy and state...","List the three main objects of inter...","State the main contributions made by...","Explain Aristotle’s most influential...","Define the term philosophy and state its origin","List the three main objects of interest in philosophy","State the main contributions made by Socrates and Plato","Explain Aristotle’s most influential domains of work","Compare the work of Saint Augustine to Plato and Aristotle","List the main philosophical ideas and arguments contributed by Aquinas","State the contributions of René Descartes to philosophy and mathematics","Explain the concept of Rationalism as found in the works of Spinoza","Define the term philosophy and state...","List the three main objects of inter...","State the main contributions made by...","Explain Aristotle’s most influential...","Define the term philosophy and state its origin","List the three main objects of interest in philosophy","State the main contributions made by Socrates and Plato","Explain Aristotle’s most influential domains of work","Compare the work of Saint Augustine to Plato and Aristotle","List the main philosophical ideas and arguments contributed by Aquinas","State the contributions of René Descartes to philosophy and mathematics","Explain the concept of Rationalism as found in the works of Spinoza"],"courseDescription":"<p>Philosophy has been a subject of study since the beginning of Western Civilization. Western Philosophy has been dramatically influenced by legendary names such as Socrates, Plato, Aristotle, and many more. During different periods, their philosophical works and contributions have shaped the modern societies we live in today. This online philosophy course is perfect for beginners and enthusiasts who would like to experience a journey through the history of Philosophy.</p><p>We’ll be following a chronological approach, starting by defining Philosophy from Ancient Greece. You will learn its main domains and the ‘Philosophical Trinity’: The True, Good, and Beautiful. We will then introduce you to the main figures contributing to philosophy, starting with Socrates, Plato, and Aristotle. We’ll discuss their works and philosophical reasoning. Next, we’ll explore the concepts of Neoplatonism in the Medieval period and the works of the Saint Augustine of Hippo, examining ‘pagan’ philosophy to monotheistic philosophy. You will also learn about Saint Thomas Aquinas, regarded as the most significant medieval Christian philosopher. His primary focus and ideas came at the end of the medieval period.</p><p>Further on, we’ll introduce you to the following main period known as ‘Modernity’ or the era of ‘Modern Philosophy’. The leading actor here was the well-known René Descartes. We will also review his works, ideas, legacy, and influence. Finally, we’ll explore Rationalism, which began with Descartes and was advanced by Baruch Spinoza. Although Spinoza died young, some of his notable works still studied today include&nbsp;Ethics,&nbsp;Conatus,&nbsp;Passions and&nbsp;Reason. This course is for beginners and anyone interested in the fundamentals of philosophy. Best of all, it’s free, detailed, and informative. Sign up today!</p><a href=\"https://alison.com/resume/courses/3791\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3791\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Philosophy","description":"This module will provide an introduction to Philosophy. It will begin with the definition of Philosophy and its origin. You will learn the history of Western Philosophy from Ancient Greece to modern-day contemporary societies. Also, you will learn about the major contributors to Philosophy, specifically: Socrates, Plato, and Aristotle.","topics":["Introduction to Philosophy - Learning Outcomes","Philosophy, Socrates, and Plato","Aristotle, Sceptics, and Stoics","Introduction to Philosophy - Lesson Summary"]},{"name":"Module","details":"Historic Figures In Philosophy","description":"This module will discuss Neoplatonism and the works of the Christian philosopher Saint Augustine of Hippo. You will also learn about the philosophical contributions made by Saint Thomas Aquinas. Further on, this module will examine the concepts of Modernity and Rationalism influenced by René Descartes and Baruch Spinoza respectively.","topics":["Learning outcomes","Neoplatonism and Introduction to Modernity","Empiricism and, Idealism and Contemporary Philosophy","Historic Figures in Philosophy - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Philosophy - Course Assessment"]}]}