{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2811","title":"An Introduction to Romantic Literature","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free course on English literature of the Romantic period, including major contexts, themes, trends and criticism.","description":"What are the chief contexts, themes and trends of English literature of the Romantic period? In this free online course, you will examine the works of prominent writer and poets of the 1790s to the 1830s to understand the works themselves and the era in which they were created. Study concepts like 'sensibility', 'psychologism' and how the expansion of the British empire influenced writers like Wordsworth, Byron and Shelley.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Register for this free online course on English literature of the Romantic period, which extended from 1798 to 1832, to analyze the various factors, events and political thoughts that influenced the minds of the authors as well as their readers, and thereby shaped the English Romantics. You will learn about the expansion of print and its consequences, including wide-ranging literacy and a greater demand for the publishing of certain kinds of books. You will also learn how the expansion of the British empire introduced the authors to exotic cultures, slavery and the sciences.</p><p>This course will help you correlate history, such as the age of ‘sensibility’ (when the quality of being able to appreciate and respond to complex emotional or aesthetic influences was valued) and the French Revolution, with the literature that they influenced. You will be introduced to concepts such as ‘antiquarianism’, ‘individualism’ and ‘psychologism’ (or a&nbsp;‘tendency to interpret events or arguments in subjective terms, or to exaggerate the relevance of psychological factors’) that emerged as key themes in the literary works of the period. You will also be able to see English poets and authors such as William Wordsworth, Samuel Taylor Coleridge, Percy Bysshe Shelley and Lord Byron through the eyes of their critics.</p><p>This course will be useful to all those who are interested in English literature or in the Romantic period. Students who wish to pursue a career in English literature and literary criticism will find this course especially valuable. Start now and enrich your knowledge of one of the most interesting periods of English literature and history.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}