{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4849","title":"An Introduction to Astronomy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will explore the nature and characteristics of celestial bodies that lie beyond our planets.","description":"Are you intrigued by what lies beyond our planet and galaxy? This course will help you gain an in-depth understanding of the universe and how it works. The course explores common celestial bodies from comets to planets in our solar system and faraway galaxies. Learn about the Big Bang theory and how the universe might end. By the end of this course, you will have gained fascinating knowledge of the workings of our cosmos.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you pondered the nature of planets, stars, galaxies and the universe? Astronomy is a branch of science that attempts to explain what we observe in our galaxy. It studies everything beyond our planet, from our own solar system's planets and stars to distant galaxies billions of light years away. This course will introduce you to astronomy and some approaches scientists use to observe the night sky. You'll learn about constellations, the celestial sphere and the celestial coordinate system that modern astronomers use to map stars, satellites, planets and other objects in space when viewed from Earth. Explore some of the best equipment for observing the night sky, such as telescopes and binoculars.&nbsp;</p><p>The Moon is a natural satellite and Earth's nearest celestial neighbour. Do you wonder why the Moon sometimes appears to be a crescent and other times full? Discover the Moon's history and formation, including its changing phases and colour-change phenomena. Discover its landscape features and physical characteristics. Investigate how and when to look for lunar phenomena and what you can expect to see. Have you been puzzled about the origin and causes of a shooting star? ‘Shooting star’s are meteors and this course explains the origins of meteors and meteorites, including where they come from and why they continue to fall on Earth. We'll show you the steps and the tell-tale signs used to identify a meteorite on the surface of the Earth.&nbsp;</p><p>Asteroids provide us with information about the Solar System's origins and pose a threat to life on Earth. Discover the difference between asteroids and other celestial bodies, the danger they pose, where they come from and how to spot them. We explain the history of comets and why they regularly revisit Earth, including the famous Halley's Comet. You will study the theory and evidence that supports the idea of a ‘Big Bang’ creating the universe. We'll also explore the notions and exploration of life outside of Earth. Find out what will become of the universe as we examine some theoretical suggestions of how the universe might end in the final part of this course. This course is open to all learners who want to understand the universe's characteristics. Research where we came from and where we are heading by examining the natural world beyond our planet. So why wait? Enrol now and learn for free!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}