{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2790","title":"An Introduction to Ecology and Culture","totalEnrolled":"451","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about ecology and the impact our culture has on the environment.","description":"This free online course is about finding the connections between ecology and human social, cultural and organizational processes. After the Industrial Revolution, the increase in the human population and the rise of technology and development were seen as threats to the natural environment. This fragility of the ecosystem as a result of a bigger demand for natural resources since the 18th century, is studied in this foundational ecology course.","courseOutcomes":["Distinguish the difference between e...","Explain the relationship between eco...","Summarize the development of environ...","Define cultural ecology, human ecolo...","Distinguish the difference between ecology and the environment","Explain the relationship between ecology and human society","Summarize the development of environmentalism from the 1960s to the present","Define cultural ecology, human ecology, environmental determinism and environmental possibilism","Analyze the concept of culture","Discuss the relationship between cultural ecology and economics","Describe the impact of human activity on the environment","Distinguish the difference between e...","Explain the relationship between eco...","Summarize the development of environ...","Define cultural ecology, human ecolo...","Distinguish the difference between ecology and the environment","Explain the relationship between ecology and human society","Summarize the development of environmentalism from the 1960s to the present","Define cultural ecology, human ecology, environmental determinism and environmental possibilism","Analyze the concept of culture","Discuss the relationship between cultural ecology and economics","Describe the impact of human activity on the environment"],"courseDescription":"<p>This foundational course on ecology and culture introduces you to the impact human settlements have on the Earth’s resources. The ecology of human societies is about finding the connections between ecological systems and human social, cultural and organizational processes. This is an introductory course in the field of Ecology and Human Societies and will shine a light on the demands modern society makes on the planet.</p><p>You will study the environmental movement that flourished in the 1960s and how a call was made to world governments to legislate laws in order to protect the environment. You will learn how, during the decades preceding the 1960s, major steps towards the protection of the environment were made, from laws that regulate pollution and the use of natural resources, to the creation of non-profit organizations such as Greenpeace and the Worldwatch Institute.</p><p>You will then learn about the field of cultural ecology, the study of human adaptations to social and physical environments. In addition, the cultural processes that enable a population to survive within a given or changing environment will be explained. You will also understand how human societies have created economic systems in response to their environments and how these changing systems have had an impact on the use of natural resources. If you interested in realizing how social and cultural processes impact the environment, then start this course today and deepen your understanding of the connections between ecology and culture.</p><a href=\"https://alison.com/resume/courses/2790\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2790\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Ecology and Society","description":"In this Module, you will be introduced to the field of Ecology and the impact that The Environmentalism Movement has had in protecting the environment.","topics":["Introduction to Ecology and Society- Learning Outcomes","The Relationship Between Ecology and Society","Basic Principles of Ecology","The History of Environmentalism","Introduction to Ecology and Society - Lesson Summary"]},{"name":"Module","details":"Cultural Ecology","description":"In this Module, you will learn about Cultural Ecology as you study the relationship between a community's environment and the emergence of their cultural values. You will also learn how the environment and culture have an impact on the economy.","topics":["Cultural Ecology - Learning Outcomes","Ecology and Culture","Cultural Ecology and Economics","Cultural Ecology Theory","Cultural Ecology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}