{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3432","title":"An Introduction to Modernistic Poetry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Meet famous Modernist poets like W.B. Yeats and T.S. Eliot while you explore their work with this free online course.","description":"This free online course introduces you to the features of poetry developed and written during the Modernist era, which fell mainly between 1900 and the Second World War. What is Modernist poetry? What defines this era and sets it apart? We answer such questions while taking you through the roots and context of this revolutionary artistic movement. Sign up to acquire new comprehension skills as you trace words that still echo down the years.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Poetry is one of the oldest forms of literary art and conveys a thought, idea or feeling to tell a story intensively, often through lyrical or rhythmic styles. Modernist poetry was a fresh style of poetry that grew out of the traditional form of lyrical expression and forged ahead with strong imagery of individual creativity, culture and dynamic content. The movement also moved past the reliance on rhyme and chose to focus more on free verse. This genre insisted on detaching from the past and mixed elements of various periods to create something new. We trace this shift in mentality that led Modernist poetry to its current place of importance.</p><p>The course begins with a look at the context that launched Modernist poetry and how it defined the emerging genre. Do you like the idea of writing poetry without a formal rhyme structure or style? This course leads you through the exciting shift during which poets embraced blank verse and began rejecting tradition while drawing on elements like symbolism and imagery to influence the new poetic style. We provide an overview of the period and its defining characteristics before delving into individual works, particularly those of William Butler Yeats and T.S. Eliot. We map the exciting connections that make T.S. Eliot such an influential poet as you discover his poem ‘The Waste Land’ and analyze the intricate details that made the poem one of the most well-known works of the last century.</p><p>The course then moves on to the evocative verses of Wilfred Owens and Dylan Thomas while explaining the circumstances and influences that informed their work. We examine Owens’ ‘Strange Meeting’ closely to find its deeper meanings, a useful skill that you can transfer to other fields in the future. This introductory course helps you understand Modernist poetry in its context and suits anyone with an interest in poetry and its impact on the world. This course can also aid in developing your interpretation skills and ability to make connections. Beyond that, we take the time to appreciate the beauty of these famous poems and hope you choose to join us.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}