{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3796","title":"An Introduction to the Principles of Phenomenology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, study the basic principles, features, and tenets of the conscious science of phenomenology.","description":"In this free online introductory course, study phenomenology's fundamental principles and characteristics as a philosophical discipline. You will examine some precursors to this movement. Similarly, we will discuss the rise of phenomenology as an influential philosophical concept in the 20th century. By completing this free online course, you will gain an exciting and professional insight into the conscious science of phenomenology. Enrol today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Phenomenology is a disciplined study of all phenomena. Etymologically, the term 'phenomenology' comes from two ancient Greek words, 'phenomena' and 'logos'. While the word 'logos' could be interpreted as 'logic', it also has several other meanings, including the 'Word of God'&nbsp;in the biblical New Testament. A phenomenon, also translated as 'appearances', is anything that can appear to conscious awareness, from actual chairs (real) to unicorns (imagined) to ideas (thoughts). As such, it encompasses the whole of human conscious experience. In this free online course, you will learn about the key 'how' and 'what' elements of phenomenology. Then, you will discern why this conscious science's methodological point of departure is the former and not the latter. We will identify the two essential ingredients for attaining the 'how' (also known as the immediate lived experience). You will see why the emphasis of phenomenology on the tonalities and structures of one's immediate experience is the dedicated call - to \"return to the things themselves!\" Examine the phenomenological law of intentionality and how it relates to the two aspects of 'lived' experience.&nbsp;</p><p>Next, you will notice how phenomenology is closely related to the historical-philosophical tradition of empiricism. Additionally, you will learn about the complex, layered structures and insights, distinguishing phenomenology from empiricism (a precursor of the former). You will also be shown how phenomenologists get to the 'essence' of what something is by taking a stance on idealism and realism (also known as the 'realism idealism' axis). Then, we will highlight the contrasting ideologies of idealism and realism proponents of phenomenology (which surged with transcendental idealism). Similarly, you will examine how phenomenology became a descriptive science by taking up the methods proposed by Franz Brentano in 'Descriptive Psychology'. We will use an author-centred approach to present the works of Husserl, who is the originator and instigator of the phenomenological movement. We will discuss the three main periods of Husserl's phenomenological work. The breakthrough period will cover&nbsp;Method and Eidetic, Intentionality, Perception, the 'Lived body'&nbsp;and more. Then, you will also learn about transcendental and genetic phenomenology. Likewise, we will consider the works of Heidegger, an existential phenomenologist, (e.g.&nbsp;Being and time&nbsp;[1927],&nbsp;Dasein&nbsp;[being-there],&nbsp;Das Man,&nbsp;Ready-to-hand,&nbsp;Present-to-hand, etc.).</p><p>Lastly, we will examine the contributions of Jean-Paul Sartre to phenomenology, including,&nbsp;Transcendence of the Ego&nbsp;(1936),&nbsp;Sketch for a theory of the Emotions&nbsp;(1938), and other key themes. Learn about Emmanuel Levinas and his style of phenomenological existential philosophy - 'human conscience is never alone'. The works of Levinas will amplify the&nbsp;'Face' (Visage) of the Other;&nbsp;Religion, God, and Judaism; etc. You will also examine the works of Simone de Beauvoir, including the&nbsp;Second Sex&nbsp;(1949),&nbsp;'Lived Experience'&nbsp;(1949) and&nbsp;An Ethics of Ambiguity,&nbsp;to mention a few. In addition, the&nbsp;Visible and Invisible&nbsp;(1964),&nbsp;Eye and Mind&nbsp;(1961), as well as,&nbsp;The Phenomenology of Perception&nbsp;(1945), proposed by Merleau-Ponty. Then, we will cover the rise of phenomenology as an influential philosophical concept in the 20th century. What is the phenomenological law? What are the distinctions and similarities between the phenomenological models? We will address these questions in the course and examine the facts that surround them. By completing this course, you will learn how to apply phenomenological concepts for theoretical insights, concrete applications, influence, and development. So why wait? Enrol for this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}