{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3797","title":"An Introduction to the Principles of Existentialism","totalEnrolled":"701","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the tenets of existentialism and create a free, exciting and purposeful life in this free online course.","description":"In this free online introductory course, we will examine the historical development of existentialism from the 19th and 20th centuries to this present day. You will develop a better understanding of the existentialism ideologies, principles and influence of the eight most notable existentialist philosophers. By completing this course, you will learn how to lead a lifestyle of freedom and self-actualization by doing only what you truly enjoy.","courseOutcomes":["Define existentialism and identify i...","Recognize the relationship between e...","Explain the theoretical and literary...","Discuss the main ideologies, legacie...","Define existentialism and identify its basic principles and unique characteristics","Recognize the relationship between existentialism, philosophy, and literature","Explain the theoretical and literary development of existentialism in the 20th century","Discuss the main ideologies, legacies, and influences of the eight most notable existentialists","Relate the tenets, insights, and focus of existentialism in this contemporary era","Outline the main issues and focal points of existentialism for the future","Define existentialism and identify i...","Recognize the relationship between e...","Explain the theoretical and literary...","Discuss the main ideologies, legacie...","Define existentialism and identify its basic principles and unique characteristics","Recognize the relationship between existentialism, philosophy, and literature","Explain the theoretical and literary development of existentialism in the 20th century","Discuss the main ideologies, legacies, and influences of the eight most notable existentialists","Relate the tenets, insights, and focus of existentialism in this contemporary era","Outline the main issues and focal points of existentialism for the future"],"courseDescription":"<p>Existentialism is a principle and way of expression that is deeply aware of the existence of humans and other creatures. This existence, in our case, cannot be described as being a rock is a rock, but a conscious, individual existence. Through feelings, introspection, reflection, and questioning, the elements of the individual existence can be sensed and pondered. And with this existence comes human freedom. This freedom is not the pensive 'freedom of the will' but one that could run very deep into our core as human subjects. It is an existential structure that ultimately goes beyond any one specific being. This free online course will highlight the mutually beneficial relation (the synergy) between existentialism in philosophy. We also cover theory and existentialism in literature. We will outline the historical past of existentialism from its theoretical and literary rise. Once we have covered this background, we will look into the philosophically rebellious stance against rationalism, empiricism, and German idealism in the 20th century. You will examine the works of existentialist philosophers like SØren Kierkegaard, Fyodor Dostoyevsky, Franz Kafka, Simone de Beauvoir and many more. We will also look into their main existentialist themes, legacy, and influence.</p><p>An overview of SØren Kierkegaard's&nbsp;'Either/Or: a Fragment of Life'&nbsp;from 1843 will be presented. You will also examine&nbsp;Fear and Trembling&nbsp;(1843) and how it engages more directly with a religious and theological issue surrounding God and theological-existential interpretations. We will highlight the main existentialist themes of Kierkegaard, including the studies of anxious subjectivity. We will also study the theory and praxis for building objectivity and stability. Likewise, we will examine the monumental works of Fyodor Dostoyevsky, one of Russia's most renowned literary exports, including,&nbsp;The Double&nbsp;(1846),&nbsp;Underground&nbsp;(1864), and&nbsp;Brothers Karamazov&nbsp;(1880). The course also covers the insecurity of human existence and the power of human freedom and passion. It explores the perennial question of God or a higher principle, which are Dostoyevsky's key existential themes. The philosophies of Friedrich Nietzsche will discern the ultimate meaninglessness of all human life, i.e. from the perspective of Nature, our lives and whole existence is relatively insignificant. Then, we dissect Nietzsche's most famous and debated proclamations, 'God is dead' - a cornerstone of existentialism.</p><p>Finally, we will examine the three metaphorical stages for the life, existence, and possible development of a human being, illustrated in 'Thus Spoke Zarathustra' (1885). We will posit the legacy and other existential themes of Friedrich Nietzsche. An exposition to the works of Franz Kafka, including,&nbsp;The Metamorphosis&nbsp;['Die Verwandlung', 1915],&nbsp;The Trial&nbsp;['Der Process', 1925], etc., will be presented. Similarly, the Existentialist philosophies of Martin Heidegger will elucidate human reality in its most elemental and existential form. Then, we will study theoretical distinctions of Heidegger's foundational ontological and existential structures, dynamics, and categories. Furthermore, you will consider&nbsp;existentialism is a Humanism&nbsp;(1945),&nbsp;The Ego&nbsp;(1936),&nbsp;Being and Nothingness&nbsp;(1943), and other key models of Jean-Paul Sartre. Likewise, we will highlight 'Existentialism and Popular Wisdom' (1945),&nbsp;Ethics of Ambiguity&nbsp;(1947), and other intellectual concepts of Simone de Beauvoir. Then, we will reveal the status and ongoing influence of existentialism in the contemporary era. By completing this course, you will boost your self-esteem and explore your lived experience openly, honestly, and comprehensively to enable you to build a purposeful life. So why wait? Enrol for this course today!</p><a href=\"https://alison.com/resume/courses/3797\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3797\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Scope of Existentialism","description":"In this module, you will be introduced to the most influential philosophical and literary movements of the 19th and 20th centuries. The philosophical ideologies, legacies and influence of the eight most notable existentialists will be examined. Then, the scope of existentialism as a philosophical concept in the modern era will be explored.","topics":["The Scope of Existentialism - Learning Outcomes","The Kierkegaard and Dostoyevsky Models","The Nietzsche and Kafka Concepts","The Heidegger and Sartre Models","The Beauvoir and Camus Theories","The Scope of Existentialism - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to the Principles of Existentialism - Course Assessment"]}]}