{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1449","title":"An Introduction to New Thinking for Your Classroom","totalEnrolled":"11,786","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to practice self-awareness and improve your teaching style with this free online classroom teaching course.","description":"This free online classroom teaching strategies course will show you how to bring new thinking to your classroom, and is based on materials from the Commonwealth Education Trust, enabling reflection on practice. Teach more effectively by continuing to develop your skills and improving learning process outcomes for all your pupils. This teaching and learning course is a great addition to the skillset of any teacher, experienced or new.","courseOutcomes":["Define what being a teacher means...","Describe what good teaching and poor...","Examine your own experiences as a pu...","Reflect on your own teaching practic...","Define what being a teacher means","Describe what good teaching and poor teaching looks like","Examine your own experiences as a pupil and how they have shaped you as a teacher","Reflect on your own teaching practice","Identify your own areas of strength","Identify areas you wish to develop to improve your teaching practice","Define what being a teacher means...","Describe what good teaching and poor...","Examine your own experiences as a pu...","Reflect on your own teaching practic...","Define what being a teacher means","Describe what good teaching and poor teaching looks like","Examine your own experiences as a pupil and how they have shaped you as a teacher","Reflect on your own teaching practice","Identify your own areas of strength","Identify areas you wish to develop to improve your teaching practice"],"courseDescription":"<p>This free online teaching strategies course is based on materials from The Commonwealth Education Trust - a UK based charity whose purpose is to advance education across the Commonwealth and has created a teacher professional development program called Teach2030. The Commonwealth Education Trust's Teach2030 initiative is a sustainable, professional development model that enables teachers to continue learning. It brings teaching and learning training to teachers, using low-cost technology combined with locally facilitated delivery through CET accredited partners.</p><p>This free online classroom teaching strategies course is based on the materials from the Commonwealth Education Trust, which will enable you to reflect on your teaching and learning practice, and teach more effectively by showing you how to continue to develop your teaching and learning skills, improving learning process outcomes for all your pupils.</p><p>This classroom teaching strategy course is suitable for all teachers, whether you are new to the classroom, have many years of experience in teaching already, or for those who are interested in pursuing a career in education. So, why wait? Learn how to become improve your teaching strategy skills today!</p><a href=\"https://alison.com/resume/courses/1449\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1449\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"An Introduction to New Thinking for Your Classroom","description":"This course is for you whether you are new to teaching, or experienced and wish to improve your teaching practice. In this course you will: - Consider what being a teacher means - Consider what good teaching and poor teaching looks like - Examine your own experiences as a learner and how they have shaped you as a teacher - Reflect on your own teaching practice - Identify your own areas of strength - Identify areas you wish to develop to improve your teaching practice","topics":["Course Objectives","Creating a Teacher Portfolio","Finding a Learning Partner","What is the Role of a Teacher?","Good Teaching / Poor Teaching","Identifying a good teacher","What makes YOU a good teacher? Self Assessment","Action Plan, Final Notes and Course Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Reflections on your role as a teacher - Assessment"]}]}