{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3742","title":"AP Calculus BC : Sequences and First Order Differential Equations","totalEnrolled":"340","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online maths course covers finite sequences, convergence tests and solving first-order differential equations.","description":"This course has been specially prepared to take you through various tests for determining if an infinite series converges. In it, we define an infinite series and show how series are related to sequences. The course explores the different types of finite sequences and how to solve for each. So, register now if you would like to prepare for the AP (Advanced Placement) examinations or improve your calculus results.","courseOutcomes":["Classify a differential equation...","Solve a first-order differential equ...","Indicate the interval and radius of ...","Identify a geometric series...","Classify a differential equation","Solve a first-order differential equation using integration","Indicate the interval and radius of convergence of a power series","Identify a geometric series","State the divergence theorem","Solve the p-series test","Discuss the alternating series test (AST)","Distinguish between the limit comparison test and ratio test","List the different types of finite sequences","Define a harmonic sequence","Evaluate arithmetic sequences","Solve geometric sequences","Classify a differential equation...","Solve a first-order differential equ...","Indicate the interval and radius of ...","Identify a geometric series...","Classify a differential equation","Solve a first-order differential equation using integration","Indicate the interval and radius of convergence of a power series","Identify a geometric series","State the divergence theorem","Solve the p-series test","Discuss the alternating series test (AST)","Distinguish between the limit comparison test and ratio test","List the different types of finite sequences","Define a harmonic sequence","Evaluate arithmetic sequences","Solve geometric sequences"],"courseDescription":"<p>This course introduces you to the concept of finite and infinite sequences. In mathematics, a sequence is a progression of numbers with a clear starting point. Some are defined recursively while others stop at a certain number. In other words, they have a first and last term and all the terms follow a specific order. This type of sequence is called a finite sequence. This course describes others such as the arithmetic, geometric, binary, power, triangular and harmonic sequences. Infinite sequences are an endless progression of discrete objects, especially numbers. You will learn about the monotonic behaviour of sequences and what it means when a sequence is monotonically increasing or decreasing as well as when a bounded monotonic sequence converges. The Cartesian graph is a wonderful way to visualize a given sequence and the material explains in detail how to graphically represent sequences.</p><p>Infinite series are useful sums that are not limited to mathematics. They also have important roles in disciplines such as physics, chemistry, biology, and engineering. However, for the purpose of this course, we will focus on their applications in mathematics. We will look at how to convert to a closed-form, an infinite series presented using enumeration. Convergence tests are methods of testing for the convergence, absolute convergence, conditional convergence, the interval of convergence, or divergence of an infinite series. The material covers methods for determining whether or not an infinite series converges. It states the divergence theorem and explains the tests for divergence, comparison, the p-series as well as ratios. The integral test is a method of testing an infinite series of nonnegative terms for convergence by comparing them to an improper integral. When testing the convergence of a series, remember that there is no convergence test that works for all series. You will have to determine the right test for a given series.</p><p>Many algorithms have been developed by numerical analysts to solve higher-order differential (and partial differential) equations. We will look at some of the theories and applications of first-order differential equations. You will learn how to solve first-order differential equations by integration, separable, linear, exact and numerical methods. A differential equation is a challenge. To solve an ordinary differential equation, we will have to determine the function or functions that satisfy this specific differential equation. How can a differential equation be classified? This course analyzes the Taylor and Maclaurin and Taylor. It explains the radius of convergence for each power series. If you want to learn about shortcuts for calculating series, or how to calculate coefficients, you should complete this course. This is a free refresher for the AP calculus exams and useful for anyone who wants to improve their overall calculus skills.</p><a href=\"https://alison.com/resume/courses/3742\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3742\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Finite Sequences","description":"This module introduces the various types of finite sequences. It explores the sequence defined by a recursive formula. Also, this module distinguishes bounds and monotonic sequences. It describes how to represent sequences on a cartesian graph.","topics":["Finite Sequences - Learning Outcomes","Types of Finite Sequence","More on Finite Sequence","Power Sequence","Bounded and Monotonic Sequence","Finite Sequences - Lesson Summary"]},{"name":"Module","details":"Tests for Convergence","description":"This module discusses the various methods used to determine whether or not an infinite series converges. It explores the sequence of partial sums and convergence of series. Also, this module analyzes infinite series written in enumerated forms and how to represent them in a closed-form.","topics":["Tests for Convergence - Learning Outcomes","Infinite Series","Tests for Convergence","More Tests for Convergence","Tests for Convergence - Lesson Summary"]},{"name":"Module","details":"First Order Differential Equations","description":"This module discusses how to solve first-order differential equations using integration, separable methods and numerical methods. This module also analyzes the Maclaurin and Taylor series. It explores how to find the coefficients and the shortcuts for finding series.","topics":["First Order Differential Equations - Learning Outcomes","Maclaurin and Taylor Series","Differential Equations - Examples","First Order Differential Equations","Numerical Methods","First Order Differential Equations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AP Calculus BC: Sequences and First Order Differential Equations - Course Assessment"]}]}