{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3800","title":"AP Calculus AB: Application and Properties of Definite Integrals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free math course outlines methods of integration, along with properties and application of the definite integral.","description":"This online course on definite integrals describes the mean value theorem and the average value of a function at an interval. The various methods and basic rules of integration are explained. It also takes you through basic trigonometric functions. By the end, you will be familiar with the concept of integration by parts, and a variety of applications of the definite integral. It is ideal for those taking AP (Advanced Placement) calculus exams.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course on the applications and properties of definite integrals introduces you to estimating with Riemann sums, sigma notation, properties of a definite integral and the fundamental theorems of integral calculus. You will learn about the trapezoid approximation methods used in evaluating integrals, and about sigma notation, which is a convenient way to compress writing large sums during integration. An exciting part of sigma notation is that it can be used for sums involving subscripts and you will study the three important laws that govern it. See how to get the exact area under a curve by using an approximation and subintervals and then taking the limit as a function approaches infinity.</p><p>The course continues by describing the properties of definite integrals. Do you know that the average set of numbers lies between the smallest and largest number but doesn't have to be a set member? The definite integral enables us to take the average of infinitely many numbers! The material describes the essence of the mean value theorem for integrals. You will delve into the relationship between a definite integral and the area under a curve. Have you experienced instances in the application of integration where the definite integral does not always yield an area under a curve? This is because of the basic rules of anti-differentiation. Unfortunately, most expressions occur in a format that doesn't allow for an immediate reversal of the process of differentiation or integration, therefore, additional methods must be developed. You will be introduced to different methods and techniques used in integration to solve problems and learn how to use a substitution equation for conversions.</p><p>Furthermore, knowing how to differentiate basic trigonometric functions makes the process of finding many integrals easier. Learn about the concept of combined sine and cosine functions as well as trigonometric integrals using u-substitutions. You will also be taken through combined tangent and secant functions. Did you know that ​​trigonometric substitutions can be useful in integrating certain binomials? You will discuss the natural logarithmic functions and integration by partial fractions. In order to use this method, we must first decompose a fractional integrand into the sum of simpler fractions. At the end, you will be taken through a slightly more complicated type of first-order differential equation. If you are a student looking to improve your knowledge of integral calculus and its amazing applications, then register for this course today. It is free to anyone, including those revising for the Advanced Placement (AP) calculus exams.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}