{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3762","title":"AP Chemistry: Scientific Measurement and Atomic Structure","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A chemistry course on scientific measurements, atomic structure and the theory of heterogeneous mixture for the AP exam.","description":"This course will teach you the rules for identifying significant figures and how making measurements can be used for data collection. You will learn how the number of atoms in a compound can be based on the chemical formula. Then explore the theory of the heterogeneous mixture and types of pure substances. This is especially useful for students who want to take the AP (Advanced Placement) chemistry exam.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you need to know how electromagnetic waves can be produced by accelerated charge and other important aspects of high school chemistry? This free online course provides you with an in-depth understanding of the rules of identifying significant figures. It is important to understand the process of data collection by making, adding, subtracting and dividing the measurements. Before working with scientific notations, it is essential to know how the decimal point can be moved directly after the first significant figure. This course takes you through the metric system, dimensional analysis and the different physical states of matter. Do you know why substances are separated and why the number of atoms in a compound is based on the chemical formula? This course will teach you the crucial procedures you need to know.</p><p>If you want to understand the concept of heterogeneous and homogeneous mixtures, including the types of pure substances, then sign up today. Once you have finished the modules, you should be able to explain the properties of metals, non-metals, metalloids and various types of energy associated with matter. You will also have a better understanding of nuclei, electrons, neutrons and protons. Do you know it is possible to determine the number of particles an atom contains? The material examines the Dalton and Thomson models of the atom and illustrates the production of positive rays and the gold foil experiment. It also clarifies the Rutherford model of the atom and number of neutrons in the nucleus.</p><p>Furthermore, you will learn about isotopes and the atomic mass of an element. Break down the concept of molecular mass, the Bohr model of the atom, and the electromagnetic spectrum. Do you know the working principle for photoelectron spectroscopy? This course helps you understand schematics and representation of mass spectroscopy, and explains in detail the characteristics of Hertz's experiment. Study the applications of electromagnetic waves, wavelength and frequency. You will learn about the technique that determines the absorption of UV and visible light in solutions in transmission mode. This free online course will prepare you for the AP chemistry exam and aid all high school students to achieve better results in general chemistry.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}