{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3857","title":"AP Chemistry: Thermodynamics and Energy Transfer","totalEnrolled":"729","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about thermodynamics and forms of energy mechanisms in organic chemistry from this free online science course.","description":"Develop your skills by exploring the laws of thermodynamics and the mechanism for energy transfer in this free online course. You will learn how organic compounds can be classified and how the major functional groups can be circled. Discuss the general concept of and terminologies in thermodynamics as well as the different forms of energy. Sign up for this course now and improve your knowledge of organic chemistry today.","courseOutcomes":["Identify the hydrocarbons as alkanes...","Analyze the IUPAC (International Uni...","Explain the concept of organic compo...","Outline the classification of hydroc...","Identify the hydrocarbons as alkanes or alkynes and function groups","Analyze the IUPAC (International Union of Pure and Applied Chemistry) rules for naming alkanes, alkenes, or alkynes","Explain the concept of organic compounds and the laws of thermodynamics","Outline the classification of hydrocarbons and further sub-classifications","Explain the nomenclature of alkenes, alkynes and the concept of ring compounds","Identify the common terminology and fundamental concepts in thermodynamics","Outline the different mechanisms of energy transfer and the concept of enthalpies","Describe thermodynamic favorability of chemical reactions using Gibbs free energy equation","List the laws of thermodynamics and the different mechanisms of energy transfer","Explain the concepts of enthalpies, heat capacity, entropy, and Gibbs free energy","Identify the hydrocarbons as alkanes...","Analyze the IUPAC (International Uni...","Explain the concept of organic compo...","Outline the classification of hydroc...","Identify the hydrocarbons as alkanes or alkynes and function groups","Analyze the IUPAC (International Union of Pure and Applied Chemistry) rules for naming alkanes, alkenes, or alkynes","Explain the concept of organic compounds and the laws of thermodynamics","Outline the classification of hydrocarbons and further sub-classifications","Explain the nomenclature of alkenes, alkynes and the concept of ring compounds","Identify the common terminology and fundamental concepts in thermodynamics","Outline the different mechanisms of energy transfer and the concept of enthalpies","Describe thermodynamic favorability of chemical reactions using Gibbs free energy equation","List the laws of thermodynamics and the different mechanisms of energy transfer","Explain the concepts of enthalpies, heat capacity, entropy, and Gibbs free energy"],"courseDescription":"<p>This course provides you with an in-depth understanding of the main types of isomers sums. If you want to explore the general concept of, and terminologies in thermodynamics - as well as the different forms of energy - then sign up for free. This course takes you through the classification of the alkenes and alkynes, as well as the physical and chemical properties of alkenes. It introduces you to the nomenclature of alkenes and alkynes, and the naming of alkenes. Study positional isomers together with preparation of alkanes. You will learn how organic compounds can be classified, as well as how some of the major functional groups can be circled. Have you analyzed the concept of ring compounds in organic chemistry? This course will teach you the functional groups that can be adopted.</p><p>Before working with structural RepN, and the bold-line structure, it is important to understand the structural isomers that are applicable as well as the concept, classifications and subclassifications of hydrocarbons. You will be able to explain the mechanism for energy transfer and the main types of thermodynamic processes. Furthermore, this course helps you understand the forms of energy transfer together with the laws of thermodynamics. Do you know there are specific illustrations of a system, surroundings, and boundary in thermodynamics? The material illustrates the Zeroth law and the law of conservation of energy. It explains how the first law of thermodynamics can be applied in a closed system and the enthalpies for different types of reactions. You will also learn about the process of determining thermodynamic favorability and feasibility.</p><p>Furthermore, you will also learn how chemical reaction energy can be transferred between the different species. Study reactions and the surroundings in which the reaction can take place. Do you know there are activities involved in internal energy? This course will help you get a better understanding of the definition of special heat and the kinds of special heat in a fluid. It explains in detail the concept of enthalpies, features of the standard enthalpy and Hess's law. You will also learn about the driving forces of a chemical reaction, the definition of Gibbs free energy and the effect of standard state enthalpy. It also discusses the thermodynamic favorability of chemical reactions and the different cases that can be used to determine it. This free online organic chemistry course is useful to all high school science students, those needing a refresher or those taking the AP (Advanced Placement) chemistry exams. Simply create an account and enroll, for free.</p><a href=\"https://alison.com/resume/courses/3857\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3857\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Organic Chemistry","description":"This module teaches you how to write hydrocarbons as alkanes or alkynes and function groups. You will also learn about the concept of an organic compound, the laws of thermodynamics. Study the classification of hydrocarbons and further sub-classifications.","topics":["Organic Chemistry - Learning Outcomes","Hydrocarbons Concepts","Alkenes and Alkynes","Ring Compounds","Organic Chemistry - Lesson Summary"]},{"name":"Module","details":"Thermodynamics Concept","description":"This module teaches you about the common terminology and fundamental concepts in thermodynamics. Learn about the different mechanisms of energy transfer, the concept of enthalpies and the thermodynamic favorability of chemical reactions using the Gibbs free energy equation.","topics":["Thermodynamics Concept - Learning Outcomes","Thermodynamics and Energy","Laws of Thermodynamics","Enthalpy and Internal Energy","Enthalpies for Different Types of Reactions","Gibbs Free Energy","Example Problems on Thermodynamic Favorability","Thermodynamics Concept - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Thermodynamics and Energy Transfer Fundamentals in Organic Chemistry - Course Assessment"]}]}