{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3709","title":"AP Calculus BC: Integration","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes methods of integration and the applications of the definite integral in calculus.","description":"This advanced math course has been specially prepared for anyone needing a working knowledge of integration in calculus. It takes you through the various methods of integration, applications of definite integrals as well as the first and second parts of the fundamental theorem of integral calculus. It also analyzes the average value of a function on an interval.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This AP course takes you through the concept of integration and various methods of integration. Integration can be used to find areas, volumes and other useful things. It is the way of adding parts to find the whole. Integration can be used to solve two essentially different types of problems. The first type are problems where the derivative of a function, its rate of change or the slope of its graph, is known. In solving such problems, it is required that the process of differentiation is reversed. This reverse process is known as antidifferentiation (integration) or finding an indefinite integral. The second type are problems involving adding up a very large number of very small quantities. This process leads to the definition of the definite integral and its properties. This course illustrates how to solve for the average value of a function on an interval as well as the mean value theorem for integrals.</p><p>If you want to learn about the first and second parts of the fundamental theorem of integral calculus, enroll today. The material covers in detail power rules and basic rules to assist in integration. Most expressions in calculus are given in a format that doesn't allow an immediate reversal for the process of differentiation. Therefore, additional methods must be developed. One option is known as u-substitution. Let’s assume you are asked to break a broomstick and a bunch of broomsticks respectively. Which will be easier to do? Of course, the single broomstick! The process of integration goes from the easier aspect to the more difficult aspect. Knowing how to differentiate the six basic trigonometric functions streamlines the process of finding many integrals involving trigonometric expressions since finding the integral is a process of anti-differentiation. The course explores some of the more frequently used trigonometric integrals as well as the trig substitutions useful in integrating certain binomials.</p><p>Furthermore, in integration, we have the derivative of a function and need to find the original function. In order to use the method of integration by partial fractions, we must first decompose a fractional integral into the sum of simpler fractions. You will learn about partial fraction decomposition, first-order differential equations and how to satisfy initial conditions when solving differential equations. The integration by parts is a technique that is frequently useful for integrating functions that are described by the product of two functions. This course illustrates other integration methods: integration of inverse trigonometric functions and hyperbolic functions. You will be able to solve for arc length, the surface of revolution and determine the volume of solid with known cross-section. Calculus can be applied to equations expressed in polar coordinates. These range from finding the area using polar coordinates, finding the polar coordinates of the point with Cartesian coordinates and finding the Cartesian equation of a curve. The learning content in this course is crucial for math students who want to pass the AP Calculus exam.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}