{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4858","title":"Basics of Meteorology","totalEnrolled":"897","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the basics of meteorology, natural hazards, climate change and mitigation strategies in this free online course.","description":"Meteorology is essential in everyday life as people must make informed decisions regarding clothing and when to plant crops or travel. This free online course begins by examining the historical context of meteorology and investigates the formation and various types of clouds and precipitation processes. Delve deeper into the characteristics of the solar system, global warming and climate change and review their impact on our environment.","courseOutcomes":["Explain the historical background of...","Discuss the classification and devel...","Describe the types of precipitation ...","Recall the basic facts about the atm...","Explain the historical background of meteorology","Discuss the classification and development of clouds","Describe the types of precipitation processes, monsoons and blizzards","Recall the basic facts about the atmosphere","Identify the essential features of the solar system","Summarise the relevant aspects of climate change and its mitigation strategies","Discuss the causes of extreme weather conditions","Explain the historical background of...","Discuss the classification and devel...","Describe the types of precipitation ...","Recall the basic facts about the atm...","Explain the historical background of meteorology","Discuss the classification and development of clouds","Describe the types of precipitation processes, monsoons and blizzards","Recall the basic facts about the atmosphere","Identify the essential features of the solar system","Summarise the relevant aspects of climate change and its mitigation strategies","Discuss the causes of extreme weather conditions"],"courseDescription":"<p>Meteorologists must give accurate information to people about the potential effects of weather, climate and natural hazards. This course explores the many aspects of weather and climate, such as temperature, humidity and wind to predict specific outcomes and patterns and make informed decisions. Learn about the cloud types, precipitation and their process of formation to have a clear understanding of the essential role they play.</p><p>Next, you will study the features of the solar system, which will give you a clear understanding of its makeup and distribution. Then discover some interesting facts about the solar system and examine the causes of climate change, the greenhouse effect and the impact of ozone on our planet. Also learn more about the consequences of global warming and the strategies you can personally adopt to reduce the risk.</p><p>Industries like agriculture, shipping and air travel require weather forecasts to plan operations and take precautions against harsh weather. There is no question that the demand for highly qualified meteorologists is more necessary than ever before. By completing this course, you will acquire sufficient knowledge of the causes of extreme weather conditions. You will also have a solid foundation to start an exciting meteorological career. Take this course today!</p><a href=\"https://alison.com/resume/courses/4858\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4858\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Meteorology","description":"In this module, you will learn the historical background of meteorology, the types and formation of clouds and discover the essential features of the solar system.","topics":["Fundamentals of Meteorology - Learning Outcomes","Introduction to Meteorology","The Atmosphere and the Solar System","Climate Change and Natural Hazards","Fundamentals of Meteorology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Meteorology - Course Assessment"]}]}