{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5080","title":"Beginner Chemistry: Enthalpy Change and Lattice Energy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you to recognise the various forms of energy produced during a chemical process.","description":"Did you know that while they are burning, fireworks produce three different forms of energy: heat, light and sound? This course will teach you about several types of enthalpy changes and how to measure and calculate them using the calorimeter and bond energy. You will also learn about lattice energy, lattice enthalpy, the factors that influence them and the Born-Haber cycle used to determine lattice energy value.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Did you know that the Born-Haber cycle incorporates all the energy stages required to transform elements into ionic compounds, which aids in calculating the lattice energies? This course covers enthalpy change and lattice energy and the methods used to calculate both. It offers multiple simple examples and exercises to clarify these concepts. We begin by exploring enthalpy change and how exothermic and endothermic reactions provide negative and positive values to enthalpy change. You will also discover how to calculate the enthalpy change of combustion by applying Hess's law.</p><p>After that, you will learn how to identify the enthalpy change of a reaction based on the type of the reaction, such as enthalpy change of formation, combustion, solution and hydration. You will learn the process of determining the enthalpy changes and the utilisation of average bond energies to compute the enthalpy change of a process. The course compares the differences between lattice enthalpy and lattice energy and discusses electron affinity and how to write equations for the first and the second electron affinities. Then you will learn how to analyse reaction energies from a Born-Haber cycle, such as lattice energy, the enthalpy change of atomisation and ionisation. We examine all the steps required to construct a lattice cycle and use them to determine the lattice energy.</p><p>Next, we demonstrate how the value of lattice energy varies with ionic radius and charge of ions. We will also discuss the factors influencing ion polarisation: the size of the cations and anions and the number of charges. Finally, the course investigates the thermal stability of group 2 carbonates, which decompose by heat into their oxides and carbon dioxide, and nitrates that decompose into nitrogen dioxide and oxygen. You will study the solubility of group 2 sulphates and the variables that cause it to decrease as the group progresses. This course is the third in our 'Beginner Chemistry' series. Don't delay. Enrol today and keep abreast of your learning.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}