{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4897","title":"Beginner Chemistry: Matter and Atoms","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the characteristics, composition and architecture of elements and compounds in this free online course.","description":"Chemistry aids your understanding of the world around you. With this course, you will begin your journey into this fascinating science field by learning basic chemistry concepts such as matter, atoms, atomic structure and electrons. The three states of matter, subatomic particles, the configuration of electrons in an atom, ionisation energy and the building blocks of the Periodic Table are just a few of the topics you'll explore.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This beginner series in chemistry delves into the world of matter, elements and compounds, as well as their structures. This course explores the elements created from a single atom, like neon gas, or from a combination of two or more identical atoms. We also study various compounds and their structure. You'll begin by learning the three states of matter (solid, liquid and gas) and their different qualities. You will become familiar with the kinetic theory of gases and the ideal gas equation, PV = nRT, used to determine any gas's unknown characteristics, including the relative molecular mass of simple molecules. Following that, you will explore the transformation of a solid into a liquid and vice versa related to high and low temperatures. You'll also discover the crystal lattices and their diverse types, including ionic, metallic and covalent, along with studying the solid state.</p><p>The following section discusses the structure of an atom, including its protons, neutrons and electrons. You will discover what the atomic number (Z) and the nucleon number, also called ‘mass number’ (A), are. After that, you'll learn about the Periodic Table, which contains elements arranged according to their atomic number in 7 periods and 18 groups. We will research all the elements that possess the same atomic number but have varying numbers of neutrons, known as ‘isotopes’, and their assorted characteristics. We will examine the two types of ions: cations with a positive charge and anions with additional electrons that form a negative charge.</p><p>The course then discusses orbitals, subshells (s, p, d, and f), and the shells that electrons inhabit around the nucleus. You'll discover that every subshell has a minimum of 2 and a maximum of 14 orbitals. Research electronic configuration, a building-up mechanism that adds electrons to orbitals, from lowest to the greatest in energy. Finally, you will investigate ionisation energies and how they vary through periods and groups, impacted by factors such as the distance between electrons and nuclear charge, the growth in atomic number and the shielding of the inner shell to the outer electrons. Don't delay. Start learning Chemistry today with the first course in this ‘Beginner Chemistry’ series.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}