{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1723","title":"Biology - Heredity - Revised","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the science of hereditary traits and learn how viruses can affect our DNA with this free online biology course.","description":"This course teaches you about hereditary traits and lays out the biological processes that transmit particular qualities from parents to children. Isn't it amazing that children can look like their parents but different from each other? We explain how that happens as we study hereditary science in animals, plants, bacteria and viruses. We also examine the theory behind the Hardy-Weinberg Principle to help you understand this fascinating topic.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Gregor Mendel is widely considered the ‘father of genetics’. He identified many of the rules of heredity, which determine how traits are passed through generations of living things, and found that such traits can skip a generation. This course introduces you to his work and explores every different combination of all the genes using the ‘Punnett square’.</p><p>The Hardy-Weinberg equilibrium (HWE) states that allele and genotype frequencies in a population will not change from generation to generation where there is an absence of other evolutionary influences or disturbing factors. We discuss the Hardy-Weinberg equilibrium and provide examples to explain its application. We also study sex-linked traits, which form an important category of genetic linkage that is driven by X and Y sex chromosomes.</p><p>This biology course explains how these characteristics can have a physical manifestation like hair color or color blindness and establishes why some traits are passed on while others skip generations. We also investigate why some traits form part of our physical makeup while others are carried but never physically expressed. Hereditary science is fascinating so sign up to learn more about your biological heritage.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}