{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3021","title":"Biotechnology - Cell Biology Techniques","totalEnrolled":"3,177","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn cell structures and functions and the various cell biology techniques in biotechnology in this free online course.","description":"There are many techniques used in the branch of biology known as Cell Biology and this free online Biotechnology course focuses on the analysis and components of cell biology techniques. Discover the definitions of differential centrifugation, immuno-localization studies and apoptosis and broaden your knowledge on the structures, functions and properties of cells in this Cell Biology Techniques in Biotechnology course.","courseOutcomes":["Discuss the steps in the preparation...","Describe the steps in the Isolation ...","Explain the steps in the Immuno-loca...","Describe the basic models of Electro...","Discuss the steps in the preparation of a Microbiology Medium","Describe the steps in the Isolation of the Periplasmic Fraction from bacteria","Explain the steps in the Immuno-localization process","Describe the basic models of Electron Microscopes","List the materials that are required in order to perform the Malaria Parasite Life Cycle","Discuss the four Properties of a Cell","Describe the steps in the Scanning Electron Microscope procedure","Discuss the steps in the preparation...","Describe the steps in the Isolation ...","Explain the steps in the Immuno-loca...","Describe the basic models of Electro...","Discuss the steps in the preparation of a Microbiology Medium","Describe the steps in the Isolation of the Periplasmic Fraction from bacteria","Explain the steps in the Immuno-localization process","Describe the basic models of Electron Microscopes","List the materials that are required in order to perform the Malaria Parasite Life Cycle","Discuss the four Properties of a Cell","Describe the steps in the Scanning Electron Microscope procedure"],"courseDescription":"<p>The advent of microscopes in the 17th century played a massive role in our understanding of cells and this free online course comprehensively studies various cell biology techniques, especially as it applies to biotechnology. This course will introduce you to prokaryotic and eukaryotic cells and the different applications of these types of cells in scientific experiments. Gain insight into the fact that all these cells are required to propagate before they can be used in scientific experiments and this is done through the use of different growth mediums. You will explore the common media constituents for bacterial growth, their composition and applications. This knowledge gets applied when you are preparing the microbiology medium and the relevant precautions you need to take while carrying out these experiments. You will be introduced to the concept of differential centrifugation, which is based on the differences in sedimentation rates of the biological properties of different sizes, shapes, and densities.</p><p>The course starts by introducing you to the fractionation of prokaryotic as well as the eukaryotic cells to isolate a protein from particular cell organelles or parts of a cell. During this process, you will look at the periplasmic fraction, which refers to the fraction that is present between the outer layer and the inner layer in the prokaryotic cells - this is the region where the bacteria stores proteins and this is where you would use the bacteria for over-expression purposes because it will give you the perfect environment for the proper folding of the protein. What are the steps for isolating the periplasmic fraction from the bacteria? This is one of the many exercises you will come to fully understand as you study this cell biology course. You will learn how to isolate cell organelles from the liver, beginning with the process of removing blood from the liver as a way of eliminating any possible contamination by the blood cells.</p><p>As you work through this free online Cell Biology Techniques in Biotechnology course content, you will gain insight into how you can use a microscope to localize a particular protein when performing different cell-based experiments and be able to perform immuno-localization studies on a mammalian cell. Finally, you will study the forward scatter channel, the side-scatter channel, phagocytosis, and phagosome and lysosome interactions.&nbsp;</p><p>If you are a biotechnology student or already working as a professional in Experimental Biotechnology and want to refine your cell biology skills, then kick-start your learning today with this free online course in cell biology techniques.</p><a href=\"https://alison.com/resume/courses/3021\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3021\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cell Biology","description":"In this module, Cell Biology, you will learn about the applications of bacterial growth media and the microbiology medium preparation process. You will also learn about the Fractionation of Cells and the basic models of Electron Microscopes.","topics":["Cell Biology - Learning Outcomes","Introduction to Cell Biology","Fractionation of Cells","Microscopy","Electron Microscopes","Microscopy Experiments","Flow Cytometry","Cell Biology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Biotechnology - Cell Biology Techniques - Course Assessment"]}]}