{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1778","title":"Chemistry - Molecules and their Composition","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about molecular and empirical formulas, as well as Avogadro’s number, with this free stoichiometry course.","description":"In this free online chemistry course, you will learn about molecules and how they are composed of various elements differing in mass and ratios. A molecule is a group of two or more atoms that bind together using chemical bonds. They may be from one or multiple elements and it is the ratio, or mass composition, of each molecule that gives the molecular compound its chemical characteristics. Take this course to learn more about molecules today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Molecules are made up of atoms and are the smallest particle in a chemical element or compound. This course will introduce you to the fundamentals of molecules and their composition. You will study molecular formulas, which are essentially the actual number of atoms in a molecule, and empirical formulas that tell you what people have observed. You will also study the mole as a unit of measurement and Avogadro's number, which is equal to 6.023 × 10 to the power of 23, and is the constant of proportionality.</p><p>You will then study molecular and empirical formulas from the mass composition and learn how to balance chemical equations. This course will also discuss stoichiometry, which is the study or the calculation of the relationships between the different molecules in a reaction. You will learn about the limiting reagent, which is basically the reactant that produces the least amount of product. You will also master how to solve mass composition problems.</p><p>Learning how to convert between atomic mass and grams using Avogadro’s number or the mole is one of the important topics you will study in this course. Once you have mastered this, you will be able to easily work out ratios and weights of molecules. You will also learn how to balance chemical equations and get viable reactions by balancing the reactants within equations. So, check out this course and learn more about stoichiometry today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}