{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1720","title":"Chemistry - Gases and Their Properties - Revised","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your understanding of the characteristics and properties of gases and learn how to calculate the Ideal Gas Law.","description":"This free online chemistry course will teach you about the characteristics of ideal gasses, the concept of the Ideal Gas Law, the behavior of gases under many different conditions, and much more. Gases have neither fixed volume nor shape, and are molded entirely by the container in which they are held. It is possible to measure their behavior by measuring properties such as pressure, volume, temperature and number of molecules.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Gas is one of the four fundamental states of matter (solid, liquid, gas and plasma). A pure gas may be composed of individual atoms, elemental molecules made from one type of atom, or compound molecules made from different atoms. A gas mixture, such as the air we breathe, contains different types of pure gases. This course will introduce you to an ideal gas, which is a theoretical gas. You will learn that gas molecules exert no attractive or repulsive forces on each other which make their collisions elastic.</p><p>Gases behave differently under pressure. This course will teach you how to calculate the pressure of a gas-filled container. You will study the Ideal Gas Law with the famous equation PV=nRT, its characteristics, and how to solve for any part of this general gas equation. This course will also teach you how changes to pressure, temperature, or volume affect each other. Plus, you will study the core units of measure for temperature.</p><p>Studying the concept behind an ideal gas equation, PV=nRT, can help you describe the relationship between pressure, volume, amount, and temperature of a gas. Because they are a simplified model of real gas, they can help explain the basics of the kinetic molecular theory which states that an increase in temperature raises the average kinetic energy of the molecules. So, check out this course and learn more about the behavior of gases, today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}