{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3013","title":"Classic Hollywood Cinema","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online film course takes you back to a golden age of film as we meet the legends of classic Hollywood cinema.","description":"This free online film studies course covers the cinematic period known as ‘classic Hollywood’, which describes both a narrative and visual style of filmmaking that characterized American cinema between World War One and the 1960s. We examine this ‘Golden Age’, the Hays Code and some notable filmmakers. This course suits any cinephile who wants to hear the echoes of the past in today’s movies as we trace their impact on popular culture.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Classic Hollywood cinema made between World War One and the 1960s became the world’s most popular and common style of filmmaking. This style is also referred to as the ‘Golden Age of Hollywood’, ‘Old Hollywood’ or ‘classical Hollywood’. As Hollywood’s style set global trends, it evolved further as sound entered production. The ‘studio system’ in Hollywood drove further change as several key studios (like MGM, Paramount and Columbia Pictures) decided that prominent directors and actors had to join a studio to find work. This course studies some of these influential studios and explains the Academy Awards, popularly known as ‘the Oscars’, which reward artistic and technical merit in film and are widely regarded as the most prestigious awards in the entertainment industry.&nbsp;</p><p>We discuss the ‘Motion Picture Production Code of Hollywood’, also known as the ‘Hays Code’ or even ‘the Code’. This was a set of industry guidelines for the self-censorship of content that was applied to American films released by major studios from 1934 to 1968. We investigate the impact of the Hays Code on classic Hollywood cinema as we break down the period’s narrative, editing and characterization. We analyze some big studio films and famous filmmakers of that period, such as George Stevens, William Wyler, Billy Wilder, Elia Kazan and George Cukor. We pay particular attention to famous examples of the filmmaking styles of Cecil B. DeMille, Frank Capra and Alfred Hitchcock.</p><p>Some of the major genres of this period were musicals, adaptations of prestigious literary works and melodrama. This course illustrates the importance and impact of melodrama, a popular subgenre of drama characterized by exaggerated stories designed to tug at the heartstrings and emotionally manipulate the viewer. Accomplished directors like Cukor, Wyler and Douglas Sirk made melodrama one of the more successful genres of the ‘40s and '50s. We examine some of Sirk’s work in detail to help you to appreciate the mechanics of melodrama and discover the thrill of conducting theoretical research in film studies. Films influence popular culture and film studies offer rewarding career options like film direction, broadcast presenter, camera operation, media or programme research, art direction and video editing. The theoretical skills acquired through this course can also be transferred to other fields in the media and communications industry. Beyond its career benefits, this course takes you back to a key period in the evolution of film and suits any cinephile who appreciates the classics.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}