{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4118","title":"CLEP Calculus","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Methods of differentiation as well as logarithmic and exponential functions are explained in this online math course.","description":"If you have an interest in understanding the concepts of differentiation and applications of integral calculus, this course will guide you. You will learn how to find the limits of polynomial and rational functions, as well as how to integrate natural logarithmic and exponential functions. This course will also teach you about definite integrals. Enrollment is free for this College Level Examination Program math course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This calculus course has been carefully curated to teach you about the methods of differentiation and the applications of integration. You will be introduced to the concepts of limits, as well as how to find them from tables or graphs. The derivative and notation are key concepts to understand when dealing with differentiation. The relationship between differentiability and continuity will also be highlighted. You will also learn about the relationship between limits and asymptotes. See how the absolute extrema is related to both absolute minima and maxima and why the Sandwich theorem is a useful tool in calculating some types of limits. Study how to use a chart to find the absolute extrema of a curve. Upon the successful completion of this course, you should be able to differentiate between concave up and concave down curves.&nbsp;</p><p>The mean value and Rolle’s theorem are important to understand when working with derivatives. The first and second derivative tests will also be explained. You will learn about the concepts of integration and the constant of integration. The relationship between Riemann sums and area under a curve will be highlighted. U-substitution allows for an immediate reversal of the process of differentiation and you will become familiar with how to find integrals using this method. The optimization problem seeks the best value for a variable quantity - you delve into the steps needed to solve it. You will also become familiar with linear approximations and differentials. Did you know that there are three sigma laws? Prepare to learn about their differences, as well as their appropriate use to simplify calculations.</p><p>This course teaches you how to integrate the six trigonometric functions because, when integrating certain binomials, trig substitutions can be useful. You will also be able to discuss integration using lnx if you are working with natural logarithmic functions. The technique of integration by parts will also be highlighted in the material. You will see how to integrate inverse trigonometric and natural exponential functions. The relationship between velocity and the position function is analyzed. You will also be able to calculate the surface of revolution and how to find the arc length. Exponential growth and decomposition are key concepts in calculus and you will become familiar with their various applications.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}