{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4135","title":"CLEP College Mathematics: Functions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course shows you how to calculate special functions and express graphical transformations of functions.","description":"This college-level math course teaches you graphical transformations through translations, reflections, and rotations. Learn how a function is calculated and discover a valuable approach to graphing that provides a deeper understanding of the relationship of equations to their graphs. Create your account and enroll - all for free.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Functions are often described as a machine in a box that is open on two ends. You put something into one end of the box, it gets changed inside the box, and then the result pops out the other end. The ‘function’ is the machine inside the box and it is defined by what it does to whatever you put into it. This is a free online course that introduces you to special as well as polynomial functions. It outlines examples of polynomial functions and how to identify their degrees, for example, if each element of a matrix A is a polynomial in x and if |A| vanishes for x = a, then (x - a) is a factor of | A |. In this course, you will learn about two important theorems that are useful in searching for the roots of polynomial equations. The material also differentiates between the remainder theorem and factor theorem.</p><p>A relation between two sets is a collection of ordered pairs containing one object from each set. A function is a type of relation. But, a relation needs to have the object x in the first set to be related to more than one object in the second set. In this course, you will learn about the properties of relations and functions. It explains the arithmetic operations of addition, subtraction, multiplication and division. See how to prove that functions are Inverses. The material explains how to solve constants and identify functions using examples. Learn the difference between constant functions and identity functions. An absolute value function is a function that contains an algebraic expression within absolute value symbols. This course teaches you the geometric definition of the absolute value function and how to solve absolute values. Study the difference between linear functions and linear equations.</p><p>Finally, the greatest integer function is one that takes an input and gives an output that is the greatest integer that is less than or equal to the input. Master how to graph and solve greater integer functions. You will learn about exponential growth and exponential depreciation. See how to plot a graph of quadratic functions. This course also introduces you to graphical transformations. You will discover the properties preserved in all translations, reflections and rotations. The rotation of isometry will be discussed. This course will be of significant interest to those taking College-Level Examination Program (CLEP) math courses or who need a refresher in functions.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}