{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4205","title":"CLEP College Mathematics: Symbolic Logic & Geometry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free math course explains how to solve symbolic logic problems as well as the features of various geometric shapes.","description":"This CLEP (College Level Examination Program) course introduces you to a branch of mathematics that makes use of symbols to express logical ideas. It also outlines some examples of mathematical sentences and statements. Learn how to identify segments and rays, and solve for the areas of quadrilaterals, triangles, circles, and sectors. It further teaches you how to prove that a quadrilateral is a parallelogram.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Symbolic logic is the branch of mathematics that makes use of symbols to express logical ideas. This method makes it possible to manipulate ideas mathematically in much the same way that numbers are manipulated. This free online course introduces you to sentences and statements. A mathematical statement is either true or false. It may contain words and symbols This course outlines some examples of mathematical sentences and statements. You will also learn about replacement value. Conditional statements and biconditional statements will be taught along with examples. The laws of syllogism, detachment, and disjunctive inference will be discussed. Learn about direct proofs and indirect proofs. Reasoning involves drawing logical conclusions based on evidence or stated assumptions. In this course, the different types of mathematical reasoning will be discussed. Learn about De Morgan’s laws as well as the properties of modus tollens.</p><p>Do you know what geometry is? Geometry is the mathematical study of all shapes and figures. It can be seen everywhere in our everyday life. We live in a world of shapes and we shall see how mathematics helps us understand the basics of geometry. In this course, you will be introduced to lines, segments, and rays. The formulas to calculate midpoints, endpoints, and opposite rays will be outlined. The course teaches you to prove the angle sum property of a quadrilateral. Learn how to classify triangles by sides and by angles. You will also learn how to find the sum of interior angles and exterior angles. It explains the median, angle bisectors, and altitude.</p><p>Finally, a quadrilateral is a closed two-dimensional figure that has four sides, four angles, and four vertices. You will learn about the properties of parallelograms and how to prove that a quadrilateral is a parallelogram. The material discusses the properties of a square, and explains methods to prove that a quadrilateral is a square. You will learn about the formulas, properties, arcs, sectors, and segments of a circle. Discover how to prove the theorems on tangent lines and tangent circles. Grapple with the properties of rectangles, parallelograms, and rhombuses, and the relationship between trapezoids and triangles. Learn how to find the area of a triangle using Heron's formula, and how to determine the sector of a circle. This math course will be of immense benefit to anyone studying advanced geometry or sitting CLEP tests.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}