{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4071","title":"CLEP Chemistry: States of Matter","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the formation of a solution, intermolecular forces and the properties of gases.","description":"This College Level Examination Program (CLEP) course covers gas laws, and gas pressure. All gases share common physical properties. Like liquids, gases freely flow to fill the container they are in. While liquids have a specific volume, gases have neither a definite volume nor shape. This course discusses the properties of gas and the variables affecting gas pressure. Register now to learn how to solve for molarity in solutions and more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The states of matter are distinguished by the differences in their bulk properties. The liquid state adapts to the shape of its container but varies only slightly in volume. The solid state maintains a fixed volume and shape, while the gaseous state expands to occupy the volume and shape of its container. Scientists have performed many experiments to understand the common behaviours of gases. They have observed that the state of gas depends on four variables: pressure (P), volume (V), temperature (T), and amount (in moles). The relationships between these variables are known as the gas laws. This free chemistry course on states of matter discusses Boyle’s law, Charles’s law, Gay-Lussac’s law, Avogadro's law and Dalton’s law of partial pressure. It explores the properties of gases, the conditions of the increment of gas pressure as well as the variables that affect it. You will learn about the assumptions of the ideal gas law described by kinetic molecular theory.</p><p>Most of the properties of a liquid are the direct result of intermolecular forces, a type of attraction that exists between liquid molecules. Most types are identical to bonding between atoms in a single molecule. This course covers in detail the three most common types of intermolecular forces. To understand them, we must first define what a ‘dipole’ is. This course compares intermolecular forces and thermal energy. It describes boiling point, the heat of evaporation, viscosity as well as surface tension as the physical properties of the liquid. You will learn about the general properties of ionic, molecular and metallic solids. Solids, liquids, and gases can be converted from one phase to another by changing the temperature and pressure. The phase changes are represented by phase curves or phase diagrams. This course defines a phase diagram and illustrates the phase diagram of water and the changes to its physical state when the temperature and pressure vary.</p><p>Furthermore, solutions are classified as homogeneous mixtures, which implies that the mixture is a single-phase where the properties will be the same no matter where a sample is taken. It can be confirmed that a mixture of more than one component is a solution most times by merely looking at our mixture. The course states the rule which determines whether two liquids dissolve to form a homogenous solution. The sections that follow discuss Henry's law and consider the process of dissolving sodium chloride (NaCl) in water. It explains the three major types of solutions and the effect of temperature on solubility. You will also learn how to solve for molarity in a given chemical equation. The learning content of this course is crucial for chemistry or anyone with an interest in understanding the states of matter.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}