{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4068","title":"CLEP College Algebra: Number Systems and Linear Equations","totalEnrolled":"474","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online math course explains the basics of algebraic number systems, along with monomials and polynomials.","description":"This is a CLEP (College Level Examination Program) course that introduces you to the foundations of algebra. Understanding algebra as a concept is more important than solving equations and finding the right answer. By the end, you should be able to apply your advanced math knowledge in business to predict sales, growth, and profit. So, register for this free algebra course now and begin your next learning journey today!","courseOutcomes":["Indicate the mathematical order of o...","Recall the number line and graphing ...","Differentiate between complex and im...","Outline the definitions and vocabula...","Indicate the mathematical order of operations","Recall the number line and graphing of numbers","Differentiate between complex and imaginary numbers","Outline the definitions and vocabulary associated with monomials","Analyze the methods of simplifying rational expressions","Summarize the sum and difference of two perfect cubes","Explain how to solve equations containing parentheses","List and explain the two types of compound inequalities","Indicate the mathematical order of o...","Recall the number line and graphing ...","Differentiate between complex and im...","Outline the definitions and vocabula...","Indicate the mathematical order of operations","Recall the number line and graphing of numbers","Differentiate between complex and imaginary numbers","Outline the definitions and vocabulary associated with monomials","Analyze the methods of simplifying rational expressions","Summarize the sum and difference of two perfect cubes","Explain how to solve equations containing parentheses","List and explain the two types of compound inequalities"],"courseDescription":"<p>Algebra helps in the representation of problems or situations as mathematical expressions. It involves variables like x, y, z, and mathematical operations like addition, subtraction, multiplication, and division to form a meaningful mathematical expression. All branches of mathematics such as trigonometry, calculus and coordinate geometry use algebra. One simple example of an expression in algebra is 2x + 4 = 8. Algebra deals with symbols that are related to each other with the help of operators. It is not just a mathematical concept, but a skill that all of us use in our daily lives without even realizing it.</p><p>The course introduces you to the different types of mathematical operations as well as number systems. In math, integers are the numbers that can be positive, negative or zero, but cannot be a fraction. They are used to perform various arithmetic operations, like addition, subtraction, multiplication, and division. This course gives you an insight into the standard definition, properties and types of a rational number. Square roots can be confusing because learners often make the mistake of multiplying that number by 2 or by the power. Also, it gets more confusing when dealing with more than one variable. You will learn about the most commonly used roots and cube roots. Simplifying radicals is one of the easiest yet potentially puzzling aspects of algebra and the course outlines a gradual process of taking you through this with the aid of examples.</p><p>Next, you study monomials and polynomials. The mathematical definition of a monomial is a number, a variable, or a product of a number and a variable where all exponents are whole numbers. A polynomial is the sum of monomials where each monomial is called a term. Sounds confusing, right? This course simplifies these concepts with the aid of examples. A system of linear equations consists of two or more linear equations made up of two or more variables such that all equations in the system are considered simultaneously. To find the unique solution to a system of linear equations, we must find a numerical value for each variable in the system that will satisfy all equations in the system at the same time. By the end of this course, you will be able to solve linear equations and inequalities and be more confident in your ability to pass algebra.</p><a href=\"https://alison.com/resume/courses/4068\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4068\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Number Systems and Operations","description":"This module introduces you to number systems and operations in algebra. The module analyzes the different types of operations, types of numbers, and square roots. You will also learn about complex and imaginary numbers with the aid of examples.","topics":["Number Systems and Operations - Learning Outcomes","Working with Sets and Operations","Introduction to Integers","Forms of Numbers","Square Roots and Radicals","Complex and Imaginary Numbers","Number Systems and Operations - Lesson Summary"]},{"name":"Module","details":"Algebraic Basics","description":"This module introduces you to monomials and the laws for exponents. You will learn about the different operations with monomials and polynomials. The module also gives an insight into factorization methods, rational expressions, and solving fractional equations.","topics":["Algebraic Basics - Learning Outcomes","Monomials and Laws for Exponents","Introduction to Polynomials","Division of Polynomial","Introduction to Factoring","Grouping and Rational Expressions","Algebraic Basics - Lesson Summary"]},{"name":"Module","details":"Solving Linear Equations and Inequalities","description":"This module introduces you to solving linear equations and inequalities. The module also explains how to solve equations by combining like terms and solving equations containing parentheses. You will also learn about the properties of inequalities and compound inequalities.","topics":["Solving Linear Equations and Inequalities - Learning Outcomes","Variables and Algebraic Expressions","Linear Equations","Linear Inequalities","Compound Inequalities","Solving Linear Equations and Inequalities - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["CLEP College Algebra: Number Systems and Linear Equations - Course Assessment"]}]}