{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4117","title":"CLEP Calculus: Integral Calculus and Applications","totalEnrolled":"258","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online college-level math course that takes you through integration and definite integrals in integral calculus.","description":"In this free online course, you will learn about definite and indefinite integrals, formulas for sums of sequences, the three Sigma laws, and integration by u-substitution. Study how to integrate natural exponential and logarithmic functions. Enrollment is free: this is a College Level Examination Program course with no subscription charges. Register today and become more confident applying your knowledge to ace your exams.","courseOutcomes":["Explain the concept of anti-differen...","Distinguish between definite and ind...","State the three sigma laws...","State the power rule of integration...","Explain the concept of anti-differentiation","Distinguish between definite and indefinite integrals","State the three sigma laws","State the power rule of integration","Discuss integration by u-substitution","Integrate natural logarithmic and exponential functions","Explain the velocity and position equation","Define the area above and below the x-axis","Discuss the volume of a solid of revolution","Explain the concept of anti-differen...","Distinguish between definite and ind...","State the three sigma laws...","State the power rule of integration...","Explain the concept of anti-differentiation","Distinguish between definite and indefinite integrals","State the three sigma laws","State the power rule of integration","Discuss integration by u-substitution","Integrate natural logarithmic and exponential functions","Explain the velocity and position equation","Define the area above and below the x-axis","Discuss the volume of a solid of revolution"],"courseDescription":"<p>This material has been specifically designed to teach you about the various methods and applications of integration. Are you aware that there are two types of integrals? You will be introduced to their properties, differences and applications. You will learn about the concepts of integration and the constant of integration. The relationship between Riemann sums and calculating the area under a curve is highlighted. You will also be introduced to the functions of Sigma notation along with its various formulas. When working with a variable number in calculus, it is important to understand the dummy variable and stopping point. The multiple formulas for sums of sequences are explained. Did you know that there are three sigma laws to simplify calculations?</p><p>Two important concepts to understand are the average value of a function on an interval and mean value theorem for integrals. The power rule and basic rules of integration will be covered extensively. U-substitution allows for an immediate reversal of the process of differentiation; learn how to find integrals using the u-substitution method. This course teaches you how to integrate the six trigonometric functions. When integrating certain binomials, trigonometric substitutions can be useful. You will also be able to discuss integration using lnx if you are working with natural logarithmic functions. Knowing how to decompose a fraction into simpler functions is also imperative in calculus. Examine how to integrate partial functions. There is also a slightly more complicated type of first order differential equation. This course teaches you about separable differential equations. You will also be able to explain the technique of integration by parts.</p><p>Furthermore, you will see how to integrate inverse trigonometric and natural exponential functions. Examine how to find the area above and below the x-axis. The volume of a solid of revolution, as well as with a known cross section, will also be covered. The formula for the area of a region in a plane will also be explained. You will understand the surface of revolution and how to find the arc length. Exponential growth and decay are key concepts in calculus and you will become familiar with their various applications.</p><a href=\"https://alison.com/resume/courses/4117\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4117\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Definite and Indefinite Integrals","description":"To start, this module will introduce you to the concepts of antidifferentiation, as well as the properties of definite and indefinite integrals. You will also be introduced to the different formulas for sigma notation and three sigma laws.","topics":["Definite and Indefinite Integrals - Learning Outcomes","Definite and Indefinite Integral","Sigma Notation","Average Value Function","Definite and Indefinite Integrals - Lesson Summary"]},{"name":"Module","details":"Power Rules of Integration","description":"To start, this module will introduce you to the power and basic rules of integration, as well as integration by u-Substitution. You will also be introduced to the method of partial functions and separable differential equations.","topics":["Power Rules of Integration - Learning Outcomes","Power Rules of Integration","Partial Functions","Integration by Parts","Power Rules of Integration - Lesson Summary"]},{"name":"Module","details":"Velocity and Position Equation","description":"To start, this module will introduce you to the velocity and position equation, as well as equation of the area of region in a plane. You will also be introduced to the applications of exponential growth and decay.","topics":["Velocity and Position Equation - Learning Outcomes","Velocity and Position Equation","Area of Region","Exponential Growth and Decay","Velocity and Position Equation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["CLEP Calculus: Integral Calculus and Applications - Course Assessment"]}]}