{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4116","title":"CLEP College Algebra","totalEnrolled":"1,131","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of number systems, operations and functions with this free online college-level math course.","description":"This course introduces you to the foundations of algebra and shows you how to manipulate functions. Understanding algebra as a concept is more important than solving equations, and you will learn how to apply this knowledge in real-life situations. The material explains how to solve mathematical functions, sequences, and series for the College-level Examination Program (CLEP).","courseOutcomes":["Differentiate between complex and im...","Outline the definitions and vocabula...","Analyze the methods of simplifying r...","Summarize the sum and difference of ...","Differentiate between complex and imaginary numbers","Outline the definitions and vocabulary associated with monomials","Analyze the methods of simplifying rational expressions","Summarize the sum and difference of two perfect cubes","List and explain the two types of compound inequalities","Change between exponential and logarithmic forms","Identify the definitions of arithmetic sequences and series","Solve for binomial expansion with coefficients","Differentiate between complex and im...","Outline the definitions and vocabula...","Analyze the methods of simplifying r...","Summarize the sum and difference of ...","Differentiate between complex and imaginary numbers","Outline the definitions and vocabulary associated with monomials","Analyze the methods of simplifying rational expressions","Summarize the sum and difference of two perfect cubes","List and explain the two types of compound inequalities","Change between exponential and logarithmic forms","Identify the definitions of arithmetic sequences and series","Solve for binomial expansion with coefficients"],"courseDescription":"<p>Algebra represents problems or situations as mathematical expressions. It involves variables like x, y, z, and mathematical operations like addition, subtraction, multiplication, and division to form a meaningful mathematical expression. All the branches of mathematics such as trigonometry, calculus and coordinate geometry use algebra. One simple example of an expression in algebra is 5 + 2x = 15. Algebra deals with symbols that are related to each other with the help of operators. It is not just a mathematical concept, but a skill that all of us use in our daily life without even realizing it. Understanding algebra as a concept is more important than solving equations and finding the right answer.</p><p>This course introduces you to the different types of mathematical operations as well as number systems. It then gives you an insight into the standard definition and properties of rational numbers, and types. Square roots can be confusing because most times the learner makes the mistake of multiplying that number by 2 or by the power. Then, you will be introduced to monomials and polynomials. Monomials are simply numbers, but polynomials can get more complicated than that. A polynomial is the sum of monomials where each monomial is called a term. This course simplifies these concepts with the aid of examples. Symmetry can be useful in graphing an equation because if we know one portion of the graph then we can also find the remaining portion. You will learn about how to test for symmetry in algebra.</p><p>Lastly, you will be introduced to the Cartesian coordinate systems that are the foundation of analytic geometry. They are also essential tools for most applied disciplines that deal with geometry, including astronomy, physics, engineering, and many more. The material outlines how to plot points on the Cartesian coordinate system, and graph a linear inequality. In elementary algebra, the quadratic formula is a formula that provides the solution to a quadratic equation. This course outlines the different methods of solving quadratic equations with the aid of examples. Sequences and series are some of the most basic topics in arithmetic. An itemized collection of elements in which repetitions of any sort are allowed is known as a sequence, whereas a series is the sum of all elements. The material analyzes the different types of sequences and series, as well as how to manipulate them.</p><a href=\"https://alison.com/resume/courses/4116\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4116\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Number Systems and Operations","description":"To start, this module introduces you to number systems and operations in algebra. The module analyzes the different types of operations, types of numbers, and square roots. You will also learn about complex and imaginary numbers with the aid of examples.","topics":["Number Systems and Operations - Learning Outcomes","Working with Sets and Operations","Introduction to Integers","Forms of Numbers","Square Roots and Radicals","Complex and Imaginary Numbers","Number Systems and Operations - Lesson Summary"]},{"name":"Module","details":"Algebraic Basics","description":"To start, this module introduces you to monomials and the laws for exponents. You will learn about the different operations with monomials and polynomials. The module also gives an insight into factorization methods, rational expressions, and solving fractional equations.","topics":["Algebraic Basics - Learning Outcomes","Monomials and Laws for Exponents","Introduction to Polynomials","Division of Polynomial","Introduction to Factoring","Grouping and Rational Expressions","Algebraic Basics - Lesson Summary"]},{"name":"Module","details":"Solving Linear Equations and Inequalities","description":"To start, this module introduces you to solving linear equations and inequalities. The module also explains how to solve equations by combining like terms and solving equations containing parentheses. You will also learn about the properties of inequalities and compound inequalities.","topics":["Solving Linear Equations and Inequalities - Learning Outcomes","Variables and Algebraic Expressions","Linear Equations","Linear Inequalities","Compound Inequalities","Solving Linear Equations and Inequalities - Lesson Summary"]},{"name":"Module","details":"CLEP College Algebra - First Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["CLEP College Algebra - First Assessment"]},{"name":"Module","details":"Introduction to Functions","description":"To start, this module introduces you to functions, the different types of functions, characteristics, and how to solve them using different methods. The module also analyzes how to graph a linear inequality and quadratic system of equations.","topics":["Introduction to Functions - Learning Outcomes","Relations and Functions","Test for Symmetry","The Cartesian Coordinate System","Graphing a Linear Inequality","Quadratic Functions","The Discriminant and Nature of Roots","Quadratic-Linear Systems of Equations","Introduction to Functions - Lesson Summary"]},{"name":"Module","details":"Exponential and Logarithmic Functions","description":"To start, this module introduces you to exponential and logarithmic functions in Algebra. The module explains how to change between exponential and logarithmic forms. The module also analyzes the graphical transformations of functions.","topics":["Exponential and Logarithmic Functions - Learning Outcomes","Graphing Polynomial Functions","Exponential Functions","Logarithmic Functions","Solving Logarithmic Equations","Graphical Transformations of Functions","Exponential and Logarithmic Functions - Lesson Summary"]},{"name":"Module","details":"Sequences and Series","description":"To start, this module introduces you to sequences ad series in algebra. The module also analyzes the different types and methods of finding sequences and series. You will also learn about the binomial theorem and how to find the binomial expansions with coefficients.","topics":["Sequences and Series - Learning Outcomes","Sigma Notation","Sequences and Series","The Binomial Theorem","Sequences and Series - Lesson Summary"]},{"name":"Module","details":"CLEP College Algebra - Second Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["CLEP College Algebra - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["CLEP College Algebra - Final Assessment"]}]}