{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4123","title":"CLEP College Mathematics: Real & Complex Numbers and Basic Algebra","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online math course examines the steps for solving real, rational and irrational numbers using operators.","description":"This is a College Level Examination Program (CLEP) course that deals with imaginary numbers that come from taking the square root of negative numbers. It introduces you to basic algebraic operations like linear and quadratic equations. You will learn how to solve inequalities, and graphs. It also unpacks the method of substituting logarithmic expressions and solving quadratic equations.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Mathematics is an exciting and varied degree that can open up a lot of opportunities for students. The basic arithmetic operations for real numbers are addition, subtraction, multiplication, and division. Addition is the most basic operation of arithmetic. In its simplest form, addition combines two quantities into a single quantity or sum. This is a free online course about real, rational and irrational numbers. You will learn about sets of numbers and their operations. It outlines the methods used to calculate the sum, difference, product, and quotient of negative whole numbers. This module teaches you the steps in converting rational numbers from and to decimals. In math, we usually deal with two types of quantities: variable quantities (or variables) and constant quantities (or constants). You will discover the different types of variation according to the pattern of changing or relationships of variables. Other names for exponents are ‘index’ or ‘power’, and the material explains how to solve exponents and powers.</p><p>A monomial is an algebraic expression that contains only one term. A monomial can be a constant real number, a variable, or an expression written as the product of a real number and variables. You are introduced to the basic rules of exponentiation. Learn how to calculate the power of power as well as the quotient rule for monomials. Equations in which a variable expression is raised to a rational exponent can be solved by raising both sides of the equation to the reciprocal of the exponent. The reason the expression is raised to the reciprocal of its exponent is that the product of a number and its reciprocal is one. This course explains how to solve an equation with rational exponents. Learn how to solve radical equations having one radical term. It discusses the relationship between logarithms and exponents, and explains the algebraic rules for multiplication of two binomials using the acronym FOIL.</p><p>Finally, there are many real-world situations that deal with quadratics and parabolas. Throwing an object, diving from a platform, and kicking a ball are all examples of situations that can be modeled by quadratic functions. This course examines the graphical solution of quadratic equations in more detail as well as other methods of solving quadratic equations. It outlines the properties of inequalities, solving inequalities using addition and subtraction. Learn how to solve inequalities using multiplication and division. You will discover imaginary numbers, their properties, and the powers of i. This course analyzes complex numbers and their properties basics. You will learn the method of completing the square to establish a general formula for solving any quadratic equation.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}