{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4115","title":"CLEP College Algebra: Functions, Sequences and Series","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This college-level math free online course explains functions, sequences, series and other aspects of advanced algebra.","description":"This is a free online CLEP course that introduces you to functions in algebra. A ‘function’ is essential in mathematics because it describes situations where one quantity depends on another. This course explains how to solve functions. You will also learn about how to manipulate sequences and series. This course is a College-Level Examination Program math course and will help you to master this area of mathematics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Algebra is one of the broad areas of mathematics, together with number theory, geometry, and analysis. In its most general form, it is the study of mathematical symbols and the rules for manipulating them. It is the unifying thread of almost all math and includes everything from solving simple equations to the study of abstractions such as groups, rings, and fields. The more basic parts are called elementary algebra; the more conceptual parts are called abstract algebra or modern algebra. Elementary algebra is generally considered to be essential for any study of mathematics, science, or engineering, as well as such applications as medicine and economics. Abstract algebra is a major area in advanced mathematics, studied primarily by professional mathematicians. This free online course analyzes some of the most important aspects of algebra and begins by introducing you to the basics of relations and the characteristics of functions.</p><p>Next, it takes you through the test for symmetry and composition on functions. Symmetry can be useful in graphing an equation since it says that if we know one portion of the graph then we will also know the remaining portion as well. We use this fact when we are graphing parabolas to get an extra point of some of the graphs. Cartesian coordinates are the foundation of analytic geometry and provide enlightening interpretations for many other branches of mathematics. They are also essential tools for most applied disciplines that deal with geometry, including astronomy, physics, engineering, and many more. They are the most common coordinate system used in computer graphics, computer-aided design (CAD), and other geometry-related data processing. This course outlines how to plot points on the Cartesian coordinate system and some definitions of terms. You will also learn about how to graph a linear inequality.</p><p>In elementary algebra, the quadratic formula is a formula that provides the solution to a quadratic equation. The word ‘quadratic’ is derived from ‘quad’, which means square. In other words, a quadratic equation is an ‘equation of degree 2’. You learn about the different methods of solving quadratic equations with the aid of examples. Sequence and series are some of the most basic topics in arithmetic. An itemized collection of elements in which repetitions of any sort are allowed is known as a sequence, whereas a series is the sum of all elements. An arithmetic progression is one of the common examples of sequence and series. This course identifies the different types of sequences and series, as well as how to manipulate them. So, register now and begin your next algebra learning journey today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}