{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4066","title":"CLEP Chemistry: Structure of Matter","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online chemistry course explores the structure of matter and atoms as well as the configuration of electrons.","description":"This course is useful for those taking CLEP (College-Level Examination Program). It breaks down the various states of matter and forms of energy (such as potential and kinetic) available in the world. It also analyzes the three various subatomic particles: neutrons, electrons and protons. If you want to learn how to determine the number of each particle different atoms contain, you should register today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘CLEP Chemistry: Structure of Matter’ is a free online course that has been specially prepared to take you through the properties of compounds, mixtures, metals, non-metals, and metalloids. It distinguishes between physical and chemical properties. What is matter? Every day, we find many varieties of things with various colours, sizes and shapes. Everything is made up of material in this universe, which scientists have named ‘matter’. Particles of matter have a force of attraction between them. We can say that matter is present in three different states: solid, liquid, and gaseous. The states of matter are interconvertible: we can convert matter in one physical state to another by changing either the pressure or the temperature (for example, changing solid water in the form of ice into liquid by melting it). This course highlights the heat of fusion, freezing points, sublimation, the heat of vaporization and condensation. It explores the complex nature of matter and atomic numbers. Energy is required for life and there are various forms available. A course module discusses the forms and transfer of energy.</p><p>Physicist Ernest Rutherford came up with a new model for an atom called the planetary model. He introduced the concept of sub-atomic particles and their position and arrangement inside the atom. If you want to learn about Dalton's theory, Thomson’s model, and the experiments carried out to find the arrangement of electrons inside the atom, this course covers in detail the discovery of the three various subatomic particles; protons, neutrons and electrons. It also specifies how to determine the number of each particle an atom contains. It is possible to argue that the periodic table is the most important part of chemistry as it organizes all of the known elements. The evolution of the modern periodic table of elements demonstrates the logical consequence of the electronic configuration of atoms. This course takes you through classifying the elements of the periodic table by groups and periods. You will learn how to predict the physical properties of an element based on the physical properties of other elements in the same group.</p><p>It is very important to understand the periodic table because the placement of the various elements on it gives rise to several periodic trends, including atomic radius, metallic character, electronegativity and ionization energy. This course describes the electron configuration of an element, and shows you how to predict the ionic charge as well as the electron configuration of cations and anions. It also covers valence electrons and the properties of elements. In general, metals lose electrons, while non-metals gain electrons. The gained and lost electrons play a vital role in chemical bonding. There are three major types of radioactivity with each having its composition, charge and mass. The learning contents in this course are crucial for students undertaking CLEP chemistry or anyone else who wants to improve their understanding of the structure and states of matter.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}