{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4134","title":"CLEP Pre-Calculus: Trigonometry","totalEnrolled":"440","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online math course explains the basics of trigonometric functions and the application of various trig laws.","description":"This course analyzes important applications of trigonometry, covering its wide range of uses in our daily lives. For instance, the fundamental workings of sound and light technology are based on trigonometry. You will learn about trigonometric laws, ratios, functions, identities, and graphs relevant to pre-calculus. This is a College Level Examination Program (CLEP) course.","courseOutcomes":["Outline four methods for proving sim...","Explain the basic trigonometric rati...","Recall how to solve for triangles us...","Distinguish the various types of ang...","Outline four methods for proving similar angles","Explain the basic trigonometric ratio","Recall how to solve for triangles using the trigonometric ratio","Distinguish the various types of angles and their quadrants","Evaluate the basic Pythagorean identities and solve for co-functions","Discuss sine, cosine and tangent functions","Describe related or reference angles and how to solve problems using them","Recall how to find the sine, cosine and tangents of the sum or difference of two angles","Recall the graphs of the six trigonometric functions","Discuss inverse cosecant, secant and cotangent functions","Solve for a first- and second-degree trigonometric as well as the equations with more than one trig function","Explain the law of sine and cosine","Outline four methods for proving sim...","Explain the basic trigonometric rati...","Recall how to solve for triangles us...","Distinguish the various types of ang...","Outline four methods for proving similar angles","Explain the basic trigonometric ratio","Recall how to solve for triangles using the trigonometric ratio","Distinguish the various types of angles and their quadrants","Evaluate the basic Pythagorean identities and solve for co-functions","Discuss sine, cosine and tangent functions","Describe related or reference angles and how to solve problems using them","Recall how to find the sine, cosine and tangents of the sum or difference of two angles","Recall the graphs of the six trigonometric functions","Discuss inverse cosecant, secant and cotangent functions","Solve for a first- and second-degree trigonometric as well as the equations with more than one trig function","Explain the law of sine and cosine"],"courseDescription":"<p>Trigonometry is said to date back to the third century. We find applications of trigonometry in astronomy, oceanography, land surveying and range finding. Archaeologists also relate the codification of climatic seasons and calendars of various ancient civilizations with aspects of modern trig. This course introduces basic trigonometric formulas useful in pre-calculus. These formulas are explained from their fundamental derivations, covering the properties of right-angle triangles.</p><p>Computers, unlike humans, cannot listen and comprehend sounds we enjoy like music. Rather, they code and decode sounds mathematically by representing sounds into constituent waves. These waves have various properties evaluated in this course, covering frequency, wavelength, and amplitude. It is therefore important for sound engineers to understand the basics of trigonometry. Trig is the study of the different relationships between angles including common functions like sine, cosine, and tangent. Also, gain knowledge on using such functions to correctly graph useful quantities that are applied in many industries. On the successful completion of this course you will be able to accurately measure and calculate various angles, and correctly state the laws of trigonometry.</p><p>Furthermore, proofs of trigonometric laws are covered to help learners become familiar with them. Learners should be able to easily state the Pythagorean theorem algebraically when they successfully complete this course, and analyze graphs of various trigonometric functions along with their inverses. Can you imagine a world without the applications of trigonometry? A world without geometry or the many branches of mechanics? You will gain knowledge of circular functions, trigonometric ratios, arcs, and the many trig identities relevant to pre-calculus. What are you waiting for? Enroll in this free online course to learn all about the important basics of trigonometry.</p><a href=\"https://alison.com/resume/courses/4134\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4134\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Trigonometry and Angles","description":"In this module, you will be introduced to the concept of trigonometry and basic trigonometric ratios. You will also learn about the types of angles and calculations related to circular functions. You will also learn about special right triangles and methods for proving various triangle types.","topics":["Trigonometry and Angles - Learning Outcomes","Introduction to Trigonometry","Angle and Arc Basics","Circular Functions","Trigonometric Ratios of Angles","Trigonometry and Angles - Lesson Summary"]},{"name":"Module","details":"Trigonometric Identities and Equations","description":"In this module, you will learn how to prove trigonometric identities along with methods for solving double angle identities. You will also learn about inverse trigonometric functions covering first-degree and second-degree trigonometric equations. You will also learn about the properties and workings of trigonometric laws.","topics":["Trigonometric Identities and Equations - Learning Outcomes","Identities and Equations","Double Angle Identities","Graphs of Trigonometric Functions","Inverse Trigonometric Functions","Applications of Sine and Cosine Laws","Trigonometric Identities and Equations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["CLEP Pre-Calculus: Trigonometry -  Course Assessment"]}]}