{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4067","title":"CLEP Chemistry: Chemical Bonding","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course analyzes chemical bonding, how to write chemical formulas and solving stoichiometry problems.","description":"Chemical bonds are forces of attraction that tie atoms together. This is a CLEP (College-Level Examination Program) related course that covers a series of concepts that explains how chemical bonds work. It describes how to write chemical formulas for ionic compounds and explores the binary compounds that contain transition metal cations as well as solve stoichiometry problems.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Chemical bonding is one of the most basic principles of chemistry. This course also explains other concepts such as molecules and their reactions. It would have been impossible for scientists to explain why atoms are attracted to each other or how products are formed after a chemical reaction without knowledge of chemical bonds. To understand the concept of bonding, one must first know the basics of the atomic structure. Atoms with relatively similar electronegativities share electrons between them and are connected by covalent bonds. As we work through this course, it is important to know that an atom generally forms a chemical bond in a way that allows it to acquire a complete outer shell of electrons. This course analyzes ionic, metallic and nonpolar covalent bonds. Lewis structures (or Lewis dot formulas) are important when determining the molecular structure of a compound. This course describes the procedure for drawing a Lewis structure. It outlines the types of covalent bonds by electron sharing and identifies the properties of a covalent bond.</p><p>If you want to learn about valence shell electron pair repulsion (VSEPR) theory and the spatial arrangement of molecules, this course comes highly recommended. The material explains in detail how to name monatomic metal ions, polyatomic ions and their IUPAC (International Union of Pure and Applied Chemistry) name. You will learn how to write chemical formulas and name binary molecular compounds. The material also explores binary compounds that contain transition metal cations. During a chemical change, the chemical composition of matter is altered. When two or more substances are combined and a chemical change occurs, a chemical reaction has taken place. It is sometimes difficult to distinguish between chemical changes and physical changes. However, this course will make it easy by taking you through general observations that indicate a chemical reaction has occurred. It also outlines the four possible states a reactant or product can be. You will be able to write accurate chemical equations for a chemical reaction as well as balance chemical equations.</p><p>Furthermore, it defines Avogadro’s law and the standard temperature-pressure (STP). Have you ever tossed a full spoon of salt into a glass of water and watched the salt dissolve? This may seem like a simple chemistry experiment but, like every other experiment, there are rules to it. This course covers the list of solubility rules to help you determine the solubility of substances. It analyzes the concept of a mole, empirical formula and molecular formula. If you take this course, solving stoichiometry problems will be easier. The learning contents of this course are crucial for chemistry or anyone with an interest in a working knowledge of chemical bonding. So, if you have wanted to write a chemical equation for a chemical reaction or write balanced chemical equations, register for this course and start your next learning journey.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}