{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4095","title":"CLEP Calculus: Limits, Differential Calculus and Applications","totalEnrolled":"296","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online math course examines the methods of differentiation and some exponential and logarithmic functions.","description":"At college level, it is important to understand the concepts of limits and differentiation. This online calculus course teaches you about the different applications of the derivative. You will explore the mean value and Rolle's theorem, as well as logarithmic and trigonometric functions. Register now to improve your understanding on the multiple applications of differential calculus. This is a College-Level Examination Program (CLEP) course.","courseOutcomes":["Compute limits from tables and graph...","Calculate limits of polynomial and r...","Describe the slope of a curve at a p...","Discuss the slope of the tangent to ...","Compute limits from tables and graphs","Calculate limits of polynomial and rational functions","Describe the slope of a curve at a point","Discuss the slope of the tangent to a curve","Indicate the derivatives of the six trigonometric functions","Distinguish between common and natural logs","Summarize the Rolle's theorem","Indicate the steps involved in solving optimization problems","Solve related rate problems","Compute limits from tables and graph...","Calculate limits of polynomial and r...","Describe the slope of a curve at a p...","Discuss the slope of the tangent to ...","Compute limits from tables and graphs","Calculate limits of polynomial and rational functions","Describe the slope of a curve at a point","Discuss the slope of the tangent to a curve","Indicate the derivatives of the six trigonometric functions","Distinguish between common and natural logs","Summarize the Rolle's theorem","Indicate the steps involved in solving optimization problems","Solve related rate problems"],"courseDescription":"<p>This course has been carefully curated to teach you about the methods of differentiation and the applications of the derivative. You will be introduced to the concepts of limits, as well as how to find them from tables or graphs. You will understand how to calculate limits using different theorems. Important concepts to understand are the limits of trigonometric and rational functions. The Sandwich theorem is a useful tool in calculating some types of limits and you will see how to use it. You will also learn about the relationship between limits and asymptotes. Did you know that there are two types of asymptotes? The average and instantaneous rates of change will also be analyzed. On completion, you should be able to explain the concepts of continuity, along with types of discontinuities.&nbsp;</p><p>As you continue, you discuss the slope of a curve at a point and the slope of a tangent at a curve. The derivative and notation are key concepts to understand when dealing with differentiation. The relationship between differentiability and continuity will also be highlighted. Are you aware that there are multiple rules of differentiation? Learn about their formulas and when to use them. This course teaches you about the six trigonometric functions, as well as their derivatives. You will study the relationship between implicit functions and implicit differentiation. Inverse trigonometric functions will also be explained. Logarithmic differentiation is another technique to look out for when dealing with calculus. You will also learn about the local extreme value theorem and its working principles. The absolute extrema is related to both absolute minima and maxima. State how to use a chart to find the absolute extrema of a curve.&nbsp;</p><p>The mean value and Rolle’s theorem are important to understand when working with derivatives. The first and second derivative tests will also be analyzed. This course also teaches you about concavity. You will become familiar with the concave up and concave down curves. Velocity and acceleration can be calculated using derivative functions. The derivative also plays a role in business, and economics. The optimization problem seeks the best value for a variable quantity. Discuss the steps involved in solving an optimization problem. You will also become familiar with linear approximations and differentials. This course will be of great interest to students with an interest in limits, differential calculus, and applications. So, register for this free advanced math course now and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/4095\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4095\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Limits and Continuity","description":"To start, this module will introduce you to the limits of polynomial, rational as well as trigonometric functions. You will also be introduced to the sandwich theorem and the algebra of continuous functions.","topics":["Limits and Continuity - Learning Outcomes","Finding Limits","One-Sided and Two-Sided Limits","Continuous Functions","Limits and Continuity - Lesson Summary"]},{"name":"Module","details":"Rates of Change","description":"To start, this module will introduce you to how to calculate the average, as well as instantaneous rates of change. You will also be introduced to the concepts of derivative, notation and intermediate value theorem.","topics":["Rates of Change - Learning Outcomes","Rates of Change","Derivative and Notation","Intermediate Value Theorem","Rates of Change - Lesson Summary"]},{"name":"Module","details":"Methods of Differentiation","description":"To start, this module will introduce you to the methods of differentiation in the sum and difference, quotient as well as product rule. You will also be introduced to the derivatives of the six trigonometric functions.","topics":["Methods of Differentiation - Learning Outcomes","The Product and Quotient Rule","Derivatives of Trigonometric Functions","Composite and Implicit Functions","Methods of Differentiation - Lesson Summary"]},{"name":"Module","details":"Inverse Trigonometric Functions","description":"To start, this module will introduce you to how to find derivatives using logarithmic differentiation and the derivatives of exponential functions. You will also be introduced to differences between common and natural logs.","topics":["Inverse Trigonometric Functions - Learning Outcomes","Inverse Functions","Logarithmic Functions","Logarithmic Differentiation","Inverse Trigonometric Functions - Lesson Summary"]},{"name":"Module","details":"First and Second Derivative","description":"To start, this module will introduce you to the first and second derivative tests, as well as the critical point method. You will also be introduced to calculus techniques and techniques for graphing functions.","topics":["First and Second Derivative - Learning Outcomes","Local Extreme Value Theorem","Rolle's Theorem","Concavity and Inflection Point","First and Second Derivative - Lesson Summary"]},{"name":"Module","details":"Applications of the Derivative","description":"To start, this module will introduce you to the applications of the derivative to velocity, acceleration, as well as jerk. You will also be introduced to the steps involved in solving optimization problems.","topics":["Applications of the Derivative - Learning Outcomes","Applications of the Derivative","Related Rate Problems","Linear Approximations","Applications of the Derivative - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["CLEP Calculus: Limits, Differential Calculus and Applications - Course Assessment"]}]}