{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4142","title":"CLEP Chemistry: Physical Chemistry","totalEnrolled":"637","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the different types of acids and bases, as well as the concept of chemical equilibrium.","description":"This is a College Level Examination Program (CLEP) course that discusses the concept of chemical equilibrium without which, life as we know it would not be possible. It also explores the relationship between the concentrations of reactants and products in a reaction at equilibrium. You will learn about acids and bases, and how to solve problems using the acid dissociation constant.","courseOutcomes":["Describe the properties of acids and...","Describe the difference between Arrh...","Discuss acid and base strength as we...","Solve problems involving the acid/ba...","Describe the properties of acids and bases","Describe the difference between Arrhenius and Bronsted-Lowry acids and bases","Discuss acid and base strength as well as the acid/base dissociation constant","Solve problems involving the acid/base dissociation constant","Describe the purpose of acid-base titrations","Recall acid-base titration calculations","Describe the equilibrium concept for a reversible reaction","Explain the application of Le Chatelier’s principle to gaseous chemical equilibrium","State Le Chatelier’s principle to the solubility of solids in aqueous solutions","Identify the factors that affect equilibrium","Recall how to use the equilibrium constant to determine the thermodynamically favourable reaction","Solve problems on solubility products","Describe the properties of acids and...","Describe the difference between Arrh...","Discuss acid and base strength as we...","Solve problems involving the acid/ba...","Describe the properties of acids and bases","Describe the difference between Arrhenius and Bronsted-Lowry acids and bases","Discuss acid and base strength as well as the acid/base dissociation constant","Solve problems involving the acid/base dissociation constant","Describe the purpose of acid-base titrations","Recall acid-base titration calculations","Describe the equilibrium concept for a reversible reaction","Explain the application of Le Chatelier’s principle to gaseous chemical equilibrium","State Le Chatelier’s principle to the solubility of solids in aqueous solutions","Identify the factors that affect equilibrium","Recall how to use the equilibrium constant to determine the thermodynamically favourable reaction","Solve problems on solubility products"],"courseDescription":"<p>In the physical world, every movement to every reaction has a point where equilibrium is established. Chemical equilibrium is the state in which the forward reaction rate and the reverse reaction rate are equal. Sometimes, when a chemical reaction takes place, it continues for a period of time and then seems to stop before all the reactants are consumed. But the reaction does not actually stop. This free online course on physical chemistry discusses the relationship between the concentrations of reactants and products in a reaction at equilibrium. It covers in detail the concept of chemical equilibrium and equilibrium constant expressions. An example of equilibrium is the movement of our bodies running on a treadmill in a forward and backward motion. The course analyzes equilibrium constant expressions when chemical reactions are added, and you will learn about the relationship between equilibrium constant and thermodynamic favorability.</p><p>You will find every aspect of chemical reactions and reversible reactions discussed in this course very useful in various laboratory procedures. It is important to understand that not all situations of equilibrium are alike: some chemical reactions favor the production of products at equilibrium. This means that not all of the reactants are converted to products. Other reactions favor the reactants at equilibrium. Once a chemical system has reached an equilibrium state, there are factors that affect equilibrium. The sections that follow explain in detail these factors, which are temperature, pressure and concentration. Le Chatelier’s principle is one of the pivotal ideas in understanding the behavior of a system in equilibrium. In addition, you will learn how to apply Le Chatelier’s principle to the solubility of solids in aqueous solutions as well as to gaseous chemical equilibriums. These problems are solved in an easy step-by-step manner while explaining the best ways to end up at the desired solutions.</p><p>Other aspects of physical chemistry covered are acids, bases and salts. Acids and bases play a vital role in our lives. Many foods we eat are either acidic or basic in nature, and our bodies are controlled acid-base systems. This course explains the properties of acids and bases. It describes the concept of Arrhenius acids and Arrhenius bases as well as the Bronsted Lowry acid-base model. How do you identify the strength of an acid? You will learn how to classify weak or strong acids and bases based on pH. You will also learn natural and synthetic indicators. This course explores in detail how to use the Henderson-Hasselbalch equation to calculate the pH of the buffer solution. At the end, you will be able to solve carefully analyzed solubility, chemical reaction and equilibrium constant of water problems from start to finish.</p><a href=\"https://alison.com/resume/courses/4142\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4142\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Chemical Equilibrium","description":"In this module, you will be introduced to chemical equilibrium as well as writing equilibrium constant expressions. This module covers the effect of changing the reactant and product concentration on the direction of the reaction. You will learn how to calculate the equilibrium constant expression when chemical reactions are added.","topics":["Chemical Equilibrium - Learning Outcomes","Concept of Chemical Equilibrium","Solubility Products","Temperature & Pressure on Equilibrium","Chemical Equilibrium - Lesson Summary"]},{"name":"Module","details":"Acid, Bases & Salts","description":"This module describes the difference between Arrhenius and Bronsted-Lowry acids and bases. It covers the acid and base strength, acid/ base dissociation constant. Also, this module explains how to calculate acid-base titration. You will learn how to solve problems involving acid/ base dissociation constant.","topics":["Acid, Bases & Salts - Learning Outcomes","Properties of Acids and Bases","Acid Strength","Acid-Base Neutralization","Acid, Bases & Salts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["CLEP Chemistry: Physical Chemistry - Course Assessment"]}]}