{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4173","title":"CLEP Chemistry: Chemical Reactions and Kinetics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online chemistry course explains redox and half-life reactions as well as the rate law and organic compounds.","description":"This course covers redox reactions, hydrocarbons and half-life reactions in detail. It also explores rate law along with the factors that affect reaction rate. Enroll in this College Level Examination Program (CLEP) course to learn how to calculate the oxidation numbers for chemical compounds and how to properly balance redox equations. No registration or monthly subscription fees - complete the course for free.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Chemical reactions involve the transfer of electrons from one substance to another. This type of reaction is called a reduction-oxidation reaction or a redox reaction. They are energy‐producing reactions in industry as well as in the body. The core of a redox reaction is the passing of one or more electrons from one species to another. It is important to keep track of the number of electrons being transferred in a redox reaction. This course teaches you how to assign an oxidation number to each substance involved in the reaction as well as the rules for assigning them. A combined understanding of these concepts improves your chances of passing your chemistry exam.</p><p>Oxidation numbers are assigned to each element in a chemical reaction to help us learn which element is oxidized and which reduced. The changes in oxidation numbers are also used to balance redox equations. The study of redox reactions begins by learning about oxidation numbers. There are several ways to approach balancing redox reactions. This course discusses the half-reaction method and the ion-electron method. It explores electrolytic and voltaic cells as well as the electrodes used in electrolysis. You will be able to recall the easy steps outlined in finding oxidation numbers as well as solving the organic chemistry and kinetic problems presented in this course. You will also get familiar with the identification and characterization of alkanes, alkynes and alkenes along with their functional groups. You will learn about the classification along with the sub-classification of hydrocarbons into saturated compounds and unsaturated compounds.</p><p>Organic compounds that have the same chemical formula but different chemical structures are called isomers. You will study the three main types of isomers. You will also learn about the rate law along with the factors that affect reaction rates. When provided with concentration and time data, what is the easiest way to determine the rate law? How do you calculate the half-life reaction? These and other questions are clearly answered in the online modules. Enroll now and improve your chemistry knowledge today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}