{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5084","title":"Comprehensive Course Paralegal Studies","totalEnrolled":"5,022","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to effectively and efficiently complete different paralegal tasks.","description":"What exactly does a paralegal do? What qualifications are necessary for a paralegal? How much does a paralegal make? Who can become a paralegal? What kind of education is considered essential for paralegals? If you have these or similar questions, this short but informative paralegal course will help you answer them. It provides a starting point for assessing your skills and planning how to train in this career.","courseOutcomes":["Outline the role of paralegals...","Define important legal terms, key pe...","Identify the various processes used ...","Summarise the legislative process in...","Outline the role of paralegals","Define important legal terms, key people and the role of paralegals in the legal sector","Identify the various processes used in effective communication","Summarise the legislative process in the UK’s legal system","Discuss the notions of business, property, estate, family and criminal law","Explain the different characteristics and categories of human rights","Indicate the conduct and ethics of paralegals, focusing on the duty of confidentiality","State the values and principles that characterise a competent paralegal","Describe the skills and professional attitude needed to excel as a paralegal","Outline the role of paralegals...","Define important legal terms, key pe...","Identify the various processes used ...","Summarise the legislative process in...","Outline the role of paralegals","Define important legal terms, key people and the role of paralegals in the legal sector","Identify the various processes used in effective communication","Summarise the legislative process in the UK’s legal system","Discuss the notions of business, property, estate, family and criminal law","Explain the different characteristics and categories of human rights","Indicate the conduct and ethics of paralegals, focusing on the duty of confidentiality","State the values and principles that characterise a competent paralegal","Describe the skills and professional attitude needed to excel as a paralegal"],"courseDescription":"<p>Working as a paralegal can be a great way to start a career in the UK's justice system. This course covers everything you need to know to stand out in a law office. It starts with an overview of the role of paralegals. You will explore who they are, the traits you need to develop to succeed and the opportunities available in this profession. You will also learn about the main paralegal functions and why they are essential to society.</p><p>The course then introduces key legal terms used by paralegals, professional roles in the legal workplace and key people in the legal sector. You will also learn about effective communication and how to use it in your daily work. Furthermore, you will explore the UK legal system and its legislative process. You will research business, property, estate and criminal law and their importance for paralegals. Understanding some of the legal matters you will face in this field is critical. We will explore family law, civil court proceedings, bankruptcy, insurance and personal injury claims.</p><p>The following section looks at the different categories of human rights and the international framework that protects them. You will also learn about the conduct and ethics of paralegals. The final section focuses on the skill and professional attitude you need to excel. So if you want to know how to take on significant responsibilities such as the legally enforceable groundwork for contracts and court cases, as well as expected duties and administrative support skills, sign up for this course today and expand your career opportunities.</p><a href=\"https://alison.com/resume/courses/5084\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5084\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Paralegal Concept's Foundations","description":"This module will help you understand the concept of the paralegal, who can become a paralegal and the specific function of paralegals. You will learn about the roles of the key people within the legal sector, the UK legal system and the legislative process. Also, you will learn the fundamentals of business, property, estate and criminal law.","topics":["The Paralegal Concept's Foundations - Learning Outcomes","Understanding the Concept of Paralegal","Business, Property, Estate and Criminal Law","Common Paralegal Legal Matters","The Paralegal Concept's Foundations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Comprehensive Course on Paralegal Studies - Course Assessment"]}]}