{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4432","title":"Complete Music Theory","totalEnrolled":"2,706","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the theoretical foundations of music in this free online musicology course to appreciate what makes it special.","description":"Keen insight around musical notation is akin to asking about science. Musical geniuses are not brought into the world every day so a basic understanding of theory becomes invaluable to real musicians to help them comprehend the logic behind the songs they play. The mind interprets music faster than words and concepts could ever explain. So begin your journey with the foundations of music theory to appreciate this art form by enrolling today.","courseOutcomes":["Recognize the fundamental properties...","Define the concepts of scales, arpeg...","Recognize the various ornaments used...","Identify the distinctions among both...","Recognize the fundamental properties of music","Define the concepts of scales, arpeggios, solfege, intervals, and octaves","Recognize the various ornaments used in music","Identify the distinctions among both harmony and chords","Define the sound categorizations utilized in musical concepts","Distinguish a simple bassline from a walking bassline or a bass inversion","Indicate the functionality of the Fermata symbol when writing music","Classify transposing instruments depending on soprano or alto","Recognize terms related to changing progression to provide variation in a musical work","Define elements such as tempo, musical timing, and time signature","Explain how rhythm is used to create music","Explain the importance of conductors in keeping an orchestra in sync and on time","Identify the articulation marks in musical notation","List coping methods to deal with performance anxiety","Recognize the fundamental properties...","Define the concepts of scales, arpeg...","Recognize the various ornaments used...","Identify the distinctions among both...","Recognize the fundamental properties of music","Define the concepts of scales, arpeggios, solfege, intervals, and octaves","Recognize the various ornaments used in music","Identify the distinctions among both harmony and chords","Define the sound categorizations utilized in musical concepts","Distinguish a simple bassline from a walking bassline or a bass inversion","Indicate the functionality of the Fermata symbol when writing music","Classify transposing instruments depending on soprano or alto","Recognize terms related to changing progression to provide variation in a musical work","Define elements such as tempo, musical timing, and time signature","Explain how rhythm is used to create music","Explain the importance of conductors in keeping an orchestra in sync and on time","Identify the articulation marks in musical notation","List coping methods to deal with performance anxiety"],"courseDescription":"<p>Music existed throughout history before theory developed to explain what players were doing when performing their melodies. However, people have a long tradition of distorting the facts about music theory. Numerous individuals believe that theory entails studying at school in front of an authoritarian professor. This thinking could not be further from the truth! Music is an art form so there are no ‘right’ or ‘wrong’ ways to perform it. This course is for you, whether you are a self-taught musician who learnt by ear or are studying music but feel unsure where to start. Musicians of all ages, songwriters, producers and everyone in between can express themself swiftly and efficiently thanks to music theory. Traditional approaches for learners to grasp music theory that does not require knowledge to play an instrument typically involve reading tonnes of books, streaming countless hours of videos on social media or formal pre-planned education plans. There is so much data available on the net that it is overwhelming to begin. Starting music theory can be frightening but do not let that deter you. Knowledge is a critical aspect of a performer's development. This music theory course can provide you with the resources required to understand the fundamentals and apply them to your musical compositions right away.</p><p>If you are just getting started in music production, this is an ideal time to learn the theory behind the music. Certain songs will be hard to play because you need to read musical notation to comprehend which chords, speed and rhythm you need to perform. In the first module, you will learn to identify essential compositional features such as notes, key signatures, chord progressions, intervals, scales and much more. Then improve your critical listening skills by studying how to combine notes harmonically and use musical markers like pitch, tone and dynamics. Develop your passion for music with theoretical components such as arpeggios, intervals, major and minor scales. Your tutor, Ethan Winer, is a formal professional musician who plays violin, guitar and cello. His professional repertoire and experience guarantee that you will be learning from a specialist who has developed detailed material for you to have the advantage of knowing the ‘why’ underlying the topic.</p><p>By the end of this course, you will be able to express yourself with other musicians with ease, grasping the universal tools that enable anyone to play music regardless of the instruments they use. With some instructions, you will be more productive at composing music to excel in your art, no matter the genre. Alternately, recognizing how music works will help you become a convincing music producer by knowing how to adapt to a scale that fits the vocalist's range, easing the process and giving room for creativity. Complete the course to increase your knowledge of music theory by discovering substitutions, notation articulation marks and music reading. A solid understanding of theory will help you expand your horizons. In addition, you’ll gain credibility among other musicians. The more scales and progressions you learn, the more resources you'll have to make music and improvise. Consider how successful Jimi Hendrix could have been if he had known music theory! So get ready to enrol in your first musicology class today!</p><a href=\"https://alison.com/resume/courses/4432\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4432\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Music Theory: The Basics","description":"This module offers a comprehensive set of musical elements such as rhythm and dynamics, scales, notes, and chords. You will discern between augmented and diminished chords and from consonance and dissonant notes. Furthermore, strengthen your interpreting music proficiency by mastering chord progressions, basslines, and melodic ornaments.","topics":["Music Theory: The Basics - Learning Outcomes","Music's Conceptual Framework","The Foundations of Music","Musical Rhythm and Structure","Music Theory: The Basics - Lesson Summary"]},{"name":"Module","details":"Melodies: Composition and Expressions","description":"This module uses patterns, articulation marks, and harmonics to highlight the fundamental framework of music. From musical devices in songwriting to the relationship between music, numbers, and beats, you'll learn everything you need to know. Also, find guidelines for coping with the overwhelming desire to quit right before the performance.","topics":["Melodies: Composition and Expressions - Learning Outcomes","Reading Time in Musical Notations","Leadership and Music Making","Melody and Harmony Expressions","Melodies: Composition and Expressions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Complete Music Theory - Course Assessment"]}]}