{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5341","title":"Cooking Basics - Key Dishes for Beginners, Meat, Fish & Salads","totalEnrolled":"2,479","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Build your culinary career by learning classic dishes and the skills needed to make them with this free online course.","description":"Becoming a professional chef requires a lot of skill and determination. By enrolling in this course, you will learn essential information concerning basic culinary skills, such as cleaning a fish and filleting it, preparing a chicken to be roasted, and making a salad dressing. This course will also teach you about different types of egg dishes, recommendations for preparing and garnishing soups, and world-famous meat dishes.","courseOutcomes":["Identify different dishes that can b...","Classify soups according to their co...","Summarize the fundamentals of soup p...","Prepare a pasta rice dish...","Identify different dishes that can be prepared from eggs","Classify soups according to their content, health benefits, and cost","Summarize the fundamentals of soup preparation and the method to prepare basic meat and vegetable soup","Prepare a pasta rice dish","Clean a fish before cooking it","Fillet a fish","Discuss the types of meats and world-famous meat dishes","Roast a chicken","Categorize salads based on their content and recognize different preparations","Identify different dishes that can b...","Classify soups according to their co...","Summarize the fundamentals of soup p...","Prepare a pasta rice dish...","Identify different dishes that can be prepared from eggs","Classify soups according to their content, health benefits, and cost","Summarize the fundamentals of soup preparation and the method to prepare basic meat and vegetable soup","Prepare a pasta rice dish","Clean a fish before cooking it","Fillet a fish","Discuss the types of meats and world-famous meat dishes","Roast a chicken","Categorize salads based on their content and recognize different preparations"],"courseDescription":"<p>Becoming a successful chef is no simple task because they face many challenges that force them to adapt to an ever-changing world. If they cannot do so, they might face a loss of their reputation. One of the main reasons a chef might fail to satisfy their customers' demands is being unaware of basic culinary skills and lacking the knowledge with regards to preparing everyday dishes.</p><p>You must learn basic culinary skills and everyday food items in order to become a well-regarded chef. This bi-modular course, where each module consists of three topics, has been developed specially to ground beginner chefs and even home cooks in the basics. The first module covers some dishes you must know as a new chef including egg dishes, soups, garnishes, sauces, pastas and rices.</p><p>Moving on, the second module will help you learn essential kitchen skills such as cleaning and filleting a fish; cleaning, scalding, and roasting a chicken; and ways to prepare a classic balsamic vinaigrette salad dressing. This module's topics also present several essential dishes that can be prepared using meat and fish, along with various salad recipes. To improve your understanding, the course presents all the essential culinary skills step-by-step. So, enroll in this course today to embark on your journey of becoming a skillful chef!</p><a href=\"https://alison.com/resume/courses/5341\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5341\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Essential Dishes for Beginner Chefs","description":"This module describes the preparation of various dishes you must know to prepare as an amateur chef. These include dishes made of eggs, various types of soups, and items used to garnish them. The module also contains a topic describing sauces, their preparation, ingredients, and their different types. You will study how to prepare pasta.","topics":["Essential Dishes for Beginner Chefs - Learning Outcomes","Famous Egg Dishes","Fundamentals of Soup Preparation","All About Sauces and Pasta Rice","Essential Dishes for Beginner Chefs - Lesson Summary"]},{"name":"Module","details":"The Culinary Classics","description":"With this module, you will learn about various classical culinary preparations. These include fish recipes, meat preparations, and salads. In this regard, this module mentions different recipes that are popular worldwide and can be prepared.","topics":["The Culinary Classics - Learning Outcomes","Basics of Fish Cooking","Different Types of Meat Preparations","Salads and Salad Garnishes","The Culinary Classics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Cooking Basics - Key Dishes for Beginners, Meat, Fish & Salads - Course Assessment"]}]}