{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3344","title":"Coordinate Geometry, Locus, Areas and Volumes","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains volumes and areas of special shapes and the concept of coordinate geometry.","description":"Geometry is one of the oldest divisions of mathematics. This course investigates an extensive analysis of solid, plane and coordinate geometry and how you can express them in abstract mathematical concepts. We focus on translational geometry and the proof of coordinates. With the help of activities, we will introduce you to several concepts. For example, you will learn how to find the reflection of a triangle. Why wait? Register today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Coordinate geometry is an essential branch of mathematics and usually assists us in locating points in a plane. Acquire the knowledge to understand the connection between algebra and geometry by using graphs, lines, curves and formulas to calculate special shapes’ areas. For example, we teach you how to use Heron’s formula to calculate the area of a triangle without necessarily calculating the angles or other distances in the triangle. Study the concept of locus and coordinate geometry related to circles and parabolas. We will uncover the parameters of regular polygons and the formula used to calculate the area of a regular polygon. We unwrap the formula used to calculate the volume of a rectangular solid. If the segment joining the centres of the circles of a cylinder is perpendicular to the planes of the bases, the cylinder is a right circular cylinder. We will briefly illustrate the formation of the circular cylinder and explain how to calculate its volume.</p><p>This course emphasises developing critical thinking skills related to logical reasoning and argument. Roughly, we can say that a line is an infinitely thin, infinitely long collection of points extending in two opposite directions. When we draw lines in geometry, we use an arrow at each end to show that it extends infinitely. We give you a step-by-step guide on how to derive the formula for calculating the distance between a point and a line. We outline the relationship between two parallel lines. The way to make the slope the ‘most opposite’ is to flip it and make it negative. This will help you prove that the length of the slope of opposite reciprocals is the same. Discover the difference between 2-D and 3-D geometry. Uncover how to calculate the distance between two points in space and find their midpoint.</p><p>Finally, you will be required to use different technological tools and manipulatives to discover and explain much of the course content, such as translation, reflection, dilation and composition of transformation and the properties preserved in them. In line with the geometry theorem, this course shows you how to solve the linear systems of equations both graphically and algebraically. We illustrate the formation of a locus, summarise the fundamental locus statements and explain the concept of locus and coordinate geometry related to circles and parabolas. In this course, you will learn about the lines of symmetry found in quadrilaterals, triangles and a circle. This course teaches you how to calculate the angle of rotation and half-turns using succinct examples. We present all the necessary mathematical tools for complex reasoning and solving problems in the sciences, technology, engineering and many skilled trades and professions. Why delay? Enrol today and become a master in coordinate geometry.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}