{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2801","title":"Copyright In Media","totalEnrolled":"1,683","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn all about the different types of copyright in the world and how copyright laws impact the media with this course.","description":"This course will guide you through copyright and the use of copyright law. One of the main components of this course is the GNU Project, which specialises in developing a free operating system. Content modules cover the concept of software ownership and the laws that protect digital content, which is extremely important in this day and age.","courseOutcomes":["Discuss the concept of software owne...","Recall Lawrence Lessig's law on digi...","Explain the concept behind the creat...","Summarize content sharing and the co...","Discuss the concept of software ownership","Recall Lawrence Lessig's law on digital content","Explain the concept behind the creation of content and copyright","Summarize content sharing and the concept of the Internet","Describe the emergence of copyright","State the effect of copyright control","Identify the claims and truths of copyright","Discuss the concept of software owne...","Recall Lawrence Lessig's law on digi...","Explain the concept behind the creat...","Summarize content sharing and the co...","Discuss the concept of software ownership","Recall Lawrence Lessig's law on digital content","Explain the concept behind the creation of content and copyright","Summarize content sharing and the concept of the Internet","Describe the emergence of copyright","State the effect of copyright control","Identify the claims and truths of copyright"],"courseDescription":"<p>This course begins with an overview of what software ownership is. It then moves on to talk about the GNU Project and its aims and objectives around copyright. The acronym ‘GNU’ stands for ‘GNU’s Not Unix’. Unix is an operating system that is comparable to Windows and supports multiple concurrent users. The GNU Linux project was created for the development of a Unix-like operating system that comes with source code that can be copied, modified and redistributed. This is a unique perspective on copyright and forms a substantial part of the course material.</p><p>You will learn about the concept of ‘intellectual property’, activities that are prohibited by copyright law and the importance of such laws. Following on from this, you will gain some insight into copyright and the media as the material analyzes examples of copyright use.</p><p>The course then wraps up with the creation of content and the emergence of copyright. This includes studying the relationship between the author and the printer, state control on copyright and international copyright routines. You will be shown claims and truths of copyright, the characteristics of digital reproduction and be introduced to the concept of the Creative Commons Licence. This course is important for learners who want to have an understanding of copyright including voluntarily applying legal principles and ethical conduct related to information technology such as copyright, plagiarism, privacy, online etiquette and acceptable use of resources.</p><a href=\"https://alison.com/resume/courses/2801\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2801\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ownership of Software and Contents","description":"In this module, you will be introduced to the GNU Manifesto by Richard Stallman who considers himself to be a software evangelist. Also, you will be shown the importance of the GNU manifesto which will help us get a snapshot of the ownership patterns of software. You will be taught the notion of free software, protection of digital contents, Lawrence Lessig's law on digital content and content sharing practices.","topics":["Ownership of Software and Contents - Learning Outcomes","Richard Stallman: The GNU Manifesto","Lawrence Lessig: Free Cultures","Ownership of Software and Contents - Lesson Summary"]},{"name":"Module","details":"Copyright","description":"In this module, you will be introduced to the creation of content and the emergence of copyright. Also, you will learn about the relationship between the author and the printer, state control on copyright and the international copyright routines. Furthermore, you will be shown claims and truths of copyright, the characteristics of digital reproduction and creative commons license.","topics":["Copyright -  Learning Outcomes","History of Copyright","Development of Modern Copyright Laws","Copyright - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Copyright In Media - Course assessment"]}]}