{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4610","title":"Creating a Successful Online Course: From Simple Idea to Marketing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master mindset, customer research, marketing strategy and copywriting and sell your knowledge in our free online course.","description":"Everyone has expertise in some subject that enables them to teach others. This course will take you from an idea to developing a successful online programme. You might lack conviction in your ability right now but you will feel confident to share your expertise after taking this course. Learn about mindset, customer research, marketing and promotion, copywriting and various tools that will enable you to complete a course and make money!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Most of us can relate to buying a product online without thinking but subconsciously feelinggood about it. The experience of buying something was seamless and the page's words spoke to us like they knew our minds. Before developing a course, you also need to believe that you can create such an experience for your future customers. We begin the course by exploring the importance of mindset. After that, you will do keyword analysis and find your niche. Explore the type of courses you can create, how to choose your topic and conduct an audience analysis. We discuss time-saving tips by discovering how to reuse some aspects of a course for your next creation. The first section concludes by considering how to record, test and host your class.</p><p>The next topic examines marketing. Learn marketing strategies and understand the current standards for what works. Consider how to price your course, build a list (of leads) and do social media marketing (SMM). One aspect of SMM knowledge is knowing the techniques that work for different platforms (Facebook and YouTube). After that, you'll see how to plan the launch of your course and the perfect webinar framework. You'll end this section by learning about website and testimonial considerations.</p><p>The final part provides knowledge about copywriting. Copywriting is an opportunity to make your voice heard in words - but there is a proper way to go about it. We demonstrate how to create compelling copy and course titles. A sales letter tends to be some of the most crucial sales copy you will write so there are many tips we will share with you. The course concludes with the topics on outsourcing, valuable tools and SEO to drive traffic to your website. Remember: we live in the Information Age so simultaneously serve the world and monetise your expertise by taking our free online course!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}