{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2789","title":"Diploma in Ecology and Human Interaction with Nature","totalEnrolled":"756","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course on how humanity has interacted with nature across history and our impact on the environment.","description":"Many believe that we are living in an era of ecological crisis. This free online course looks at how human societies have interacted with their natural environments across history and the impact they have had on these ecosystems. Understanding what has led up to this modern-day crisis will help create more sustainable solutions for a better future. This course will be helpful to anyone wanting to make a difference to the human-ecology dynamic.","courseOutcomes":["Define Cartesian anxiety...","Describe the ideas of Orientalism, p...","Discuss the emergence of religion in...","Recall the role of Christianity in t...","Define Cartesian anxiety","Describe the ideas of Orientalism, paternalism and communalism","Discuss the emergence of religion in human evolution","Recall the role of Christianity in the ecological crisis","Indicate conservation ethics in Buddhism","Explain the views of Hinduism in nature conservation","Recall environmental philosophies","Explain the concept of deep ecology, social ecology and ecofeminism","Outline the difference between indigenous knowledge and scientific knowledge","Identify how indigenous knowledge is passed on","Analyze the impact of indigenous knowledge on development projects","Summarize the work entitled, 'An Ecological Journey","Define Cartesian anxiety...","Describe the ideas of Orientalism, p...","Discuss the emergence of religion in...","Recall the role of Christianity in t...","Define Cartesian anxiety","Describe the ideas of Orientalism, paternalism and communalism","Discuss the emergence of religion in human evolution","Recall the role of Christianity in the ecological crisis","Indicate conservation ethics in Buddhism","Explain the views of Hinduism in nature conservation","Recall environmental philosophies","Explain the concept of deep ecology, social ecology and ecofeminism","Outline the difference between indigenous knowledge and scientific knowledge","Identify how indigenous knowledge is passed on","Analyze the impact of indigenous knowledge on development projects","Summarize the work entitled, 'An Ecological Journey"],"courseDescription":"<p>Many ecologists, anthropologists and philosophers agree that the solution to contemporary environmental and ecological problems does not lie in government legislation but in educating humanity and changing the way we think about and see Nature. You will start by learning how ‘dualism’ - or the idea that nature and society are separate from each other - started during the European Renaissance when a systematic fragmentation of the medieval world took place, and the whole western attitude towards the environment, knowledge, and learning was transformed. As you learn about these changes you will be introduced to the term ‘Cartesian anxiety’, in a place that became obsessed with understanding the world by modern scientific means. Next, you will study three different paradigms of human-environmental relations. The first paradigm is ‘Orientalism’, which expresses the idea that humans are the masters of Nature, and therefore Nature needs to be conquered, and which was prevalent during colonialism. Next is the paradigm of ‘paternalism’, which argues that nature needs to be protected. Finally, you will learn about the paradigm of ‘communalism', which brings nature and society back together.</p><p>Go on to understand more about religion from anthropologist Roy Rappaport and sociologist Emile Durkheim. One of the theories proposed by Rappaport is that religion is central to the continuing evolution of life and that one possible answer to the world’s crisis would be a religion founded on post-modern science grounded in ecology, rather than astronomy. After this, you will learn about the relationship that religious beliefs have had with nature over the centuries. Study the thinking of historian Lynn White, as he argues that Christianity and its belief that God commanded man to master the Earth, are partly to blame for the western attitude of mankind’s dominion over nature.</p><p>The next section of this free online course is about Asian religions, as you study how the Buddha saw nature and how he commanded his followers to respect the environment. You will read about ancient Hindu writings regarding sacred groves and respect for flora. Afterwards, you will learn about ecological ethics as you study three philosophical views of nature. The first is ‘deep ecology’, which describes intense ecological awareness. The second is ‘social ecology’, which claims that the environmental crisis is a result of the hierarchical organization of power and the authoritarian mentality rooted in the structures of our society. Thirdly, there is ‘ecofeminism’, which sees the oppression of women and the destruction of nature as one and the same. Finally, you will learn about traditional indigenous knowledge or the practical knowhow and wisdom native communities have accumulated over generations of interaction with their natural surroundings and how this knowledge can be used alongside scientific research to sustainably manage our natural resources. This course is ideal for those who are not only passionate about nature and want to make a difference but who also want to have a solid understanding of the religious and philosophical beliefs behind modern ecological theory.</p><a href=\"https://alison.com/resume/courses/2789\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2789\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Human Environmental Relations","description":"This module will consider how society's view of nature started to change as humans began to give more importance to scientific knowledge during the Renaissance Era. It will also consider three paradigms of Human Environmental Relations, that of Orientalism, Paternalism, and Communalism.","topics":["Human Environmental Relations - Learning Outcomes","Introduction to Human Environmental Relations","Orientalism","Paternalism","Communalism","Human Environmental Relations - Lesson Summary"]},{"name":"Module","details":"Nature and Religion","description":"This module will discuss the role religion plays in human interaction with its environment and how anthropologists understand this relationship. It will also discuss the role rituals play in environmental relations.","topics":["Nature and Religion - Learning Outcomes","Epistemology","Religion and Ecology","Rituals and Environmental Relations","Nature and Religion - Lesson Summary"]},{"name":"Module","details":"The Ecological Crisis and Religion","description":"This module will discuss what factors led to the Ecological Crisis we face today and the role that religion played. It will also discuss the views of Buddhism and Hinduism on Nature and how religion can play a role in helping us face the Ecological Crisis today.","topics":["The Ecological Crisis and Religion - Learning Outcomes","Religious Heritage and the Environment","The Role of Christianity","Buddhism and Conservation Ethics","Conservationism and Hinduism","The Ecological Crisis: A Common Responsibility","The Ecological Crisis and Religion - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of Modules 1 to 3 of the following course: • Diploma in Ecology and Human Interaction with Nature.","topics":["First Assessment"]},{"name":"Module","details":"Environmental Ethics","description":"This module will discuss three different philosophies of Environmental Ethics, that of Deep Ecology, Social Ecology, and Ecofeminism. Environmental Ethics is a discipline in philosophy that studies the moral relationship of human beings to, and also the value and moral status of, the environment and its non-human contents.","topics":["Environmental Ethics - Learning Outcomes","Introduction to Environmental Ethics","Deep Ecology","Social Ecology","Ecological Feminist Philosophy","Environmental Ethics - Lesson Summary"]},{"name":"Module","details":"Traditional Ecological Knowledge","description":"This module will discuss how Indigenous Traditional Knowledge has been acquired and passed on through generations and how this Indigenous Knowledge can be merged with Scientific Knowledge in sustainably managing our natural resources.","topics":["Traditional Ecological Knowledge - Learning Outcomes","Traditional Ecological Knowledge","An Ecological Journey","Traditional Ecological Knowledge - Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of Modules 4 to 5 of the following course: • Diploma in Ecology and Human Interaction with Nature.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}