{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2797","title":"Diploma in Text, Textuality and Digital Media","totalEnrolled":"1,106","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the evolution of communication from oral and written forms to digital media in this free online diploma course.","description":"This diploma course establishes the great influence of communication media on human history and examines its continued social impact. We take you through the development of different forms of communication and trace their impact on societies, from early oral and written traditions to the invention of printing and electronic communication and finally digital media. We also show you how the Digital Age is changing the way we live and think.","courseOutcomes":["Discuss the evolution of communicati...","Describe the evolution of human comm...","Explain the characteristics of oral ...","Establish how the discovery of alpha...","Discuss the evolution of communication technology","Describe the evolution of human communication from speech, language, symbols, alphabets and finally words","Explain the characteristics of oral and manuscript cultures","Establish how the discovery of alphabets boosted literacy","Outline the impact of oral forms on the development of manuscripts","Appreciate the influence of textual culture on printing technology","Explain how the transition from feudalism to capitalism led to urbanization","Discuss how print has influenced exploration, science and politics","Define ‘word processing’ and ‘digital space’","Highlight how print brought about the standardization of languages","Outline the emergence of electronic literature","Discuss the evolution of communicati...","Describe the evolution of human comm...","Explain the characteristics of oral ...","Establish how the discovery of alpha...","Discuss the evolution of communication technology","Describe the evolution of human communication from speech, language, symbols, alphabets and finally words","Explain the characteristics of oral and manuscript cultures","Establish how the discovery of alphabets boosted literacy","Outline the impact of oral forms on the development of manuscripts","Appreciate the influence of textual culture on printing technology","Explain how the transition from feudalism to capitalism led to urbanization","Discuss how print has influenced exploration, science and politics","Define ‘word processing’ and ‘digital space’","Highlight how print brought about the standardization of languages","Outline the emergence of electronic literature"],"courseDescription":"<p>This diploma course takes you through the history of human communications and explains how it has influenced the development of society. We begin by going through various oral forms of communication to show you how they led to written forms. These later developed into manuscripts, which represent a major focus of this course. We carefully trace the shift from oral to literary traditions and explore its far-reaching impact on human communication, society and thought.</p><p>The course goes on to cover the development of written communication and compares the characteristics of oral and written forms. We discuss the evolution of alphabets, writing and printing across the world. We study the development of printing technology and explain its role in the transition from feudalism to capitalism. The course explains how improvements in technology have driven the processing and distribution of text and links those changes to shifting historical European developments. We also investigate Marshall McLuhan’s famous dictum that ‘the medium is the message’.</p><p>The course then delves into the influence of print on exploration and colonialism and explains how it drove the scientific and technological advancement of Europe. We analyze the changes in perception caused by the emergence of digital media and cover word processing, digital spaces and the effects of print media and hypertext support systems. This diploma course is important for anyone who wants to understand the history of the media and provides important skills for those seeking to enter the field of communications and media.</p><a href=\"https://alison.com/resume/courses/2797\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2797\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Medium and The Message","description":"In this module, you will see how the mode of communication affects the message we are trying to send. Features of communication cultures are highlighted in this course. You will be shown the evolution of oral to manuscript culture in this particular module. You will also learn about how technology has influenced early writing cultures.","topics":["The Medium and The Message - Learning Outcomes","Introduction to the Course","Marshall McLuhan: Medium is the Message","Marshall McLuhan: The Gutenberg Galaxy","The Medium and The Message - Lesson Summary"]},{"name":"Module","details":"Orality and Literacy","description":"In this module, you will learn about the effect of the shift from the oral domain to the literary domain and its far-reaching effect on human communication, society, and the human mind. You will be shown the development of written cultures. You will further learn about the characteristics of oral and written forms and how alphabets, writing and printing developed.","topics":["Orality and Literacy - Learning Outcomes","Oral Domain","Written Domain","Orality and Literacy - Lesson Summary"]},{"name":"Module","details":"Storytelling and The Manuscript","description":"In this module, you will learn about oral forms of communication, how they are applied by using storytelling and how they influenced early manuscript forms. You will be shown the traditions of Dastangoi which will include the elements and features of the oral form. You will also learn about manuscripts, their production and then about bookmaking in medieval Europe.","topics":["Story Telling and The Manuscript - Learning Outcome","Dastangoi: History","Dastangoi: Chouboli","Manuscript Culture: Europe","Story Telling and The Manuscript - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"This assessment is meant to test your understanding of the modules you have learned so far. You need to score 80% or more to pass.","topics":["Diploma in Text, Textuality and Digital Media - First Assessment"]},{"name":"Module","details":"Writing and Printing Technology","description":"In this module, you will be introduced to the techniques and materials that were used for writing. You will be shown the development of printing technology and the comparison between feudalism and capitalism. You will be taught how technology has affected the history of text processing and its distribution. You will also learn how development in Europe influenced text and the effect of the medium on messages.","topics":["Writing and Printing Technology - Learning Outcomes","Manuscript Culture: India","Feudalism to Capitalism","Febvre and Martin: The Discovery of Printing & The Chinese Precedent","Writing and Printing Technology - Lesson Summary"]},{"name":"Module","details":"Print and The Renaissance","description":"In this module, you will learn about the effect the emergence of print had on Europe socially and politically from the 15th to 17th century. You will be shown the motivation for printing and the concept of John Dryden's verse mock-heroic satire 'MacFlecknoe' on print. The influence of print on exploration and colonialism will be explained and how print also aided the scientific and technological advancement of Europe.","topics":["Print and The Renaissance - Learning Outcomes","Gutenberg and Revolution: 15th Century","Consequences of Print: 16th - 17th Century","John Dryden: MacFlecknoe","Print and The Renaissance - Lesson Summary"]},{"name":"Module","details":"Entrance to Digital Media","description":"In this module, you will be introduced to the changes in the perception of text with the coming of digital media. You will be taught about word processing and the digital space, the effect of prints on the oral universe and hypertext support systems. Also, the emergence of electronic literature and its characteristics will be covered in this module. Furthermore, you will be shown some examples of early electronic literature.","topics":["Entrance to Digital Media - Learning Outcomes","Jay David Bolter: Seeing and Writing","Robert Coover: The End of Books","N. Katherine Hayles: Electronic Literature","Entrance to Digital Media - Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"This assessment is meant to test your understanding of the modules you have learned so far. You need to score 80% or more to pass.","topics":["Diploma in Text, Textuality and Digital Media - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Text, Textuality and Digital Media Course Assessment"]}]}