{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4007","title":"Diploma in High School Algebra II","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A comprehensive course that explains the major aspects of trig, stats, probabilities and other parts of basic algebra.","description":"This free online course is especially useful for students taking the Regents Exam in Algebra II (Common Core). It lays out a modern approach for understanding the principles and techniques of algebra, particularly solving equations, and working with functions and sequences. You will also learn about trigonometric functions, probability as sell as statistical analysis.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, you will learn about the definition, properties and application of real numbers as well as the properties of positive integral exponents. Study the various types of quotients and the laws of the power of quotients. You will be taught how to solve fractional equations and the application of synthetic division in performing long division. Master how to perform operations on complex numbers in addition to the various ways of factoring a monomial or polynomial. The concept of the perfect square trinomial will also be discussed. Explore the methods and criteria for solving equations in addition to graphing linear equations. Learn about the solutions to systems of two equations in two variables, systems of linear equations in three variables, and linear inequalities. By completing this course, you will acquire knowledge of the general form, graphical representation, and methods of solving quadratic equations. Study the techniques for determining quadratic-linear systems of equations and quadratic inequalities. Learn about the discriminant and various nature of roots. The general form of the equation of a parabola and the procedures involved in the graphing of a circle are covered. Then discuss the variations, simplification, and basic operations of rational expressions.</p><p>Do you want a proper understanding of the concepts of relations and functions? Then this course is for you. Learn about special and quadratic functions. Study the composition of functions, as well as their graphical and multiple transformations. You will learn about the methods used to solve exponential functions along with the graphing of logarithms. You will be taught the manipulation of logarithmic expressions and the applications of exponents. Study the concept of polynomial functions as well as the procedure for finding zeros and end behaviours of a polynomial function. Learn about the derivative of ln x along with the derivative of the log of x. Learners will gain an understanding of the methods of graphing and finding the equation of a polynomial function. Discuss the definition of a rational function and types of asymptotes, along with how to determine the x- and y- intercepts of the graph of rational functions. You will study the methods used for graphing any function without the aid of a calculator and solving real-world problems using rational functions. Get to grips with the methods for solving polynomial inequalities and division, and theorems for finding the roots of polynomial equations. Learn about the rational root theorem, the algebraic solution to polynomial equations, and the intermediate value theorem. You will be taught the pattern of sequences and series as defined by various formulas as well as the different types of sequences and series.</p><p>Lastly, the methods for proving similar triangles and basic trigonometric ratios of right triangles will be broken down. See how to identify the rules for side lengths in special triangles. Study the terminologies, quadrants, and classification of angles. This course analyzes the three main and reciprocal trigonometric functions. You will be taught the trigonometric ratios of any angle, graphs of trigonometric functions, and trigonometric identities and equations. You will also learn about probability using Venn diagrams along with the types and methods of evaluating probabilities. Taking this course will boost your knowledge of the principles of probability, the probability of events and the application of Bernoulli's experiments. You will study statistics from the measures of central tendency and modes of displaying data. Study how to work with histograms and measures of dispersion. Learn about normal distribution, the bell curve, percentiles, quartiles and median. This course will greatly benefit anyone who wants to master or recap major parts of high-school algebra. Register for this course today and start your next learning journey in mathematics!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}