{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1450","title":"Diploma in General Science","totalEnrolled":"16,980","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the main principles and concepts of biology, physics, and chemistry, with this free general science course.","description":"Alison's free online Diploma in General Science course will give you a strong overview of the three classical fields of biology, chemistry, and physics. Science is one of the oldest and most important academic disciplines in the world. Everything we know about the world around us, from the atoms to the universe itself, are the results of the study of science. This course will guide you through the main aspects of this incredible subject.","courseOutcomes":["Describe living organisms and how to...","Describe the important concepts behi...","Explain principles of plant biology ...","Describe the theory of evolution...","Describe living organisms and how to characterise them","Describe the important concepts behind cell theory","Explain principles of plant biology such as photosynthesis and plant hormones","Describe the theory of evolution","Explain concepts in genetics such as mitosis, and meiosis","Describe practical applications of gene technology","Describe concepts related to electric systems, magnetism and sound","Explain important aspects of motion and gravity","Describe the periodic table and the structure of atoms","Explain the different states of matter: gases, liquids, and solids","Describe important concepts in organic and analytic chemistry","Describe living organisms and how to...","Describe the important concepts behi...","Explain principles of plant biology ...","Describe the theory of evolution...","Describe living organisms and how to characterise them","Describe the important concepts behind cell theory","Explain principles of plant biology such as photosynthesis and plant hormones","Describe the theory of evolution","Explain concepts in genetics such as mitosis, and meiosis","Describe practical applications of gene technology","Describe concepts related to electric systems, magnetism and sound","Explain important aspects of motion and gravity","Describe the periodic table and the structure of atoms","Explain the different states of matter: gases, liquids, and solids","Describe important concepts in organic and analytic chemistry"],"courseDescription":"<p>This free online science course starts off with living things. You will study the five different kingdoms of living things, look into plant and animal cells, and the study the six major group of nutrients. The course will then discuss cell theory including the types of cells, cellular respiration, enzymes, and cell membranes. You will study plant biology including photosynthesis, diseases such as fungi and worms, and plant hormones. The course will also discuss evolution, mitosis, meiosis, and genetics as well as gene technology.<br><br>You will then study electronics, electronic systems, magnets, sounds, and transformers. The course will guide you through the study of motion, electric fields, spectra, energy transfers, force, acceleration, gravity, Newton's law, projectiles, and light. You will then look into basic chemistry and the periodic table, as well as how each atom combines to form elements on the periodic table. You will also study the different states of matter and learn about organic and analytic chemistry, elements, electrons, nuclear fusion and fission, energy conversions, electrochemistry, and food chemistry.<br><br>Proficiency in science is a skill that opens up exciting and high-paying jobs and careers around the world. All of this starts with an understanding of the basics. This Diploma in General Science online course will start you on your journey towards understanding the incredible world around you through science. By the end of the course, you will have increased your knowledge set, learned something really interesting, and possibly kickstarted a great career.</p><a href=\"https://alison.com/resume/courses/1450\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1450\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Organisms, Nutrients and Digestion","description":"This module teaches you about living things and how to characterise living things into five different kingdoms. You will also learn about plant cells and animal cells and the six major group of nutrients.","topics":["Organisms, Nutrients and Digestion - Learning Outcomes","Cells and Other Living Things","Plant Cells","Growth and Reproduction","The Five Kingdoms","Food and Types of Nutrients","The Digestive System","Organisms, Nutrients and Digestion - Lesson Summary"]},{"name":"Module","details":"Cell Theory","description":"This module teaches you about cell theory including types of cells, cellular respiration, enzymes, and passage through cell membranes.","topics":["Cell Theory - Learning Outcomes","Cell Principles","Enzymes and Membranes","Regulation of Body Temperature in Animals","Responses to Environmental Effects","Cell Theory - Lesson Summary"]},{"name":"Module","details":"Plant Biology","description":"This module teaches you about plant biology including photosynthesis, diseases such as fungi and worms, and plant hormones.","topics":["Plant Biology - Learning Outcomes","Photosynthesis","Disease","Transmission of Pathogens and Parasites in Animals and Plants","Plant Hormones","Plant Biology - Lesson Summary"]},{"name":"Module","details":"Cell Theory, Metabolism & Plant Biology Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in General Science - Cell Theory, Metabolism, and Plant Biology Assessment"]},{"name":"Module","details":"Evolution","description":"In this module, you will learn about evolution and the evidence for evolution. You will also learn about natural selection and relative dating.","topics":["Evolution - Learning Outcomes","Natural Selection and Evolution","Human Evolution","Patterns of Evolution","Evolution - Lesson Summary"]},{"name":"Module","details":"Mitosis, Meiosis, and Genetics","description":"This module teaches you about mitosis, meiosis and genetics, including pedigrees, inheritance, Mendel's theory, and mutations that can occur.","topics":["Mitosis, Meiosis, and Genetics - Learning Outcomes","Mitosis and Meiosis","Genetics","Inheritance","Chromosomes and Mutations","Mitosis, Meiosis, and Genetics - Lesson Summary"]},{"name":"Module","details":"Gene Technology","description":"In this module, you will learn about gene technology including the implications of gene technology, DNA science, and gene expression. You will also learn about gene mapping and how to calculate the map distance of genes.","topics":["Gene Technology - Learning Outcomes","DNA Science and Gene Technology","Implications of Gene Technology","Gene Technology - Lesson Summary"]},{"name":"Module","details":"Evolution and Genetics Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in General Science - Evolution and Genetics Assessment"]},{"name":"Module","details":"Electric Systems, Magnetism and Sound","description":"In this module, you will be introduced to electronics, electronic systems, magnets, sounds and transformers, and much more. It provides a comprehensive grounding in Physics and is ideal as a complement to regular classes, a study or revision aid, or as a resource for someone pursuing an interest in basic science.","topics":["Electric Systems, Magnetism and Sound - Learning Outcomes","Introduction to Electric Systems","Electric Systems and Circuits","Capacitors and AC to DC Conversion","Tranducers","Magnets and Magnetism","Exploring Sound","Sound Standing Waves","Intensity of Sound","Electric Systems, Magnetism and Sound - Lesson Summary"]},{"name":"Module","details":"Motion and Gravity","description":"In this module, you will be introduced to motion, electric fields, spectra, energy transfers, force, acceleration, gravity Newton laws, projectiles, and light. Also, this module can serve as an additional resource material in regular classes, study and revision aid, and resource for someone with an interest in basic science.","topics":["Motion and Gravity - Learning Outcomes","Motion Normal Reaction","Motion Constant and Vertical Circular Motion","Motion Momentum and Impulse","Introduction to Gravity","Structures and Materials","The Wave-Like Nature of Light","Emission and Absorption Spectra","Motion and Gravity - Lesson Summary"]},{"name":"Module","details":"Physics Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in General Science - Physics Assessment"]},{"name":"Module","details":"Basic Chemistry","description":"This module teaches you about the periodic table and how each atom combines to form elements on the periodic table. You will also learn about the different states of matter; gases, liquids, and solids and also how these states of matter can be changed from one form to the other.","topics":["Basic Chemistry - Learning Outcomes","The Periodic Table","Molecules, Atoms and Elements","Chemical Bonds and Reactions","Atoms and Molecules - Summary","Ions, Particles and Mixtures","Acids, Bases, pH Scale and Acid-Base Indicators","Types of Separation Techniques","Basic Chemistry - Lesson Summary"]},{"name":"Module","details":"Organic and Analytic Chemistry","description":"In this module, you will be introduced to an in-depth exploration of general, organic and analytic chemistry. It examines various topics such as chemical equilibrium, types of reactions, rates of reaction, chromatography and their applications in real-world industries.","topics":["Organic and Analytic Chemistry - Learning Outcomes","The MOLE Concept","Volumetric Analysis","Analysis by Chemical Reaction","Analytical Chemistry","Equilibrium","Chemical Equilibrium","Equilibrium in Living Systems","Dissociation Constants of Weak Acids","Functional Groups and Homologous Series 1","Functional Groups and Homologous Series 2","Le Chatelier's Principle","Precipitation Reactions","Preparation of Ethanoic Acid from Ethane","Rate of Reaction","Reaction between Ethanol and Ethanoic Acid to form the Ester","Redox Reactions","Structural Isomers","Water Kw and the Use of the pH Scale","Sulfuric Acid","Gravimetric Analysis","Spectroscopic Techniques","Chromatography","Industrial Chemistry","Organic and Analytic Chemistry - Lesson Summary"]},{"name":"Module","details":"Advanced Chemistry","description":"In this module, you will be introduced to elements, the history of the atomic theory, electrons, nuclear fusion and fission, energy conversions, electrochemistry and food chemistry among other topics.","topics":["Advanced Chemistry - Learning Outcomes","The Origin of the Elements","The History and Development of the Atomic Theory","Electrochemistry","Aqueous Solution or Molten Salt - the Production of Aluminium","Production of Chlorine and Sodium Hydroxide - The Chloralkali Industry","Energy Conversions","Digestion","Food Chemistry","Advanced Chemistry - Lesson Summary"]},{"name":"Module","details":"Chemistry Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in General Science - Chemistry Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in General Science - Final Course Assessment"]}]}