{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1691","title":"Diploma in Media Studies","totalEnrolled":"11,085","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Take a closer look at how modern media has evolved and how it influences society and culture, with this free course.","description":"This free online media studies course teaches you about the development of modern media, the trends and issues which affect important types of media, and the history and cultural impact of books, newspapers, magazines, radio, movies, TV, and the Internet. If you are someone with an interest in how different types of media have evolved, or how modern media affects today's culture, then this course is a great resource.","courseOutcomes":["Describe media literacy and discuss ...","Summarize the different ways mass me...","Trace the material and cultural orig...","Explain the significance and cultura...","Describe media literacy and discuss its relevance in today’s world","Summarize the different ways mass media affects culture","Trace the material and cultural origins of printed books","Explain the significance and cultural impact of modern journalism","Discuss trends in magazine journalism that emerged in the 20th and 21st centuries","Assess the impact of technologies that have changed the face of the music industry.","Explain the use of formats in the development of modern radio stations","Summarize key developments and technology in the motion picture industry","Outline the ways in which television affects the development of a culture","Describe media literacy and discuss ...","Summarize the different ways mass me...","Trace the material and cultural orig...","Explain the significance and cultura...","Describe media literacy and discuss its relevance in today’s world","Summarize the different ways mass media affects culture","Trace the material and cultural origins of printed books","Explain the significance and cultural impact of modern journalism","Discuss trends in magazine journalism that emerged in the 20th and 21st centuries","Assess the impact of technologies that have changed the face of the music industry.","Explain the use of formats in the development of modern radio stations","Summarize key developments and technology in the motion picture industry","Outline the ways in which television affects the development of a culture"],"courseDescription":"<p>This course begins by reviewing the evolution of media and its impact on culture. You will learn about media theories and controversies and then look into the main factors which influence books, newspapers, and magazines, and learn how these types of media impact modern cultures. You will also study the impact modern media - such as the Internet, electronic games and entertainment, and social media - has had on society.</p><p>The course then looks at the history of music, the different factors which have influenced music, and music's impact upon culture. You will also look into the challenges which face today's music industry. The course will also discuss the history of radio broadcasting, movies, and television including the influence modern technology has had on these types of media. You will then look at their impact on society and culture, and the different factors which affect them in turn.</p><p><br>The evolution of the Internet and globalization has made a big impact on culture and communication, and you will look at their impact on society and culture, and the different factors which affect them in turn.</p><p>If you’re interested in media studies as a future career, or if you’re a media professional seeking to improve your knowledge, then this course is the one for you. Understanding the role of the media in today's world and it how influences culture and society is essential for any aspiring media professional. Start this course today, and by the end of the week, you’ll have gained valuable new knowledge.</p><a href=\"https://alison.com/resume/courses/1691\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1691\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Media and Culture","description":"In this module you will learn about Media and Culture and it covers topics such as Media: History and Development; Cultural Movements; Evaluating Media; Open and Closed Content. Note: each module in this course contains learning outcomes and lesson (module) summary topics, i.e. the first and last topic of every module.","topics":["Media and Culture - Learning Outcomes","Media and Culture","Media: History & Development","Cultural Movements","Evaluating Media","Open and Closed Content","Media and Culture - Lesson Summary"]},{"name":"Module","details":"Media Research and Analysis","description":"In this module you will learn about Media Research and Analysis and it covers topics such as Information and New Media; Media Effects Theories; Media Research Analysis.","topics":["Media Research and Analysis - Learning Outcomes","Information and New Media","Media Effects Theories","Media Research Analysis","Media Research and Analysis - Lesson Summary"]},{"name":"Module","details":"The World of Books","description":"In this module you will learn about the World of Books and it covers topics such as Reading and Early Books; The Book Industry; Popular Literature; Book Formats and Releases; Book Sales; Publishing Online.","topics":["The World of Books - Learning Outcomes","Reading and Early Books","The Book Industry","Popular Literature","Book Formats and Releases","Book Sales","Publishing Online","The World of Books - Lesson Summary"]},{"name":"Module","details":"Journalism - Print and Online","description":"In this module you will learn about Journalism - Print and Online and it covers topics such as History of Newspapers; Journalistic Styles; Journalistic Standards; Newspapers and Readership; Journalism Online.","topics":["Journalism: Print and Online - Learning Outcomes","History of Newspapers","Journalistic Styles","Journalistic Standards","Newspapers and Readership","Journalism Online","Journalism: Print and Online - Lesson Summary"]},{"name":"Module","details":"Magazines","description":"In this module you will learn about Magazines and it covers topics such as History of Magazines; Magazine Culture and Advertising; Magazine Titles; Magazine Content; Specialist Magazines; Magazines: Print and Online.","topics":["Magazines - Learning Outcomes","History of Magazines","Magazine Culture and Advertising","Magazine Titles","Magazine Content","Specialist Magazines","Magazines: Print and Online","Magazines - Lesson Summary"]},{"name":"Module","details":"Diploma in Media Studies - First Assessment","description":"This assessment will test your knowledge of Modules 1 - 5 from the following course: Diploma in Media Studies. You must score 80% or more to pass. You can re-take this assessment, until a successful outcome is achieved.","topics":["Diploma in Media Studies - First Assessment"]},{"name":"Module","details":"The World of Music","description":"In this module you will learn about the World of Music and it covers topics such as History of Popular Music; Music Technology and Genres; Music and Culture; Music Labels; Music Online.","topics":["The World of Music - Learning Outcomes","History of Popular Music","Music Technology and Genres","Music and Culture","Music Labels","Music Online","The World of Music - Lesson Summary"]},{"name":"Module","details":"The World of Radio","description":"In this module you will learn about the World of Radio and it covers topics such as Radio History and Technology; Radio Content and Regulation; Radio Formats; Radio and Consumer Culture; New Radio Technology.","topics":["The World of Radio - Learning Outcomes","Radio History and Technology","Radio Content and Regulation","Radio Formats","Radio and Consumer Culture","New Radio Technology","The World of Radio - Lesson Summary"]},{"name":"Module","details":"The World of Film","description":"In this module you will learn about the World of Film and it covers topics such as History of Cinema; Developments in Cinema; Cinema and Culture; Film: Investment and Return; Digital Film Technology.","topics":["The World of Film - Learning Outcomes","History of Cinema","Developments in Cinema","Cinema and Culture","Film: Investment and Return","Digital Film Technology","The World of Film - Lesson Summary"]},{"name":"Module","details":"The World of Television","description":"In this module you will learn about the World of Television and it covers topics such as Television Technology; Television Programming; Television Networks and Sponsors; Digital and Satellite TV.","topics":["The World of Television - Learning Outcomes","Television Technology","Television Programming","Television Networks and Sponsors","Digital and Satellite TV","The World of Television - Lesson Summary"]},{"name":"Module","details":"The World of Computer Games","description":"In this module you will learn about Computer Games and it covers topics such as Early History; Computer Game Development; Innovations in Computer Games; Computer Games and Culture; Computer Games: Controversial Issues; Social and Educational Games.","topics":["The World of Computer Games - Learning Outcomes","Computer Games: Early History","Video Game Development","Innovations in Computer Games","Computer Games and Culture","Video Games: Controversial Issues","Social and Educational Games","The World of Computer Games - Lesson Summary"]},{"name":"Module","details":"The World of the Internet","description":"In this module you will learn about Internet Standards and Protocols; Social Media and Web 2.0; Social Media Applications; Internet Access.","topics":["The World of the Internet - Learning Outcomes","Internet Standards and Protocols","Social Media and Web 2.0","Social Media Applications","The World of the Internet - Lesson Summary","Internet Access"]},{"name":"Module","details":"Diploma in Media Studies - Second Assessment","description":"This assessment will test your knowledge of Modules 7 - 12 from the following course: Diploma in Media Studies - Revised. You can re-take this assessment, until a successful outcome is achieved.","topics":["Diploma in Media Studies - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Media Studies - End of Course Assessment"]}]}