{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3447","title":"Diploma in Trigonometry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course covers the applications of trigonometry, as well as the six trigonometric functions and their inverses.","description":"This online course helps you master trigonometry, the branch of math used to find the length of a triangle and its angles. Knowing six trig functions, their properties and the inverses of their functions is a valuable skill when working in trigonometry. This diploma course lets you explore trig identities, methods for solving equations, and examples of applications in physics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This trigonometry course has been specifically prepared to teach you about the concept of trig and how it can be applied in various calculations. First of all, you will learn about different types of triangles and the properties of right-angled triangles, as well as the various methods used to prove that two triangles as similar, will be covered. Then, you will explore how SOH CAH TOA is applied to right triangles to find missing angle measures and side lengths. Different angles can be classified and it is important that you know how to draw them in standard position on the Cartesian plane. Identifying in which quadrant the terminal side of the angle lies is also essential. You will need to know how to determine which angles are quadrantal, and which pairs of angles are coterminal. You will see how angles can be measured in terms of degrees and radians, as well as their conversion.</p><p>Next, this course examines the unit circle and focuses on how it is used to define the six trig functions. You will learn how to compute the values for any angle measured in standard position. You will gain vital knowledge on how to calculate arc lengths and the areas of sectors and segments in circles. See how to distinguish between identities and trig equations. On completion of this course, you will learn how to prove identities and use them to solve these trig equations with examples. The Law of Sines and the Law of Cosines will be explained. Using them, you will also be able to identify the number of triangles that can be formed given specific measurements. The primary application of trigonometry is found in scientific studies where precise distances need to be measured.</p><p>Finally, the material teached you how the graphs for the six trig functions are drawn. The properties of the functions are domain, range, periodicity, frequency, symmetry, amplitude, and asymptotes. Using a basic graph, you will understand how transformations affect the graphs as a variety of new equations are defined. You will also generate the graphs of the inverse trig functions and identify their properties, and compare the Cartesian coordinate system to the polar coordinate system. By the end, you will be able to convert ordered pairs and equations from one format to the other. Given equations in polar form, you will examine how to recognize and draw graphs for a variety of curves. This free trig course will be useful to anyone studying higher-level math or those who need a refresher for jobs where trigonometry is used. So, register now and start your next learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}