{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3233","title":"Diploma in Early Poetry Reading and Writing","totalEnrolled":"2,181","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Meet era-defining writers as we explore the form and function of early English poetry in this free online course.","description":"This free online course teaches you the fundamentals of English verse written during the Elizabethan, Romantic and Victorian periods in England and Britain. We take you through the early development of prominent poets and explain the different forms and functions of their work. This course also demonstrates the relevance of poetry in everyday life and its impact on culture and society, whether you’re inspired by song lyrics or more formal verse.","courseOutcomes":["Discuss the relevance of poetry...","Describe different views on the valu...","Explain poetic devices and their use...","Outline different functions of poetr...","Discuss the relevance of poetry","Describe different views on the value of poetry","Explain poetic devices and their use","Outline different functions of poetry","Identify the various poetic forms used during the Elizabethan era","Summarize the influence of various Elizabethan poets","Define the ‘Romantic’ movement","Describe the forms and functions of poetry during the Romantic period","Explain the context of the Victorian era","Lay out the creative theories cited by various poets","Discuss the focus of poetry in the Victorian era","Discuss the relevance of poetry...","Describe different views on the valu...","Explain poetic devices and their use...","Outline different functions of poetr...","Discuss the relevance of poetry","Describe different views on the value of poetry","Explain poetic devices and their use","Outline different functions of poetry","Identify the various poetic forms used during the Elizabethan era","Summarize the influence of various Elizabethan poets","Define the ‘Romantic’ movement","Describe the forms and functions of poetry during the Romantic period","Explain the context of the Victorian era","Lay out the creative theories cited by various poets","Discuss the focus of poetry in the Victorian era"],"courseDescription":"<p>Poetry is an expression of words that unblocks the mind and allows it to move beyond language’s usual conventions. This course escorts you through the verse of the Elizabethan, Romantic and Victorian Eras in England and then Britain. We also demonstrate the ongoing relevance of poetry as a mode of higher expression that moves us to thought and action. This course combines close reading of specific poems with analysis of their context to help you appreciate its changing forms and functions. Understanding these elements is essential for understanding poetry as a whole so we unpack poetic devices like rhyme and rhythm.</p><p>We unlock some of the Elizabethan era’s secrets as we examine its poetic forms and themes, focussing on sonnets and their authors, like the renowned William Shakespeare. The course then moves on to the Romantic period and its distinctive lyrical ballads. We investigate the themes and devices favoured by writers like William Wordsworth and Samuel Coleridge to make clear how their famously passionate poetry spoke to its time.</p><p>Lastly, we explore Victorian verse, in particular the dramatic monologue. We begin with Robert Browning, who is considered the master of this poetic form, and his wife the influential Elizabeth. The course wraps up with more attention to other prominent nineteen century poets and offers intellectual tools to anyone interested in poetry or language in general. Do you appreciate the beauty of the written word that expresses itself in a rhythmic form? Do you relish emotive language and like the intensity created by poetry? Then this course is for you as it offers insight into the words of the past while handing you the important skill of decoding text for meaning.</p><a href=\"https://alison.com/resume/courses/3233\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3233\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Poetry","description":"In this module, Introduction to Poetry, you will learn about aspects surrounding the relevance of poetry. You will also learn about the functions and forms of poetry, poetic devices, and poetry music.","topics":["Introduction to Poetry - Learning Outcomes","The Relevance of Poetry","Forms and Functions of Poetry","The Music of Poetry","Geoffrey Chaucer","Introduction to Poetry - Lesson Summary"]},{"name":"Module","details":"Poetry in the Elizabethan Era","description":"In this module, you will learn about poetry in the Elizabethan Era. The module introduces you to prominent poets of this time period and critically analyses their work.","topics":["Poetry in the Elizabethan Era - Learning Outcomes","Elizabethan Poets","Elizabethan Poets (1552 - 1631)","William Shakespeare","Poetry in the Elizabethan Era - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"","topics":["First Assessment"]},{"name":"Module","details":"Poetry in the Romantic Period","description":"In this module, Poetry in the Romantic Period, you will learn about the forms poetry took on during this era. You will also learn about the important and influential poets of this time.","topics":["Poetry in the Romantic Period - Learning Outcomes","Introduction to Romantic Poetry","William Wordsworth","Other Romantic Poets","Poetry in the Romantic Period - Lesson Summary"]},{"name":"Module","details":"Poetry in the Victorian Era","description":"In this module, you will learn about the different forms and functions that poetry took on during this time. You will also learn about the movements that rose out of this era and the influential poets of this period.","topics":["Poetry in the Victorian Era - Learning Outcomes","Introduction to Victorian Poetry","The Browning’s","Other Victorian Poets","Poetry in the Victorian Era - Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Early Poetry Reading and Writing - Course Assessment"]}]}