{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3277","title":"Diploma in Maritime Watchkeeping and Rules of the Road","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the COLREGs and principles of maritime watchkeeping under varying conditions in this free online course.","description":"This in-depth course on maritime watchkeeping and rules of the road guides you through the Convention on the International Regulations for Preventing Collisions at Sea, 1972 (COLREGs). The aim of the collision regulations is to establish rules to avoid collisions and improve safety at sea. By the end of this course, you will become familiar with the safety principles being employed by mariners for the safe navigation of vessels at sea.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>How do ships avoid collisions at sea? The Convention on the International Regulations for Preventing Collisions at Sea, 1972 (COLREGs) has 41 rules and 6 sections that govern the standards - all of which are covered in detail in this highly specialised maritime safety course. It begins with explaining the annexes containing technical requirements concerning lights, shapes and their positioning. You will be taken through sound signalling appliances, additional signals for fishing vessels and international distress signals. You will also get to study how to verify compliance with the provisions of the Convention. Moreover, it is also necessary for the Officer of the Watch (OOW), a desk officer assigned with the duties of watchkeeping on a ship’s bridge, to understand the International Maritime Organizations (IMO’s) guidelines and recommendations for keeping a safe navigational watch. This course therefore provides the learners with an in-depth knowledge of the COLREGs together with the principles to be adopted at sea for a safe navigational watch as per IMO’s recommendations.</p><p>Following on from this, you will be introduced to the required conduct of vessels in any condition of visibility. This includes the required conduct of vessels in sight of one another and conditions of restricted visibility. You will learn about the application of the rules and responsibilities, along with the types of vessels in the context of COLREGs and the general definitions guiding them. The course goes on to demonstrate how to maintain a proper look-out as well as the factors to be considered in determining a safe speed. You will also analyse the process of determining the risks of collisions. Next, you will discover the actions that are required to avoid a collision along with the actions to be taken by the vessels in narrow channels such as the required actions when two sailing vessels are approaching one another to avoid a collision. The rules that apply to the traffic separation schemes adopted by the organisation and the actions that are required from a vessel using the scheme are also discussed. This course explains how to prevent collisions between power-driven vessels underway from a vessel not under command and also how vessels engaged in fishing can be prevented from colliding with a vessel restricted in her ability to manoeuvre.</p><p>Moving on, you will be taught how the Officer of Watch must ensure that a proper lookout is maintained on the bridge. You will go through previous investigations into maritime casualties including the principal contributing factors and study the roles of the master of every ship in ensuring that watchstanding arrangements are sufficient for a safe navigation watch. This course describes how the bridge watch standing aboard a ship demands certain attributes from the bridge team and explains the functions of a proper look-out in compliance with Rule 5 of COLREGs. You will learn about the designation of the functions of a proper lookout and how it is to be performed by a member of the navigational watch. The course then discusses the differences between the duties of the helmsman and the look-out as you learn the duties of a helmsman when on the wheel including steering the ship and contributing valuable information for navigation. You will gain insight into the closed-loop communications practised when giving helm orders. If you are a mariner or you are typically interested in having sound knowledge of the navigation and safety rules at sea, then sign up for this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}