{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1366","title":"Diploma in Biology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a better understanding of how humans, animals, and plants interact with each other with this free biology course.","description":"This free online Biology diploma course teaches you all about the structure, growth, origin, evolution, and distribution of living things. You will learn how to characterise living things into five different kingdoms, study plant and animal cells, and look into the six major groups of nutrients. You will also study the cell theory, plant biology, and gene technology. Start this free online course and grow your understanding of the living world!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first introduce you to cell theory, metabolism, and plant biology. You will study the six major groups of nutrients, the three types of carbohydrates, and the two types of digestion. You will study cellular respiration, thermoregulation, and homeostasis. The course will also cover the two stages of photosynthesis as well as the defense mechanisms in plants. You will study antibodies and antigens as well as the factors that affect the rate of transpiration in plants.<br><br>You will then learn about evolution and parallel evolution, natural selection, diversity, gradualism, and punctuated equilibrium. The course will also discuss mitosis, the process of meiosis, and population genetics including pedigrees, inheritance, Gregor Mendel's fundamental laws of inheritance, and mutations. You will also learn about gene technology including the implications of gene technology, DNA science, and gene expression. You will also study gene mapping and how to calculate the map distance of genes.<br><br>The study of biology is important not just for those who are in the field of science but for everyone who wants to better understand their bodies, their resources, and potential threats that are present in the environment. It allows people to understand every organism present in the five kingdoms of living things. This course contains valuable knowledge for those who are interested in entering medical school, veterinary school, or other scientific graduate programs so make sure to check it out.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}