{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3019","title":"Diploma in Experimental Biotechnology","totalEnrolled":"1,842","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn Experimental Biotechnology techniques, processes and its various applications in this free online course.","description":"The rapidly-expanding field of biotechnology includes using biological systems and living organisms to create new products and processes. In this free online course, you will learn about the methods and applications involved in Experimental Biotechnology as well as the technical definitions and applications of immunology, the polymerase chain reaction technique and the process where antigens and antibodies link together known as agglutination.","courseOutcomes":["Discuss the steps in the Generation ...","Summarise the different types of Cel...","Explain the main Properties of a Cel...","Outline the steps in the Immunopreci...","Discuss the steps in the Generation of Antibodies in an organism.","Summarise the different types of Cell-Mediated Immune Responses.","Explain the main Properties of a Cell.","Outline the steps in the Immunoprecipitation Assay procedure.","Analyse the Immuno-localization process.","Compare the basic models of Electron Microscopes.","List the sources of Template DNA.","Recognise the steps in the Genomic DNA Isolation procedure.","Discuss the steps in the Generation ...","Summarise the different types of Cel...","Explain the main Properties of a Cel...","Outline the steps in the Immunopreci...","Discuss the steps in the Generation of Antibodies in an organism.","Summarise the different types of Cell-Mediated Immune Responses.","Explain the main Properties of a Cell.","Outline the steps in the Immunoprecipitation Assay procedure.","Analyse the Immuno-localization process.","Compare the basic models of Electron Microscopes.","List the sources of Template DNA.","Recognise the steps in the Genomic DNA Isolation procedure."],"courseDescription":"<p>Experience and immerse yourself in the exciting world of Experimental Biotechnology - the area of scientific study that has produced many food products, textiles, chemicals and biofuels that we use today. In this free online course, you will explore the fact that hybridoma cells contain spleen cells capable of coding an antibody whereas myeloma cells do not produce antibodies but have the ability to grow indefinitely. The fact that the antigen that is used for immunization should be as pure as possible which helps reduce the generation of cross-reactive antibodies will also be discussed. Learn all about the concepts of cytokines and chemokines, which are extracellular signaling molecules that mediate cell-to-cell communication. You will learn that the enzyme-linked immunosorbent assay (ELISA) technique is based on the competitive binding of the primary antibody between the target antigen in a sample and the same antigen that is coated to the multi-well plate. You will discover that pixel densities on the developed X-ray film can be collected and analyzed using a transmission-mode scanner and image analysis software.&nbsp;</p><p>The course begins by introducing you to immunology techniques and the interaction between antibodies and antigens. Then, the Direct Agglutination test which diagnoses antibodies against a large number of cellular antigens such as red blood cells (RBCs), bacteria and fungi, will be discussed. You will explore Radial Immunodiffusion, which is a quantitative immunodiffusion technique used to detect the concentration of antigens by measuring the diameter of the precipitin ring formed by the interaction of the antigen and the antibody at optimal concentration. You will discover the fact that the growth and multiplication of a host organism that is used as an expression system, requires suitable biochemical and biophysical conditions. It will be clarified that the term homogenizer, refers to a piece of laboratory or industrial equipment used for the homogenization of cells during the isolation of cell organelles. The content covered includes learning all about gating and that it refers to the section of only a certain population of cells available for analysis on a plot and this provides the ability to look at parameters that are only specific to that subset. You will be taught that, in an Epifluorescence Microscope, the illumination of the specimen, as well as the collection of the fluorescence light, is achieved by a single lens.</p><p>Next, you will learn that when conducting Immuno-localization studies, it is critical to start with the fixation step which stops the biological activity and the relative movement of cellular components and intracellular macromolecules. You will gain insight into “resolution” and that it is a term that refers to the minimum distance at which two distinct points of a specimen can still be seen and that the resolution of a microscope is linked to the numerical aperture as well as the wavelength of light that is used to examine a specimen. The course content goes on to analyze a Scanning Electron Microscope and that in this microscope, the secondary electrons that are produced by the specimen are detected to generate an image that contains the topological features of the specimen. The final bits of content in this Biotechnology course deals with the typical phagocytosis of a bead, which when it is represented by the appearance of beads in the phase data, the same bead will be circled by a blue fluorescence from the filipin. Lastly, you will study the important Polymerase Chain Reaction-, sequencing and blotting techniques, DNA amplification, and primer designing.&nbsp;</p><p>Enrolling in this instructor-led video-based course, means you will be provided with demonstrations, problems, examples and assessment questions that are designed to deliver a comprehensive foundation, enabling you to take serious steps in your career in Experimental Biotechnology.</p><a href=\"https://alison.com/resume/courses/3019\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3019\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Immunology Techniques","description":"In this module, Immunology Techniques, you will learn about the Antibody Generation function of the immune system. You will also learn about the interaction between the Antibody and the Antigen.","topics":["Immunology Techniques - Learning Outcomes","Antibody Generation","Antibody-Antigen Interaction","Immunoprecipitation","Sandwich and Competitive ELISA","Cytokines","Immunology Techniques - Lesson Summary"]},{"name":"Module","details":"Cell Biology","description":"In this module, Cell Biology, you will learn about the applications of bacterial growth media and the microbiology medium preparation process. You will also learn about the Fractionation of Cells and the basic models of Electron Microscopes.","topics":["Cell Biology - Learning Outcomes","Introduction to Cell Biology","Fractionation of Cells","Microscopy","Electron Microscopes","Microscopy Experiments","Flow Cytometry","Cell Biology - Lesson Summary"]},{"name":"Module","details":"Diploma in Experimental Biotechnology - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Experimental Biotechnology - First Assessment"]},{"name":"Module","details":"Polymerase Chain Reaction","description":"In this module, Polymerase Chain Reaction, you will learn about the Polymerase Chain Reaction, a technique that is used to amplify DNA. You will also learn about the key parameters in the designing of primers and the three categories of PCR Applications.","topics":["Polymerase Chain Reaction  - Learning Outcomes","DNA Amplification","Instrumentation","Primer Designing","Application of PCR","Polymerase Chain Reaction  - Lesson Summary"]},{"name":"Module","details":"Sequencing and Blotting Techniques","description":"In this module, Sequencing and Blotting Techniques, you will learn about the stages in the overview of protein sequencing. You will also learn about the steps in the Sanger Protocol and the steps in the northern blotting procedure.","topics":["Sequencing and Blotting Techniques - Learning Outcomes","Biomolecule Sequencing Techniques","Blotting Techniques","Southern Blotting Technique","Sequencing and Blotting Techniques  - Lesson Summary"]},{"name":"Module","details":"Diploma in Experimental Biotechnology - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Experimental Biotechnology - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Experimental Biotechnology - Course Assessment"]}]}