{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2850","title":"Diploma in Analytical Techniques in Purification of Biomolecules","totalEnrolled":"996","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the methods involved in analytical techniques for the purification of biomolecules.","description":"The various techniques and analysis involved in the complex purification of biomolecules is covered in this free online course. Learn the definition of gel filtration chromatography and affinity chromatography, which works on the principle of mutual recognition forces between a ligand and a receptor, will also be discussed.","courseOutcomes":["Discuss the mechanism of separation ...","Explain the different precautions to...","Describe the properties of a protein...","Outline the iron-exchange chromatogr...","Discuss the mechanism of separation in chromatography","Explain the different precautions to take whilst using the chromatography machine","Describe the properties of a protein molecule","Outline the iron-exchange chromatography purification steps","Discuss the popular gel filtration matrices","Describe how a column packing experiment is conducted","Discuss the advantages of affinity chromatography","Explain the steps in the antibody purification process","List the steps involved in the metal-affinity chromatography protein purification process","Discuss the mechanism of separation ...","Explain the different precautions to...","Describe the properties of a protein...","Outline the iron-exchange chromatogr...","Discuss the mechanism of separation in chromatography","Explain the different precautions to take whilst using the chromatography machine","Describe the properties of a protein molecule","Outline the iron-exchange chromatography purification steps","Discuss the popular gel filtration matrices","Describe how a column packing experiment is conducted","Discuss the advantages of affinity chromatography","Explain the steps in the antibody purification process","List the steps involved in the metal-affinity chromatography protein purification process"],"courseDescription":"<p>Be introduced to the world of analytical techniques in the purification of biomolecules in this free course. You will explore the fact that chromatography is a technique that allows scientists to separate molecules of interest from a crude mixture and discover which effect this separation exploits. Find out which type of chromatography leads to the matric having a negatively charged functional group with an affinity towards positively charged molecules. You will be introduced to the concept of ‘hydrophobic interaction chromatography’ which exploits the ability of strong interactions between the hydrophobic group attached to the matrix and hydrophobic patches present on an analyte such as a protein. Find out what happens to the water molecules shielding the protein side chains in the presence of a high amount of salt, and discover what the addition of a low amount of salt to the protein solution results in. Demonstrations, problems, examples and assessment questions in this instructor-led video-based course are designed to provide you with a comprehensive foundation in this aspect of biology.</p><p>The course kicks off with the definition of gel filtration chromatography (also known as size-exclusion&nbsp;chromatography&nbsp;or molecular-sieve&nbsp;chromatography) and the different types of problems that one is likely to have after packing the column. The choice of the column will be discussed, depending on the range of molecular weight and the pressure limit of the operating equipment. You will explore the fact that the molecular weight and size of a protein is related to the shape of the molecule and the relationship between its molecular weight and the radius of gyration. You will discover the fact that the native molecular weight determination by gel filtration in conjugation with the SDS-PAGE can be used to determine the oligomeric status of the protein. Go on to study preparing gel filtration samples in the mobile phase and how the binding of DNA to protein induces certain conformational changes.</p><p>Next, you will learn that affinity chromatography works on the principle of mutual recognition forces between a ligand and a receptor. You will gain insight into the fact that in the bio-affinity chromatography method, biomolecules are used as a receptor present on the matrix and it exploits the biological phenomenon such as the antibody-antigen. You will then discover that Glutathione S-transferase (GST) utilizes glutathione as a substrate to catalyze conjugation reactions for xenobiotic detoxification purposes. This GST fusion protein is produced by the recombining of the protein of interest with the GST sequence present in the expression vector. You will be taught that the biotinylation of antibodies allows the immobilization of antibodies in the correct orientation on the streptomycin coated glass beads. You will discover that an affinity column can also be used as a tool to study or isolate an interacting partner of a particular protein. Finally, you will study gel filtration chromatography, receptor and ligand interactions, bio-affinity chromatography, and metal-affinity chromatography. This course will be of interest to biotechnology students, or those professionals in experimental biotechnology.</p><a href=\"https://alison.com/resume/courses/2850\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2850\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Chromatography","description":"In this module, Chromatography, you will learn about Chromatography, a technique that allows scientists to separate molecules of interest from a crude mixture. You will also learn about different Chromatography Techniques and how to use Iron-Exchange Chromatography.","topics":["Chromatography - Learning Outcomes","Chromatography","Chromatography System","Chromatography Techniques","Iron-Exchange Chromatography","Hydrophobic Interaction Chromatography","Chromatography - Lesson Summary"]},{"name":"Module","details":"Diploma in Analytical Techniques in Purification of Biomolecules - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Analytical Techniques in Purification of Biomolecules - First Assessment"]},{"name":"Module","details":"Gel Filtration Chromatography","description":"In this module, Gel Filtration Chromatography, you will learn about the different safety precautions to take when performing the gel filtration chromatography. You will also learn how to conduct Column Packing Experiments and validation procedures.","topics":["Gel Filtration Chromatography - Learning Outcomes","Protein Folding","Column Packing Experiment","Gel Filtration Chromatography","Gel Filtration Chromatography - Lesson Summary"]},{"name":"Module","details":"Affinity Chromatography","description":"In this module, Affinity Chromatography, you will learn about the Operation of Affinity Chromatography and the steps in the process of generating antibodies. You will also learn about Bio-affinity Chromatography and the Metal-affinity Chromatography Protein Purification process.","topics":["Affinity Chromatography - Learning Outcomes","Introduction to Affinity Chromatography","Receptor and Ligand Interactions","Bio-affinity Chromatography","Metal-Affinity Chromatography","Affinity Chromatography - Lesson Summary"]},{"name":"Module","details":"Diploma in Analytical Techniques in Purification of Biomolecules - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Analytical Techniques in Purification of Biomolecules - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Analytical Techniques in Purification of Biomolecule - Course Assessment"]}]}