{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2849","title":"Diploma in Lab Practices and Electrophoresis","totalEnrolled":"3,860","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the systems and analysis involved in laboratory practices and electrophoresis.","description":"In this free online course, learn about the guidelines and processes involved in laboratory practices and electrophoresis. Study the definition of good laboratory practices and analyze stains in polyacrylamide gels. Electrophoresis, which refers to an electrokinetic process that separates charged particles in a fluid using a field of electrical charge, will be also discussed in this comprehensive course.","courseOutcomes":["Discuss laboratory guidelines and pr...","Describe the contents of the materia...","Explain the components of liquid han...","Discuss the uses of the water distil...","Discuss laboratory guidelines and precautions","Describe the contents of the material safety data sheet (MSDS)","Explain the components of liquid handling systems in the laboratory","Discuss the uses of the water distillation unit","Describe the different types of centrifuges","Explain the roles of different buffer solutions","Discuss the components of gel electrophoresis","Explain the steps in the staining procedure","List the typical apparatus in an agarose gel electrophoresis experiment","Describe the different variants of gel electrophoresis","Discuss laboratory guidelines and pr...","Describe the contents of the materia...","Explain the components of liquid han...","Discuss the uses of the water distil...","Discuss laboratory guidelines and precautions","Describe the contents of the material safety data sheet (MSDS)","Explain the components of liquid handling systems in the laboratory","Discuss the uses of the water distillation unit","Describe the different types of centrifuges","Explain the roles of different buffer solutions","Discuss the components of gel electrophoresis","Explain the steps in the staining procedure","List the typical apparatus in an agarose gel electrophoresis experiment","Describe the different variants of gel electrophoresis"],"courseDescription":"<p>This detailed course introduces you to the world of professional lab practices and electrophoresis. You will explore the fact that good laboratory practice (GLP) embodies a set of principles that provide a framework within which lab studies are planned, performed, monitored, recorded, reported and archived. The three levels of categorization from the Rosch Approach will be discussed. You will be introduced to the concept of buffer capacity, a quantitative measure of the resistance to change of pH by a solution, containing a buffering agent with respect to a change in the acid or alkali concentration. You will also learn that the electrophoresis in the vertical electrophoresis system performs in a discontinuous way with a buffer in the upper and lower tank, whilst the electrophoresis in the horizontal gel system performs continuously. You will discover how the calibration curve from native and denaturation gels are used to determine the molecular weight of the protein. Demonstrations, problems, examples and assessment questions in this instructor-led video-based course, are designed to provide you with a comprehensive foundation, which will enable you to take serious steps into this career.</p><p>The course begins by introducing you to the definition of GLP and the different levels of categorization within it. Then, the material safety data sheet (MSDS) will be discussed, showing you how it contains information about the potential hazards of a material. You will explore the buffer solution, which is used during experiments as a means of keeping the pH at a nearly constant value in a wide variety of chemical applications. You will discover the fact that at a fixed centrifugal force and liquid viscosity, the sedimentation rate of a particle is proportional to its size and the difference between the particle density and the density of the solution. You will also discover that electrophoresis refers to an electrokinetic process that separates charged particles in a fluid using a field of electrical charge and the reasons why the electrophoresis technique is not good for use in the separation and analysis of complex biological samples.</p><p>Next, you will learn that the complex biological samples are efficiently resolved in 2-D gel electrophoresis. This involves the combination of charge and molecular weight to provide much greater separation in comparison to the use of the individual property. You will gain insight into the fact that when conducting the agarose gel electrophoresis experiment on the native page, the sample that is prepared in the loading dye does not contain detergent or denaturing agent and as a result, the sample runs based on charge. You will then see that in the horizontal polyacrylamide gel electrophoresis, the complex biological sample is resolved according to its charge and then moved to the counter charge electrode. Study calibration curves from native and denaturation gels before moving onto liquid-handling systems, secondary structures in RNA, polyacrylamide gel electrophoresis, and stacking gel polymerization. This course will be of interest to biotechnology students, or those professionals in experimental biotechnology.<br><br></p><a href=\"https://alison.com/resume/courses/2849\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2849\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Laboratory Basics","description":"In this module, Laboratory Basics, you will learn about the general guidelines and precautions to take when carrying out experiments in the lab. You will also learn about the importance of reading the Material Safety Data Sheet for each chemical before using it.","topics":["Laboratory Basics - Learning Outcomes","Good Laboratory Practices","Laboratory Safety Guidelines","Liquid Handling Systems","Weighing Balance","Operation of Laboratory Instruments","Preparation of Solutions and Buffers","Laboratory Basics - Lesson Summary"]},{"name":"Module","details":"Diploma in Lab Practices and Electrophoresis - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Lab Practices and Electrophoresis - First Assessment"]},{"name":"Module","details":"Electrophoresis","description":"In this module, Electrophoresis, you will learn that Electrophoresis is an electrokinetic technique that is used to separate charged particles in a fluid. You will also learn how to conduct an image analysis and horizontal gel electrophoresis.","topics":["Electrophoresis - Learning Outcomes","Reagents in Gel Electrophoresis","Staining and Image Analysis","Horizontal Gel Electrophoresis","Variants of Gel Electrophoresis","Electrophoresis - Lesson Summary"]},{"name":"Module","details":"Scientific Questions","description":"In this module, Scientific Questions, you will learn about the process of determining the oligomeric status of a protein. You will also learn about the region of the gene that is responsible for the binding of the transcription factor.","topics":["Scientific Questions - Learning Outcomes","Scientific Questions","Experimental Design","Transcription Factor","Identification of Genome Region","Scientific Questions - Lesson Summary"]},{"name":"Module","details":"Diploma in Lab Practices and Electrophoresis - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Lab Practices and Electrophoresis - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Lab Practices and Electrophoresis - Course Assessment"]}]}