{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3988","title":"Diploma in High School Algebra I","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about number operations, monomials, polynomials, and measures of central tendency from this free online course.","description":"Dive into the world of algebra with this course from Alison! Learn about the classification of number operations as well as how to solve complex equations. You will explore the composition of monomials and polynomials along with the operations of sequences and series. The material also covers methods of statistical analysis from the measures of central tendency. Start this course today and take your numeracy skills to the next level!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Decipher the common challenges in solving equations and statistical analysis with this free online algebra course from Alison! This course defines the terms, operations as well as the common vocabulary associated with algebra. In it, you will identify the classification of sets and the operations between them. You will learn about the functionality of Venn diagrams and how they are applied to sets. Study the set of numbers as a collection of elements while exploring the functions and relationship between rational and irrational numbers. This course exposes you to the concept of variables and algebraic expressions with a focus on the composition of expressions. Gain invaluable insight into the laws of exponents and the concept of monomials as an algebraic expression in mathematics. This course will further explain how to reverse distributive properties in factoring polynomials and how to get the difference of two perfect squares using the FOIL method.</p><p>Having difficulty factoring the sum of two perfect cubes? This course illustrates practically how to factor the sum of two perfect cubes and what it means to factor a polynomial completely. You will be able to differentiate between the composition of a monomial and a polynomial. The material succinctly explains the process of graphing linear inequalities along with how to solve pairs of linear inequalities graphically. It further explores the principles as well as the methods of solving quadratic equations. Grapple with the concept of the parabola as it relates to quadratic inequalities and the different ways of determining the roots of quadratic equations. You will also learn about the properties of exponential functions and how to solve various kinds either algebraically or graphically. Another great benefit includes understanding the concept of functions, domain and the range of a function.</p><p>Finally, this course explains how basic arithmetic operations such as addition, subtraction, multiplication, and division are performed on a function. It also demonstrates the functions of the measures of central tendency in statistical analysis. Learn about the importance of the entire set of data in a single statement as well as the different types of measures of central tendency. By successfully completing the modules, you will be able to solve mathematical problems ranging from number operations to monomials and polynomials including the laws of exponents. You will also learn how to effectively display statistical data like a pro using bar charts and linear interpolation. This includes how to interpret and construct frequency tables and histograms. This course is targeted at students and anyone enthusiastic about improving their knowledge of algebra. Start this course today and enhance your understanding of number operations, word problems, laws of exponents, and quadratic equations in algebra.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}