{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2798","title":"Diploma in Digital Textuality","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the evolution of how text is used alongside the development of media technologies in this free online course","description":"This free course will study the evolution of language, narratives and representation through the history of the technologies of communication – oral, written, print and digital. It will analyze concepts of copyright, censorship, authorship and nation formation. This course will explore the arrival of mass media, blogging, the arrival of social media, internet and network giants such as Facebook, Google and Twitter.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will introduce learners to the history of books in Europe and how print contributed to the standardization of languages, influenced the spread of ideas, and affected the politics and economics of European societies. Also, learners will gain an understanding of colonialism, its link to capitalism and the concept of a civilizing mission. With digital media being the heart of modern communication, this course will explore the concept of Lawrence Lessig's law on digital content.</p><p>Furthermore, this course will show how printing developed in northern India and its socio-political influence on India. You will learn about the effects that the mechanical reproduction of arts has on the value attributes of art. In addition, you will be taught the effect the development of electronic media had on human society and the importance of the GNU manifesto which will help us get a snapshot of the ownership patterns of software. This course, goes on to explore the notion of free software and the protection of digital contents.</p><p>This course will teach you about content creation and the emergence of copyright, the claims and truths of copyright and the characteristics of digital reproduction. Also, learners will gain an understanding of digital media and the human mind, the power of Google, social media and its politics. You will be shown the concept of the internet, the movement of mass media to social media and the level of government control over social media. This course is important for learners who want to be equipped with a well-rounded understanding of the evolution of how text is used alongside the development of media technologies.</p><p>Start Course Now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}