{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1241","title":"Diploma in Educational Psychology","totalEnrolled":"94,186","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to harness knowledge of educational psychology to teach more effectively in this free online diploma course.","description":"This diploma course helps you improve your teaching methods to fulfill your role more effectively by exploring classroom psychology. Teaching can be very challenging when confronted with the many different personalities and learning levels of students. How do you accommodate all of these different characters and abilities in a classroom? This diploma course helps you to use your newfound knowledge of psychology to complete this difficult task.","courseOutcomes":["Describe the process of learning in ...","Compare the two major learning theor...","Identify various psychologists, phil...","Discuss trends in contemporary stude...","Describe the process of learning in terms of educational theory","Compare the two major learning theories: behaviorism and constructivism","Identify various psychologists, philosophers and researchers associated with it","Discuss trends in contemporary student development","Outline key cognitive, social and moral development theories","Highlight physical, social, academic and cognitive differences in terms of gender role","Explain how cultural differences can affect students’ educational experiences","Lay out the fundamentals of special education","Describe the most common types of disabilities encountered in classrooms","Generate an individual education plan for a student with special education needs","Describe the process of learning in ...","Compare the two major learning theor...","Identify various psychologists, phil...","Discuss trends in contemporary stude...","Describe the process of learning in terms of educational theory","Compare the two major learning theories: behaviorism and constructivism","Identify various psychologists, philosophers and researchers associated with it","Discuss trends in contemporary student development","Outline key cognitive, social and moral development theories","Highlight physical, social, academic and cognitive differences in terms of gender role","Explain how cultural differences can affect students’ educational experiences","Lay out the fundamentals of special education","Describe the most common types of disabilities encountered in classrooms","Generate an individual education plan for a student with special education needs"],"courseDescription":"<p>Educational psychology addresses teaching and learning methods and studies cognitive development and aptitude assessment of learners. This diploma course compares teaching and learning and draws on behaviorism, a learning philosophy that focuses on operant conditioning and its important pedagogic implications. We then investigate psychological and social constructivism.</p><p>The course then tackles the most common mental issues encountered in the classroom, including learning disabilities, attention deficit hyperactivity disorder (ADHD), intellectual disabilities, behavioural disorders, physical disabilities and sensory impairments. We lay out the specific skills and strategies required to work with students with these special educational needs. Finally, we examine student development and diversity and discuss its two core elements: gender and culture.</p><p>Educators require the desire and guts to stand in front of a class and teach but they also need compassion and special skills to connect with different students. This course is of great benefit to education professionals who would like to improve their teaching. Understanding how learners think and feel can boost your ability to understand and meet their educational needs so sign up to earn a diploma that signals your ability to do so.</p><a href=\"https://alison.com/resume/courses/1241\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1241\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to the Learning Process","description":"This module will introduce you to two main learning theories and four different domains of learning. You will also learn about curriculum learning and incidental learning.","topics":["The  Learning Process - Learning Outcomes","The Learning Process","Teachers’ Perspective on Learning","The  Learning Process - Lesson Summary"]},{"name":"Module","details":"Behaviourism","description":"You will be introduced to behaviourism and operant conditioning. You will learn about research into operant conditioning using laboratory rats and how this research has influenced learning in the classroom.","topics":["Behaviourism - Learning Outcomes","Introduction to Behaviourism","Operant Conditioning","Operant Conditioning and Students’ Learning","Further Key Concepts about Operant Conditioning","Behaviourism - Lesson Summary"]},{"name":"Module","details":"Constructivism","description":"You will be introduced to constructivism and its two main branches - psychological constructivism and social constructivism. You will also learn about assimilation and accommodation in relation to constructivism.","topics":["Constructivism - Learning Outcomes","Introduction to Constructivism","Psychological Constructivism","Social Constructivism","Theoretical Differences between Psychological and Social Constructivism","Implications of Constructivism for Teaching","Constructivism - Lesson Summary"]},{"name":"Module","details":"Diploma in Educational Psychology - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Educational Psychology - First Assessment"]},{"name":"Module","details":"Introduction to Special Education","description":"In this module you will learn how to correctly define special education and the main responsibilities of teachers who teach students with special educational needs. You will be introduced to the concept of least restrictive environment and how to modify assessments for students with special educational needs.","topics":["Special Education - Learning Outcomes","Special Education and Legalisation","Teachers’ Responsibilities for Special Education","The Individual Educational Plan","The Value of Inclusive Education","Categories of Disabilities","Special Education - Lesson Summary"]},{"name":"Module","details":"Learning Disabilities","description":"Learn how to correctly define learning disability and how to distinguish a learning disability from other types of disabilities. You will be introduced to strategies that can help students with learning disabilities.","topics":["Learning Disabilities - Learning Outcomes","Introduction to Learning Disabilities","Case Study: Assisting a student with a learning disability","Learning Disabilities - Lesson Summary"]},{"name":"Module","details":"Attention Deficit Hyperactivity Disorder (ADHD)","description":"This module introduces Attention Deficit Hyperactivity Disorder (ADHD) and behavioural signs exhibited by students. You will learn about the drugs that students with ADHD take to reduce their symptoms and practical problems associated with taking these drugs. The modules also describes strategies that a teacher can use to teach students with ADHD.","topics":["Attention Deficit Hyperactivity Disorder (ADHD) - Learning Outcomes","Introduction to ADHD","Teaching Students with ADHD","Attention Deficit Hyperactivity Disorder (ADHD) - Lesson Summary"]},{"name":"Module","details":"Intellectual Disabilities","description":"You will learn how to distinguish between an intellectual disability and a learning disability, and the strategies that teachers use when teaching students with intellectual disabilities.","topics":["Intellectual Disabilities - Learning Outcomes","Introduction to Intellectual Disabilities","Teaching Students with Intellectual Disabilities","Intellectual Disabilities - Lesson Summary"]},{"name":"Module","details":"Behavioural Disorders","description":"You will learn about potential types of triggers of inappropriate behaviour. You will be introduced to examples of problematic behaviour that a student with a behavioural disorder might display and strategies for teaching students with behavioural disorders.","topics":["Behavioural Disorders - Learning Outcomes","Introduction to Behavioural Disorders","Teaching Students with Behavioural Disorders","Behavioural Disorders - Lesson Summary"]},{"name":"Module","details":"Physical Disabilities and Sensory Impairments","description":"You will learn to recognise the signs of hearing loss and visual impairment and strategies for teaching students with hearing loss and visual impairment.","topics":["Physical Disabilities and Sensory Impairments - Learning Outcomes","Introduction to Physical Disabilities and Sensory Impairments","Teaching Students with Hearing Loss","Teaching Students with Visual Impairment","Physical Disabilities and Sensory Impairments - Lesson Summary"]},{"name":"Module","details":"Diploma in Educational Psychology - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Educational Psychology - Second Assessment"]},{"name":"Module","details":"Student Development","description":"This module differentiates between learning and development and outlines ways that students' development is relevant to teachers. You will be introduced to different developmental models such as the staircase model and the kaleidoscope model of development.","topics":["Student Development - Learning Outcomes","Introduction to Student Development","Developmental Trends","Student Development - Lesson Summary"]},{"name":"Module","details":"Physical Development","description":"You will learn about puberty and the types of physical changes that occur during puberty. You will be introduced to trends in the height and weight in students, and factors that contribute to a rise in obesity levels. The module also describes the importance of developing motor skills in young children.","topics":["Physical Development - Learning Outcomes","Trends in Height and Weight","The Effects of Puberty","Development of Motor Skills","Health and Illness","Physical Development - Lesson Summary"]},{"name":"Module","details":"Cognitive Development","description":"This module introduces the work of the famous Swiss psychologist Jean Piaget who developed the four stage cognitive development theory. The module outlines the ages at which each of Piaget's stages occur and describes each of the four stages in detail.","topics":["Cognitive Development - Learning Outcomes","Jean Piaget’s Theory","The Sensorimotor Stage","The Preoperational Stage","The Concrete Operational Stage","The Formal Operational Stage","Cognitive Development - Lesson Summary"]},{"name":"Module","details":"Social Development","description":"This module introduces research into social development such as Erikson's eight stage model of social development. You will learn how changes in social development affect student behaviour in the classroom.","topics":["Social Development - Learning Outcomes","Introduction to Social Development","Erik Erikson’s Theory","Abraham Maslow’s Theory","Social Development - Lesson Summary"]},{"name":"Module","details":"Moral Development","description":"You will learn how to distinguish between morality and moral development, and between morality of justice and morality of care. The module introduces the work theorists such as Kolberg and his theory of moral development, and Gilligan's theory of moral development.","topics":["Moral Development - Learning Outcomes","Introduction to Moral Development","Lawrence Kohlberg's Theory","Carol Gilligan's Theory","Character Education","Moral Development - Lesson Summary"]},{"name":"Module","details":"Student Diversity","description":"This module introduces the concept of individual learning styles in students. You will learn how to distinguish between field dependence and field independence, and between the two cognitive styles of impulsivity and reflectivity.","topics":["Student Diversity - Learning Outcomes","Introduction to Student Diversity","Individual Learning Styles","Multiple Intelligences","Gifted and Talented Students","Student Diversity - Lesson Summary"]},{"name":"Module","details":"Gender Differences","description":"This module describes ways that gender differences affect students in day-to-day classroom life, and what are the implications of gender differences in the classroom. You will learn about differences in the way that boys and girls usually socially interact, and how teachers can influence gender roles.","topics":["Gender Differences - Learning Outcomes","Introduction to Gender Differences","Physical Differences in Gender Roles","Social, Academic and Cognitive Difference in Gender Roles","Gender Differences - Lesson Summary"]},{"name":"Module","details":"Cultural Differences","description":"You will learn about bilingualism and compare and contrast the two second language teaching techniques - total immersion and additive approach. The module helps you identify what a culture is and how language is used differently across various cultures.","topics":["Cultural Differences - Learning Outcomes","Introduction to Cultural Differences","Cultural Differences in Language","Cultural Differences in Attitudes and Beliefs","Accommodating Cultural Diversity","Cultural Differences - Lesson Summary"]},{"name":"Module","details":"Diploma in Educational Psychology - Third Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Educational Psychology - Third Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 21: Diploma in Educational Psychology - Final Assessment"]}]}