{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4554","title":"Diploma in Genetics and Evolution through Biological Anthropology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the basics of genetics and evolution in this free online biological anthropology diploma course.","description":"This free online biological anthropology course explores the world of genetics and evolution. People have misunderstood the term ‘evolution’ for years. Does evolution mean humans evolved from monkeys? No! Register for this diploma certification course and learn what evolution is and how it works! We devote the first section to genetics because you need to understand genetics to understand evolution. We then study evolution in detail.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>We begin this diploma course by introducing you to the field of Anthropology, which studies human behaviour. Anthropology has four areas. We will research these fields and then focus on Biological Anthropology. Biological Anthropology explores many topics, including the study of genetics and evolution, which is the focus of this diploma course. We have provided two classes in one: you will study both genetics and evolution. Why is genetics so important to learn? To understand evolution and how it works, you first need to understand genetics.</p><p>We teach you basic genetics concepts in the first half of this course, including deoxyribonucleic acid (DNA) and chromosomes. We then investigate both Mendelian and non-Mendelian genetics. We outline the genetics of several human traits and diseases. The second half of this course examines evolution. We study the history of evolutionary thought and learn about microevolution and macroevolution. Then, we analyse how genetics can help us understand human evolution. We concentrate on what genetics can tell us about neanderthals, one of our closest relatives. We consolidate the relationship between genetics and cultural practices and explain how culture influences evolution. Finally, we observe some examples of contemporary human evolution.</p><p>Some people think that evolution means that humans evolved from monkeys. But they are mistaken. Take this free online diploma course and find out what evolution really is and how it works! Please note: this course does not focus on proving evolution. If you are against the idea of evolution and don’t want to learn about it, then this course is not for you. However, if you’re curious about evolution and how it works, enrol in this course right away and earn your diploma today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}