{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1243","title":"Diploma in Human Anatomy and Physiology","totalEnrolled":"82,999","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master basic anatomy and learn all about the physiology of the human body in this free online diploma course.","description":"This course covers human anatomy and lays out the physiology of the cardiovascular, respiratory, reproductive, skeletal and nervous systems, among others. We explore the amazing inner workings of the body, which is a complex collection of interacting systems that carry out the important functions that let you move, think, feel and live. This course suits anyone interested in studying medicine or who simply wants to understand how bodies work.","courseOutcomes":["Describe the structure and functions...","Explain the transmission of neural i...","Lay out the workings of the male and...","Trace the development of offspring d...","Describe the structure and functions of blood and blood vessels, the heart, the digestive system, the muscular system and the nervous system","Explain the transmission of neural impulses","Lay out the workings of the male and female reproductive systems","Trace the development of offspring during the intrauterine process","Outline the structure and functions of the respiratory system, sensory organs and skeleton","Describe the structure and functions...","Explain the transmission of neural i...","Lay out the workings of the male and...","Trace the development of offspring d...","Describe the structure and functions of blood and blood vessels, the heart, the digestive system, the muscular system and the nervous system","Explain the transmission of neural impulses","Lay out the workings of the male and female reproductive systems","Trace the development of offspring during the intrauterine process","Outline the structure and functions of the respiratory system, sensory organs and skeleton"],"courseDescription":"<p>Have you ever wondered why you react quickly when you touch a hot surface? This is because the nervous system transmits neural impulses to the brain, which in turn sends a message to your muscles. This intriguing course uses detailed diagrams to explore the anatomical features and physiological functions of each important bodily system. This helps you to easily learn how these systems develop and interact with each other.</p><p>We examine the structure and functions of blood and blood vessels, the heart, the digestive system, the muscular system, the respiratory system, the nervous system and the skeleton. The course also covers the structure and functions of the reproductive systems and traces the development of offspring during the intrauterine process (gestation).</p><p>This course is ideal for aspiring medical students who need to learn about biomedical science and also those who just want to expand their knowledge and understanding of the human body and its organs. Sign up to improve your understanding of the body.</p><a href=\"https://alison.com/resume/courses/1243\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1243\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to the Cardiovascular System","description":"In this module you will be introduced to circulatory systems and the cardiovascular system. You will also be introduced to the functions and components of blood.","topics":["Module 1: Learning Outcomes","Introduction to the Cardiovascular System","The Circulatory System","Introduction to Blood and Blood for Transport","Blood and Energy Mobilisation","Responses to Hemorrhage, Blood Transfusion, and Blood Matching","Temperature Control by Means of the Blood","Module 1: Lesson Summary"]},{"name":"Module","details":"The Blood Vessel and the Heart","description":"In this module you will be introduced to types, functions and structures of blood vessels. Furthermore, you will be introduced to the parts of the heart and cardiac system as well as the functions they serve. Additionally, you will learn about the connection between the blood vessel system and the heart.","topics":["Module 2: Learning Outcomes","Introduction to the Blood Vessels","Blood Supply","Location of Blood Vessels and Capillaries","The Chambers of the Heart and the Structure of Heart Walls","Cardiac Valves","NAVL of the Heart","Fibrous Skeleton of the Heart and the Pericardium","Blood Flow","Module 2: Lesson Summary"]},{"name":"Module","details":"Introduction to the Human Digestive System","description":"In this module, you will be introduced to the human digestive system. This will include information on how energy is obtained from food, the main food types, and the digestive process. The structure and functions of the stomach will also be described.","topics":["Module 3: Learning Outcomes","The Energy Cycle","Food and Vitamins","Introduction to the Human Digestive System","Ingestion","Swallowing","Temporary Storage","Module 3: Lesson Summary"]},{"name":"Module","details":"Digestion, Absorption, Elimination and Protection","description":"In this module, you will be introduced to the methods in which food is digested, how nutrients are absorbed, the elimination of waste materials, and the protective mechanisms of the digestive system. Furthermore, this module will briefly describe the function of mammary glands in protecting babies form infection during breastfeeding.","topics":["Module 4: Learning Outcomes","Digestion","Absorption","Elimination","The Reticuloendothelial System","The Mammary Glands","Module 4: Lesson Summary"]},{"name":"Module","details":"Diploma in Human Anatomy and Physiology - Revised: First Assessment","description":"This Course Assessment will now enable you to review your learning so you can determine your knowledge and understanding of the following areas: HUMAN CARDIOVASCULAR SYSTEM HUMAN DIGESTIVE SYSTEM Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in Human Anatomy and Physiology - Revised: First Assessment"]},{"name":"Module","details":"Introduction to the Respiratory System","description":"In this module, you will be introduced to the respiratory system. This module will describe why the human respiratory system is necessary, the difference between breathing and respiration, and the structure of the human trunk.","topics":["Module 6: Learning Outcomes","Introduction to the Respiratory System, Physical Principles, and General Construction","Thoracic Diaphragm, Diaphragmatic Inhalation and Exhalation","Human Breathing, Lung Capacities, and Breathing Cycles","Anatomy of the Human Rib Cage","Costal Inhalation and Exhalation","Module 6: Lesson Summary"]},{"name":"Module","details":"Organs in the Respiratory System","description":"In this module, you will be introduced to the various organs in the respiratory system. You will also learn how human speech is produced and the functions of respiratory organs. Also, you will learn the difference between nutrient and functional blood, and how gases are transported around the body.","topics":["Module 7: Learning Outcomes","General Functions and Nervous Control of Breathing","The Nose, Nasopharynx, and the Larynx","Control of Volume of Air and the Production of Human Speech","The Respiratory Tree, Pulmonary Alveoli, Lung Structure,  and Pleural Cavities","Functional Blood Supply and the Exchange and Transport of Gases","Module 7: Lesson Summary"]},{"name":"Module","details":"Introduction to the Reproductive System","description":"In this module you will be introduced to the human reproductive system. This will include the identification of the different sex hormones, genitalia, the process of fertilization. Furthermore, you will learn the structure and function of both the male and female reproduction system. Lastly, aspects of fertilization, pregnancy, and child birth are described.","topics":["Module 8: Learning Outcomes","Introduction to the Reproductive Systems","The Testis and Secondary Male Sex Organs","The Ovary and Secondary Female Sex Organs","Bony Pelvis and Mammary Glands","Intrauterine Development and Parturition","Module 8: Lesson Summary"]},{"name":"Module","details":"Introduction to the Urinary System","description":"","topics":["Module 9: Learning Outcomes","Introduction to the Urinary System","Kidneys","Urinary Bladder","Module 9: Lesson Summary"]},{"name":"Module","details":"Sense of Vision","description":"In this module, you will learn why the human body needs senses, the difference between general and special senses, and the structure and functions of the eye.","topics":["Module 10: Learning Outcomes","General versus Special Senses and the Retinas","Focusing of the Light Rays","Eye Movements","Visual Reflexes and Lacrimal Apparatus","Module 10: Lesson Summary"]},{"name":"Module","details":"The Senses of Hearing, Balance, Smell and Taste","description":"In this module, you will be introduced to the nervous pathways for hearing, as well as the structure and function of ears. Furthermore, the process of \"general body sense\" will be described. Lastly, this module will identify the sensory receptors and the olfactory sensory receptors for taste and smell.","topics":["Module 11: Learning Outcomes","The Ear","Introduction to the Sense of Balance","The General Body Sense, Sense of Smell, and Sense of Taste","Module 11: Lesson Summary"]},{"name":"Module","details":"Diploma in Human Anatomy and Physiology - Revised: Second Assessment","description":"This Course Assessment will now enable you to review your learning so you can determine your knowledge and understanding of the following areas: HUMAN RESPIRATORY SYSTEM HUMAN REPRODUCTION SYSTEM HUMAN URINARY SYSTEM HUMAN SENSORY ORGANS Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in Human Anatomy and Physiology - Revised: Second Assessment"]},{"name":"Module","details":"Introduction to the Human Skeletal System","description":"In this module, you will be introduced to the functions and types of bones found in the human skeleton. Furthermore, you will learn about the tissue types and processes found in skeletal elements. Lastly, you will learn the differences between the axial and appendicular skeleton.","topics":["Module 13: Learning Outcomes","Introduction to the Human Skeletal System","Tissue and Tissue Processes of Skeletal Elements","The Human Skeleton, The Axial and Appendicular Skeleton","The Skull and Rib Cage","The Vertebral Column","The Appendicular Skeleton","Module 13: Lesson Summary"]},{"name":"Module","details":"Human Skeletal System -- Bones and Joints","description":"In this module, you will be introduced to the differences between long and flat bones. You will also learn the steps involved in bone development. Furthermore, you will learn the conditions of cranium and sesamoid bones. Lastly, you will learn about the types of joints and elements of particular joints.","topics":["Module 14: Learning Outcomes","Structure of a Typical Long Bone","The Periosteum of the NAVL","The Origin and Development of a Typical Long Bone","The Structure and Development of a Typical Flat Bone","Bones of the Cranium and the Sesamoid Bones","Introduction to Joints","Synovial Joints","Module 14: Lesson Summary"]},{"name":"Module","details":"Introduction to the Human Nervous System","description":"In this module, you will be introduced to the human nervous system. You will be introduced to the structural and functional organization of the human nervous system. Furthermore, you will be introduced to the structure of the brain, spinal nerves, and the difference between the peripheral and autonomic nervous system.","topics":["Module 15: Learning Outcomes","Introduction to the Human Nervous System","Organization of the Human Nervous System","The Human Brain","The Cerebrum","The Human Spinal Cord","The Peripheral Nerves and a Typical Spinal Nerve","The Autonomic Nervous System","Module 15: Lesson Summary"]},{"name":"Module","details":"The Transmission of Neural Impulses","description":"In this module, you will be introduced to the electrochemical transmission of neuron impulses in the human nervous system. You will also be introduced to the difference between the synapse and the neuromuscular junction. Furthermore, you will learn about pathways in the human nervous system, such as a general sensory path and a motor pathway.","topics":["Module 16: Learning Outcomes","The Transmission of Neuronal Impulses","The Reflex Arc","Introduction to the General Sensory Pathways","Pain","Temperature and Touch","Body Sense","Motor Pathways in the Human Nervous System","Levels of Control in the Human Nervous System","Dominance and Memory","Module 16: Lesson Summary"]},{"name":"Module","details":"Introduction to Muscle Tissues","description":"In this module, you will learn why there is a need for a human muscular system as well as the different types of muscles. Furthermore, you will learn about fatigue and how it relates to muscles.","topics":["Module 17: Learning Outcomes","Introduction to Muscle Tissues and Types of Muscles","The Striated Muscle Tissues","The Skeletal Muscles","Basic Physiology of the Skeletal Muscles","Module 17: Lesson Summary"]},{"name":"Module","details":"Introduction to the Mechanics and Nervous Control of Skeletal Muscles","description":"In this module, you will be introduced to the different skeletomuscular mechanics. You will be introduced to the structure of the skeletomuscular unit, the roles of skeletal muscles, and the ways the exercise effects skeletal muscles. Furthermore, you will learn about the nervous control of skeletal muscles.","topics":["Module 18: Learning Outcomes","Introductions to Skeletomuscular Mechanics","Roles of Skeletal Muscles","Effects of Exercise or Lack of It","Nervous Control, Motor Commands, and Sensory Input to the CNS from Skeletal Muscles","Module 18: Lesson Summary"]},{"name":"Module","details":"Diploma in Human Anatomy and Physiology - Revised: Third Assessment","description":"This Course Assessment will now enable you to review your learning so you can determine your knowledge and understanding of the following areas: HUMAN SKELETAL SYSTEM HUMAN NERVOUS SYSTEM HUMAN MUSCULAR SYSTEM Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in Human Anatomy and Physiology - Revised: Third Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Human Anatomy and Physiology - Revised: Final Assessment"]}]}