{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3290","title":"Diploma in Celestial Navigation","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the calculations used during celestial navigation using the equatorial coordinate system.","description":"Celestial navigation requires an understanding of the solar system, its measurements and the calculations involved during the navigation of a shipping vessel. If you have an interest in celestial navigation, this free online course will help you learn about these procedures, as well as how to obtain the local hour angle and declination for the GMT.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The ‘Diploma in Celestial Navigation’ is a free online course that has been specially prepared to teach you about solar system measurements. This course will help you understand the calculations involved during celestial navigation to protect a shipping vessel and its crew. When learning about celestial navigation, you will gain an understanding of the difference between the perihelion and aphelion, and you will learn how to identify the celestial pole, solstices and equinoxes. You will learn about the two types of eclipses, solar and lunar, and the conditions required for each eclipse to occur. The daily motion of celestial bodies in relation to the Earth will also be covered. Do you know that the Earth revolves around the sun in an anti-clockwise direction and completes a revolution in approximately 365 days? Prepare to learn more interesting facts and common terminologies associated with the equatorial coordinate system.</p><p>Next, this course will teach you about the characteristics of sextant altitude and the horizon system of coordinates. Parallax, the apparent movement of objects when viewed from different positions, is an important part of navigation and will be covered in this course. A navigator should have adequate knowledge of the relationship between time and longitude. Therefore, the equation of time, as well as the step-by-step calculations of time used in celestial navigation, will be covered in this course. By taking this course, you will be able to determine the position fixing of a ship when the ship is out of sight of land. You will also be able to calculate the time of meridian altitude of the sun and deduce the latitude by the method of ex-meridian of the sun.</p><p>Furthermore, if you want to learn how to calculate a ship’s position by two simultaneous or staggered observations, then you need to complete this course. You will learn about the concept of imaginary latitude, as well as the longitude grid in position finding and coastal navigation features. You will uncover key related terms, such as line of position, meridian passage and Greenwich Mean Time. The course also answers frequently asked questions on the procedure for calculating latitude and plotting lines of position as well as how to obtain the local hour angle and declination for the GMT, including how to apply the intercept formula. Completing this course will help you gain specialized knowledge needed to find the GMT of meridian passage to the nearest second, as well as how to find the latitude and line of position. This course will be of great interest to students, researchers, and anyone with an interest in celestial navigation, also known as astronavigation. So, register for this course and start your next learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}