{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3346","title":"Diploma in Neurophysiology & Neuro-Instrumentation","totalEnrolled":"2,961","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to scan and record brain activity as it sends signals to the body with this free online neuroscience course.","description":"This free online course explores the human brain and its role in allowing you to think, feel, see, hear and speak as it controls motor function and shapes behaviour. Neurophysiology is the study of the central nervous system and its function. Neuro-instrumentation is the process of scanning, recording and interpreting brain activity. This neuroscience course takes a close look at the intricacies of this fascinating organ that makes us who we are.","courseOutcomes":["Identify the structural design of a ...","Indicate the function of axons and d...","Analyze synapses in neuronal network...","Define the ‘resting membrane potenti...","Identify the structural design of a neuron","Indicate the function of axons and dendrites","Analyze synapses in neuronal networks","Define the ‘resting membrane potential’","Describe how to perform EEGs","Define ‘action potentials’","Explain the function of ion channels in the cell membrane","State the function of transcranial direct current and transcranial magnetic stimulation","Outline the applications for electro-convulsive therapy","Define an ‘event-related potential’","Discuss the clinical application of different event-related potentials","Recall the process for manufacturing silicon wafers","Identify the structural design of a ...","Indicate the function of axons and d...","Analyze synapses in neuronal network...","Define the ‘resting membrane potenti...","Identify the structural design of a neuron","Indicate the function of axons and dendrites","Analyze synapses in neuronal networks","Define the ‘resting membrane potential’","Describe how to perform EEGs","Define ‘action potentials’","Explain the function of ion channels in the cell membrane","State the function of transcranial direct current and transcranial magnetic stimulation","Outline the applications for electro-convulsive therapy","Define an ‘event-related potential’","Discuss the clinical application of different event-related potentials","Recall the process for manufacturing silicon wafers"],"courseDescription":"<p>Neurophysiology helps doctors and researchers understand mental disorders, evaluate brain function and guide treatment for conditions such as seizures, sleep problems, depression and Parkinson's disease. Would you like to understand the link between the human brain and mental and physical disorders? This course maps this connection and teaches you the components and functions of the human central nervous system. We explain the technical science behind electroencephalograms (EEGs), electrical brain stimulation, event-related potentials and the manufacturing of electrodes and circuits used in neuroscience instruments. We begin by investigating the human central nervous system’s architecture, starting with the neuron. This means examining the neuron’s components, including axons and dendrites, and seeing how they extend to form neuronal circuits. We offer an intriguing close look at the neuron’s cell membrane and its ionic channels’ electric-chemical properties. Understanding the neuron’s cell membrane function is crucial in understanding how these nerve cells exchange information with each other via neuronal synapses and action potentials.</p><p>We continue our study of the central nervous system with attention to the cerebrum’s anatomical structure, the cerebellum and the spinal cord. We examine the functions of the cerebrum’s four lobes and the purpose of sulci (grooves) and gyri (folds) on the surface of the cerebrum. We go through the use of nanotechnology in manufacturing the primary tools used for EEG recordings, including voltage and patch clamps. We demonstrate how to place electrodes on the scalp to perform an EEG and break down the intricacies of resting membrane potential and the mechanics of action potentials. The course compares intracellular and extracellular recordings in measuring membrane potentials before moving on to neurobiology and axonology. These exciting fields show how neurons are both chemically and electrically stimulated and we demonstrate how to mathematically model synaptic potentials and action potentials so that they can provide a theoretical description of neuronal activity.</p><p>The course then moves on to brain stimulation techniques that can treat depression and chronic pain: transcranial direct current stimulation, transcranial magnetic stimulation and electro-convulsive therapy. They can help to control mental disorders such as dyslexia and schizophrenia and provide treatment for patients with Alzheimer's, Parkinson's and other brain diseases. Finally, we show you how to record event-related potentials or the brain’s voltage changes preceding specific visual, auditory or sensory stimuli to evaluate mental function. You will learn what different event-related potentials reveal about a patient's health and the equipment needed to record them. We conclude by studying the manufacture of chips, sensors and other electrical components used in electrophysiological recordings. Imagine those suffering from Alzeheimer’s or Parkinson’s regaining their faculties and physical capabilities or enhancing mental performance to increase an individual’s intelligence. That is the potential future of neuroscience. This course is complex, challenging and rewarding for anyone studying neuroscience or medical professionals interested in understanding neurophysiology and the instruments used to monitor, study and evaluate brain activity. This course also suits anyone with a curious mind who wants to know how it got that way.</p><a href=\"https://alison.com/resume/courses/3346\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3346\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Neurophysiology","description":"This module will discuss the architectural design of the central nervous system. Special attention is given to the structure of the human cerebral cortex and its cellular structure to understand brain functions. It will also provide a brief introduction to the fabrication of electrodes used in neuro instrumentation technology.","topics":["Introduction to Neurophysiology - Learning Outcomes","Cellular Structure of the Central Nervous System","Anatomical Structure of the Central Nervous System","Introduction to Neuro-Instrumentation","Introduction to Neurophysiology - Lesson Summary"]},{"name":"Module","details":"Fundamentals of Electrophysiology","description":"This module will discuss how neurons produce electronic signals and how scientists can read, record, and measure them using electro-instrumentation technology.","topics":["Fundamentals of Electrophysiology - Learning Outcomes","Electrophysiological Readings","Applications of MEMS Fabrication Technologies","The Electroencephalogram","Fundamentals of Electrophysiology - Lesson Summary"]},{"name":"Module","details":"Neuronal Biophysics","description":"This module will discuss the electrical properties of neurons, axons, and dendrites. It models the action potential using cable theory combined with computational models to generate synaptic potentials and action potentials. It also discusses the procedure to perform an EEG and the protocols of a cleanroom facility.","topics":["Neuronal Biophysics and EEG Procedures - Learning Outcomes","The Action Potential","The Biophysics of Axons and Dendrites","Experimental Setup for EEG Recording","Cleanroom Protocols","Neuronal Biophysics and EEG Procedures - Lesson Summary"]},{"name":"Module","details":"First Assessment - Diploma in Neurophysiology & Neuro-Instrumentation","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 1 to 3 from the following course: • Diploma in Neurophysiology & Neuro-Instrumentation","topics":["First Assessment"]},{"name":"Module","details":"Brain Stimulation and 3D Printing","description":"This module will discuss three different brain stimulation techniques: transcranial direct current stimulation, transcranial magnetic stimulation, and electro-convulsive therapy. It will introduce event-related potentials, and it will explain the use of 3D printing technology in manufacturing EGG electrodes.","topics":["Brain Stimulation and 3D Printing - Learning Outcomes","Brain Stimulation Techniques","Introduction to Even-Related Potentials","3D Printing","Brain Stimulation and 3D Printing - Lesson Summary"]},{"name":"Module","details":"Event-Related Potentials","description":"This module will discuss how different event-related potentials recorded from an EEG can diagnose mental disorders by monitoring visual, auditory, and somatosensory channels in the brain. It will also discuss how silicon wafers used to produce sensors, chips, and electrodes for EEGs, are manufactured.","topics":["Event-Related Potentials - Learning Outcomes","Understanding Event-Related Potentials","Silicon Wafer Processing Techniques","Basics of Silicon Dioxide","Event-Related Potentials - Lesson Summary"]},{"name":"Module","details":"Second Assessment - Diploma in Neurophysiology & Neuro-Instrumentation","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 4 to 5 from the following course: • Diploma in Neurophysiology & Neuro-Instrumentation","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Neurophysiology & Neuro-Instrumentation - Course Assessment"]}]}