{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2788","title":"Diploma In Ecology and Society","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the ecology of human societies, and human interaction with the environment.","description":"How the world is facing an ecological crisis is described in this free online course in ecology and society. Experts from around the world state that if humanity does not act to protect the natural environment, the result will be catastrophic for human society. This course is designed to raise awareness about these global issues while analyzing how societies interact with the environment at a social and cultural level.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This diploma course in Ecology and Society explains the need for society to work together to protect Earth’s fragile ecosystems. Unlike other species inhabiting the planet, human societies are not driven by instinct. Instead, human behaviour is learned as we interact with our environment. During this course, you will first learn about the environmental movement that flourished during the 1960s and which gave birth to modern-day environmentalism. It was this early movement that pushed world governments to start creating laws that protect the environment.</p><p><br>Next, you will learn about the meaning of ‘culture’ and you will be introduced to the concept of ‘cultural ecology’, which is the study of human adaptations to both social and physical environments. As you study how human societies and their cultural relationship with the environment has evolved throughout history, you will be introduced to the concept of ‘human ecology’, which emerged as scientists became more and more aware of the negative impact the activities of modern societies have on the environment.</p><p><br>You will be taught about ecological anthropology, a field of study that developed from the approach of cultural ecology, and provided a conceptual framework more suitable for scientific inquiry than the cultural-ecological approach. You will also learn about the concept of nature as you study the nature-culture divide, a debate that tries to determine if culture is a product of nature, or if nature is a construct of culture. Finally, you will learn about cosmology or the way native communities have conceptualized and interact with Nature in order to understand how modern societies can develop solutions that lead to a sustainable use of our natural resources. If you are passionate about the environment and are fervent in wanting to see a change, this course will interest you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}