{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3431","title":"Diploma in Modern Poetry Reading and Writing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course escorts you through the distinctive periods that define the shifting styles of modern poetry.","description":"This free online course explores the characteristics of modern poetry. What makes contemporary poetry unique? We take you through the varying poetic styles that set this era apart and the periods that divide verse from different stages of modernity. Come with us to discover what makes poetry Modernist or feminist as we examine verse from Britain, India and the United States that contains wisdom and beauty that is both timeless and fresh.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Poetry conveys a concentrated idea or tells a story, often using devices like rhyme and rhythm. Modernist poetry developed in the first half of the twentieth century from the tradition of lyrical expression and focused on personal imagination, consciousness and emotion - breaking from the past while using existing literary elements to create something new. We start with the beginnings of the genre with attention to giants like William Butler Yeats, T.S. Eliot, Wilfred Owens and Dylan Thomas. We combine analysis of their context with close reading of famous poems like Eliot’s ‘The Waste Land’ to uncover evolving techniques and deeper meanings. This skill is useful in many contexts beyond the classroom.</p><p>We then delve more deeply into American poetry connected to the exciting emerging spirit of Modernism. We trace the links between various poets’ context and their work, starting with Robert Frost, whose poems still echo across today’s popular cultural landscape. The course then covers Wallace Stevens and William Carlos Williams. Next, we investigate the rise of feminist poetry to understand its continued literary and social impact as ifluential writers like Maya Angelou and Sylvia Plath changed the way we construct gender.</p><p>Finally, the course probes the links between British and Indian poetry written in English. We examine the history surrounding these genres to appreciate how it informed modern verse. Post-1950 Britain saw the birth of different artistic movements based on location and diverse identities, which in turn affected Indian poets writing from the Sub-Continent. We study several Indian poets to establish their significant impact on global poetry. This course can help you understand modern poetry and the context in which it arose. We map the connections between modernity and its verse to let you develop your analytical skills while enjoying the beautiful words of talented writers. The ability to read text deeply is useful in most contexts and this course can hone both your skills and appreciation of the words that helped build the modern world.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}