{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3747","title":"Advanced Diploma in High School Physics","totalEnrolled":"3,552","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Designed for high school physics students, this course explains mass, force, motion, and energy in simple terms.","description":"Physics is the natural science that studies matter, its motion and behavior through space and time, and the related entities of energy and force. It is one of the most fundamental scientific disciplines, and its main goal is to understand how the universe behaves. By the end of this online course, you will have a strong grasp of the concepts of mass, force, motion, and energy. Registration and completion are completely free.","courseOutcomes":["Distinguish between fundamental and ...","Summarize the activity on the magnit...","Define equilibrium and discuss diffe...","Explain Kepler’s laws of planetary m...","Distinguish between fundamental and derived units","Summarize the activity on the magnitude of displacement","Define equilibrium and discuss different types of it","Explain Kepler’s laws of planetary motion","Explain different forms of energy and its transformation","Describe the mechanism of current conduction in metallic conductors","Discuss Faraday’s laws of electromagnetic induction","List examples of transverse and longitudinal waves","Distinguish between virtual and real images","Recall Bohr's model of an atom","Solve for the binding energy per nucleon","Distinguish between fundamental and ...","Summarize the activity on the magnit...","Define equilibrium and discuss diffe...","Explain Kepler’s laws of planetary m...","Distinguish between fundamental and derived units","Summarize the activity on the magnitude of displacement","Define equilibrium and discuss different types of it","Explain Kepler’s laws of planetary motion","Explain different forms of energy and its transformation","Describe the mechanism of current conduction in metallic conductors","Discuss Faraday’s laws of electromagnetic induction","List examples of transverse and longitudinal waves","Distinguish between virtual and real images","Recall Bohr's model of an atom","Solve for the binding energy per nucleon"],"courseDescription":"<p>Physics, a tremendous, eye-opening, and ever-changing science, requires you to have a solid knowledge of mathematics (including algebra), chemistry, and biology. It provides the foundation for natural sciences, as it explains the world around us. If you pay close attention to the world around you, you’ll constantly come up with questions like ‘How will I catch the ball?’ or ‘How far should I push this punching bag?’. These are physics-related questions. This course introduces you to the basic concepts of physics, the branch of science that primarily studies matter, energy, and their interactions. Physics contributes to technological infrastructure and physicists hypothesize relationships, design experiments, and complete tests to turn hypotheses into valid theories.</p><p>The course introduces you to the mechanics of physics. Units of measurement were among the earliest tools invented by humans. The definition, agreement, and practical use of units of measurement have played a crucial role in human endeavor from early ages to the present. Units of measurements are important because, without standardized units, it would be extremely difficult for scientists to express and compare measured values in a meaningful way. You will learn about unit conversions and the guidelines for good graphing techniques. Then examine ‘work’ and ‘energy’, which are significant in our everyday lives and scientific engagements. There are several examples of work that can be observed in our everyday life like a horse pulling a plow through to a student lifting a backpack full of books. By the end of this course, you should be able to identify and explain the different types of work and energy.</p><p>Next, you will be introduced to the concept of electromagnetism. Electricity and magnetism are separate yet interconnected phenomena associated with electromagnetic force. Together, they form the basis for electromagnetism, a key physics discipline. Have you ever experienced an electric shock while coming in contact with a household appliance? Why does that happen? By the end of this course, you will be able to differentiate between types of materials with the aid of examples. Everything we hear and see is based on the information our bodies take in. No single answer to the question “What is light?” satisfies the many contexts in which light is experienced, explored, and exploited. This course analyzes the different laws that govern how light interacts with matter and changes direction. So, register for this course now and begin your next learning journey today!</p><a href=\"https://alison.com/resume/courses/3747\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3747\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Mathematics of Physics","description":"To start, this module introduces you to the basics of mathematics of physics. The module also analyzes the units of measurement as well as vector vs. scalars. You will also learn about the components of vectors and errors in measurements.","topics":["The Mathematics of Physics - Learning Outcomes","The Mathematics of Physics - The Basics","Graphing in Physics","Components of Physics","The Mathematics of Physics - Lesson Summary"]},{"name":"Module","details":"The Study of Motion","description":"To start, this module introduces you to the basics of the study of motion. The module also analyzes the different types of acceleration and how to calculate it. You will also learn about the graphical analysis of motion and velocity-time graphs.","topics":["The Study of Motion - Learning Outcomes","Mechanics of Motion","Acceleration","Free Fall-Motion","Motion of Objects","The Study of Motion - Lesson Summary"]},{"name":"Module","details":"Newton's Laws and Forces","description":"To start, this module introduces you to Newton's laws of motion and their applications. The module also discusses the coefficient of friction and motion in a plane. You will also learn about vertical motion and horizontal motion.","topics":["Newton's Laws and Forces - Learning Outcomes","Introduction to Newton’s Laws and Forces","The Inclined Plane","Coefficient of Friction","Projectile Motion","Newton’s Laws and Forces - Lesson Summary"]},{"name":"Module","details":"Uniform Circular Motion","description":"To start, this module introduces you to Uniform Circular Motion and the laws of universal gravitation. The module also discusses Kepler's laws of planetary motion and the factors that affect the period of a simple pendulum. You will also learn about impulse and the different types of collisions.","topics":["Uniform Circular Motion - Learning Outcomes","Introduction to Uniform Circular Motion","Kepler's Three Laws of Planetary Motion","Introduction to Momentum","Conservation of Momentum Problems - Recoil/Kickback","Uniform Circular Motion - Lesson Summary"]},{"name":"Module","details":"Work, Power and Energy","description":"To start, this module introduces you to the work-energy theorem and the work done by a variable force. The module also discusses the law of conservation of mechanical energy with problems and conservation forces. You will also learn about the difference between conservative and non-conservative forces.","topics":["Work, Power and Energy - Learning Outcomes","Introduction to Work","Introduction to Power","Work/Energy Theorem","Work, Power and Energy - Lesson Summary"]},{"name":"Module","details":"Electrostatics","description":"To start, this module introduces you to electrostatics and Coulomb's law/The electric force The module also discusses grounding, conservation, and quantization of charge. You will also learn about vertical motion and horizontal motion. You will also learn about work done to move a charge in an electric field and Milliken’s oil drop experiment.","topics":["Electrostatics - Learning Outcomes","Introduction to Electrostatics","Conductor Vs Insulator","Introduction to Grounding","Work Done to Move a Charge","Electrostatics - Lesson Summary"]},{"name":"Module","details":"Diploma in High School Physics - First Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in High School Physics - First Assessment"]},{"name":"Module","details":"Circuits and Resistors","description":"To start, this module introduces you to circuits and currents. The module also discusses drawing schematic diagrams and Kirchoff's law of voltage. You will also learn about the different types of circuits.","topics":["Circuits and Resistors - Learning Outcomes","Introduction to Circuits","Simple Circuit","Kirchhoff’s Laws","Circuits and Resistors - Lesson Summary"]},{"name":"Module","details":"Magnetic Forces","description":"To start, this module introduces you to the concepts of Magnetism and Geomagnetism. The module also discusses Oersted’s laws and Faraday’s law of electromagnetic induction. You will also learn about the different types of generators and their advantages.","topics":["Magnetic Forces - Learning Outcomes","Introduction to Magnetism","Oersted’s Law","Calculating the Force on a Current","Faraday’s Law of Electromagnetic Induction","Magnetic Forces - Lesson Summary"]},{"name":"Module","details":"Mechanical Waves","description":"To start, this module introduces you to the basics of mechanical and electromagnetic waves. The module also analyzes the different types, applications, and differences between waves. You will also learn about the differences between diffraction and interference.","topics":["Mechanical Waves - Learning Outcomes","Introduction to Mechanical Waves","The Electromagnetic Spectrum","Speed of a Wave","Diffraction and Interference of Light","Sound Waves and Resonance","Mechanical Waves - Lesson Summary"]},{"name":"Module","details":"Introduction to Light","description":"To start, this module introduces you to the basics of light and reflections. The module also analyzes different laws that govern the ability of images to be formed by plane mirrors and the focal length of a mirror. You will also learn about spherical and chromatic aberration.","topics":["Introduction to Light - Learning Outcomes","Speed of Light","Snell's Law and Dispersion","Polarization","Real Vs Virtual Images","Focal Length of a Mirror","Spherical and Chromatic Aberration","Introduction to Light - Lesson Summary"]},{"name":"Module","details":"Modern Physics","description":"To start, this module introduces you to the basics of modern physics. The module also analyzes the laws of conservation of mass and energy as well as the fundamental forces of nature. You will also learn about the drawbacks of the Rutherford model of an atom and the binding energy of a nucleus.","topics":["Modern Physics - Learning Outcomes","Concepts of Modern Physics","Mass - Energy","Fundamental Forces of Nature","Thomson's Model of an Atom","Neutrons in an Atom","Electric Charges","Modern Physics - Lesson Summary"]},{"name":"Module","details":"Diploma in High School Physics - Second Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in High School Physics - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in High School Physics - Final Assessment"]}]}