{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3189","title":"Diploma in Terrestrial and Coastal Navigation","totalEnrolled":"1,343","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course outlines the importance of coastal navigation and aids used for estimating a vessel’s position.","description":"Since 2 000 B.C.E., sailors have been navigating the oceans. This course teaches you the planning and monitoring of marine passage using terrestrial and coastal navigation, which explains how to plan and fix a ship’s position at sea. We will outline the concept of the Earth’s axis passing through the north and south poles, the Earth’s equator, which maintains equidistant from the poles, and the polar axis from which you measure angle coordinates.","courseOutcomes":["Identify the equatorial and polar ra...","Discuss the application of a great c...","Explain the tilt of the Earth's axis...","Describe the measurement of a latitu...","Identify the equatorial and polar radii of the shape of the Earth","Discuss the application of a great circle and the small circle","Explain the tilt of the Earth's axis as well as the effect of the tilt","Describe the measurement of a latitude and parallels of latitude","Analyse the significance of the referential meridian and prime meridian","Explain the measure and significance of a geographical statute and nautical mile","Describe the Earth's axis of rotation as well as the process of location directions","Explain the working of a magnetic compass for navigation","Explain the significance and application of position lines and positions","Outline the various methods of plotting positions on a chart","Identify the equatorial and polar ra...","Discuss the application of a great c...","Explain the tilt of the Earth's axis...","Describe the measurement of a latitu...","Identify the equatorial and polar radii of the shape of the Earth","Discuss the application of a great circle and the small circle","Explain the tilt of the Earth's axis as well as the effect of the tilt","Describe the measurement of a latitude and parallels of latitude","Analyse the significance of the referential meridian and prime meridian","Explain the measure and significance of a geographical statute and nautical mile","Describe the Earth's axis of rotation as well as the process of location directions","Explain the working of a magnetic compass for navigation","Explain the significance and application of position lines and positions","Outline the various methods of plotting positions on a chart"],"courseDescription":"<p>Pythagoras first proposed that the Earth’s shape was spherical and Aristotle confirmed this a few centuries later. Aristotle was credited with being the first person to try and calculate the size of the Earth by determining its circumference. This diploma course in terrestrial and coastal navigation will teach you how these great philosophers have helped forge the way for how we navigate today.&nbsp; We explain how you can draw ‘the great circle’ on the surface of a sphere. You can form the spherical triangle on a sphere by using the arcs of three great circles. Understand that planning and monitoring a sea passage uses terrestrial and coastal navigation. We will explain various aids for fixing a vessel’s position or estimating the vessel’s position. We will introduce you to the concept of the Earth axis, an imaginary line that connects the poles of a body. Learn about the equator that divides the Earth into a northern and southern hemisphere. The prime meridian and its anti-meridian form a great circle and divide the world into the eastern and western halves. Discover the format of expressing longitude coordinates, the concept of the geographical, statute and the nautical mile, the idea of the knot, cable and datum.&nbsp;</p><p>The course then describes the nautical publications and how to gather important information required during sailing, especially terrestrial coordinates features. Examine how a navigator uses the nautical chart to plot courses and review daily works. Nautical charts are essential for marine navigation, the use of the title block, datum and soundings. Study the difference between the two latitudes and learn how to measure the meridional parts of a given latitude. We summarise the natural scale and use it to determine the relationship between a given distance on the chart and the Earth. Recognise the symbols and abbreviations that can be used on charts and consciously avoid charted dangers during passage planning. Deduce how you can group the symbols and abbreviations under the required headings. You will learn about the features of the notice to mariners, light list, tide and current tables and the coast pilots. We will also cover the essential nautical publications of the United States and the significant admiralty nautical publications.</p><p>Become familiar with the Earth’s rotation and how you can use the development of the gyrocompass for marine navigation. You will learn about the directions on the compass card and the gyro error and see how the magnetic compass can be fitted on ships. Grasp the application and significance of position lines and master the various plotting positions on a chart, the source of errors in position lines and position fixes. This course will teach you how to use the horizontal sextant angles in position fixing on a chart. We will uncover the primary position fixing method, position accuracy and the celestial fix before we explain how navigators plot a fix consisting of the intersection of two or more distances. You will also learn about the fix by distance races, visual fixes and how to use a terrestrial charted object’s vertical sextant angle (VSA) to get range and position. This course will greatly appeal to students, researchers and anyone interested in marine navigation. So enrol for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3189\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3189\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Shape of the Earth","description":"This module will teach you about the shape of the earth, great circle, small circle, spherical triangle, as well as the earth axis. In this module, you will learn about the poles, equator, meridians, as well as the latitude and parallels of the latitude.","topics":["Shape of the Earth - Learning Outcomes","Introduction to Shape of the Earth","Earth Axis","Prime Meridian","Cable and Knot","Shape of the Earth - Lesson Summary"]},{"name":"Module","details":"Nautical Charts","description":"This module will teach you about the nautical charts, Mercator charts, as well as Lambert conformal charts. In this module, you will learn about the meridional part, the natural scale, as well as how a nautical chart can be used as a graphical two-dimensional representation of the maritime area.","topics":["Nautical Charts - Learning Outcomes","Introduction to Nautical Chart","Meridional Parts and Natural Scale","Symbols and Abbreviations Used on Admiralty Charts","Lights and Other Publications","Nautical Charts - Lesson Summary"]},{"name":"Module","details":"Diploma in Terrestrial and Coastal Navigation - First Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Terrestrial and Coastal Navigation - First Assessment"]},{"name":"Module","details":"Axis of Rotation","description":"This module will teach you about the axis of rotation, direction by gyrocompass, as well as the magnetic compass and lines of position fixes. In this module, you will also learn about the method of positions fixes, position lines and how to plot positions on the chart.","topics":["Axis of Rotation - Learning Outcomes","Rotation of the Earth","Lines of Position Fixes","Method of Position Fixing","Vertical and Horizontal Sextant Angles","True Course and Parallel Sailing","Use of Traverse Table","Axis of Rotation - Lesson Summary"]},{"name":"Module","details":"Use of Charts","description":"This module will teach you about the order, procedure of allowing, counteracting current, and leeway. In this module, you will learn about the cause and effect of tidal stream, the concept of DR and FIX for finding out the actual set. The rate of current, as well as the types of lights, will also be introduced.","topics":["Use of Charts - Learning Outcomes","Chart Work","Tidal Stream and Geographical Range","Last Sighting Distances","IALA Buoyage System","Passage Planning","Execution and Monitoring","Use of Charts - Lesson Summary"]},{"name":"Module","details":"Diploma in Terrestrial and Coastal Navigation - Second Assessment","description":"You need to score 80% or more to pass.","topics":["Diploma in Terrestrial and Coastal Navigation - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Terrestrial and Coastal Navigation - Course Assessment"]}]}