{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3748","title":"Advanced Diploma in High School Chemistry","totalEnrolled":"3,564","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers scientific measurements plus organic and nuclear chemistry for high school students.","description":"This is a well-explained and summarized course on modern chemistry that is highly relevant to high school students, especially those preparing to take exams, as well as teachers looking to refresh their fundamental knowledge. It starts with the foundations of scientific measurements and covers nuclear and organic chemistry. Registration, subscription and completion are all free.","courseOutcomes":["Evaluate the dimensional analysis us...","Compute temperature measurements bet...","Derive the empirical formula of chem...","Describe how matter can transition b...","Evaluate the dimensional analysis used in converting between units within the metric system","Compute temperature measurements between various temperature scales","Derive the empirical formula of chemical compounds","Describe how matter can transition between the different physical states","Explain the change in the volume or temperature of gas using Charles’s law","Outline the pressure, volume, moles, or temperature of a gas using the ideal gas law","Relate intermolecular forces to vapour, pressure, boiling point, viscosity, and surface tension","Explain the concepts surrounding thermal energy","Evaluate the dimensional analysis us...","Compute temperature measurements bet...","Derive the empirical formula of chem...","Describe how matter can transition b...","Evaluate the dimensional analysis used in converting between units within the metric system","Compute temperature measurements between various temperature scales","Derive the empirical formula of chemical compounds","Describe how matter can transition between the different physical states","Explain the change in the volume or temperature of gas using Charles’s law","Outline the pressure, volume, moles, or temperature of a gas using the ideal gas law","Relate intermolecular forces to vapour, pressure, boiling point, viscosity, and surface tension","Explain the concepts surrounding thermal energy"],"courseDescription":"<p>This is a detailed online diploma in high school chemistry. It is specifically designed for science teachers and students to cover chemistry concepts that are required for high school exams. Teachers that enroll in this diploma will be able to refresh their knowledge. Students will gain exposure to key elements of scientific quantities along with their basic units. They will also learn about different solutions to problems requiring both calculations and conversions of quantities alongside their units, in line with standardized nomenclature that is globally recognized. Other standardized aspects examined include the rules for writing and balancing all types of equations. Some reactions in chemistry are redox, organic, and neutralization - a combined understanding of these concepts improves your chances of passing your chemistry exam.</p><p>Chemistry demands good analytical skills to make basic calculations related to volume, moles, units, and conversions. Worked examples show how different methods can be used to solve chemistry problems. These examples are carefully chosen to keep up to date with the many advances in chemistry, especially those relevant to high school students. Learners are expected to recall the easy steps outlined in solving the general, organic, and nuclear problems analyzed in this course. Upon successful completion of the required modules, you will also be conversant with the identification and characterization of organic compounds along with their functional groups.</p><p>Have you ever thought about how energy surrounds us and our activities? This and other questions are clearly answered by the material. You will learn about mass conservation together with comparisons between physical and chemical properties of substances. This will help build a foundation for the evaluation of laws covering the different states of matter, including Avogadro’s law, Boyle’s law, and Dalton’s law. The course also analyzes atomic and subatomic particles that can only be seen with the aid of complex equipment. This is done in order to allow learners to understand the constituents of atoms and molecules. You will also evaluate how to make volumetric analyses using calculations for neutralization reactions. Start your learning journey into the world of chemistry today!</p><a href=\"https://alison.com/resume/courses/3748\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3748\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Scientific Measurements","description":"To start, this module introduces you to aspects of making scientific measurements with accuracy. You will also learn about identifying and performing correct calculations covering significant figures along with uncertainties and precision.","topics":["Introduction to Scientific Measurements - Learning Outcomes","Uncertainty, Accuracy, and Precision","Significant Figures","Scientific Notation and Dimensional Analysis","Introduction to Scientific Measurements - Lesson Summary"]},{"name":"Module","details":"Properties of Matter and Atoms","description":"To start, this module introduces you to the basic properties of matter covering concepts around their different states and their transitions. You will also learn about atoms and various concepts surrounding definitions around their structure, components, and energy.","topics":["Properties of Matter and Atoms - Learning Outcomes","States of Matter and the Elements","Chemical Formulas and Conservation of Mass","Energy and Atoms","Atomic Notation and the Bohr Model","Properties of Matter and Atoms - Lesson Summary"]},{"name":"Module","details":"Periodic Tables and Elements","description":"To start, this module introduces you to the categorization of elements into different groups and periods of the periodic table. You will also learn about aspects of various atoms, electrons, and ionic charges as properties of elements in the periodic table.","topics":["Periodic Tables and Elements - Learning Outcomes","Periodic Table and Trends","Metallic Character and Ionization Energy","Properties of Elements and Valency","Electron Configuration and Ionic Charges","Periodic Tables and Elements - Lesson Summary"]},{"name":"Module","details":"Writing Formulas and Chemical Equations","description":"To start, this module introduces various aspects of writing chemical formulas together with their ionic components. Also, you will learn about writing various chemical reaction equations with the rules involved for the different compounds involved.","topics":["Writing Formulas and Chemical Equations - Learning Outcomes","Monoatomic and Polyatomic Ions","Writing Chemical Formulas","Chemical Reaction Equations","Writing Formulas and Chemical Equations - Lesson Summary"]},{"name":"Module","details":"Mole Concept and Stoichiometry","description":"To start, this module introduces concepts surrounding Avogadro's number and its function in calculating aspects useful to atoms and moles in chemical equations. You will also learn about both molar mass and molar volume together with formula calculations.","topics":["Mole Concept and Stoichiometry- Learning Outcomes","Avogadro's Number, Molar Mass, and Molar Volume","Percent Composition, Empirical Formula, and Molecular Formula","Stoichiometry and Mass - Volume Calculations","Mole Concept and Stoichiometry- Lesson Summary"]},{"name":"Module","details":"Diploma in High School Chemistry - First Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in High School Chemistry - First Assessment"]},{"name":"Module","details":"Properties of Gases and Gas Laws","description":"To start, this module introduces you to the properties unique to gases covering aspects of pressure together with variables that affect the pressure of gases. You will also learn about different gas laws related to the volume, temperature, pressure, and number of moles of gas.","topics":["Properties of Gases and Gas Laws - Learning Outcomes","Introduction to Properties of Gases","Gas Laws in Chemistry I","Gas Laws in Chemistry II","Properties of Gases and Gas Laws - Lesson Summary"]},{"name":"Module","details":"Properties of Liquids and Solids","description":"To start, this module introduces you to the various properties of liquids and solids covering the intermolecular forces of different states of matter around us. You will also learn about aspects of liquids related to vapour pressure, boiling point, and viscosity.","topics":["Properties of Liquids and Solids - Learning Outcomes","Intermolecular Forces in Liquids","Properties of Liquids","Properties of Solids","Properties of Liquids and Solids - Lesson Summary"]},{"name":"Module","details":"Chemical Bonding","description":"To start, this module introduces you to the different types of chemical bonds covering ionic bonds, covalent bonds, and nonpolar bonds. You will also learn about the shapes of molecules and their effects on solids and liquids. Also, you will learn about aspects of solubility and concentration.","topics":["Chemical Bonding - Learning Outcomes","Introduction to Chemical Bonding","Shapes of Molecules and Solutions","The Process of Dissolving and Solubility","Chemical Bonding - Lesson Summary"]},{"name":"Module","details":"Acids, Bases, and Salts","description":"To start, this module introduces you to various aspects of general chemistry related to acids, bases, and salts. You will also learn about the concepts surrounding acid-base titrations and chemical equilibrium. You will also learn about the workings of equilibrium shifts.","topics":["Acids, Bases, and Salts - Learning Outcomes","Properties of Acids, Bases, and Salts","Acid-Base Indictors and Titration","Chemical Equilibrium","Acids, Bases, and Salts - Lesson Summary"]},{"name":"Module","details":"Oxidation, Nuclear Reactions, and Organic Chemistry","description":"To start, this module introduces you to computations and problems of balancing redox equations, oxidation numbers, alongside predicting the spontaneity of redox reactions. You will also learn about nuclear reactions and basic aspects of organic chemistry.","topics":["Oxidation, Nuclear, and Organic Chemistry - Learning Outcomes","Oxidation and Reduction","Nuclear Reactions","Introduction to Organic Chemistry","Oxidation, Nuclear, and Organic Chemistry - Lesson Summary"]},{"name":"Module","details":"Diploma in High School Chemistry - Second Assessment","description":"In order to pass this assessment, you will need to score 80 percent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in High School Chemistry - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in High School Chemistry - Final Assessment"]}]}