{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2830","title":"Diploma in Ethnography","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the processes, theories and methods of ethnography in this free online course.","description":"Ethnography is the academic study of peoples and cultures with regard to their various customs, habits and differences. It is a method of qualitative research where the subject is the interactions between people and their social context. In this free online course, you will learn about the ethnographic process, research and concepts. You will also consider the challenges and methods used in ethnography to gather data for research.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Delve into ethnography and methods of qualitative research in this free online course. The material takes you through different aspects in the field of ethnography, starting with important terminology. You will learn about ‘the other’ and differing notions of reality, ethnographic processes and the ‘research question’. This explores how the specific questions a researcher asks and their wording can impact the rest of the study. Then, look at case studies that show the ethnographic process in action in the real world. Next, you will begin understanding challenges and observations in ethnography. As it deals with people and their interactions, and tries to understand their cultures and processes, the research method is necessarily complicated because of the social and cultural differences between the researcher and the participants in the study. The course explores these difficulties and looks at how the researcher can gain access while still being respectful of the subjects. You will be taught about maintaining trust and building rapport in an ethical way, and look at the idea of ‘immersion’ to gain a better understanding of being both an insider and an outsider in your research, whether it is overt or covert. Next, consider the use of ‘observation’ to gather data: different types of observation methods and what is necessary to observe in order to answer the research question. You will learn about ‘participation observation’, which entails learning about a phenomenon while engaging with it, and the different degrees of using this method.&nbsp;&nbsp;</p><p>Then, you will learn about designing an ethnographic interview and using visual ethnography. The course covers the different forms of interviews that can be used in ethnography as well as their characteristics. Importantly, you will learn how to structure these interviews in order to guide the core discussion so that fundamental information that aids the research question is gleaned. You will also learn that in doing these interviews, the researcher needs to create space for the participant and researcher to be equal. Continue onto the visual ethnographic method (or using photography, film and digital media) and analyze the part ‘reflexivity’ plays in this or how you need to examine and consciously acknowledge the assumptions and preconceptions that you as a researcher bring to the study and therefore may shape its outcome.</p><p>Finally, the material recaps the content of the different modules and shows how ethnographic studies are used in multiple disciplines such as design and education, to create new approaches in their respective fields. This thorough course introduces you to the world of ethnography and shows you how to use the ethnographic process to research and study phenomena around people and their culture.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}