{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2058","title":"Diploma in Mathematics","totalEnrolled":"48,862","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"We take you through important mathematical concepts step by step in this free online mathematics diploma course.","description":"Enhance and refresh your mathematical knowledge with this diploma course. We cover a wide range of topics, including algebra, statistics, calculus, geometry and trigonometry. We break down these complex ideas and go through them step by step with exercises and examples to prepare you for many professional fields. This course widens your career options as mathematics is essential in a world that is constantly moving forward with new technologies.","courseOutcomes":["Solve equations with expressions and...","Use algebra to solve equations, incl...","Solve equations with inequalities...","Explain how to work with complex num...","Solve equations with expressions and formulas","Use algebra to solve equations, including quadratic equations","Solve equations with inequalities","Explain how to work with complex numbers","Work with coordinate and synthetic geometry","Solve equations using trigonometry, including sines, cosines and tangents","Describe how to work with number systems, including indices and arithmetic series","Calculate percentages and depreciation","Calculate the length, area or volume of a shape or segment","Discuss how to solve equations with normal and binomial distributions","Employ statistical methods, including important sampling approaches","Work with functions to plot graphs","Solve equations with expressions and...","Use algebra to solve equations, incl...","Solve equations with inequalities...","Explain how to work with complex num...","Solve equations with expressions and formulas","Use algebra to solve equations, including quadratic equations","Solve equations with inequalities","Explain how to work with complex numbers","Work with coordinate and synthetic geometry","Solve equations using trigonometry, including sines, cosines and tangents","Describe how to work with number systems, including indices and arithmetic series","Calculate percentages and depreciation","Calculate the length, area or volume of a shape or segment","Discuss how to solve equations with normal and binomial distributions","Employ statistical methods, including important sampling approaches","Work with functions to plot graphs"],"courseDescription":"<p>This diploma course expands your mathematical knowledge and explains how to work with and solve expressions and formulas to solve quadratic and simultaneous equations. We also show you how to work with inequalities and complex numbers.</p><p>The course then moves on to synthetic (or ‘pure’) geometry and examines shapes before delving into coordinate geometry to explain how to work with parallel and perpendicular lines, circles and graphs. We also study trigonometry before demonstrating how to work with and solve number systems. The course then covers percentages, simple and compound interest and how to calculate the length, area or volume of a shape or segment. We break down how to work out the probability of simple and compound events and work with normal and binomial distributions. We lay out important statistical methods and concepts, including sampling methods, correlation and regression and stem and leaf diagrams.</p><p>Finally, the course teaches you how to work with functions to plot graphs, including their quadratic, cubic and exponential versions. This includes a detailed analysis of differentiation as we explain how to apply the ‘chain’, ‘product’ and ‘quotient’ rules. We also explore integration, covering topics like trigonometric functions and exponentials. This diploma course suits anyone who wants to study mathematical concepts, either for the first time or as a refresher that can help even seasoned professionals stay sharp.</p><a href=\"https://alison.com/resume/courses/2058\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2058\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Algebra","description":"This first module looks at some basic expressions and formulas. It takes the learner through Inequalities and then moves onto complex numbers. Within each topic are a number of videos which will cover various sub-topics, such as Argand diagrams for complex numbers.","topics":["Algebra - Learning Outcomes","Expressions and Formulas","Solving Equations","Inequalities","Complex Numbers","Algebra - Lesson Summary"]},{"name":"Module","details":"Geometry and Trigonometry","description":"In this module you will learn how to work with and solve synthetic geometry including shapes, coordinate geometry including parallel and perpendicular lines, circles and graphs. You will also learn how to work with trigonometry including sines, cosines and tangents.","topics":["Geometry and Trigonometry - Learning Outcomes","Synthetic Geometry","Coordinate Geometry","Trigonometry","Geometry and Trigonometry - Lesson Summary"]},{"name":"Module","details":"Numbers and Shapes","description":"In this module you will learn how to work with and solve number systems including indices, arithmetic series and geometric series; use arithmetic to work with percentages, simple interest, compund interest and depreciation; and how to calculate the length, area or volume of a shape or segment.","topics":["Numbers and Shapes - Learning Outcomes","Number Systems","Arithmetic","Length - Area - Volume","Numbers and Shapes - Lesson Summary"]},{"name":"Module","details":"Diploma in Mathematics - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mathematics - First Assessment"]},{"name":"Module","details":"Probability and Statistics","description":"In this module you will learn how to work out the probability of simple and compound events, and work with normal distributions and binomial distributions. The topic also introduces you to Bernoulli trials and Bayes' Theorem. You will also learn how to work with statistical methods including sampling methods, correlation and regression, stem and leaf diagrams.","topics":["Probability and Statistics - Learning Outcomes","Counting and Probability","Statistics","Probability and Statistics - Lesson Summary"]},{"name":"Module","details":"Functions and Calculus","description":"In this module you will learn how to work with functions to plot graphs, including quadratic graphs, cubic graphs and exponential graphs. This topic also review differentiation in detail including the Chain Rule, Product Rule and Quotient Rule. You will also learn about integration, covering areas such as trigonometric functions and exponentials.","topics":["Functions and Calculus - Learning Outcomes","Functions","Calculus - Differentiation","Calculus - Integration","Functions and Calculus - Lesson Summary"]},{"name":"Module","details":"Diploma in Mathematics - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mathematics - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Mathematics - Final Assessment"]}]}