{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1244","title":"Diploma in Legal Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Using case-studies and real life examples, this free course will give you a strong understanding of the legal system.","description":"This free online course in Legal Studies will provide you with simple definitions and clear explanations of important legal concepts, different types of laws, and how laws are created. The legal system is an integral part of any society, built to protect its citizens and maintain their rights. By taking this free course, your legal system will become clear and accessible to you. That is important knowledge, for life.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This legal studies degree explains the adversary trial system, how legal procedures operate, and much more. You will gain an understanding of the legal profession with detailed explanations of the roles that are played by solicitors, barristers, judges, the jury, and magistrates. In addition, the Diploma in Legal Studies offers resources and activities to understand how law is created in the UK, from common law to the law of negligence.<br><br>As you progress through the lessons, you will learn the characteristics of effective laws, the difference between civil and criminal law, the different aspects of law-making within courts, the relationship between the various law-making bodies, and the methods used to change laws including the reasons for such changes. You will also understand the role of a judge in law-making and learn about the adversary trial system, court hierarchy, the jury system, and civil and criminal procedures.<br><br>This course will be of great interest to anyone studying law or those who would like to have a better understanding of the legal system. It will also be useful as a resource for educators. There is a saying: “the law was made for one thing alone, for the exploitation of those who don't understand it.” Let’s not fall victim to this. Check out the course, and gain an understanding of your legal system today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}