{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4589","title":"Diploma in Outcome-based Education and Academic Quality Assurance","totalEnrolled":"6,518","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the fundamentals of outcome-based education and academic quality assurance with this free online course.","description":"Are you searching for a new way to enhance your teaching skills and improve your students' learning outcomes? This course will teach you how to implement outcome-based education and quality assurance in your educational institution. You will learn new methods and strategies to prepare you for world-class excellence in teaching. We provide an overview of eLearning and how you can guarantee quality assurance with this recent educational trend.","courseOutcomes":["Distinguish between the traditional ...","Describe how to develop students’ le...","Explain the principles of quality as...","Outline the quality assurance requir...","Distinguish between the traditional teacher-centred education and a student-centred education","Describe how to develop students’ learning outcomes","Explain the principles of quality assurance in education","Outline the quality assurance requirements for effective communication between the teachers and students","Discuss ISO 9001 quality management systems for education","Evaluate the challenges of quality education at the institution and state levels","Distinguish between the traditional ...","Describe how to develop students’ le...","Explain the principles of quality as...","Outline the quality assurance requir...","Distinguish between the traditional teacher-centred education and a student-centred education","Describe how to develop students’ learning outcomes","Explain the principles of quality assurance in education","Outline the quality assurance requirements for effective communication between the teachers and students","Discuss ISO 9001 quality management systems for education","Evaluate the challenges of quality education at the institution and state levels"],"courseDescription":"<p>Twenty-first-century schools, colleges and universities in many countries and institutions are moving from the traditional teacher-centred to more student-centred classrooms that focus on learning outcomes. Dr Kamran Moosa is the instructor for this course. He is the Chief Executive of Pakistan’s Institute of Quality (PIQC) and an experienced researcher and professor who has authored many publications and courses. This online course aims at helping teachers, instructors and administrators of educational institutions to improve the quality of their teaching methods and strategies to achieve outstanding learning outcomes.</p><p>The course explains the fundamentals of outcome-based education, its meaning, benefits and drawbacks. Explore Bloom’s Taxonomy, one of the most prevalent learning frameworks used worldwide. Research other learning models and taxonomies such as the SOLO taxonomy, the Kirkpatrick Model of training evaluation and the multiple intelligences and constructive alignment approach. We will give you guidelines on developing educational objectives, particularly student learning outcomes.</p><p>You will then come to appreciate the definitions and terminologies used in the quality assurance methods used in education. This section will outline the good practices in teaching quality assurance, curriculum, exams and assessments, student-teacher communication and so on. After that, you will explore commonly used global accreditation models for both school and university levels. We take you step-by-step through implementing quality assurance and outcome-based education in schools, colleges and universities. We will provide tips on improving educational leadership and meeting the everyday challenges of any educational transformation. This course will help you learn unique teaching methods and approaches to prepare you for world-class distinction. Take advantage of this opportunity and enrol today.</p><a href=\"https://alison.com/resume/courses/4589\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4589\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Outcome Based Education","description":"This module gives you an introduction to the course and addresses the fundamentals of outcome-based education. You will learn the benefits, drawbacks, and countries adopting the system. You will also explore Bloom's taxonomy and its three main domains. Also, you will be shown the structure and practical example of the SOLO taxonomy.","topics":["Outcome Based Education - Learning Outcomes","Fundamentals of Outcome Based Education (OBE)","Bloom's Taxonomy: The 3 Domains","SOLO Taxonomy","Outcome Based Education - Lesson Summary"]},{"name":"Module","details":"Other Training Models and Learning Outcomes","description":"This module will teach you the Kirkpatrick training and evaluation model, which is used to evaluate the effectiveness of training programs. You will also learn about Howard Gardner's multiple intelligence theory and the constructive alignment theory. Guidelines on writing students learning outcomes and what they should contain will be provided.","topics":["Other Training Models and Learning Outcomes - Learning Outcomes","Kirkpatrick Training Evaluation Model","Multiple Intelligences (Howard Gardner)","Constructive Alignment","Students Learning Outcomes (SLOs)","Other Training Models and Learning Outcomes - Lesson Summary"]},{"name":"Module","details":"Diploma in Outcome Based Education and Academic Quality Assurance - First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 1 - 2 of the course. You must score 80% or more to pass this assessment.","topics":["Diploma in Outcome Based Education and Academic Quality Assurance - First Assessment"]},{"name":"Module","details":"Quality Assurance in Education","description":"In this module, you will be introduced to the fundamentals of quality assurance in education. You will learn about quality assurance in teaching, curriculums, exams and assessments, student-teacher communication, etc. You will also be provided with common issues and terminologies in quality assurance.","topics":["Quality Assurance in Education - Learning Outcomes","Fundamentals of Quality Assurance in Education","Quality Assurance in Teaching","Quality Assurance in Curriculum","Quality Assurance in Exams & Assessments","Quality Assurance in Student-Teacher Communication","Quality Assurance in Research","Quality Assurance in Students Affairs & Services","Quality Assurance in Education - Lesson Summary"]},{"name":"Module","details":"Accreditation and Online Education","description":"This module will address the issues of educational accreditation and will provide you with some global accreditation bodies. You will also learn how to implement OBE and QA in schools, colleges and universities. Quality assurance in online education, educational leadership, and meeting the challenges of educational quality will be outlined.","topics":["Accreditation and Online Education - Learning Outcomes","Accreditation","OBE & QA Implementation","Quality Assurance in Online Education","Educational Leadership","Meeting Challenges of Educational Quality","Accreditation and Online Education - Lesson Summary"]},{"name":"Module","details":"Diploma in Outcome Based Education and Academic Quality Assurance - Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 4 - 5 of the course. You must score 80% or more to pass this assessment.","topics":["Diploma in Outcome Based Education and Academic Quality Assurance - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Outcome Based Education and Academic Quality Assurance - Course Assessment"]}]}