{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1521","title":"Diploma in Sociology","totalEnrolled":"14,172","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how society and culture combine to create the human world around us in this free online sociology diploma course.","description":"This diploma course lays out the important concepts and methods of sociology to explain how humans organize themselves into large groups. The study of sociology is crucial for planning and understanding communities to effectively manage their problems. We establish that society is a complex phenomenon with multiple interacting elements and show you how to use sociology to understand them. Sign up to see the world around you with new eyes","courseOutcomes":["Explain concepts central to sociolog...","Discuss the role of social control w...","Compare race, ethnicity and minority...","Define ‘gender identity’...","Explain concepts central to sociology and describe its three main theories","Discuss the role of social control within culture","Compare race, ethnicity and minority groups","Define ‘gender identity’","Outline the social impact of changing family structures","Break down types of economic systems and their historical development","Explain concepts central to sociolog...","Discuss the role of social control w...","Compare race, ethnicity and minority...","Define ‘gender identity’...","Explain concepts central to sociology and describe its three main theories","Discuss the role of social control within culture","Compare race, ethnicity and minority groups","Define ‘gender identity’","Outline the social impact of changing family structures","Break down types of economic systems and their historical development"],"courseDescription":"<p>This diploma course introduces you to sociology and provides an overview of culture. We then examine the evolution of societies, particularly in the industrial and post-industrial era. We establish the importance of socialization and outline the problems people face if they do not adapt to their social context. There are various groups and subgroups within societies, and we study various examples and their interaction, including familial or political factions.</p><p>Race and ethnicity are among the most common markers of inequality globally. This course investigates the roles and behaviours of both dominant and subordinate groups to demonstrate how stereotyping perpetuates discrimination. We discuss the contrasting role and impact of gender, sex and educational inequalities on individuals in different contexts. We also track the roles that family, government, politics and religion have on society. Finally, the course takes you through the main research methods and techniques required to conduct sociological research.</p><p>Sociology can be fascinating and explains how people fit into their world by tracing how others perceive them. It also challenges people to see their social landscape in a more complex and interconnected way, which can help them navigate the world much more effectively and thoughtfully. This diploma course can also open up a wide range of career opportunities in companies and organizations around the world as it heightens your ability to understand those around you.</p><a href=\"https://alison.com/resume/courses/1521\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1521\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}