{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1690","title":"Diploma in Outdoor and Physical Education Studies","totalEnrolled":"9,160","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This online physical education course will help you launch a career in adventure activities, health, and fitness.","description":"This free online Outdoor and Physical Education Studies course covers important subjects such as coaching and training, physical fitness, outdoor activities, and adventure, as well as basic physiology. Working in the great outdoors is a wonderful opportunity. With this course, you will gain a comprehensive understanding of key topics in outdoor adventure and physical education which will open the doors to a fantastic and healthy career.","courseOutcomes":["Describe the different types of adve...","Explain about historical adventures ...","List the high, medium and low access...","Explain the importance of safety in ...","Describe the different types of adventure, the degree of difficulty, risks involved and skills required","Explain about historical adventures and their motivation","List the high, medium and low accessibility of different adventure sports","Explain the importance of safety in adventure","Describe basic muscle physiology, muscle groups, the heart, energy systems, converting food to energy, principles of training and training methods","Explain elements of sports psychology, such as the limits to performance and sporting injuries","Explain about different groups in society, influences on physical education, intrinsic/extrinsic influences on fitness, and socio-cultural considerations","Describe the different types of adve...","Explain about historical adventures ...","List the high, medium and low access...","Explain the importance of safety in ...","Describe the different types of adventure, the degree of difficulty, risks involved and skills required","Explain about historical adventures and their motivation","List the high, medium and low accessibility of different adventure sports","Explain the importance of safety in adventure","Describe basic muscle physiology, muscle groups, the heart, energy systems, converting food to energy, principles of training and training methods","Explain elements of sports psychology, such as the limits to performance and sporting injuries","Explain about different groups in society, influences on physical education, intrinsic/extrinsic influences on fitness, and socio-cultural considerations"],"courseDescription":"<p>This free online physical education course will give you an introduction to outdoor adventure activities and cover their main characteristics, types, and impact on the environment. You will learn what motivates people to go on an adventure, look at examples of adventure, and study adventure safety, accessibility, timing, and location. The course will also cover grading, guidebooks, adventure as a commodity, outdoor equipment, and land management.<br><br>Next, you will study basic muscle physiology for physical education, the heart, and the energy systems as well as how to convert food to energy. The course will also cover the principles of training, training methods, oxygen uptake, fatigue, and recovery. You will also study coaching and fitness, legal and illegal ergogenic aids, sports psychology, and sporting injuries. Finally, the course will cover the relationship between physical activity and society.<br><br>They say that if we were meant to stay in one place, then we'd have roots instead of feet. This course is ideal for anyone interested in making a career out of their interest in outdoor activities and health and fitness. It is also valuable for anyone who might like to organise some outdoor events for their personal and social life. Have a look at the course today, and find out where it takes you.</p><a href=\"https://alison.com/resume/courses/1690\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1690\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Adventure Activities","description":"In this module, you will learn about the meaning of adventure, key elements and characteristics of adventures. You will also learn about history and motivation behind adventures, exploration, experimentation, aspects of confidence, danger under control, competence in an adventure and how to determine the dangers and risks of embarking on an adventure course.","topics":["Adventure Activities - Learning Outcomes","The Meaning of Adventure","Characteristics of Adventures","Motivation for Adventures","Safety in Adventure","Different Types of Adventure","Grading And Guidebooks","Adventure Activities - Lesson Summary"]},{"name":"Module","details":"Land Use And Recreation","description":"In this module, you will learn about ways of viewing the environment from indigenous people. You will also learn about land as a commodity, conservation management, resolving conflicts, conflicts of interests in land use and look at a case study that highlights the Australian Aborigines.","topics":["Land Use and Recreation - Learning Outcomes","Ways of Viewing the Environment","Conservation","Recreation And Land Management","Case Study - The Australian Aborigines","Land Use and Recreation - Lesson Summary"]},{"name":"Module","details":"Diploma in Outdoor and Physical Education Studies - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Outdoor and Physical Education Studies - First Assessment"]},{"name":"Module","details":"Basic Physiology For Physical Education","description":"In this module, you will learn about basic muscle physiology, muscle architecture, interior components, motor unit, regulation for muscular force, firing pattern, muscle fibre types, types of muscle contractions, sliding filament theory, the heart, energy systems, and conversion of food to energy.","topics":["Basic Physiology For Physical Education - Learning Outcomes","Basic Muscle Physiology","Muscle Groups","Information On The Heart","Energy Systems","Converting Food To Energy","Basic Physiology For Physical Education - Lesson Summary"]},{"name":"Module","details":"Training Methods","description":"In this module, you will learn about the principles of training, overload principles, the principle of specificity, reversibility principle, the principle of individual differences, training principles, training methods, benefits of training intervals, oxygen consumption, factors changed by exercise, fatigue and recovery.","topics":["Training Methods - Learning Outcomes","The Principles Of Training","Training Principles","Training Methods","Maximal Oxygen Uptake","Acute Responses","Chronic Training Responses","Fatigue And Recovery","Training Methods - Lesson Summary"]},{"name":"Module","details":"Coaching And Fitness","description":"In this module, you will learn about the core components of fitness like muscle strength, muscle power, flexibility, agility, speed, balance, coordination and reaction time, the role of the coach, coaching styles, and coaching techniques.","topics":["Coaching and Fitness - Learning Outcomes","The Core Components Of Fitness","The Role Of The Coach","Coaching Styles","Coaching Techniques","Coaching and Fitness - Lesson Summary"]},{"name":"Module","details":"Improving Physical Fitness","description":"In this module, you will learn about ways of improving physical fitness and ergogenic aids, illegal ergogenic aids, sports psychology, anatomical and physiological differences affecting performance, limitations to performance, sporting injuries and prevention.","topics":["Improving Physical Fitness - Learning Outcomes","Legal Ergogenic Aids","Illlegal Ergogenic Aids","Sports Psychology","Sporting Injuries","Improving Physical Fitness - Lesson Summary"]},{"name":"Module","details":"Physical Activity And Society","description":"In this module, you will learn about recreation and physical activity for different groups within society, and promoting involvement in physical activity and the positive and negative influential factors of promoting involvement in physical activity.","topics":["Physical Activity and Society - Learning Outcomes","Different Groups Within Society","Intrinsic/Extrinsic Influences On Fitness","Socio-Cultural Considerations","Motivational Factors and Participation Rates","Fact Or Fiction Activity","Physical Activity And Society - Lesson Summary"]},{"name":"Module","details":"Diploma in Outdoor and Physical Education Studies - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Outdoor and Physical Education Studies - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Outdoor and Physical Education Studies Final Assessment"]}]}