{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3387","title":"Diploma in Influential Political Philosophers","totalEnrolled":"1,131","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the role of Enlightenment philosophers in creating today’s human rights with this free online politics course.","description":"This free online course explores the work of influential political philosophers such as Immanuel Kant, Georg Hegel, Karl Marx and John Stuart Mill. We examine concepts like ‘freedom’ and ‘free will’ as investigated by Kant and Hegel. We also discuss timeless topics like alienation, suffrage and the exploitation of workers from the perspective of these famous thinkers. This course delves into the past to map our contemporary political landscape.","courseOutcomes":["Define ‘the Enlightenment’...","Outline the aims and objectives of m...","Explain the interconnection between ...","Break down Hegel’s conception of fre...","Define ‘the Enlightenment’","Outline the aims and objectives of moral philosophy","Explain the interconnection between morality, freedom and autonomy","Break down Hegel’s conception of freedom","List his major works","Contrast civil society with the state","Define the concept of ‘alienation’","Discuss exploitation in reference to Marx’s idea of the proletariat","Define ‘utilitarianism’","Relate utilitarianism to liberty","Analyze Mill’s views on representative government","Define ‘the Enlightenment’...","Outline the aims and objectives of m...","Explain the interconnection between ...","Break down Hegel’s conception of fre...","Define ‘the Enlightenment’","Outline the aims and objectives of moral philosophy","Explain the interconnection between morality, freedom and autonomy","Break down Hegel’s conception of freedom","List his major works","Contrast civil society with the state","Define the concept of ‘alienation’","Discuss exploitation in reference to Marx’s idea of the proletariat","Define ‘utilitarianism’","Relate utilitarianism to liberty","Analyze Mill’s views on representative government"],"courseDescription":"<p>What does it mean to be an ‘influential’ philosopher? Do you need a Nobel Peace Prize? Should people know of your eccentricities? The philosophers covered in this course affected the way people view and navigate the world of today’s politics. Marx dreamed of the freedom of the working class, Hegel found inspiration in idealism, Kant helped drive the Enlightenment and Mill fought for the liberation of women. We begin our journey with Kant, a representative of German idealism who is often held up as the quintessential ‘Age of Reason’ figure as he advanced ideals such as liberty, tolerance and progress. We go through his work to help you appreciate how he advocated for the ideals that still resonate in the halls of power.</p><p>We then move on to Hegel and his idea that our will forms the free and practical part of the spirit and requires the presence of others. Hegelian doctrine was based on realism and argues that ‘the rational alone is real’. We then investigate Marx’s assertion that ‘true freedom’ is only possible only in a communist state where there is neither private property, politics nor class conflicts. He argued that the modes of production in any given society divide people into two main classes, bourgeoisie and proletariat, and this course explores a side of Marxist theory that is little known in the popular imagination.</p><p>Finally, we examine the theories of the British liberal Mill, who lobbied for women's rights like the right to vote. Mill believed in equal opportunities for men and women, as demonstrated by his campaign for expanding employment options for women, and that an equal world is a better one. We compare Mill to his predecessors to explain utilitarianism: the emphasis on outcome to seek pleasure and avoid pain via the pursuit of happiness. We delve into the theories of iconic philosophers to explain how the foundations of the modern world were laid. This course suits anyone who is interested in politics as it links today’s headlines to the ideas that created them.</p><a href=\"https://alison.com/resume/courses/3387\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3387\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Immanuel Kant","description":"This module introduces you to the concept of Enlightenment. You will also learn about themes such as morality, autonomy and freedom and Immanuel Kant thoughts on these subjects. The concept of Kingdom of Ends will be explored, together with Kant’s views on Republicanism and Cosmopolitanism.","topics":["Immanuel Kant – Learning Outcomes","Enlightenment","Morality, Autonomy and Freedom","Kingdom of Ends and Critical Assessment","Immanuel Kant – Lesson Summary"]},{"name":"Module","details":"Wilhelm Friedrich Hegel","description":"In this module, you will learn about Hegel, an influential German thinker. You will be taught about his major works and some important themes of his, family, civil society, and the state. You will also learn about Hegel’s contribution to the history of Western political thought, along with the criticism he has been subjected to.","topics":["Wilhelm Friedrich Hegel – Learning Outcomes","Introduction and Freedom","Civil Society and State","Rights and Critical Assessment","Wilhelm Friedrich Hegel – Lesson Summary"]},{"name":"Module","details":"First Course Assessment","description":"","topics":["First Course Assessment"]},{"name":"Module","details":"Karl Marx","description":"In this module, you will learn about a philosophical thinker known as Karl Marx. Some of his fundamental theories, such as alienation and exploitation, will be explored in the light of capitalism. You will also learn about Marx’s views on communism and politics. The critical assessment of Marx’s views will be addressed, along with his legacy.","topics":["The Philosopher, Karl Marx – Learning Outcomes","Introduction and Historical Materialism","State and Class","Views on Politics, Communism and Critical Assessment","The Philosopher, Karl Marx – Lesson Summary"]},{"name":"Module","details":"John Stuart Mill","description":"In this module, you will learn about a thinker named John Stuart Mill, a utilitarian philosopher. You will also learn about his support of the demand for the right to vote for women. His views on liberty and representative government will be addressed. A critical assessment of Mill’s thought will be covered.","topics":["John Stuart Mill – Learning Outcomes","Introduction, Context and Biography","Utilitarianism and Subjection of Women","Views on Representative Government and Critical Assessment","John Stuart Mill – Lesson Summary"]},{"name":"Module","details":"Second Course Assessment","description":"","topics":["Second Course Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Influential Political Philosophers - Course Assessment"]}]}