{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3332","title":"Diploma in Early Western Political Thought","totalEnrolled":"929","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn how political thought allows us to competently understand the nature of politics.","description":"This free online course on early Western political thought will cover the pioneers of political theory, particularly Plato’s and Aristotle’s philosophies. Uncover the ideal state concept with the philosopher’s rule as king, as envisioned by Plato, and learn about Aristotle’s take on the ideal state, along with notions such as household, property and economy. Slavery and constitution are, among others, theories incorporated into this course.","courseOutcomes":["Define political thought...","List questions covered by political ...","Contrast political theory to politic...","Explain the concept of \"classics\" in...","Define political thought","List questions covered by political thought","Contrast political theory to political thought","Explain the concept of \"classics\" in relation to political thought","Discuss the concept of justice","Contrast Socrates’ political ideology to that of Plato","Explain Plato’s philosophy of education","Summarize the political ideology of the earliest political thinkers","Explain ethics and virtue as political concepts","List the major works of Aristotle","Discuss the philosophical concepts of household, property and economy","Define a constitution","Define political thought...","List questions covered by political ...","Contrast political theory to politic...","Explain the concept of \"classics\" in...","Define political thought","List questions covered by political thought","Contrast political theory to political thought","Explain the concept of \"classics\" in relation to political thought","Discuss the concept of justice","Contrast Socrates’ political ideology to that of Plato","Explain Plato’s philosophy of education","Summarize the political ideology of the earliest political thinkers","Explain ethics and virtue as political concepts","List the major works of Aristotle","Discuss the philosophical concepts of household, property and economy","Define a constitution"],"courseDescription":"<p>Freedom, democracy, majority rule with minority rights and other related expressions are the results of thoughts deeply rooted in ancient times. Have you wondered how these terms came about? Are you fascinated by how ancient philosophers such as Plato and Aristotle became pioneers in this field? This course on political thought will immerse you in their philosophical way of thinking. It deals with government, sovereignty and state, along with justice, constitution and citizenship. Western political thought remains an essential tradition of political thinking and theorizations. One of the primary reasons we should study political thought is that it raises specific political questions still relevant today. It helps us to critically understand our assumptions and approach to politics in our generation. You will discover that political thought provides us with a set of concepts and strategies that helps us understand and interpret the contentious and complex nature of politics in modern times.</p><p>As you work through the course, you will study Plato, who was a student of the eminent Socrates. One of the most influential concepts developed by Plato was justice, which in his opinion is a primary moral value. It is connected intrinsically to other moral values such as courage, wisdom and self-control. His conception of justice is rooted in the harmony of existence and is embedded within the self or the soul. For Plato, there is a need for order within the soul and within the state, which is essential to achieve the individual’s full potentialities. You will discover that justice is an organic conception, which envisions a coherent individual and political order. For him, as in any individual where reason or intellect must guide the soul’s spirited parts, the philosophers should primarily teach the auxiliary and trading classes in the state. Other central concepts of political thought developed by Plato will be uncovered, along with those of another political thinker known as Aristotle.</p><p>Aristotle was a scholar of Plato. He viewed politics as a master science. Many political thinkers of modern times regard Aristotle as both a conservative and a radical thinker. His impact on the history of political thought and the natural sciences has been immense. His influence extends into many fields such as biology, physics, rhetoric and politics. Aristotle’s politics profoundly shaped the history of political thought in Western tradition. You will delve into his profound concepts such as constitution and citizenship. The course will be of great interest to anyone intrigued by philosophy or politics, particularly students specializing in political sciences or preparing for careers in politics on a national or international scale. Government officials entrusted with political and leadership roles will find this course particularly inspiring in performing their duties. Start this course today and refine your understanding of Western political thought.</p><a href=\"https://alison.com/resume/courses/3332\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3332\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Western Political Thought","description":"This module introduces you to the study of western political thought. You will be taught about the pioneers of political thought, the classics, along with the various approaches and methods used, including textual, contextual and interpretative.","topics":["Introduction to Western Political Thought - Learning Outcomes","General Outline of Western Political Thought","Studying Political Thought","Approaches and Methods","Introduction to Western Political Thought – Lesson Summary"]},{"name":"Module","details":"First Course Assessment","description":"N/A","topics":["First Course Assessment"]},{"name":"Module","details":"From Socrates to Plato","description":"This module introduces you to the great philosophers of ancient times, Socrates and Plato in particular. You will learn the concept of the ideal state, Kallipolis, with the philosopher's rule as the king as envisioned by Plato. You will also learn about Plato's ideas on education in the ideal state, along with the philosopher king's role and the communism of wives and property.","topics":["From Socrates to Plato - Learning Outcomes","Introduction and Justice","State and Philosopher King","Communism of Wives and Property","From Socrates to Plato - Lesson Summary"]},{"name":"Module","details":"Aristotle's Political Thought","description":"This module is about Aristotle’s political thought, starting with ethics and virtue. You will learn about Aristotle’s ideal state, along with concepts such as household, property and economy. Slavery and the constitution are other concepts covered in this topic. You will also learn about citizenship and views on revolution, along with causes and remedies.","topics":["Aristotle’s Political Thought – Learning Outcomes","Ethics and Virtue","Politics and his Ideal State","Aristotle: Citizenship and Views on Revolution","Aristotle’s Political Thought – Lesson Summary"]},{"name":"Module","details":"Second Course Assessment","description":"N/A","topics":["Second Course Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Early Western Political Thought - Course Assessment"]}]}