{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3334","title":"Early Political Philosophers","totalEnrolled":"788","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Meet the early political philosophers who laid the foundations for modern political theory in this free online course.","description":"This free online course offers in-depth insight into the early political philosophers. We examine the work of Socrates and Plato, beginning with Plato’s vision of the ‘ideal state’. We then unravel Aristotle’s political ideas, starting with ethics and virtue, before exploring his theories regarding citizenship, slavery and constitutions. While they lived thousands of years ago, these towering intellectual figures still loom over world history.","courseOutcomes":["Discuss the concept of ‘justice’...","Compare Socrates’ and Plato’s politi...","Explain Plato’s philosophy of educat...","Summarize the political ideology of ...","Discuss the concept of ‘justice’","Compare Socrates’ and Plato’s political Ideology","Explain Plato’s philosophy of education","Summarize the political ideology of the earliest political thinkers","Define Plato's ‘ideal state’","Describe the dominant traits of human subjectivity","Unpack ethics and virtue as political concepts","List the major works of Aristotle","Discuss the philosophical concepts of ‘household’, ‘property’ and ‘economy’","Define a ‘constitution’ and its various types","Outline various theories of revolution","Discuss the concept of ‘justice’...","Compare Socrates’ and Plato’s politi...","Explain Plato’s philosophy of educat...","Summarize the political ideology of ...","Discuss the concept of ‘justice’","Compare Socrates’ and Plato’s political Ideology","Explain Plato’s philosophy of education","Summarize the political ideology of the earliest political thinkers","Define Plato's ‘ideal state’","Describe the dominant traits of human subjectivity","Unpack ethics and virtue as political concepts","List the major works of Aristotle","Discuss the philosophical concepts of ‘household’, ‘property’ and ‘economy’","Define a ‘constitution’ and its various types","Outline various theories of revolution"],"courseDescription":"<p>Modern political concepts like freedom of speech, democracy, majority rule with minority rights and social justice are the legacy of early political philosophers, particularly the titanic figures of Plato and Aristotle. This course introduces you to early political philosophers, analyzes their work and illustrates their contemporary relevance. Plato, for instance, addressed ‘justice’ by rooting it in the harmony of existence within the individual’s soul. Such balance is mirrored in the relationship between the State’s three classes and Plato considered it vital to maintain order and a primary moral value intrinsically connected to other virtues such as temperance, wisdom and courage. Plato is found by some authors to be ‘utopian’ or even unrealistic but his ideas continue to guide modern political theory and resonate today.</p><p>We then move on to Aristotle, Plato’s student (and Alexander the Great’s tutor). For Aristotle, politics is a ‘master science’ that helps you live an ethical life and realise your full moral potential. This is only achieved in a ‘polity’, a virtuous community. Aristotle saw humanity as distinct from other species in terms of being rational and possessing language to communicate ideas. He believed that humans are neither beasts nor gods, though they share some attributes with both and questioned any transcendental or universal theory of ethics, morality or good. Though considered by some to be conservative and conventionalist, Aristotle is widely seen as a revolutionary thinker who influenced the history of political thought, particularly western tradition. Other Aristotelian themes include the economy, which Aristotle described as ‘the art of household management’, constitutions, citizenship and corruption.</p><p>Despite their eminence in the field of political thought, Plato and Aristotle have been criticized, often severely, by many authors. Aristotle himself severely questioned Plato’s ‘ideal state’ and deemed it ‘elitist’, doubting wisdom accessible solely to philosophers. Aristotle believed in the ‘wisdom of many’ but accepted the form of state described in Plato’s ‘Statesman and Laws’. Likewise, many scholars have critiqued Aristotle’s work, especially his defence of slavery and his support of women’s subordinate roles, which are anachronistic today. This course investigates these theories and discusses their role. This course is of particular interest to students specializing in philosophy or political science but it can help anyone who wants to understand why the world is run the way it is. These ancient ideas echo in the speeches and soundbites you hear today and we explain how they have survived the centuries.</p><a href=\"https://alison.com/resume/courses/3334\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3334\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"From Socrates to Plato","description":"This module introduces you to the great philosophers of ancient times, Socrates and Plato in particular. You will learn the concept of the ideal state, Kallipolis, with the philosopher's rule as the king as envisioned by Plato. You will also learn about Plato's ideas on education in the ideal state, along with the philosopher king's role and the communism of wives and property.","topics":["From Socrates to Plato - Learning Outcomes","Introduction and Justice","State and Philosopher King","Communism of Wives and Property","From Socrates to Plato - Lesson Summary"]},{"name":"Module","details":"Aristotle's Political Thought","description":"This module is about Aristotle’s political thought, starting with ethics and virtue. You will learn about Aristotle’s ideal state, along with concepts such as household, property and economy. Slavery and the constitution are other concepts covered in this topic. You will also learn about citizenship and views on revolution, along with causes and remedies.","topics":["Aristotle’s Political Thought – Learning Outcomes","Ethics and Virtue","Politics and his Ideal State","Aristotle: Citizenship and Views on Revolution","Aristotle’s Political Thought – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Early Political Philosophers - Course Assessment"]}]}