{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4333","title":"Egyptology - Architecture, Government and Society","totalEnrolled":"1,901","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the government structure, beliefs, lifestyle and language of ancient Egypt in this free online course.","description":"Do you want to know how the ancient Egyptian empire evolved to become the greatest civilisation of its time? This course investigates the dynasties, prominent rulers and government structure of ancient Egypt. In addition, you'll acquire knowledge of the Gods and Goddesses and the art and architecture of this era. We cover key components of this civilisation, including its lifestyles, fashions, language and writing.","courseOutcomes":["Outline important aspects of ancient...","Discuss various dynasties of ancient...","List major Egyptian gods and their p...","Describe the art and architecture of...","Outline important aspects of ancient Egyptian civilisation","Discuss various dynasties of ancient Egypt","List major Egyptian gods and their powers","Describe the art and architecture of ancient Egypt","Evaluate the role and authority of Pharaohs","Recall the ancient Egyptian justice system","Summarise the ancient Egyptian family system","Analyse the old Egyptian language and writing system","Recognise different ancient Egyptian numerals","Outline important aspects of ancient...","Discuss various dynasties of ancient...","List major Egyptian gods and their p...","Describe the art and architecture of...","Outline important aspects of ancient Egyptian civilisation","Discuss various dynasties of ancient Egypt","List major Egyptian gods and their powers","Describe the art and architecture of ancient Egypt","Evaluate the role and authority of Pharaohs","Recall the ancient Egyptian justice system","Summarise the ancient Egyptian family system","Analyse the old Egyptian language and writing system","Recognise different ancient Egyptian numerals"],"courseDescription":"<p>The Egyptian empire was one of history's earliest and most influential civilisations, unique in terms of its longevity, consistency and geography. You will learn the fundamentals of Egyptology, which is the study of ancient Egypt's language, culture and history. We group the history of Egypt into three main periods: the Old Kingdom, the Middle Kingdom and the New Kingdom, which spanned over three millennia. Discover the dynasties and prominent rulers and their unique contributions to Egypt. Ancient Egyptians were polytheists, worshipping around two thousand Gods and Goddesses. You will acquire knowledge of the meaningful Egyptian deities, their role in every aspect of life and their specific powers. The Egyptian civilisation was rich in art and it played a crucial role in their social and religious contexts. You will learn about the function of art in ancient Egyptian culture and gain a proper understanding of its different forms.</p><p>The ancient Egyptians were capable of building magnificent building structures. We will explore their architecture and various building structures, including the pyramids of Giza, famous temples and houses for the elite and poor classes. Do you want to know how Pharaohs ruled ancient Egypt and maintained their control over the people and resources? Research the Egyptian government and administration, law and order, taxation and the role of Pharaohs in society. We demonstrate their living style, including family, marriage, education, fashion and entertainment. The ancient Egyptian language evolved over millennia and used symbols and different scripts. We refer to them as ‘hieroglyphs’. Study its origin, how to write it and how it changed over different periods. Understand its use, number system and the emergence of writing fractions in ancient Egyptian.</p><p>We designed this course for Egyptology students and those interested in the history, civilisation, culture, language or art of ancient Egypt. Human history is an intriguing subject for everyone as it provides an insight into how humans have reached their present state and how old cultures influenced later cultures, beliefs and lifestyles. Examine the salient characteristics of the ancient Egyptian civilisation to give you an idea of how this powerful civilisation was able to overcome difficulties and turmoil to last for millennia. Pictorial representation of Egyptian art, architecture and language will enhance your learning experience. Don't miss out on the opportunity to gain insight into ancient Egypt. Join the course now!</p><a href=\"https://alison.com/resume/courses/4333\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4333\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Egyptian Culture and Rulers","description":"This module will introduce you to the ancient Egyptian dynasties and their government structure. Learners will acquire knowledge of the beliefs, gods and temples of ancient Egyptians. You will learn about Egyptian architecture, pyramids and houses as well as Egyptian language, writing and number system.","topics":["Egyptian Culture and Rulers - Learning Outcomes","Introduction to Egyptology","Egyptology - Architecture, Government and Society","Egyptian Culture and Rulers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Egyptology- Architecture, Government and Society - Course assessment"]}]}