{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3522","title":"Environmental Education: Climate Change - The Science","totalEnrolled":"5,487","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about our dynamic climate, the causes of climate change and impacts of global warming in this free online course.","description":"Climate change is the defining socio-economic force of the 21st century and this free online course introduces you to the concepts, causes and impacts of global warming. Drawing on real-world examples and scientific data, you will explore the fundamentals of greenhouse gases, natural climate cycles and how we know that human actions are driving today’s climate crisis. In the face of change, an informed society is a more resilient society.","courseOutcomes":["Define the term 'climate'...","Outline concerns about climate chang...","Explain what natural climate archive...","List examples of extreme weather eve...","Define the term 'climate'","Outline concerns about climate change","Explain what natural climate archives reveal","List examples of extreme weather events","Recognize the scale of the modern climate crisis","Discuss the challenges and opportunities our current situation represents for coming generations","List ways in which you can counter the climate change crisis","Define the term 'climate'...","Outline concerns about climate chang...","Explain what natural climate archive...","List examples of extreme weather eve...","Define the term 'climate'","Outline concerns about climate change","Explain what natural climate archives reveal","List examples of extreme weather events","Recognize the scale of the modern climate crisis","Discuss the challenges and opportunities our current situation represents for coming generations","List ways in which you can counter the climate change crisis"],"courseDescription":"<p>‘Climate Change – The Science’ is a free online course that introduces you to the basics of our climate system and explores the nature of today’s climate crisis. In the first section, you will learn how ‘climate’ is differentiated from everyday ‘weather’, and how what we experience as local climate is part of a planetary-scale flow of energy. This section also puts modern climate change into a broader context by elaborating on long-term, natural climate variability, such as the Ice Age cycle. It outlines how the stable and predictable conditions of the Holocene provided the foundation for our complex civilisations. Study how humankind came to realize the dynamic nature of Earth’s climate, replacing mythology with science as a means of explaining our landscapes. The material explores some of the key scientific concepts underscoring the role of greenhouse gasses, such as carbon dioxide, in regulating Earth’s temperature and how these vital gases work.</p><p>Against a background of rising atmospheric greenhouse gas concentrations due to human activity, the next sections guide you through the dynamic response of Earth’s climate system to this growing energy imbalance and show you some of the most problematic anticipated impacts of global warming. Specific topics covered in these sections include the rise in sea levels and ecosystem disruption; extreme weather events such as drought and the polar vortex; and the potentially catastrophic phenomenon of ‘abrupt climate change.’ Via real-world examples and striking imagery, you will also witness the basic scientific evidence for anthropogenic (human-caused) climate change and learn to recognise both the scale of the modern climate crisis and the challenges and opportunities our current situation represents for coming generations.</p><p>Because climate change is the dominant socio-economic force right now, an informed working knowledge of our dynamic climate is an invaluable tool for anybody wanting to help shape society’s response to this greatest of challenges. Moreover, the chronicle of Earth’s climate is a fascinating subject that dominates every facet of our lives. Featuring video, text and images, coupled with audio recordings of the written course content to provide greater accessibility for students, ‘Climate Change – The Science’ is a novel, interactive, and ultimately positive introduction to the tempestuous phenomenon that we call ‘climate’. It will help you better understand both humanity’s impact on our environment and our collective responsibility for seeking a more sustainable future for life on Earth.</p><a href=\"https://alison.com/resume/courses/3522\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3522\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Climate Change - The Science","description":"In the following module we will be discussing what we mean by climate change, what climate actually is and exploring its effect on the planet. This module will introduce you to the fundamentals of our climate system and outline the nature of today’s climate crisis.","topics":["Climate Change: The Science - Learning Outcomes","Introduction to Climate Change","Earth's Dynamic Climate System","Who Knew Earth's Climate Could Change","What Next for Life on Earth?","Climate Change: The Science - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Environmental Education: Climate Change - The Science Course Assessment"]}]}