{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4305","title":"Environmental Education: Water Pollution","totalEnrolled":"2,258","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the devastation caused by water pollution and the need for clean water in this free online course.","description":"Did you know that water is a vital resource for all life forms on Earth? Despite this, water pollution is still a significant problem today, with humans being one of its largest polluters. Discover how humans can use water wisely and improve the quality of all life. Follow water on its journey around our planet through the water cycle and learn about its usage per person, product and sector in society today.","courseOutcomes":["Recognise the severity and urgency r...","Explain how water travels from water...","Define the term ‘pollution’...","Identify the various sources and cau...","Recognise the severity and urgency related to water quality and quantity","Explain how water travels from water bodies into the atmosphere and back again and how humans interact with this cycle","Define the term ‘pollution’","Identify the various sources and causes of water pollution","Compare the relative amount of water used in different sectors of society","Analyse an item of clothing to discover its water-use and environmental impact","Recall some of the possible ways to conserve water and reduce or eliminate water pollution","Recognise the severity and urgency r...","Explain how water travels from water...","Define the term ‘pollution’...","Identify the various sources and cau...","Recognise the severity and urgency related to water quality and quantity","Explain how water travels from water bodies into the atmosphere and back again and how humans interact with this cycle","Define the term ‘pollution’","Identify the various sources and causes of water pollution","Compare the relative amount of water used in different sectors of society","Analyse an item of clothing to discover its water-use and environmental impact","Recall some of the possible ways to conserve water and reduce or eliminate water pollution"],"courseDescription":"<p>Water is a vital resource in short supply and unevenly distributed on our planet. Less than one percent of all the water on Earth is clean and easily accessible freshwater and about two billion people drink contaminated water. Discover the natural and human water cycles, where humans intercept, use and dispose of water at different stages of the natural process. Following this, we define ‘pollution’ and explore its various types and sources. Water pollution comes mainly from the following sectors of society: agriculture, industry, energy production and domestic use. Households are the primary source of sewage and also dispose of a variety of toxic substances. Plastics are another source of water pollution, from clothing micro-fibres to plastic rubbish to large fishing nets, which are either eaten by mistake or entangled with aquatic life.</p><p>Explore water usage in various sectors and the water used for a single product, such as a cotton t-shirt. Did you know that agriculture uses 70% of the world’s freshwater? Additionally, to manufacture a t-shirt, you would need a whopping 2700 litres of water. We also look at individual water-use and make a rough comparison between countries. We will learn about a ‘water footprint’ that includes the water used to make the products we buy and services we use, in addition to our direct use for washing. The section finishes with the prediction of increased water scarcity by 2050, due primarily to increasing demand, unless we take significant measures to use water more efficiently and reduce our contribution to water pollution.</p><p>Finally, we look at ways to conserve water and improve water quality. Individuals, businesses, NGOs and governments will need to drive the efforts required. Agriculture will need to adopt more conservative and targeted irrigation strategies, transition as much as possible to biological pest control methods and targeted use of natural fertilisers and better contain and reuse animal waste. Examples exist in the industry of closed-loop systems, where waste is treated and reused without discharging into the ground and waterways. There are also natural, compostable materials that you can use widely and safely. Our energy system is undergoing a welcome transition towards greater use of cleaner, renewable energy sources and this will need to be encouraged and accelerated. Households, or consumers, will need to be more aware of the environmental impact of their purchases and be encouraged to make environmentally friendly choices. As far as plastics are concerned, less use and more compostable and safe, reusable alternatives are required.</p><a href=\"https://alison.com/resume/courses/4305\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4305\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Water Pollution","description":"Learn about the necessity and limited availability of clean, fresh water, the water requirements of various products and the natural and human water cycles. Discover the impacts of water pollution and its definition and sources, along with the amount of water used per sector, product and person and how we can conserve and improve water quality.","topics":["Water Pollution - Learning Outcomes","Introduction to Water Pollution","Water Pollution Sources","Water Usage and Footprint","Water Quality and Conservation","Water Pollution - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Environmental Education: Water Pollution - Course Assessment"]}]}