{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4282","title":"Environmental Education: Energy Calculations","totalEnrolled":"966","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to calculate power output and convert standard units of energy with this free online course.","description":"How do we calculate the energy used in our daily life? There are many energy units, calculation methods and concepts to understand when calculating energy. In this course, you will learn the main energy concepts, the correct terminology and how to make accurate calculations rapidly. In addition, you will cover energy conversion between the main units of fuels, Carnot efficiency, temperature scales and many other critical components.","courseOutcomes":["Outline the basic laws of physics th...","Identify the sources of energy and h...","Define terms such as ‘load capacity’...","Discuss critical primary information...","Outline the basic laws of physics that underline energy calculations and the S.I. units system","Identify the sources of energy and how to calculate their energy potential","Define terms such as ‘load capacity’, ‘kinetic’, ‘potential’, ‘chemical’ and ‘thermal energy’","Discuss critical primary information such as the calorific value of fuels and the specific heat capacity of materials","Recall secondary calculation requirements such as insulation calculations and Carnot Efficiency","Compute basic energy calculations such as energy conversions","Recognise the different temperature scales and their relevance to energy calculations","Outline the basic laws of physics th...","Identify the sources of energy and h...","Define terms such as ‘load capacity’...","Discuss critical primary information...","Outline the basic laws of physics that underline energy calculations and the S.I. units system","Identify the sources of energy and how to calculate their energy potential","Define terms such as ‘load capacity’, ‘kinetic’, ‘potential’, ‘chemical’ and ‘thermal energy’","Discuss critical primary information such as the calorific value of fuels and the specific heat capacity of materials","Recall secondary calculation requirements such as insulation calculations and Carnot Efficiency","Compute basic energy calculations such as energy conversions","Recognise the different temperature scales and their relevance to energy calculations"],"courseDescription":"<p>How much energy does it take to power a home, a school or an entire city? How would you go about calculating these? Our production and energy-use, primarily from fossil fuels, contribute to climate change. In this course, you will learn about the fundamentals of physics and energy before using formulas for calculating energy and its efficiency. You will begin with physics and the fundamental laws of thermodynamics before covering a key concept of scientific and engineering studies: standard measurements. This will include the seven Système Internationale (S.I.) measurements from which we derive all other measurements. Energy comes in five different types. As you continue, you will study examples of these types, the formulas for calculating each type and step-by-step illustrations for using these formulas.</p><p>The following section explores temperature. First, you will concentrate on the three temperature scales we commonly use, focusing mainly on Celsius. Next, we will introduce energy terms before outlining joules and the variations of the basic energy unit. Another topic we cover is power, where we focus on joules, watts and how to convert energy between the two. We will present practical energy calculations, such as a power station's output and efficiency. Following this, we will provide you with examples, supported by step-by-step instructions that you need to follow for every calculation. Finally, we will teach you two commonly used subscripts in energy calculations as you progress.</p><p>This course finishes with thermodynamic calculations of various materials. Throughout this course, you will form a solid understanding of energy calculations, from the standard units of measurement to the multiple formulas used to convert between different measurement units. Start this course today to learn how quickly and accurately the energy output of differing materials or scenarios.</p><a href=\"https://alison.com/resume/courses/4282\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4282\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Energy Calculations","description":"In this module, you will be introduced to the fundamentals of energy calculations. This includes the basic laws of physics, the various forms of energy and the standard units of measurement used in scientific calculations. You will also study formulas for converting those standard measurements and determining energy output or various scenarios.","topics":["Energy Calculations - Learning Outcomes","Introduction to Energy Calculations","Units, Calculations and Conversions","Thermodynamic Calculations","Energy Calculations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Environmental Education: Energy Calculations - Course Assessment"]}]}