{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4871","title":"Environmental Management and Legal Compliance","totalEnrolled":"1,466","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the industrial causes of environmental damage and how to manage them in this free online course.","description":"This short course explores the negative impact that industries cause on the environment. It highlights various sectors that contribute the most to ecological damage and the emission of greenhouse gases. Another important aspect of this course is that it contains content that will help you learn about different measures to show compliance with environmental protection laws. So help with the pollution problem and enrol today.","courseOutcomes":["Define ‘global warming’ and ‘climate...","Analyse the role of industries and b...","Indicate those industries that are c...","Classify different types of industri...","Define ‘global warming’ and ‘climate change’","Analyse the role of industries and businesses in driving global warming and climate change","Indicate those industries that are contributing the most to climate change","Classify different types of industrial wastes","Discuss the role of air pollution in greenhouse gas emissions","Describe how the greenhouse effect generates and traps the heat in the Earth's atmosphere","Recognise the industrial causes of water and land pollution","Summarise the role of waste control measures in helping the industries regarding waste management","Outline the benefits of an environmental management system for industries and business enterprises","Define ‘global warming’ and ‘climate...","Analyse the role of industries and b...","Indicate those industries that are c...","Classify different types of industri...","Define ‘global warming’ and ‘climate change’","Analyse the role of industries and businesses in driving global warming and climate change","Indicate those industries that are contributing the most to climate change","Classify different types of industrial wastes","Discuss the role of air pollution in greenhouse gas emissions","Describe how the greenhouse effect generates and traps the heat in the Earth's atmosphere","Recognise the industrial causes of water and land pollution","Summarise the role of waste control measures in helping the industries regarding waste management","Outline the benefits of an environmental management system for industries and business enterprises"],"courseDescription":"<p>One of humanity's most important dilemmas today is the extensive environmental damage caused by pollution. This damage leads to harsh weather conditions, droughts, floods and hurricanes worldwide. One of the primary causes of this ecological damage is extensive industrialisation. These harmful practices have released pollutants into the environment and harmed their surroundings. A critical reason industries contribute to environmental damage is the lack of proper education regarding identifying and mitigating these hazards.</p><p>Considering these facts, we have designed this course with two essential components. The first component will allow you to identify the industrial causes of environmental damage. The second will focus on helping companies and industries meet their national legal requirements regarding environmental protection. In this regard, the course presents two environmental protection laws from the United Kingdom and the United States.</p><p>The course is unique because it contains different statistics that tell you about the severity of this problem and the need to take urgent action. Furthermore, we will focus on the greenhouse effect, which results from air pollution generated by extensive industrial activities. In addition, appealing graphics will pique your interest. Finally, a summary will help you recall and retain the vital knowledge points before you take the small assessment and earn your Alison certificate. Register today!</p><a href=\"https://alison.com/resume/courses/4871\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4871\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Industrial Causes of Environmental Damage","description":"This module teaches you about the various industries contributing to environmental pollution. Also, you will learn about global warming, the greenhouse effect, and its industrial causes. Furthermore, this module also discusses how industries can comply with their national laws concerning environmental protection and conservation.","topics":["Industrial Causes of Environmental Damage - Learning Outcomes","Industrial Practices & Our Environment","Industries & their Relation to Pollution","Environmental Safety & Legal Compliance","Industrial Causes of Environmental Damage - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Environmental Management and Compliance - Course Assessment"]}]}