{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2794","title":"Environmental Philosophy","totalEnrolled":"1,268","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, study various philosophical views on eco-ethics and the value of indigenous knowledge.","description":"In this free online course on environmental philosophy, you will learn about environmental ethics from the perspective of three different philosophical approaches to nature and the ecological crisis: deep ecology, social ecology and ecological feminism. It also discusses the importance of traditional indigenous knowledge and understanding of various ecosystems, in creating sustainable solutions for resource management.","courseOutcomes":["Recall environmental philosophies...","Explain the concepts of deep ecology...","Outline the difference between indig...","Identify how indigenous knowledge is...","Recall environmental philosophies","Explain the concepts of deep ecology, social ecology and ecofeminism","Outline the difference between indigenous knowledge and scientific knowledge","Identify how indigenous knowledge is passed on","Analyze the impact of indigenous knowledge on development projects","Summarize the work titled, 'An Ecological Journey","Recall environmental philosophies...","Explain the concepts of deep ecology...","Outline the difference between indig...","Identify how indigenous knowledge is...","Recall environmental philosophies","Explain the concepts of deep ecology, social ecology and ecofeminism","Outline the difference between indigenous knowledge and scientific knowledge","Identify how indigenous knowledge is passed on","Analyze the impact of indigenous knowledge on development projects","Summarize the work titled, 'An Ecological Journey"],"courseDescription":"<p>This free online course in environmental philosophy will discuss human-Nature relationships; how environmental ethics is the part of environmental philosophy that considers extending the traditional boundaries of ethics from solely including humans to including the non-human world; and how traditional indigenous knowledge is important in understanding our natural surroundings and creating sustainable solutions for resource management. You will start by learning how environmental ethics emerged from the American wilderness movement in the 1960s, which helped create the great national parks in the United States. Ponder two classic polarities of environmental ethics: the opposition of preservationists to utilitarians; and anthropocentric to biocentric attitudes towards Nature. This will be your starting point for understanding the development of several environmental philosophies. The first you will learn about is ‘deep ecology’, developed by the Norwegian philosopher Arne Naess, which promotes the inherent worth of all living beings regardless of their instrumental utility to human needs, plus the restructuring of modern human societies in accordance with this idea. Naess claims that the essence of deep ecology is to ask deeper questions, probing the values of our societies, and to the development of a holistic point of view.</p><p>The second environmental philosophy you will analyze is ‘social ecology’, which argues that the environmental crisis is a result of the hierarchical organization of power and the authoritarian mentality rooted in the structures of human society. In social ecology, the elite class is viewed as manipulating the Earth’s natural resources ‘for their own benefit at a substantial cost to the environment and disadvantaged social groups’. In place of hierarchical and class systems, social ecology proposes an egalitarian society based on mutual aid, caring and communitarian values. People in this ‘new society’ would appreciate that the interests of the collective are inseparable from those of each individual. The third environmental philosophy you will study is ‘ecological feminist philosophy’ or ‘ecofeminism’. It is not one of the different perspectives of feminism, such as liberal, traditional Marxist, radical or socialist. It is, rather, a philosophical approach emphasizing the variety of different connections between feminism and the environment, between the domination of women (and other humans) and the domination of Nature. It is a recent development in feminist thought which argues that the current global environmental crisis is a predictable outcome of patriarchal culture.</p><p>Towards the end of this course, you will grapple with a growing trend in anthropological studies known as ‘ethnoecology’, which is the study of how different groups of people living in different locations understand the ecosystems around them and their relationships with their surrounding environments. The ‘traditional’ or ‘indigenous’ knowledge that native people have acquired through the centuries over generations of interactions with their natural surroundings, is valuable in understanding how these communities sustained these ecosystems for the survival of their own culture. Anthropologists believe that our current scientific knowledge needs to reconcile with this indigenous knowledge to create modern and sustainable solutions for managing our natural resources. You will also examine research by a group of scientists, headed by the noted ecologist Professor PS Ramakrishnan entitled, ‘One Sun, Two Worlds: An Ecological Journey’, styled in the form of a dialogue between two knowledge systems, 'traditional knowledge' and 'formal knowledge'. This free online course will deepen your understanding of ecological philosophy and the different approaches of various philosophies of ecology.</p><a href=\"https://alison.com/resume/courses/2794\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2794\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Environmental Ethics","description":"This module will discuss three different philosophies of Environmental Ethics, that of Deep Ecology, Social Ecology, and Ecofeminism. Environmental Ethics is a discipline in philosophy that studies the moral relationship of human beings to, and also the value and moral status of, the environment and its non-human contents.","topics":["Environmental Ethics - Learning Outcomes","Introduction to Environmental Ethics","Deep Ecology","Social Ecology","Ecological Feminist Philosophy","Environmental Ethics - Lesson Summary"]},{"name":"Module","details":"Traditional Ecological Knowledge","description":"This module will discuss how Indigenous Traditional Knowledge has been acquired and passed on through generations and how this Indigenous Knowledge can be merged with Scientific Knowledge in sustainably managing our natural resources.","topics":["Traditional Ecological Knowledge - Learning Outcomes","Traditional Ecological Knowledge","An Ecological Journey","Traditional Ecological Knowledge - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}