{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4211","title":"Environmental Education: Transport","totalEnrolled":"859","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how modern transportation systems are causing the deterioration of the climate with this free online course.","description":"Transportation, in all its forms, has become easier to access but at what cost? In this course, you will learn about the current state of global transportation. You will study your daily commute, see how it affects your health and how your vehicle can harm the environment. With the knowledge you take away from this course, you will be able to take your first effective steps towards more sustainable methods of transportation.","courseOutcomes":["Discuss key reasons that fossil fuel...","Recognise the socio-economic trends ...","Explain the major environmental, cli...","Define the key challenges facing our...","Discuss key reasons that fossil fuels remain the dominant energy source for transport","Recognise the socio-economic trends that have created today’s transport systems","Explain the major environmental, climatic and health impacts of transport pollution","Define the key challenges facing our transport choices in a warming world","Summarise our most viable options for creating a cleaner transport infrastructure","Identify harmful gasses released into the air during your daily commute","Discuss key reasons that fossil fuel...","Recognise the socio-economic trends ...","Explain the major environmental, cli...","Define the key challenges facing our...","Discuss key reasons that fossil fuels remain the dominant energy source for transport","Recognise the socio-economic trends that have created today’s transport systems","Explain the major environmental, climatic and health impacts of transport pollution","Define the key challenges facing our transport choices in a warming world","Summarise our most viable options for creating a cleaner transport infrastructure","Identify harmful gasses released into the air during your daily commute"],"courseDescription":"<p>When heading out for work or running a few errands, what form of transportation do you use: car, bus, bike or something else? Have you ever considered how your choice could be harming the planet? In this course, you will learn how transportation has evolved into the harmful issue that it has become. You begin with a look into the current state of transport and see how goods are delivered across the globe. In particular, you will learn about food delivery and the negative ramifications of delivering various food across the world, such as having New Zealand lamb on European shelves, for instance. You will then cover the one fuel that is used to power most of this moving around - oil - and find out how we have become so dependent on this energy source. You will also look into extracting energy from fossil fuels as you learn about the power required for transport.</p><p>Then take a deep dive into the factors that have helped to create the world of transportation that we live in today such as the evolution of the suburb and the growth of personal mobility within these communities. As you progress, you will cover common cliches on car ownership as a status symbol and how this has led to over one billion car owners around the globe. Along with growing suburbs, you will also cover public transportation. If you lived in these suburban areas would you depend on public or private transport? For those in more urban areas, as you will learn, public transport is becoming scarcer and harder to afford. This section then wraps up with under-considered urban planning and decentralisation. This includes the rising dependency on private cars, low-cost quick fixes and the growing needs required to sustain the tourism industry.</p><p>As you continue your studies, you will learn about the sustainability of transport and what we can do to change our ways. This includes potent greenhouse gasses released as part of fossil fuel combustion in cars and busses and the specific harm they do to the human body and Earth, in particular black carbon and its effects on the Arctic's snow. The course finishes with the impact of car culture on human life, particularly how your workday is shaped by your daily commute. You will also learn about the solutions that could help counter the harm that is being caused daily. Throughout this course, you will form a solid understanding of the damage that modern transportation is doing to the planet and your own quality of life. Start this course today to learn how you can change your transportation method to help protect the climate and planet where you live.</p><a href=\"https://alison.com/resume/courses/4211\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4211\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Climate Change: Transport","description":"In this module, you will learn about the evolution of transportation and its rising risks to the planet. This includes an introduction to the modern systems of transportation and the factors that have played a role in creating these systems. You will also take the time to study how the environment is suffering as you cover potential solutions.","topics":["Climate Change: Transport - Learning Outcomes","The Current State of Transport on Earth","How Did We Get Here?","Questions of Transport Sustainability","Climate Change: Transport - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Environmental Education: Transport - Course Assessment"]}]}