{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1963","title":"Exploring Movie Construction and Production","totalEnrolled":"7,864","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"What's so exciting about movies around the world? Learn how a movie is constructed and produced with this free course!","description":"This free online movie production course will teach you about the fundamentals of how movies are made and produced. In this film production course, study a wide range of topics in filmmaking process, including theme, genre, narrative structure, story, directing, acting, cinematography, photography, shooting, editing, and sound. Learn about the basic principles of character development, how to create a three-dimensional character, and a lot more!","courseOutcomes":["Identify the difference between the ...","Recognize different types of genres ...","Describe the mechanics of creating t...","Discuss how the story can be categor...","Identify the difference between the use of themes and genres in movies","Recognize different types of genres and sub-genres","Describe the mechanics of creating the story and plot","Discuss how the story can be categorized into six elements and define these elements","Outline the three elements needed to create a three-dimensional character","Describe the role of a movie director","Identify common vocabulary and terms used in cinematography;","Outline the basic principles of editing and different editing techniques;","Identify different types of sound techniques used in movie production","Identify the difference between the ...","Recognize different types of genres ...","Describe the mechanics of creating t...","Discuss how the story can be categor...","Identify the difference between the use of themes and genres in movies","Recognize different types of genres and sub-genres","Describe the mechanics of creating the story and plot","Discuss how the story can be categorized into six elements and define these elements","Outline the three elements needed to create a three-dimensional character","Describe the role of a movie director","Identify common vocabulary and terms used in cinematography;","Outline the basic principles of editing and different editing techniques;","Identify different types of sound techniques used in movie production"],"courseDescription":"<p>Why do we get excited when we think about going to the movies? Do you love a movie but when asked why, you can't explain it? If you have not watched a lot of movies, then this free online movie construction and pre-production information course will give you a solid foundation for a better understanding the movies you watch. You will also learn how to critically analyse movie distribution.</p><p>The movie production course begins by exploring the use of themes and genres in movie construction. Next, you will learn about creating narrative structure and characters. Lastly, you will also learn about directing, cinematography, visual effects, stages, locations, editing and sound in movie post-production. These areas are covered in this specific order so you can see the formation of a movie from the theme, or purpose, through to its completion.</p><p>This movie production course will be ideal for anyone interested in learning about the fundamental basics of movie framework, construction, and production. So, why wait? Start learning today and by the end of the week, you will have gained valuable skills and knowledge about how to construct and produce movies!</p><a href=\"https://alison.com/resume/courses/1963\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1963\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Part I: Construction","description":"This module will introduce learners to the fundamental principles of themes and genres in move construction, and the mechanics of creating the story and plot. You will also learn about the basic principles of character development and how to create a three-dimensional character.","topics":["Part I: Construction - Learning Outcomes","Introduction to Themes and Genres in Movies","Types of Movie Genres - Part 1","Types of Movie Genres - Part 2","The Mechanics of Creating the Story and Plot","Character Development","Part I: Construction - Lesson Summary"]},{"name":"Module","details":"Part II: Production","description":"This module will introduce learners to the fundamental principles of directing and cinematography. You will also learn about different types of editing and sound techniques used in movie production.","topics":["Part II: Production - Learning Outcomes","Directing and Cinematography","Editing and Sound","Part II: Production - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Exploring Movie Construction and Production - Course Assessment"]}]}