{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4504","title":"Fact Checking 101","totalEnrolled":"1,244","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to check facts and enhance and protect your credibility with readers in this free online writing course.","description":"This course on fact-checking will help you learn the basics of fact-checking techniques and their importance. All it takes is some consistent effort to write compositions that readers will appreciate. Your fans will not hesitate to recommend your article to others because you have freed it from embarrassing oversights. You'll learn a simple fact-checking routine that will elevate writers, content creators and editors to a higher level.","courseOutcomes":["Summarize how to create a fact-check...","Describe where and how to check vari...","Outline the difference between opini...","Explain the pitfalls in getting name...","Summarize how to create a fact-checking routine that catches errors and inconsistencies","Describe where and how to check various kinds of facts - including an amazingly helpful, taxpayer-funded free research resource","Outline the difference between opinions that don't warrant a fact-check and statements that do","Explain the pitfalls in getting names and numbers correct","Discuss the importance of recognizing and discounting biased or outdated sources of information","Summarize how not to fall for and pass along hoaxes, baseless rumors and myths that have already gone around the internet","Explain the kinds of mistakes that run the greatest risk of landing you in legal trouble and how to avoid them","Outline the best way to handle the consequences if an error does nevertheless slip by you","Summarize how to create a fact-check...","Describe where and how to check vari...","Outline the difference between opini...","Explain the pitfalls in getting name...","Summarize how to create a fact-checking routine that catches errors and inconsistencies","Describe where and how to check various kinds of facts - including an amazingly helpful, taxpayer-funded free research resource","Outline the difference between opinions that don't warrant a fact-check and statements that do","Explain the pitfalls in getting names and numbers correct","Discuss the importance of recognizing and discounting biased or outdated sources of information","Summarize how not to fall for and pass along hoaxes, baseless rumors and myths that have already gone around the internet","Explain the kinds of mistakes that run the greatest risk of landing you in legal trouble and how to avoid them","Outline the best way to handle the consequences if an error does nevertheless slip by you"],"courseDescription":"<p>Fact-checking is an essential technique needed when you write. There are five reasons why you should include fact-checking in your writing routine. Are you wondering how you can use fact-checking to maintain the credibility of your documents? This course will help you acquire authentic writing skills to improve your credibility. We explore how fact-checking works in documents and go through some examples and exercises that will help you learn its process. We will compare fact-checking to proofreading, describe a fact-checking routine, discuss a formal system for doing this and describe how to incorporate it into your daily writing routine. You will also learn to overcome the initial problems you may encounter when applying these techniques.</p><p>We will then investigate some important fact-checking areas, such as where to look something up, which sources you can rely on and which ones are dubious or unreliable. We examine some of the most valuable sources available to determine the accuracy of the information in an article. Discover how to do a fact-check on names, including all proper nouns like names of people, their job titles, places, businesses, schools and so on. Another essential element of fact-checking is numbers. These include amounts, percentages, dates, statistics, street numbers, phone numbers, distances, measurements and more. Learn how to check the accuracy of numbers using various available resources. We demonstrate how to determine the authenticity of research results on the internet, such as blogs or news sites. Research different approaches and methods to find the sources of information available on the internet.</p><p>The course will help you complete practical exercises to test your knowledge of the important points, methods and approaches discussed in the previous fact-checking topics. These include scenarios where you need to be extra careful to ‘get it right’ and where the stakes could be high. Delve into the concept of defamation and learn about the risks associated with potentially dangerous, emotional or urgent information. Become familiar with precautions and confidentiality clauses when sharing information about others, whether they are neighbors, friends, clients or colleagues. We then discuss the concept of ‘information responsibility’ and plagiarism. This course is ideal for freelance writers, editors, bloggers, authors or online publishers who want to gain a competitive edge and are concerned about reliability and accuracy. So why wait? Start your learning journey today.</p><a href=\"https://alison.com/resume/courses/4504\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4504\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Essentials of Fact Checking","description":"In this module, you will learn the essentials of fact-checking techniques and their importance. We will go over five reasons why you should include fact-checking in your writing routine. We will also go over the fact-checking process and important areas of fact-checking, such as where to look something up.","topics":["Essentials of Fact Checking - Learning Outcomes","Why Fact Check? The Top 5 Reasons","What to Check","Your Fact-Checking Routine","Where to Check","Essentials of Fact Checking - Lesson Summary"]},{"name":"Module","details":"Fact Checking Skills","description":"In this module, We will learn how to do a fact check for names with proper research tools and strategies. Next, we will move to another important element of fact-checking, namely numbers. We will also discuss how to determine the authenticity of research results on the Internet, e.g. in blogs or on news sites.","topics":["Fact Checking Skills - Learning Outcomes","Getting Names Right","Getting Numbers Right","Confirming Research Results","Now You Try It","Fact Checking Skills - Lesson Summary"]},{"name":"Module","details":"Advanced Fact Checking Issues","description":"In this module, we will talk about certain situations where we need to be extra careful to do things right and where there could be a lot at stake. We will also discuss precautions and confidentiality when sharing information about others. Next, we will review all the important points and key concepts we have learned throughout the course.","topics":["Advanced Fact Checking Issues - Learning Outcomes","Danger Zones","Information Responsibility","Course Conclusion","Advanced Fact Checking Issues - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}