{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1838","title":"Foundation Diploma in Mathematics - Science, Technology and Engineering","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the Math skills you need to apply for a STEM subject at third level and make your future career a success.","description":"This free online Foundation in Mathematics course is designed to help people pursuing careers in Science, Technology Engineering and Mathematics (STEM). STEM careers are some of the most highly paid and respected in the world. No matter what level of math you currently have, you can always get a little better, and a free online course is a great place to do so. Start this free online course today and make your future STEM career a success.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This diploma course will give you the mathematical knowledge and skills you need to study a Science, Technology, or Engineering discipline at third-level. The course consists of simple Maths tutorial videos in which qualified Math teachers resolve problems in real-time. You will also receive comprehensive assessment tests on all aspects of Mathematics which are related to Science, Technology and Engineering.<br>The course covers a wide range of essential Math topics in a clear step-by-step manner. You will start by learning about fractional indices, simple formulae, and simultaneous equations. Next, you will get a full run-through of quadratic equations, quotients, and differentiation, which are key Math topics for any STEM career. This will pave the way for more advanced lessons covering radians, arrangements, and complex numbers. This will give you a solid grounding for any STEM discipline at third level.</p><p>By the end of this course, your Math skills will have greatly improved, and will encompass the core Math topics of Algebra, Equations and Functions, Calculus, Probability and Statistics, Calculus, Matrices, Trigonometry and Complex Numbers. This knowledge will open up a wide range of highly paid careers, making a real difference to your life. So get started today, and in less than 2 weeks you'll have given your career development a real boost.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}