{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4937","title":"Fundamentals of Particle Physics","totalEnrolled":"1,038","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain insight into studying particles, matter and radiation with this free online course on Alison.com.","description":"Are you studying for an exam on nuclear physics? Or are you just curious as to what constitutes the inside of an atom? This online course on the fundamentals of particle physics (or high energy physics) will guide you through the rudiments of matter, particles and their interaction. In addition, this course explores the composition of elementary particles to the theories of radiation. So register and learn today!","courseOutcomes":["Explain the basics of elementary par...","Identify the various types of elemen...","Examine the concept of the nucleus a...","Describe the mechanism of nuclear re...","Explain the basics of elementary particles, their interactions and the various types of atomic models","Identify the various types of elementary particles and their unique characteristics","Examine the concept of the nucleus and the different nuclear models","Describe the mechanism of nuclear reactions and radioactivity along with their types","Analyse what particle accelerators are along with their major types and functions","Discuss the kinds of radiation detectors, their uses and their working mechanisms in nuclear technology","Explain the standard model theory and how different particles interact with one another to form a single structure","Explain the basics of elementary par...","Identify the various types of elemen...","Examine the concept of the nucleus a...","Describe the mechanism of nuclear re...","Explain the basics of elementary particles, their interactions and the various types of atomic models","Identify the various types of elementary particles and their unique characteristics","Examine the concept of the nucleus and the different nuclear models","Describe the mechanism of nuclear reactions and radioactivity along with their types","Analyse what particle accelerators are along with their major types and functions","Discuss the kinds of radiation detectors, their uses and their working mechanisms in nuclear technology","Explain the standard model theory and how different particles interact with one another to form a single structure"],"courseDescription":"<p>Does physics fascinate you and you wonder what makes up simple things like an atom? Do you ponder how different invisible radiations are detected? The course kicks off with an introductory explanation of particle physics. Then we explore the basic models and types of particles. We investigate the various characteristics of these elementary particles and how to measure their quantum numbers.&nbsp;</p><p>Have you ever wondered how the atomic number of an atom is calculated? We examine the nucleus in detail and the evolution and development of nuclear physics. We analyse key models, theories and laws regarding nuclei and radioactivity. You will investigate the phenomena of particle acceleration and the instruments used to create it.</p><p>Have you ever figured out what type of nuclear reaction creates an atomic explosion? We dissect the different types of nuclear reactions as the course progresses. Then we identify radiation detectors and their different types. Finally, we discuss the standard model theory as it is one of the foundations of particle physics. Particle physics is one of the integral branches of physics. If you want to understand its concepts thoroughly, enrol today!</p><a href=\"https://alison.com/resume/courses/4937\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4937\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Particle Physics","description":"In this module, the learner will be dissecting elementary particles and how they interact with one another. The characteristics of these elementary particles will be discussed along with their quantum numbers. The nucleus and nuclear physics shall be examined. Particle accelerators, radiation detectors, and standard model theory shall be explained.","topics":["Fundamentals of Particle Physics - Learning Outcomes","Introduction to Particle Physics","Elementary Particles","The Nucleus and It's Properties","Nuclear Physics","Particle Accelerators","Radiation Detectors","Standard Model Theory","Fundamentals of Particle Physics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Particle Physics - Course assessment"]}]}