{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3910","title":"Fundamentals of Linear Equations and Word Problems","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about linear equations, how to solve word problems, and inequalities from this free online mathematics course.","description":"This course provides you with a comprehensive guide on the composition of linear equations and inequalities in two or more variables. You will learn how to solve word problems with consecutive integers and the Pythagorean theorem. It also explains the methods of solving quadratic equations. Start today and improve your knowledge of linear equations.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Ever wondered about the formation of a Cartesian plane or the operations of linear equations? This course starts by introducing you to the formation of a Cartesian plane, which is done by a horizontal number line, called the x-axis, and a vertical number line called the y-axis. Learn about the various approaches that can be used to find the linear equation in algebra. This course explains how linear equations are solved graphically as well as algebraically using the substitution and elimination methods. Study the concept of second-order determinants from solving linear equations. Evaluate the process of using a traditional method to solve a system of literal linear equations in two or more variables. The material then shows how systems of linear equations are solved in three variables as well as how to solve these systems with three independent equations.</p><p>Having difficulty in graphing a linear inequality? This course succinctly explains the process of graphing linear inequalities as well as how to solve pairs of linear inequalities graphically. It unpacks the principles along with the methods of solving quadratic equations. Study examples of coin word problems and how to solve them using either a single or two variables. You will also learn about the relationship between three variables in distance calculation along with how to solve number problems using single or multiple variables. This course then teaches you the formulas for calculating perimeter and area from different word problems. Solve rectangular frame word problems and learn how the work word problems deal with accomplishing a job by two or more people or machines working at different rates.</p><p>Finally, you will discuss the concept of the parabola as it relates to quadratic inequalities as well as its turning point, the vertex. Explore different ways of determining the roots of quadratic equations. The material sheds light on the methods to graph quadratic equations. By completing this course, you will be able to solve quadratic equations using the completing the square method. You will also know how this method is used to establish a general formula for solving quadratic equations. The modules also discuss the relationship between discriminants and the quadratic formula along with their application to equations. This course is targeted at math students wanting to improve their algebra skills. Start today and improve your understanding of linear equations, word problems, and quadratic inequalities.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}