{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4368","title":"Fundamentals of Domestic Violence and Abuse","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about identifying and reporting domestic violence and abuse in children and adults.","description":"Domestic violence is common and many adults and children experience some sort in their lifetime. This course examines how to report abuse and explores the signs of abuse in a relationship. We will discuss different types and what to do if you suspect that a child is being abused. You will also learn how to help adults and children affected by domestic violence. Additionally, you will know how to report an incident in confidence.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will help you gain a broader understanding of domestic violence and abuse. We will explore why people stay in contact or remain in abusive relationships. We will also look at issues around reporting abusers and examine the signs of abuse within a relationship. In addition, you will understand the cycle of abuse and patterns of behaviour. Next, we will talk about the Duluth Model, developed in the early 1980s to reduce domestic violence against women. This course looks at the impact of domestic violence and addresses both the reasons for abuse to victims and the long-term consequences. It recaps who can be a sufferer and looks at victims' characteristics. You will gain more insight into the impact on physical and mental health.&nbsp;</p><p>The course will briefly discuss the consequence of domestic violence on children. First, we will explore different types of abuse and what to do if you discover an abused child. Next, we will research how we can play an important role and responsibility in preventing domestic violence and abuse against children. Then study the factors that can increase risk and where they emerge. Finally, we will look at the process of individual assessment with the complete procedure about how you can determine whether or not a child is at risk by recognising a risky situation.</p><p>The course then explains what ‘disclosure’ means and what to do if someone discloses domestic violence. You will also learn to identify and understand domestic violence to help the victim. This course emphasises training you on how to offer support to a child or young adult and how to fulfil your duty of care. You will also learn how to help older adults affected by domestic abuse and how to report incidents in confidence. This course is ideal for anyone learning about domestic violence and abuse and professionals working in social services and non-governmental organisations (NGOs). So why wait? Start your learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}