{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1702","title":"Fundamentals of Storytelling in Education for Teachers and Trainers","totalEnrolled":"17,610","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Enhance student engagement with almost any subject by improving your storytelling techniques with this free course.","description":"This free online Storytelling in Education for Teachers and Trainers course focuses on storytelling as a way of organizing information, conveying emotions, and building a sense of community in the classroom. Storytelling is one of the oldest forms of communication and plays an important role in education, particularly for younger children. With this course, you will learn how to use storytelling to enhance student engagement.","courseOutcomes":["Outline about the role of storytelli...","Describe the different storytelling ...","Discuss the story listening experien...","Analyse the story listening trance a...","Outline about the role of storytelling in education","Describe the different storytelling models","Discuss the story listening experience","Analyse the story listening trance and how its induced","Utilize storytelling to achieve greater communication","Outline about the role of storytelli...","Describe the different storytelling ...","Discuss the story listening experien...","Analyse the story listening trance a...","Outline about the role of storytelling in education","Describe the different storytelling models","Discuss the story listening experience","Analyse the story listening trance and how its induced","Utilize storytelling to achieve greater communication"],"courseDescription":"<p>At its most basic, a story can be said to have a beginning, middle, and end. This course will first teach you the important elements for the listener according to the model of the story listening trance experience which includes identification with the story, listener's memories, and personal preferences. You will also learn that according to the model of the story listening trance experience, a story should be visually descriptive, emotionally charged, and have novelty.</p><p>You will then learn that the listener's expectations, the content of the story, and the storyteller's ability are important elements that help bring a listener from a baseline state of consciousness to an altered state of consciousness. You will study the elements of a story, and learn that according to Professor Strum, the altered state of consciousness, the passive mode of consciousness. and the alternate/altered reality accompany the storytelling process.</p><p>Effective storytelling can lead to an altered state of consciousness that deepens the relationship between teacher and students. This course will give you three stories that illustrate the theoretical model of storytelling. Storytelling ethics and the need for trust between storyteller and listeners are also discussed. So, check out this course and learn more about the effectiveness of storytelling as a tool that can enhance learning within the classroom.</p><a href=\"https://alison.com/resume/courses/1702\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1702\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Storytelling in Education for Teachers and Trainers","description":"This module details what storytelling is and how to harness the power of storytelling to create more effective communication. During this module, learners are enlightened to the power of storytelling in education. Learners are taught what constitutes good storytelling, how to use storytelling models and how to engage their listeners. The altered state of mind induced by storytelling is discussed and the channels used to foster this state are explained.","topics":["Fundamentals of Storytelling in Education - Learning Outcomes","Storytelling","Fundamentals of Storytelling in Education - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Storytelling in Education for Teachers and Trainers – Assessment"]}]}