{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4511","title":"Basics of Journalism","totalEnrolled":"2,755","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to assemble information and disseminate it as news items in this free online journalism course.","description":"Journalism is of paramount importance and plays vital roles in the community, the public and the wider world because it entails disseminating important information that society can use. As a journalist, you need information about events to share with your audience. How can this information be sourced and transformed into a newsworthy article? We will introduce you to the principles of journalism, its ethics, forms and more.","courseOutcomes":["Define ‘journalism’...","List the types and forms of journali...","Recall the five principles in the pr...","Discuss the history and development ...","Define ‘journalism’","List the types and forms of journalism","Recall the five principles in the practice of journalism","Discuss the history and development of journalism","Explain the process of setting up an interview","Outline the types of interviews","Recognize the basic step-by-step construction of news items","State the relevant terminologies in journalism and the types of producers in the field","Summarize the factors that should be considered by producers when constructing a TV news broadcast","Identify the equipment used for reporting and the three functions of a cue","Define ‘journalism’...","List the types and forms of journali...","Recall the five principles in the pr...","Discuss the history and development ...","Define ‘journalism’","List the types and forms of journalism","Recall the five principles in the practice of journalism","Discuss the history and development of journalism","Explain the process of setting up an interview","Outline the types of interviews","Recognize the basic step-by-step construction of news items","State the relevant terminologies in journalism and the types of producers in the field","Summarize the factors that should be considered by producers when constructing a TV news broadcast","Identify the equipment used for reporting and the three functions of a cue"],"courseDescription":"<p>Journalism is vital to society because it provides people with the knowledge to live their lives and make conclusions regarding various subject areas, including politics, entertainment, sports, celebrities, fashion, technology, science and many more. There are various ways and channels to disseminate information about recent or trending events to the public. We introduce you to the concept of journalism and show you the various channels used to distribute news about the happenings in society. With good journalism comes greater demand for creativity and professional skills such as good writing and presentation skills. What makes a good journalist? What should a journalist do when they're out in the field? We will teach you how journalists should conduct themselves while in the field to maintain professionalism. Discover the important skills required in journalism to achieve progress and success in this career.</p><p>Journalism takes many forms, each with its own set of procedures. A journalist does not engage in all forms of journalism. As you advance through this course, we'll explain the procedures of several forms of journalism: access, advocacy, broadcast, citizen, data and more. As a journalist, you should bear in mind the credibility of your information and its source. Explore the different types of information sources that make a credible news production. We highlight the five principles of journalism that will guide you through the ethics of its practices. We also analyze the history and evolution of journalism since the 18th century. Explore events in the past that led to journalism and learn how they led to the foundation of the National Union of Journalists in the United Kingdom.</p><p>Journalists are trained to gather information in many forms, develop them into newsworthy stories and then circulate them to the public. Amongst other methods, one of the ways journalists obtain information is through interviews. Gain insight into the notion of an interview and learn how you can conduct a high-quality one. We highlight the dos and don'ts of conducting an interview, the three basic types of interviews in journalism, the purpose of diary events such as press conferences, local authority meetings and more. We cover other aspects of journalism, such as its terms and how to apply them, producers in journalism and reporting equipment used in the production of news. Finally, we examine the various cable news channels, TV and radio stations in the UK and guide you through their approach and operating methods. We have designed this course for aspiring journalists, correspondents or anyone interested in being at the forefront of information sharing. Do you want to develop the skills and improve your understanding of journalism? Enrol and start this course today!</p><a href=\"https://alison.com/resume/courses/4511\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4511\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Concepts and Emergence of Journalism","description":"In this module, you will be introduced to the concept of journalism, the basic principles of conduct and behaviour in journalism and the various forms of journalism. You will learn about the history of journalism and how to be a good newscaster, producer and reporter. In addition, you will be shown some terminologies in journalism.","topics":["Concepts and Emergence of Journalism - Learning Outcomes","Principles and History of Journalism","Interviewing and Newspaper Journalism","News Writing, Television and Radio Journalism","Concepts and Emergence of Journalism - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Journalism-Course Assessment"]}]}