{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3143","title":"Fundamentals of Charts Usage in Navigation","totalEnrolled":"599","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course examines charts used in navigation, passage plan preparation and features of the buoyage system.","description":"If you desire to sail and have a passion for the ocean, look no further. This course on nautical charts and current direction meets all your needs. Learn the procedure for counteracting current and leeway and essential terms used in current sailing. Discover how to collect information for the passage plan and how to calculate the distance of the visible horizon of either a light or the distance of the visible horizon of an observer.","courseOutcomes":["Describe the cause and effect of the...","Discuss the concept of ‘DR’ and ‘FIX...","Identify the types of lights (their ...","Explain the concepts of geographical...","Describe the cause and effect of the tidal stream","Discuss the concept of ‘DR’ and ‘FIX’","Identify the types of lights (their colour, phase and sectors) that are used for navigation","Explain the concepts of geographical range, luminous range and a nominal range of lights","Outline the position of the ship by using a running fix (transfer of position lines /circles)","Identify the IALA system of buoyage and its significance","Describe the cause and effect of the...","Discuss the concept of ‘DR’ and ‘FIX...","Identify the types of lights (their ...","Explain the concepts of geographical...","Describe the cause and effect of the tidal stream","Discuss the concept of ‘DR’ and ‘FIX’","Identify the types of lights (their colour, phase and sectors) that are used for navigation","Explain the concepts of geographical range, luminous range and a nominal range of lights","Outline the position of the ship by using a running fix (transfer of position lines /circles)","Identify the IALA system of buoyage and its significance"],"courseDescription":"<p>Nautical charts are a necessity when navigating the ocean as they contain the details you need to know the ocean waterways and seafloor. This introductory course on the use of charts outlines their importance as an integral part of navigation. Learn about plotting positions, transferring position lines and important terms used for ocean currents. We present meaningful concepts like the tidal stream and highlight some related examples. You will learn about the characteristics of the light, types of lights, the geographical range, luminous range and the nominal range. The course explains what it means by the last sighting distance, the extreme range and the dipping distance of a lighthouse. We describe the process of a running fix, a method of navigation position fixing with current and leeway. Passage planning is crucial before you begin a voyage. We will study various aspects of an effective appraisal needed to plan a passage. Explore the division of the international association of lighthouse authorities (IALA) maritime buoyage system and the difference between region ‘A’ and ‘B’ buoyage systems. We will uncover the cardinal marks used in the maritime buoyage system.</p><p>The course then demonstrates the various stages in passage planning, preparing a passage plan and collecting information for the passage plan. You will also learn about its execution and the necessary tactics for its implementation. We will emphasise the points to consider to achieve the benefits of the navigational equipment provided in the vessel for position monitoring. The course will teach you the application of the primary seacoast lights, secondary lights, the colour of the light and the sector light. We will inspect the characteristics of the demographic, luminous and nominal ranges in detail. You will calculate the distance of the visible horizon of a light, the distance of the observer’s visible horizon and the geographical range of the light. You will also learn about the caution involved when using the luminous or geographical range of lights for fixing the ship’s position. We will also cover the steps for finding the raising distance of light when the observer’s eye height is provided.</p><p>Become familiar with the cardinal system, other buoys, distinguishing flashes and retro-reflecting tapes properties by taking this fascinating course. Recognize the isolated danger mark, safe watermark and special mark. We will illustrate the IALA system for regions ‘A’ and ‘B’ and the techniques involved in monitoring a passage. Know how to gather information relevant to the contemplated voyage and confirm the preparation of materials essential for its completion. The atlas of pilot charts, pilot charts, process of completing a detailed description of the journey using charts will also be highlighted. You will learn about the effect of wind current. This course will help you enhance your knowledge of drawing the passage plan on the chart and the points considered for passage planning. We will also clarify the process of the course line design and the changes or deviations in the passage plan. If you are passionate about the ocean or marine navigation, enrol today.</p><a href=\"https://alison.com/resume/courses/3143\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3143\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Use of Charts","description":"In this module, you will be introduced the order, procedure of allowing, counteracting current, and leeway. You will also be introduced the cause and effect of tidal stream, the concept of DR and FIX for finding out the actual set. The rate of current, as well as the types of lights, will also be introduced.","topics":["Use of Charts - Learning Outcomes","Chart Work","Tidal Stream and Geographical Range","Last Sighting Distances","IALA Buoyage System","Passage Planning","Execution and Monitoring","Use of Charts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Charts Usage in Navigation - Course Assessment"]}]}