{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3501","title":"Fundamental Theorem of Integral Calculus","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This calculus course explains definite integral, methods of integration and the process of estimating with Riemann sums.","description":"This math course teaches you the process of estimating with Riemann sums, as well as the trapezoidal approximation methods in calculus. Learn about the conversion process from rectangular to polar coordinates and the formulas for sums of sequences. If you want to develop your skills exploring definite integrals together with how to reconfigure the integral in terms of natural exponential functions, then sign up for free now.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course&nbsp; explores the process of estimating with Riemann sums and trapezoidal approximation methods. Learn how to employ the trapezoid approximation method as opposed to using rectangles via clear illustrations. Before working with sigma notation and its formula, it is important to understand the conversion from rectangular to polar coordinates. This course will take you through the conversion process and the formulas for sums of sequences. It also introduces you to the use of Riemann sums with subintervals to estimate the distance, (in miles) travelled by a particle whose velocity is given. Have you considered using the partition with equal subintervals to estimate the work done? This course analyzes the steps required in finding the area under a curve, as well as the calculus techniques that can be employed to solve ancient problems of calculating complex areas.</p><p>If you want to know the use of opposite differentiation or antidifferentiation, as well as how the area of a problem can be solved, then enrol today. You will be able to explain the properties and laws of the definite integral. Also, this course will help you understand the required steps on how the definite integral can be distributed to a sum or difference of functions. Do you know the average value of a function on an interval? The material analyzes the second fundamental theorem of integral calculus and the formula for calculating the average value of a function on an interval. It explains with different examples the formula for calculating the average value of a function on an Interval. If you have struggled with understanding the first fundamental theorem of integral calculus or how to choose uniform partition points, then this course is for you.</p><p>You also learn about integration by the u-substitution method together with the substitution equation that can be used to convert Xs to Us. You will be taken through the natural logarithmic functions together with further evidence on the power of a u-substitution technique. See how to reconfigure the integral in terms, as well as the natural exponential functions. Do you know there is a process of differentiating the basic trigonometric functions and finding many integrals involving trigonometric expressions? Get a better understanding of the integration by parts technique that can be used frequently for integrating functions that are described by the product of two functions. This course will explain in detail the concept of the inverse trigonometric functions, as well as the unique value that can be used to make inverse sine a legitimate function. This free online course will be of great interest to calculus students or anyone needing a refresher on definite integrals and methods of integration. Register now and start your next learning math journey today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}