{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4131","title":"Basics of Music Theory","totalEnrolled":"3,061","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of music theory using piano or keyboard with this free online music course with full video tutorials.","description":"If the skills and techniques studied in this course are applied correctly, music becomes easier to understand and to play on a piano or keyboard. The structure of the course is divided into three main subjects - Note Theory, Main Theory and Harmony Elements - which are explained with instructive videos and images.","courseOutcomes":["State the different notes that can b...","Identify all the basic notations for...","Define the meaning of rhythm in musi...","Summarise the simple logic of readin...","State the different notes that can be found on a musical stave","Identify all the basic notations for speed, dynamics, and repeats","Define the meaning of rhythm in music","Summarise the simple logic of reading the musical staff","Analyse how a musical scale is constructed to create different musical scales","Explain how to construct chords and how they work","Recognise the main chords of every scale","Recall the Circle of the Fifths","State the different notes that can b...","Identify all the basic notations for...","Define the meaning of rhythm in musi...","Summarise the simple logic of readin...","State the different notes that can be found on a musical stave","Identify all the basic notations for speed, dynamics, and repeats","Define the meaning of rhythm in music","Summarise the simple logic of reading the musical staff","Analyse how a musical scale is constructed to create different musical scales","Explain how to construct chords and how they work","Recognise the main chords of every scale","Recall the Circle of the Fifths"],"courseDescription":"<p>In this free online course, you will grasp the fundamental elements of the language of music. Anyone who wants to enter the fascinating world of music can master valuable skills and techniques with the easy-to-follow videos. Music students who want to understand the fundamentals of music theory better will benefit greatly, too. You will analyse in-depth three main subjects, namely note theory, main theory and harmony elements. See how you can begin playing a keyboard fluently by applying the methods learnt from this course. You will also learn the root knowledge of a piano, often referred to as the king of musical instruments.</p><p>Begin by studying how the letters in music, referred to as notes, are circles written on the five lines of the music stave, and are represented by the first seven letters of the alphabet (A B C D E F G). Music is a straightforward language that is based on simple logic. By applying the logic and skills you acquire, you will be able to see that music theory is much easier to grasp than often thought. You will then discover harmony elements and have the opportunity to put them into practice in order to hear how all the pieces work in music. The tutorial videos can be followed along on the piano keys, allowing you to learn piano-playing elements.</p><p>By completing this course, you will have stronger knowledge that will give you the confidence to learn faster and successfully play the piano better. This course is available to all ages and backgrounds. If you wanted to learn music at one point in your life but you did not, and the desire to master it is still there, then this course is for you. It is never too late to play music! Covered in this course are different musical notes, correct note placements on a musical stave, and much more. You will be able to follow along with the instructor on your own personal keyboard. All you need to do is create your free Alison account and enrol today.</p><a href=\"https://alison.com/resume/courses/4131\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4131\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Notes Theory","description":"In this module, we will analyse the elements of music theory concerning musical notation. We will learn to read the notes on G and F clefs. We will also see these notes on the piano keyboard. We'll specify the meaning of the high and the bass notes, and also the different octaves in the staff and on the piano keys.","topics":["Introduction to Notes Theory - Learning Outcomes","Reading Musical Notes","Musical Notes - Examples","The Musical Values","The Musical Values - Examples","The Musical Notation","The Musical Notation - Examples","Introduction to the Notes Theory - Lesson Summary"]},{"name":"Module","details":"Main Theory of Music","description":"We have seen in the previous module the notes, values and rhythm. We also learned how all these are combined in order to make a musical piece masterfully written. In this next section, we will now cover another huge chapter of music that are scales and intervals.","topics":["Main Theory of Music - Learning Outcomes","Music Scales","Music Scales - Examples","The Intervals","Main Theory of Music - Lesson Summary"]},{"name":"Module","details":"Harmony Elements","description":"After having considered the scales and the intervals, now we will go in the field of Harmony of music. We'll see how the chords are constructed and how they are related. Then we'll see the Circle of the Fifths that is a major musical tool.","topics":["Harmony Elements - Learning Outcomes","The Construction of Chords","Chords Construction Examples","The Circle of Fifths","Harmony Elements - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Music Theory - Course Assessment"]}]}