{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3291","title":"Geometry: Congruence, Quadrilaterals, Similarity, Circles","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn how geometry uncovers relationships between sizes and shapes in triangles.","description":"Do you know how to determine the height of an object without measuring it? This free online course will introduce you to the basics of geometry, a mathematical technique used in the calculation of shapes and their properties. Geometry is essential to working with objects, drawings, and even construction. You will also learn how to apply Pythagoras’ theorem as well as how to identify the similarities of triangles.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>'Geometry: Congruence, Quadrilaterals, Similarity, Circles’ is a free online course that offers its learners a comprehensive guide to understanding shapes and their properties. If three sides of one triangle are congruent to three sides of another triangle, then how do you define this? This course explains the properties of triangles as well as the method for proving triangles congruent. You will uncover the theorem of an isosceles triangle, learn how to measure an equilateral triangle and discover the conditions for which you can determine triangle inequalities. Learn about the sides and angles of a quadrilateral, and how a quadrilateral becomes a parallelogram, including the properties of a parallelogram, rectangle, rhombus and a square. We will also take a brief look at how you can prove that a quadrilateral is a rhombus.</p><p>Because we encounter ratios in our everyday life, it’s important to understand the basic meaning of ratios and how they are used. The next segment of the course will teach you about ratios and their properties. A ratio is a mathematical term used for comparing two or more quantities that are measured in the same units. We also use ratios in proportion problems which deal with the equality of two ratios. This course explains the relationship between the ratio of areas and the ratio of the lengths of corresponding sides of a triangle. You will learn how to determine similar triangles as well as the theorem of their similarity and proving how two triangles can be similar to one other. Thales’ theorem states that if three points (A, B and C) lie on the circumference of a circle, whereby the line AC is the diameter of the circle, then the angle ∠ABC is a right angle. Is there a relationship between Thales’ theorem and segments joining the two sides of a triangle? This course will look at the likelihood and consider the facts around them.</p><p>Finally, this course will get the learner started on degrees and the techniques used in calculating the degrees of right-angle triangles. It explains the properties of inequalities and explores the substitution postulates for inequality, such as those involving addition, subtraction, multiplication and division. The triangle inequality theorem describes the relationship between the three sides of a triangle. In line with this theorem, this course shows the learners how to determine the sum of lengths of two sides and measuring the angles of the triangle. Here, you will also learn about the theorems of tangents of a circle and gain an understanding of a circle’s radius, diameter and chord. The course further illustrates how to identify a sector and an arc of a circle. Using succinct examples, this course teaches you how to calculate the angle formed by two chords intersecting in the interior and exterior of a circle, and also illustrates the theorems for equal chords. If you work with objects or drawings, are in construction, or if you are a video game programmer, then this course in geometry is for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}