{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3584","title":"Geometry Basics: Circles, Coordinate Geometry, Locus and Transformations","totalEnrolled":"730","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes the applications of circles in geometry, and the importance of coordinate geometry.","description":"Explore the geometry basics with this free online course and delve specifically into circles, coordinate geometry, locus and transformations. All that you need to know is covered in this online geometry course including the basic definitions and applications of circles in geometry, the concepts that form part of coordinate geometry as well as analyzing how this provides a connection between algebra and geometry through graphs of lines and curves.","courseOutcomes":["Identify the basic definitions of ci...","Identify the theorems regarding chor...","Differentiate between central and in...","Explain how to find the area of a tr...","Identify the basic definitions of circle-related terms","Identify the theorems regarding chords in a circle","Differentiate between central and inscribed angles","Explain how to find the area of a triangle","Differentiate between the volume of a sphere and a hemisphere","Differentiate between parallel and perpendicular lines","Analyze the areas in coordinate geometry","Identify the formulas of proof using coordinate geometry","Explain 3-Dimensional coordinate geometry","List the properties preserved in translations","Identify the basic definitions of ci...","Identify the theorems regarding chor...","Differentiate between central and in...","Explain how to find the area of a tr...","Identify the basic definitions of circle-related terms","Identify the theorems regarding chords in a circle","Differentiate between central and inscribed angles","Explain how to find the area of a triangle","Differentiate between the volume of a sphere and a hemisphere","Differentiate between parallel and perpendicular lines","Analyze the areas in coordinate geometry","Identify the formulas of proof using coordinate geometry","Explain 3-Dimensional coordinate geometry","List the properties preserved in translations"],"courseDescription":"<p>This course is the third in a series of geometry topics in mathematics for general studies. Geometry Basics: Circles, Coordinate Geometry, Locus and Transformations is a free introduction to geometry that has been specially prepared to take you through an introductory level to working with circles. Learning geometry concepts can be tough and overwhelming but this course is designed in a way that makes your learning process thorough but simple-to-understand. What is the formula for calculating the circumference and area of a circle? How do you find the tangents of a circle? In this geometry course, each section answers basic geometric questions and gives basic definitions to help you understand what geometry is. There are many applications of geometry that can be used in our day-to-day life: circular cylinders are used to print newspapers, engineers exploit the circle's symmetrical properties as seen by the use of the circle in making watches, clocks, bicycles and much more.</p><p>This course prepares you by taking you through coordinate geometry and coordinate proofs. Coordinate geometry is one of the most important and exciting ideas of mathematics as it provides a connection between algebra and geometry through graphs of lines and curves. This can be used to solve geometric problems algebraically, as well as provide geometric insight into algebra. The invention of calculus was an extremely important development in mathematics that enabled mathematicians and physicists to model the real world in ways that were previously impossible. Calculus became the bridge between algebra and geometry by using the coordinate plane. The invention of calculus was dependent on the development of coordinate geometry and you will learn how to plot points on the coordinate plane and find the distance between two points. There are several methods that can be used to graph linear equations and all of these are covered in the course material along with practical examples. The next part of your learning includes coordinate and transformational geometry. The word transform means “to change” and you will learn about the different types of transformations in geometry. What is the line of symmetry? We often find symmetry in things around us and it’s said that there is symmetry when the exact reflection or mirror image of a line, shape, or object gets created. You will learn about the symmetry of quadrilaterals and triangles and be introduced to translations which includes moving a shape into a different position without changing it in any way. When you look in the mirror, you see your reflection. In math, you can create mirror images of figures by reflecting them over a given line. You will learn about the properties preserved in line reflections and the reflections in the coordinate plane.&nbsp;</p><p>This geometry course is perfect for you if you are a student interested in mathematics or chemistry, how geometry can be applied in the world of engineering, or if you are curious about how the disciplines of algebra and geometry can be connected.</p><a href=\"https://alison.com/resume/courses/3584\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3584\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Circles","description":"In this module, you will be introduced to the basic definitions of circles and the tangents to a circle. You will learn how to find the circumference and area of a circle with the aid of examples. The module also discusses angles measures in circles and angles formed by two chords intersecting in the Interior of the circle.","topics":["Introduction to Circles - Learning Outcomes","Vocabulary Definitions","Chords in a Circle","Angle Measures","Angles Formed by Tangents and Secants","Introduction to Circles - Lesson Summary","Introduction to Circles - Assessment"]},{"name":"Module","details":"Area and Volume","description":"In this module, you will be introduced to the various geometric figures and how to find their areas. You will learn also learn about how to calculate the volumes of geometric shapes. The module also discusses how geometric shapes can be applied to everyday situations.","topics":["Area and Volume - Learning Outcomes","Introduction to Areas","Areas of Sectors and Segments of a Circle","Volumes of Objects","Spheres and Volumes","Area and Volume - Lesson Summary","Area and Volume - Assessment"]},{"name":"Module","details":"Coordinate Geometry and Coordinate Proofs","description":"In this module, you will be introduced to coordinate geometry and coordinate proofs. You will learn also learn about how to find the distances, midpoints, and slopes of a line. The module also discusses graphing a linear equation and the equation of circles.","topics":["Coordinate Geometry and Coordinate Proofs - Learning Outcomes","The Cartesian Plane and Plotting Points","Midpoint of a Line Segment","Equations of Lines","Areas in Coordinate Geometry","Coordinate Geometry and Coordinate Proofs - Lesson Summary","Coordinate Geometry and Coordinate Proofs - Assessment"]},{"name":"Module","details":"Coordinate and Transformational Geometry","description":"In this module, you will be introduced to coordinate and transformational geometry. You will learn also learn about the formulas and conditions of coordinate geometry. The module also discusses line reflections, rotations, and dilations.","topics":["Coordinate and Transformational Geometry - Learning Outcomes","Proofs using Coordinate Geometry","Transformational Geometry","Line Reflections","Coordinate and Transformational Geometry - Lesson Summary","Coordinate and Transformational Geometry - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Geometry Basics: Circles, Coordinate Geometry, Locus and Transformations Course Assessment"]}]}