{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3601","title":"Geometry Basics: Parallel Lines and Congruent Triangles","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free maths course shows how symbolic logic draws conclusions from statements and proves congruent triangles.","description":"This geometry course introduces you to how logical statements are analyzed using symbols. When we try to draw conclusions from statements, we find that their meanings and relationships to other statements are not always clear. This course helps you learn about the concepts of Euclidean geometry and congruent triangles. Register now and begin your next math learning journey today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This is the first in a series of geometry courses in mathematics for general studies. It explains more about geometric concepts, Euclidean geometry, and congruent triangles. The material begins by introducing you to symbolic logic. Logical statements can be analyzed using symbols. When we try to draw conclusions from statements, we find that their meanings and relationships to other statements are not always clear. By representing these statements using symbolic logic, we can more easily come to valid conclusions. Conditional statements make appearances everywhere. In our everyday lives, events can easily be represented by the expression, ‘If P then Q’. Conditional statements are indeed important and you will learn about the differences between them and biconditional statements. A truth table has columns that are statements, and rows that are possible scenarios. It contains every possible scenario and the truth values that would occur. This course outlines the importance of truth tables, tautologies, and equivalence relations. Formal proofs consist of a sequence of statements that are used to demonstrate the logical necessity of a given conclusion. You will learn how to prove the validity of an argument.</p><p>You are then introduced to the study of critical thinking, which allows us to prove statements are true. Instead of making a truth table for every argument, we may be able to recognize certain common forms of arguments that are valid or invalid. If we can determine that an argument fits one of the common forms, we can immediately state whether it is valid or invalid. These laws of inference allow us to prove mathematical statements are true. In propositional logic and Boolean algebra, De Morgan's laws are a pair of transformation rules that are both valid rules of inference. The rules allow the expression of conjunctions and disjunctions purely in terms of each other via negation. You will learn about the application of this law and the different ways in which it is defined. Quantifier expressions are marks of generality. They come in a variety of categories in English, but determiners - like all, each, some, many, most and few - provide some of the most common examples of quantification.</p><p>Next, this course introduces you to Euclidean geometry, a mathematical system attributed to Greek mathematician, Euclid. You will learn about the relationships between figures in both 2-dimensional planes and 3-dimensional spaces. Although there are many types of geometries that are based on different surfaces, the planar surface best approximates the small surfaces we deal with on a daily basis. To create a geometric system, a postulate system needs to be established. Euclid created a set of assumptions or postulates from which he drew conclusions - these are the rules we will use in studying Euclidean geometry. Next, you study congruent triangles. In geometry, two figures or objects are congruent if they have the same shape and size, or if one has the same shape and size as the mirror image of the other. You will learn about the methods for proving triangles congruent and the inequalities of a triangle. Why not register for this course now and start improving your logical thinking and geometry skills today?</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}