{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1845","title":"Geometry - Angles, Shapes and Area","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This course will guide you through different areas of Geometry such as points, lines, angles, triangles, circles, transf","description":"This free online geometry course will teach you about geometrical concepts such as angles, shapes and area. Geometry is the area of mathematics that deals with questions of shape, size, relative position and the properties of space for objects and shapes. This course will give you an insight into the basic and advanced mathematical concepts involved in geometry, from the properties of shapes to the tangent to a circle.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course in Geometry is for high school and secondary school students. The course will guide you through several different areas of Geometry such as points, lines, angles, triangles, and circles, as well as transformations and area.</p><p>The course starts off with synthetic geometry giving you an overview of the different types of shapes you encounter in geometry, then moves on the helping you establish geometric reasoning, to help you understand the shapes. Along with teaching you how to prove three different theorems to be true.</p><p>In the next module you will learn about working out geometry with coordinates, beginning with the equation of a straight line, working out the equation for parallel and perpendicular lines. Then the module moves on to sketching a curve without a graph, along with the translation, reflection and stretching of functions on a graph. Next you will learn different ways of working out the equation of a circle, about the tangent and normal to a circle. The last part of this module discusses geometry involving one or more lines, such as the angle between two.</p><p>The third module teaches you about working out the trigonometry for find the missing sides and angles using Sine Ratio, Cosine Ration, and the Tangent Ratio. After the module on trigonometry the module on radians for measurements with circles starts with introducing radians, using them to find the area of a sector of a circle. Then the module moves on the graphing trigonometric functions and the unit circle.</p><p>Lastly you will learn about calculating the length, area, and volume of different objects, form 3-cuboids to parallelograms and trapeziums. Along with how to work out the area of compound shapes and the volume of compound solid shapes.</p><p>This course would be of great interest to anyone studying secondary or high school mathematics, or any one looing to further their knowledge and skills in Mathematical geometry and geometric reasoning.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}