{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3336","title":"Geometry Basics, Geometric Constructions and Logic","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the branch of mathematics that studies the sizes, shapes and dimensions of things.","description":"This free online course provides a rigorous mathematical foundation for both practical and theoretical geometric thinking. The course begins by considering basic figures such as points, lines and planes. You will be introduced to the concept of parallelism and perpendicularity as well as more complicated geometric figures such as polygons. Emphasis is placed on developing critical thinking skills as they relate to logical reasoning.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Geometry Basics, Geometric Constructions and Logic’ offers a basic guide to understanding the sizes, shapes, positions, angles and dimensions of things. This course covers the branch of mathematics mainly concerned with two- and three-dimensional figures and their properties. We will use algebra, inductive and deductive reasoning, constructions, measurement and coordinate geometry to explore these properties. Geometry is a critical component of mathematics education because you are required to relate concepts from algebra to geometric phenomena. This course requires you to focus on logical proof and critical thinking when solving problems or evaluating arguments. Many post-secondary institutions require students to take a geometry course in high school because it provides the necessary mathematical tools for complex reasoning and solving problems in the sciences, technology, engineering and many skilled trades and professions. Therefore, much of the course is focused on preparation for recalculus, and thus several concepts and activities offer a preview of topics from these higher-level mathematics courses in analytic geometry.</p><p>This course includes an in-depth analysis of plane, solid and coordinate geometry as they relate to both abstract mathematical concepts as well as real-world situations. You will be taken through the concept of reasoning and the two types of reasoning. You will learn how proofs can be written informally and how they can be set up. You will also learn how you can logically combine rules, laws, postulates and theorems to obtain the desired conclusion. Emphasis will be placed on developing critical thinking skills as they relate to logical reasoning and argument. The course describes how to use different technological tools for making deductive reasoning. You will discuss parallel lines, angles and polygons. Discover how to find the sum of the measures of the interior angles of a quadrilateral and how to add the angle measures of two triangles. With this course, you will be able to demonstrate knowledge of concepts, definitions, properties and applications of geometry. You will also be able to develop the computational skills and strategies needed to solve problems, and you will develop critical thinking and decision-making skills by connecting concepts to practical applications.</p><p>Although we may not always recognize it, basic geometry skills are used regularly in everyday life. The course fittingly touches on strategies for solving real-world geometry problems. Geometry is also an integral part of many other areas of study, including physics and other natural sciences. This course mainly considers two-dimensional figures, but the two lessons on three-dimensional geometry provide more complete coverage of the subject. Each successive lesson in the course builds on previous lessons, culminating in lessons that teach the student how to calculate lengths, areas and volumes of more complicated figures. In addition to its in-depth discussion of the mathematical aspects of geometry, the course also includes lessons on how to draw various figures using a compass and straightedge. This course concludes by applying all that the student has learned to a brief introduction to trigonometry. The course provides the perfect starting point for a more rigorous study of geometry as well as other areas of mathematics. By the end of the course, you should feel comfortable tackling a range of basic to moderately difficult geometry problems. Take this course today to learn the basics of geometry for free.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}