{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3389","title":"Great Philosophers – An Introduction to Karl Marx","totalEnrolled":"801","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online political theory course introduces you to Karl Marx and his ideas on class that remain relevant today.","description":"This free online course covers Marx and his historical materialist theory that highlights two social classes: the bourgeois ruling elite and the proletariat working masses. We explore concepts such as alienation and exploitation through the lens of a critique of capitalism. We explain how most governments enact policies that contribute to the exploitation of the proletariat while you learn Marx’s views on civil society and the State.","courseOutcomes":["Define Marx’s idea of ‘alienation’...","Discuss the concept of ‘exploitation...","Explain the exploitation of the prol...","Analyze the contribution of the Stat...","Define Marx’s idea of ‘alienation’","Discuss the concept of ‘exploitation’","Explain the exploitation of the proletariat","Analyze the contribution of the State to the exploitation of the proletariat","Recall the contribution of Marx’s philosophy to contemporary political discourse","Summarize various critical assessments of Marx’s views","Define Marx’s idea of ‘alienation’...","Discuss the concept of ‘exploitation...","Explain the exploitation of the prol...","Analyze the contribution of the Stat...","Define Marx’s idea of ‘alienation’","Discuss the concept of ‘exploitation’","Explain the exploitation of the proletariat","Analyze the contribution of the State to the exploitation of the proletariat","Recall the contribution of Marx’s philosophy to contemporary political discourse","Summarize various critical assessments of Marx’s views"],"courseDescription":"<p>Marx and his adherents aim to improve the conditions endured by members of the working class, many of whom are exploited and alienated in factories. Capitalist society’s economic organisation combines labour and capital to form the modes of production. Marx divided society into two classes: the bourgeoisie who have capital and the proletariat that supplies labour. This course explores how the bourgeoisie prospers and exploits the suffering proletariat. The plight of the working class inspired Marx to offer a philosophical defence, thus defining him as a broadly humanist philosopher.</p><p>The course illustrates industrialization’s relentless exploitation of workers alienated from the products of their labour, the process of labouring and their fellow human beings. We also examine the impact of such alienation on the bourgeoisie. While studying, you may wonder how governments protect workers but we explain how they often do the opposite and enact laws to legitimize the exploitation of the proletariat - thus widening income inequality. The course examines Marx’s critique of such ‘injustice’ and focuses on his vision of a ‘rational’ order that would abolish private property.</p><p>The prevailing capitalistic system masks an exploitative reality with the term ‘free contract’ but are workers truly ‘free’ while signing them? This course explores such questions while examining shifting class conditions and breaking down Marx’s definition of ‘communism’. While the countries that adopted communism sank into tyranny, the ideas that drove their economic policies remain important and we investigate their contemporary impact on countries across the globe. This course suits anyone who wants to understand today’s political conversations and often-misused terms like&nbsp; ‘Marxist’, ‘communist’ and even ‘socialist’. Whatever one’s views, this course can help you become an authority on Marx’s ideas and his continued impact on today’s political debates.</p><a href=\"https://alison.com/resume/courses/3389\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3389\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Karl Marx","description":"In this module, you will learn about a philosophical thinker known as Karl Marx. Some of his fundamental theories, such as alienation and exploitation, will be explored in the light of capitalism. You will also learn about Marx’s views on communism and politics. The critical assessment of Marx’s views will be addressed, along with his legacy.","topics":["The Philosopher, Karl Marx – Learning Outcomes","Introduction and Historical Materialism","State and Class","Views on Politics, Communism and Critical Assessment","The Philosopher, Karl Marx – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Great Philosophers – An Introduction to Karl Marx - Course Assessment"]}]}