{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1572","title":"Growth Mindsets for Teachers and Learners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to improve your teaching skills by adopting and promoting a growth mindset with this free online course.","description":"This free online Growth Mindset for Teachers course is designed to help teachers get the best out of their students and themselves, focusing on the approach and attitude towards learning in your classroom. The quality of a student's teacher has been proven to have a higher impact on learning outcomes than any other factor. Take this free online course today to expand your teaching toolset and improve the quality of your classroom environment.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online teaching course is based the teacher professional development programme - Teach2030 - from the Commonwealth Education Trust, which was created to support teachers worldwide. Our engaging and interactive course materials will support you to reflect on your classroom practice, teach more effectively, continue to develop your skills, and improve learning outcomes for all your pupils.</p><p>The free online course Growth Mindsets for Teachers and Learners asks you to reflect on your approach to your learning, and of those you teach. The course explores Dr Carol Dweck and her ground-breaking and influential research on how our mindset affects both our own learning outcomes, and those of our learners. It clearly defines growth and fixed mindsets, and how the feedback you give can influence the success of your pupils.</p><p>Whether you are an experienced practitioner looking to develop your skills, or are new to teaching, this course will provide you with opportunities to examine your classroom practice, learn new techniques and strategies, and to build an action plan to become an even better teacher. The course takes approximately 2-3 hours to complete, including the short tasks and activities. Come and join the Teach2030 community by beginning our course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}