{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2844","title":"Guidance for Irish Schools on Good Procurement Processes","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the official procurement processes for primary and post-primary schools in Ireland in this free online course.","description":"This free online course has been prepared as a practical guide on public procurement for school personnel and Boards of Management in primary and post-primary schools in Ireland. It is intended for use as a reference for best practice, which may be consulted for guidance on all aspects of procurement as laid out by the Department of Education's Schools Procurement Unit.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course is to help you assess all areas of a school’s procurement activity. It will help personnel and management boards to benchmark their current policies and practices against a best practice model, set within the context of current obligations under the law. This does not place any additional responsibility upon a school to adhere to National Guidelines and public procurement law, above that which already exists and perhaps of which individual schools may not be fully aware.</p><p>The material takes a step-by-step approach to put in place procurement processes for schools. It contains diagrams and templates to support personnel in putting these systems in place in a practical way. It is important to mention from the outset, that a school is best advised to only embark on procurement activity in the absence of a suitable alternative arrangement provided by the Office of Government Procurement, and particularly so for areas of high expenditure. Using central arrangements, while not mandatory, fosters reassurance and convenience in several areas: it reduces exposure to the risk of litigation and exploitation, reduces administrative effort and cost, and delivers best-value outcomes through large-scale bundling arrangements.</p><p>Guidance of this nature cannot ever be totally definitive. It is intended to keep it under regular review, to take account of any amendments and changes which occur in the guidelines and legislation which governs how public procurement is conducted in Ireland. In this regard, the Schools Procurement Unit welcomes comments and suggestions from any source which might lead to improvements in this guidance or publicises evidence of further good practices in schools.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}