{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4617","title":"Guide to Start Acting in Film & TV","totalEnrolled":"4,359","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course is a step-by-step guide for those wanting to grow their career in the acting profession.","description":"Acting in a film or on TV is a gratifying and rewarding career. This course provides a beginner's guide in understanding the acting process, starting a career and finding work. We help you position yourself for success and provide information to assist you in exploring the main areas to address in-depth. We start with building a resume and the actions to follow. Then we answer questions such as: 'What is UCP?' or 'How can you start a career?'.","courseOutcomes":["Explain how movies are cast and prov...","Describe the steps that will positio...","Identify your UCP and the elements t...","Analyse why to create a stage name a...","Explain how movies are cast and provide tips to shine like a star","Describe the steps that will position you for success in acting","Identify your UCP and the elements that are involved","Analyse why to create a stage name and describe actions to refine your acting craft","Indicate how to properly create your own toolbox","Summarise the process of marketing your acting business","Outline how to request auditions and reach agencies","Explain how movies are cast and prov...","Describe the steps that will positio...","Identify your UCP and the elements t...","Analyse why to create a stage name a...","Explain how movies are cast and provide tips to shine like a star","Describe the steps that will position you for success in acting","Identify your UCP and the elements that are involved","Analyse why to create a stage name and describe actions to refine your acting craft","Indicate how to properly create your own toolbox","Summarise the process of marketing your acting business","Outline how to request auditions and reach agencies"],"courseDescription":"<p>Creating and beginning a career in acting for films or TV is daunting. This course provides information on how to find work in this profession, how movies are cast and demonstrates the working principles if you are just starting out. This course explains and defines how to position yourself for success by understanding how to shine like a star. We will help you analyse how to perfect your craft and refine your product by polishing up your resume and creating the ideal headshot. We provide the answers to questions related to your ‘Unique Character Proposition’ (UCP) and discuss the acting toolbox and its various tools.</p><p>Following this, we will prepare you to study your tools and how to utilise them. First, explore how to create and use your website for your acting career correctly. Next, you will discover how to create a proper audition and prepare your work with your toolbox. We then research how to market your acting business successfully. How can you start an acting trade? What tools will help you perfect your acting craft? How can you market your acting career? This course will clarify these questions and help you on your way to success.&nbsp;</p><p>Finally, we will supply you with all the skills and techniques required to start and flourish as an actor. The course provides accurate and specific information you can use to grow your acting craft. It touches on the fundamental steps to begin your career and is ideal for those starting in the profession or someone who wants to learn progressive techniques. Register for this course and become knowledgeable and excited about beginning your career in the acting business.</p><a href=\"https://alison.com/resume/courses/4617\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4617\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Acting in Film & TV","description":"This module begins by providing you with knowledge about how to present your business. We will help you organize information linked to your UCP like, your Essence or Silhouette. Also, you will answer questions like: How can you shine like a star? What steps will help your acting career? How can you refine your unique product?","topics":["Acting in Film & TV - Learning Outcomes","Introduction to Guide","Position Yourself for Success","Refine Your Unique Product","Create Your Acting Toolbox","Market Your Acting Business","Acting in Film & TV - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Guide to Start Acting in Film & TV - Course assessment"]}]}