{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3858","title":"High School Algebra - Working With Functions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to solve polynomial, logarithmic, rational, and exponential functions in this free online maths course.","description":"This course breaks down the modern techniques used in working with functions in high school mathematics. Learners will acquire knowledge of the types, operations, and transformations carried out on functions. The methods for solving, graphing, and the manipulation of various functions are also explored in detail. Register for this algebra course today, become more confident in functions, and begin a new and exciting learning journey!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This is a practical guide for working with functions and inequalities. Are the concepts of ‘relations’ and ‘functions’ difficult for you to understand or do you want to master the operations of functions? Then this course is for you! The ways to represent a function and their characteristics are discussed in simple terms. Learn about quadratic functions along with polynomial and rational functions. Learners will be taught the applications of exponential and piecewise-defined functions. Study the composition of functions and how to form the composite of two or more functions. Analyze the different types of graphical transformations and how they can simplify the process of graphing functions. The multiple transformations of a function and the graphical transformations of functions are also covered. Learn about the definition and properties of an exponential function and study the procedures used in solving exponential equations in addition to the properties and graphing of logarithmic functions.</p><p>This course demonstrates the process of manipulating logarithmic expressions and how to evaluate expressions using logarithms. You will learn how to solve real-world problems with the application of exponents and logarithms. The domain, range and degree of a polynomial function will be explained. Study the methods used to search for the zeros of more advanced polynomial functions and principles used to manipulate polynomials. Learn about the four possible end behaviours that a polynomial function will assume depending on certain factors. Study the steps taken to draw a graph of a polynomial equation. Given its zeros, the procedures used in finding the equation of a polynomial function will be explained. You will learn the definition of a rational function as well as how to simplify them then uncover the methods for finding vertical, horizontal, and oblique asymptotes.</p><p>Lastly, the procedures used to find the x and y-intercept of the graph of a rational function will be covered. If you want a proper understanding of the methods used for graphing any function without the aid of a calculator, then this course is for you. Solving problems with rational functions and solving polynomial inequalities will be analyzed extensively. You will learn about the concept of polynomial division and the important theorems that are useful in searching for the roots of polynomial equations. Master how to prove the rational root theorem. Learn about the algebraic solution to polynomial equations and techniques to help locate their possible roots. Finally, the intermediate value and location of roots theorems will also be covered. This course will greatly benefit high school students or those who need a refresher in algebra. Register for today and take your numeracy skills to the next level!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}