{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3889","title":"High School Algebra - Sequences and Trigonometric Functions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the operations of sequences, right triangle trigonometry, and circular functions in this free online course.","description":"This course provides learners with practical knowledge of sequences and series. By taking this algebra course, you will gain a better understanding of the functionalities and measures of right triangle trigonometry. The circular and reciprocal trigonometric functions will also be discussed. Register for this self-paced course now and improve your comprehension of mathematics today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are sigma notations difficult for you, or do you want to understand sequences defined by various formulas? Then this high school algebra course is for you! In it, the pattern of sequences along with the enumerative and closed forms will be discussed in practical terms. Learn about the procedures for solving finite and infinite sequences. Learners will be introduced to arithmetic and geometric sequences together with applicable examples. Build foundational knowledge of finite and infinite series in addition to expressing series using sigma notation. Study the finite and infinite geometric series as well as arithmetic series. The triangular sequence and sequence defined by a recursive formula will also be covered. Then gain a proper understanding of the Fibonacci, harmonic, power, and binary sequences.</p><p>The material explains the concept of a right triangle from its sides and the importance of the hypotenuse. Learn about the basic trigonometric ratios along with the four methods for proving similar triangles and their ratios. The basic concepts of trigonometric application and solving triangles using trigonometric ratios will be explained. Study the 30-60-90 degree triangle and 45-45-90 degree triangle along with the rules for the lengths of the sides in these two special triangles. Master the terminologies, quadrants, and classification of angles. Study the methods to determine the length of an arc and the coterminal angles. The measurement and conversion of angles will also be broken down. Taking this course gives you insights into the idea, formula representation, and frequently used values of the sine function. You will learn about the application of the cosine and tangent functions. Then study the three additional circular functions related to the basic circular functions of sine, cosine, and tangent.</p><p>Lastly, cofunctions, trigonometric values of quadrantal angles, and Pythagorean identities are covered. Learn about the methods used to determine the trigonometric value of any angle measure. Study how to find the remaining trigonometric values when one value is known. Grapple with the graphs of the six trigonometric functions considering the period, amplitude, frequency, domain, and range of each. Study the reciprocal relationships of the trigonometric functions with their inverse pairs while topics such as trigonometric identities and equations will be covered extensively. Finally, the various methods for proving identities and solving equations will also be explored. This course will be of great benefit to students who have an interest in algebra.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}