{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3684","title":"High School Chemistry: Atoms, Molecules, and Ions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This course prepares you for the Regents Exam in Chemistry by explaining the periodic table and chemical formulas.","description":"This course is designed to teach basic concepts of the periodic table. It analyzes properties of the periodic table relevant to successfully writing chemical formulas. The categorization of elements into groups and periods is also carefully explained to fulfill the needs of learners taking the Regents Exam in Chemistry in New York State but the course is a good refresher for any chemistry student.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you struggle with formulas in chemistry? This free course examines the categorization of elements on the periodic table to provide a better understanding of chemical formulas. It will improve your understanding of the origins of standardized element categorization, as well as cover more newly discovered elements and those yet to be discovered. Furthermore, you will learn about various periodic trends related to elements based on their physical properties. Analyze different aspects of the electrons of atoms including valency, configurations, and dot formulas. Do you&nbsp; want to learn about interesting ways of predicting the charges, electron configurations, and physical properties of elements based on their respective groups or periods? Then, enroll in this course to find out about specific methods for each prediction based on the periodic table.</p><p>Are you a student who wants to avoid the problems connected to balancing chemical equations? Or a teacher who wants your students to grasp the basics of chemical formulas? To successfully pass this second certificate in a series of Regents Exams in Chemistry, there are fundamental requirements in writing chemical formulas that must be passed. This covers ions, atoms, and compounds all related by the periodic table. This course teaches you the basics of each using simple details to help you recall the correct classifications of both monatomic and polyatomic ions based on their distinct properties. This will also improve your ability to name chemical formulas for common monatomic ions, polyatomic ions, binary ionic compounds, and molecular compounds.</p><p>It is common in science to predict and use many hypotheses to better understand observations and situations through evidence. The evidence that is specially used in formulas, atoms, and ions in chemistry is the chemical reaction equations you have learnt. As for moles in chemistry, they are the evidence used in stoichiometry covering empirical and molecular formulas, and even mass-volume calculations. These concepts are all combined to aid simple predictions on ionic compounds that are soluble in water together with conventional solubility rules. It is also typical in science to understand all types of changes, including the microscopic ones chemistry tends to observe more. This course outlines general observations of both physical and chemical changes together with their properties. Start today to learn all about formula writing and the periodic table especially useful to your Regents Exam in Chemistry!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}