{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3739","title":"High School Chemistry: General, Organic, and Nuclear Chemistry","totalEnrolled":"2,634","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes chemical reactions, along with aspects of general, organic, and nuclear chemistry.","description":"This course highlights the basic concepts of general, organic, and nuclear chemistry relevant to students taking high school chemistry exams. Do you need to understand chemistry problems covering acids, bases, and salts? Learn about different reactions related to neutralization, redox, and titration. Start your learning journey on the standardized rules in chemical reactions today!","courseOutcomes":["Distinguish between the Arrhenius an...","Relate Le Chatelier’s principle to t...","Explain the workings of acid-base ti...","Discuss how redox reactions are bala...","Distinguish between the Arrhenius and Bronsted-Lowry acids and bases","Relate Le Chatelier’s principle to the solubility of solids in aqueous solutions","Explain the workings of acid-base titration calculations","Discuss how redox reactions are balanced using oxidation numbers","Identify organic compounds by functional groups","State how IUPAC rules are used in naming alkanes, alkenes, or alkynes","Classify common hydrocarbons into alkanes, alkenes, or alkynes","Distinguish between the Arrhenius an...","Relate Le Chatelier’s principle to t...","Explain the workings of acid-base ti...","Discuss how redox reactions are bala...","Distinguish between the Arrhenius and Bronsted-Lowry acids and bases","Relate Le Chatelier’s principle to the solubility of solids in aqueous solutions","Explain the workings of acid-base titration calculations","Discuss how redox reactions are balanced using oxidation numbers","Identify organic compounds by functional groups","State how IUPAC rules are used in naming alkanes, alkenes, or alkynes","Classify common hydrocarbons into alkanes, alkenes, or alkynes"],"courseDescription":"<p>Information from chemical analysis forms a base for requirements used by engineers, technicians, and scientists. Engineers, for instance, cannot do without the concept of equilibrium. Technicians, on the other hand, require that safety standards are conducted on hazardous materials like acids while chemists often require various specialized instrumental techniques within and outside their areas of specialization. Chemical analysis is very broad and technical. It covers techniques for calculations, analysis, and reporting of concepts in general chemistry. You will be presented with an important standardized technique for conducting accurate acid-base titrations along with unique skills for predicting the spontaneity of reactions. This includes aspects of chemical equilibrium covering the effects of concentration, temperature and pressure on chemical balance together with their shifts.&nbsp;</p><p>This course educated you on the basics of common redox reactions found in the fundamental equations that give us energy all over our universe. They are found in reactions where electrons are caused to move, thereby releasing spontaneous energy. This free online course illustrates these reactions at both atomic and molecular levels in clear terms. The material makes it easy for you to understand concepts around atoms, molecules, and compounds. Learners are also introduced to useful details for mastering basic nuclear and organic reactions as well as other common reactions. This includes secrets every student should have before sitting for their high school exam in chemistry.</p><p>Usually, people perceive nuclear chemistry and its reactions to be solely destructive, causing them to lose opportunities for learning about the benefits of nuclear radioactive particles, especially in relation to energy generation. They also shy away from the important applications of organic chemistry in medicine, therapy, and product processing useful to our everyday lives. You will learn about the many benefits that these fields of chemistry have in making life sustainable. Furthermore, acids are often seen as bad, often neglecting the defining property of varying concentrations that makes acids, bases, and salts harmless. Enjoy a good refresher on your basic chemistry covering general, organic, and nuclear chemistry by enrolling for free today.</p><a href=\"https://alison.com/resume/courses/3739\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3739\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Acids, Bases, and Salts","description":"In this module, you will be introduced to various aspects of general chemistry related to acids, bases, and salts. You will also learn about the concepts surrounding acid-base titrations and chemical equilibrium. You will also learn about the workings of equilibrium shifts.","topics":["Acids, Bases, and Salts - Learning Outcomes","Properties of Acids, Bases, and Salts","Acid-Base Indictors and Titration","Chemical Equilibrium","Acids, Bases, and Salts - Lesson Summary"]},{"name":"Module","details":"Oxidation, Nuclear Reactions, and Organic Chemistry","description":"In this module, you will be introduced to computations and problems of balancing redox equations, oxidation numbers, alongside predicting the spontaneity of redox reactions. You will also learn about nuclear reactions and basic aspects of organic chemistry.","topics":["Oxidation, Nuclear, and Organic Chemistry - Learning Outcomes","Oxidation and Reduction","Nuclear Reactions","Introduction to Organic Chemistry","Oxidation, Nuclear, and Organic Chemistry - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["High School Chemistry: General, Organic, and Nuclear Chemistry - Course Assessment"]}]}