{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3444","title":"High School Equivalency - Historical Governments & United States Democracy","totalEnrolled":"519","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free course in the structure of government to help you prepare for success on the High School Equivalency exam.","description":"This free online course will prepare you for success in the Social Studies portion of the High School Equivalency exam. On completion of this course you will be able to identify and compare historical forms of government including a detailed look at the founding of the United States' democracy. Additionally, you will be able to identify and describe the components that make up the structure of the US government.","courseOutcomes":["Identify and compare types of modern...","Describe the relationship of both mo...","Identify how American constitutional...","Identify circumstances that led to t...","Identify and compare types of modern and historical governments","Describe the relationship of both modern and historical governments","Identify how American constitutional democracy was influenced by key historical documents","Identify circumstances that led to the Constitutional Convention","Recognize compromises in drafting the Constitution","Review the process of amending the Constitution","Discuss the differences and similarities between federal and state governments","Recognize the responsibilities of the president","Compare the functions of state and federal systems","Analyze the two houses of Congress by contrasting and comparing them","Identify and compare types of modern...","Describe the relationship of both mo...","Identify how American constitutional...","Identify circumstances that led to t...","Identify and compare types of modern and historical governments","Describe the relationship of both modern and historical governments","Identify how American constitutional democracy was influenced by key historical documents","Identify circumstances that led to the Constitutional Convention","Recognize compromises in drafting the Constitution","Review the process of amending the Constitution","Discuss the differences and similarities between federal and state governments","Recognize the responsibilities of the president","Compare the functions of state and federal systems","Analyze the two houses of Congress by contrasting and comparing them"],"courseDescription":"<p>This course begins by giving a brief history of world governments and clearly defines the three primary forms of government; oligarchy, autocracy and democracy. Additionally, you will learn different examples of each governmental form with a focus on the representative style of democracy that makes up the United States’ government.</p><p>Next, you will learn about the founding of US democracy and the historical documents that play a central role in establishing the US government. From the Magna Carta to the American Constitution, you will understand the historical influences and important historical figures that helped forge the early stages of the United States.</p><p>Finally, you will take an in-depth look at the structure of the American government, beginning with the three branches of the federal government (legislative, executive and judicial) and analyzing the balance of powers that exist between them. There will be a detailed description of each branch and the role each plays in governance. You will then identify key similarities between the state and federal governments.</p><a href=\"https://alison.com/resume/courses/3444\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3444\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"HSE Social Studies - Government","description":"In this module you will learn a brief history of government and take a detailed look at the founding and structure of the United States Democracy.","topics":["HSE Social Studies - Government - Learning Outcomes","Types of Governments","United States Constitutional Democracy","Configuration of American Government","HSE Social Studies - Government - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}