{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3707","title":"High School Physics: Force and Energy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online physics course examines the standards, examples, and application of force and energy in objects.","description":"Work and energy play essential roles in our everyday lives and scientific circumstances. Not only does energy have many forms, but it is involved in almost all phenomena and is one of the most important concepts in physics. You'll learn how to apply the principles of the conservation of energy to study the dynamics of systems and the relationship between work and energy.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the standards and applications of work and energy. When a force acts on an object to cause displacement of that object, it is said that ‘work’ has been done on the object. There are three key ingredients to this which are workforce, displacement, and cause. In order for a force to qualify as having done work on an object, there must be a displacement and the force must cause the displacement. There are several good examples of work that can be observed in our everyday life such as a horse pulling a plow, a person pushing a grocery cart, a student lifting a backpack full of books or a footballer kicking a ball. In each case, there is force exerted on an object to cause that object to be displaced.</p><p>The course begins by introducing you to Newton's laws and forces and Kepler's three laws of planetary motion. Sir Isaac Newton worked in many areas of mathematics and physics. He developed the theories of gravitation in 1666. In 1686, he presented his three laws of motion in the Principia Mathematica Philosophiae Naturalis. By developing his laws of motion, Newton revolutionized science. Newton’s laws, together with Kepler’s Laws, explain why planets move in elliptical orbits rather than in circles. The course then analyzes friction, its general characteristics, and coefficient. The applications of friction can be seen in our everyday activities. It is an important factor in many engineering disciplines like transportation, measurement, and household usage. For example, road slipperiness is an important design and safety factor for automobiles as is the use of a tribometer to measure the friction on a surface. You will learn about the different applications of friction and how to reduce it.</p><p>Lastly, you will be introduced to momentum, a commonly used term in sports. Momentum is actually a physics term; it refers to the quantity of motion that an object has. A sports team on the move has momentum. If an object is in motion (on the move) then it has momentum. The course analyzes problems connected to the conservation of momentum and the momentum theorem. Work, in physics, is the measure of energy transfer that occurs when an object is moved over a distance by an external force applied in the direction of the displacement. This course identifies the different kinds of situations where no work is done. Register today and improve your understanding of key concepts in physics.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}