{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3761","title":"High School Algebra: Number Operations and Algebra","totalEnrolled":"1,502","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Created for high school math students, this course unpacks sets, number operations, Venn diagrams and basic algebra.","description":"This free online course is a comprehensive guide on the operations of sets and their classification. You will learn about the definition of terms in algebra and how to solve algebraic equations using formulas. Subscription and registration are free, and this course will help you improve your math results with examples and online tests.","courseOutcomes":["Define real numbers and their proper...","Explain the representation of sets i...","Discuss the concepts of rational and...","Recall how positive integers are got...","Define real numbers and their properties","Explain the representation of sets in mathematics","Discuss the concepts of rational and irrational numbers with examples","Recall how positive integers are gotten from number lines","Define the concept of absolute value","Analyze how fractions are expressed in mathematics","Explain the simplification of radicals in numbers","Discuss the composition of algebraic expressions","Discuss the concept and functions of the number line in mathematics","Solve for a specific variable in a formula","Explain how to solve mathematical problems using ratios","Define real numbers and their proper...","Explain the representation of sets i...","Discuss the concepts of rational and...","Recall how positive integers are got...","Define real numbers and their properties","Explain the representation of sets in mathematics","Discuss the concepts of rational and irrational numbers with examples","Recall how positive integers are gotten from number lines","Define the concept of absolute value","Analyze how fractions are expressed in mathematics","Explain the simplification of radicals in numbers","Discuss the composition of algebraic expressions","Discuss the concept and functions of the number line in mathematics","Solve for a specific variable in a formula","Explain how to solve mathematical problems using ratios"],"courseDescription":"<p>This course introduces you to the definition of sets along with the two ways they are represented in mathematics. You will also be introduced to the common vocabulary and definition of terms that will be used in the material. Furthermore, it explains the classification and operations between sets. You will learn about the functionality of Venn diagrams and how they are applied to sets. Study a set of numbers as a collection of elements while exploring the functions and the difference between rational and irrational numbers. The course explains the two types of operations along with the delineation of the basic arithmetic operations that includes addition, multiplication, subtraction, and division. Learn about the definition as well as the properties of real numbers, and how to write sets of numbers using interval notation instead of inequality statements.</p><p>Have you ever struggled with the relationship between number lines and graphing in mathematics? This course succinctly explains how to graph a set of numbers on a number line. It will also take into consideration the origin of the number, which is the point on the number line associated with the number 0. Then learn about the functions of positive and negative integers in algebra. With the aid of illustrations, this course teaches you about the multiplication, addition, subtraction, and division of integers. See how fractions are expressed as the quotient of two quantities while looking at the concept of absolute value. This course explains how decimals are derived from fractions and the different operations that can be performed with fractions. It further sheds light on the different methods of approximating square roots in algebra then explores the simplification process of radicals through the knowledge of perfect squares, perfect cubes, and other popular roots in mathematics.</p><p>Next, you will be exposed to the concept of variables and the composition of algebraic expressions. With concrete mathematical problems, you will learn how algebraic expressions are simplified and how to write equations along with formulas. This course shows you how to solve algebraic equations using addition, subtraction, multiplication, and division. You will also practice how to graph a solution set on a number line and the application of solving equations. Learn how to solve an equation for a specific variable with a formula. By the end, you will be able to solve problems using ratios. This course is targeted at high school students who want to improve their algebra results as well as anyone interested in sharpening their mathematical knowledge.</p><a href=\"https://alison.com/resume/courses/3761\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3761\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Numbers and Operations","description":"This module analyzes the functions of numbers and their operations in mathematics. It further explains how to work with sets of numbers and how fractions are expressed as the quotient of two quantities. Learn about the relationship between rational and irrational numbers in mathematics.","topics":["Numbers and Operations - Learning Outcomes","Working with Sets - Vocabulary and Definitions","Sets of Numbers","The Number Line and Graphing","Fractions and Decimals","The Real Numbers","Irrational Numbers – Definition and Properties","Perfect Squares, Perfect Cubes and Other Popular Powers and Roots","Operations with Radicals","Numbers and Operations - Lesson Summary"]},{"name":"Module","details":"Basics of Algebra","description":"This module encapsulates the composition of algebraic expressions in mathematics. Learn how to solve equations in mathematics using addition, subtraction, multiplication, and division. This module illustrates how to get the percentage of a number in mathematics.","topics":["Basics of Algebra - Learning Outcomes","Variables and Algebraic Expressions","Solving Equations","Graphing a Solution Set on the Number Line","Ratios and Proportions","Percents and Their Applications","Basics of Algebra - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["High School Algebra: Number Operations and Algebra - Course Assessment"]}]}