{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3752","title":"High School Algebra: Solving Equations and Parabola","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"For high school math students, this course shows you how to solve linear and quadratic equations and graph parabolas.","description":"This free online course teaches you the modern approach for solving and graphing linear equations. Learners who take this course will gain up-to-date knowledge of the form, graphical representation, and methods of solving a quadratic equation. The concepts of parabolas and circles will also be covered extensively. Register for this course today if you want to improve your high school physics results.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This is a practical guide for solving linear equations, quadratic equations, and parabolas. In this course, the methods and rules for solving equations using addition and subtraction are discussed in practical terms. Learn about the properties to remember and procedures for solving equations using multiplication and division. You will be taught the applications of solving an equation and how to solve for a specific variable in a formula. Study solving equations by combining terms, solving equations containing parentheses, and graphing a solution set on the number line. Study the Cartesian coordinate system and quadrants together with the procedures of graphing linear equations. The slope-intercept, the point-slope, and the two-point forms of lines are also covered. Learn about the methods of solving systems of linear equations, evaluation of second-order determinants as well as potential complications. Then master the methods of solving systems of linear equations in three variables.</p><p>This course further demonstrates the procedures for graphing and solving systems of linear inequalities. You will learn about number line analysis in addition to the principles for solving quadratic inequality. The general form of a quadratic equation and the various ways of solving them by factoring will be explained. Study the concept of parabolas and the turning point or vertex of quadratic equations. Learn about procedures for solving a quadratic equation by graphing and the concept of double roots. Study the steps used in solving quadratic equations by completing the square and the application of the quadratic formula. The various natures of roots along with the sum and product of the roots will be explained. Taking this course gives you insight into the modern methods used in finding a quadratic equation whose roots are known. You will learn procedures for solving quadratic-linear systems graphically and algebraically. You also will be taught how to solve quadratic inequalities using methods of algebras and set theory. Learn how to solve quadratic inequalities using the method of number line analysis.</p><p>Lastly, the definition of a parabola, graphing of a parabola and the parabola with vertex at the origin will be covered by the material. The general form of and the methods for writing the equation of a parabola will be analyzed extensively. You will learn about the definition, standard equation, graphing, and general equation of a circle in the easiest way possible. Study the various real-world applications of circles and how to write the equation for one. Master variation, simplification of rational expression, and complex fractions. Finally, the procedure involved in the operations of rational expressions will also be covered. This course will be useful for those studying high school math who want to revise algebra to improve their results. There are no subscription or registration fees and you can complete the course for free.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}