{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3740","title":"High School Physics: Electricity and Magnetism","totalEnrolled":"845","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The basics of electrostatics, circuits, magnetism and field lines are all covered by this free online physics course.","description":"This course introduces you to the basics of electrostatics and circuits and is helpful for anyone studying high school science. The study of electrostatics is useful in many areas such as generators, inkjet printers, and electrostatic painting. You will also learn about activity in magnetic fields and field lines. So, simply create your account and register for free to understand more about electricity and magnetism.","courseOutcomes":["Describe charging by friction and ho...","Differentiate between conductors and...","Explain electron volts as a tiny uni...","Describe the mechanism of current co...","Describe charging by friction and how it is achieved","Differentiate between conductors and insulators","Explain electron volts as a tiny unit of energy","Describe the mechanism of current conduction in metallic conductors","Differentiate between Kirchhoff's current law and voltage law","Identify the symbols of electric components","Differentiate between permanent magnets and electromagnets","Analyze Faraday’s laws of electromagnetic induction","Explain Lenz's law is a consequence of conservation energy","List some of the applications of electromagnetism","Describe charging by friction and ho...","Differentiate between conductors and...","Explain electron volts as a tiny uni...","Describe the mechanism of current co...","Describe charging by friction and how it is achieved","Differentiate between conductors and insulators","Explain electron volts as a tiny unit of energy","Describe the mechanism of current conduction in metallic conductors","Differentiate between Kirchhoff's current law and voltage law","Identify the symbols of electric components","Differentiate between permanent magnets and electromagnets","Analyze Faraday’s laws of electromagnetic induction","Explain Lenz's law is a consequence of conservation energy","List some of the applications of electromagnetism"],"courseDescription":"<p>Electricity and magnetism are separate yet interconnected phenomena associated with electromagnetic force. Together, they form the basis for electromagnetism, a key discipline in physics. In an electromagnetic wave, the electric field and magnetic field are perpendicular to one another. Except for behavior due to the force of gravity, nearly every occurrence in daily life stems from electromagnetic force. It is responsible for the interactions between atoms and the flow between matter and energy. Other fundamental forces govern radioactive decay and the formation of atomic nuclei. This course introduces you to the basics of electrostatics. Coulomb's law provides an accurate description of the force between two objects whenever the objects act as point charges. It has many applications to modern life, from photocopiers and laser printers to powder coating. This course analyzes Coulomb's law in vector form as well as the comparison of electrostatic and gravitational forces.</p><p>It introduces you to different types of materials. Have you ever experienced a feeling of electric shock while coming in contact with a household appliance or while trying to plug your phone to charge? Why does that happen? Why don’t we get a similar experience when we are in contact with wooden materials? By the end of this course, you will be able to differentiate between the two types of materials with the aid of examples. You may wonder how charges can continuously flow in a uniform direction through wires. In order for a source-and-destination scheme to work, both need to have an infinite capacity for charges in order to sustain a continuous flow. This is possible with the aid of circuits, a never-ending looped pathway for charge carriers.</p><p>Lastly, you will learn about the relationship between current and resistance expressed by Ohm’s law. This states that the current flowing in a circuit is directly proportional to the applied voltage and inversely proportional to the resistance of the circuit, provided the temperature remains constant. In 1845, German physicist Gustav Kirchhoff developed a set of rules that deal with the conservation of current and energy within electrical circuits. These are known as Kirchhoff's current and voltage laws, and the course will explain them further. Magnetism is caused by the motion of electric charges. The material outlines the magnetic lines and properties of force, and the magnetic forces between permanent magnets. If you want to improve your high school physics results, sign up for this free course today!</p><a href=\"https://alison.com/resume/courses/3740\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3740\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Electrostatics","description":"In this module, you will be introduced to electrostatics and Coulomb's law/The electric force The module also discusses grounding, conservation, and quantization of charge. You will also learn about vertical motion and horizontal motion. You will also learn about work done to move a charge in an electric field and Milliken’s oil drop experiment.","topics":["Electrostatics - Learning Outcomes","Introduction to Electrostatics","Conductor Vs Insulator","Introduction to Grounding","Work Done to Move a Charge","Electrostatics - Lesson Summary"]},{"name":"Module","details":"Circuits and Resistors","description":"In this module, you will be introduced to circuits and currents. The module also discusses drawing schematic diagrams and Kirchoff's law of voltage. You will also learn about the different types of circuits.","topics":["Circuits and Resistors - Learning Outcomes","Introduction to Circuits","Simple Circuit","Kirchhoff’s Laws","Circuits and Resistors - Lesson Summary"]},{"name":"Module","details":"Magnetic Forces","description":"In this module, you will be introduced to the concepts of Magnetism and Geomagnetism. The module also discusses Oersted’s laws and Faraday’s law of electromagnetic induction. You will also learn about the different types of generators and their advantages.","topics":["Magnetic Forces - Learning Outcomes","Introduction to Magnetism","Oersted’s Law","Calculating the Force on a Current","Faraday’s Law of Electromagnetic Induction","Magnetic Forces - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["High School Physics: Electricity and Magnetism - Course Assessment"]}]}