{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3860","title":"High School Algebra - Real Numbers and Polynomials","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online math course takes you through the basics of real numbers, binomials and polynomials in simple modules.","description":"Get to grips with the definition and properties of real numbers. This course introduces the learners to the techniques used to perform basic operations with radicals as well as the differences between non-positive integral exponents and zero exponents. By the end, the learner will be acquainted with operations using rational expressions as well as multiplying monomials and polynomials.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Real numbers comprise different types of numbers, prominent among them are rational and irrational numbers. This course explains the various properties of irrational numbers and how they are linked in the practice of algebra. Are you familiar with the number line system in mathematics? Did you know that all irrational numbers maintain a particular position on the real number line? By taking this course, you will get a thorough understanding of the set of numbers that make up real numbers. The material takes you through the different methods for calculating the square root of a number. In elementary mathematics finding the square root of a perfect square can be quite easy. But, when the radicand is not a perfect square, there are proven and tested methods that can be used to find the approximate value of the square root. The course will take you through the approaches used to find the square of perfect squares.&nbsp;</p><p>Do you know that operations like addition, subtraction, multiplication and division can be performed with radicals? These operations are valid for square roots, cube roots, and even fourth roots. You will study the simplification of radicals, how to add and subtract radicals as well as their use in problem-solving. Simplifying radicals can be sometimes daunting! To simplify radicals, you must have a good knowledge and understanding of perfect squares, perfect cubes, or other roots, as well as the product property of square roots. Learn how to add or subtract radicals by ensuring the index or root must be the same, and the radicands must also match. You will study equations containing a variable under the radical sign called a radical equation. There are instances where an algebraic expression contains only a singular term; this is a monomial. A monomial can exist as a real number in constant form or as a variable. It can also be expressly written as the product of a real number and other variables. In working with monomials, we will need to learn the laws for exponents.&nbsp;</p><p>You will also study useful scientific notations relevant to algebra, which are important when dealing with large numbers. They can also be used if working with very small numbers. As a student, having basic knowledge of scientific notation ensures you are able to compute extreme numbers more easily. Another interesting concept you will get to learn is polynomials, an expression with two or more monomial terms combined by addition and/or subtraction. Monomials combine to form a polynomial and each monomial making up the polynomial is known as a term. Polynomials can be classified in different ways, including as constant, linear and quadratic. You will be introduced to different operations that can be performed on a polynomial, including addition and subtraction as well as using associative, commutative and distributive properties. This course also elaborates on binomials, which are expressions consisting of two monomials combined by an addition or subtraction sign. Are you having difficulties with dividing polynomials? This course has got you covered! It covers in detail the two methods for dividing polynomials - the long division method and the synthetic division method. Sign up for free to revise algebra online with this free math course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}