{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3710","title":"High School Physics: Mechanics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes the various standardized units of measurements, as well as the mechanics of motion.","description":"This course introduces you to the fundamental aspects of physics. Units of measurements are important because without standardized units, it would be extremely difficult for scientists to express and compare measured values in a meaningful way. You will learn about the importance of units of measurements and the study of motion.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course covers two fundamental aspects of physics: measurement and motion. A unit of measurement is a standardized quantity of physical property used as a factor to express occurring quantities of that property. Units of measurement were among the earliest tools invented by humans. The definition, agreement, and practical use of units of measurement have played a crucial role in human endeavor from early ages up to the present. They are important because without them, it would be extremely difficult for scientists to express and compare measured values in a meaningful way. The measurements of physical quantities are expressed in terms of units, which are standardized values. For example, the length of a race, which is a physical quantity, can be expressed in metres (for sprinters) or kilometres (for long-distance runners). You will learn about unit conversions and the guidelines for good graphing techniques.</p><p>The course then introduces you to vector and scalar quantities. Mathematics and science developed as ways of understanding and describing the world around us. A lot of mathematical quantities are used in physics to explain concepts clearly, including force, speed, velocity, and work. These are often described as being scalar or vector quantities. Scalar and vector quantities are differentiated depending on their definition. You will also learn about the resultant of two vectors that are collinear and at right angles. Some numerical statements are exact: for example, 2 + 2 = 4. However, all measurements have some degree of uncertainty that may come from a variety of sources. The process of evaluating this uncertainty associated with a measurement result is called uncertainty analysis or error analysis. You will learn about the different types of errors and how to measure them.</p><p>Then, you will be introduced to the study of motion. In physics, motion is the phenomenon in which an object changes its position over time. Motion is mathematically described in terms of displacement, distance, velocity, acceleration, speed, and time. The motion of a body or object is observed by attaching a frame of reference to an observer. Measuring the change in position of the body relative to that frame with a change in time. The branch of physics describing the motion of objects without reference to its cause is kinematics. The branch studying forces and their effect on motion is known as dynamics. You will learn about different aspects of motion and its graphical analysis. Next, the course analyzes acceleration. An often confused quantity, acceleration has a much different meaning from what is implied by sports announcers and other people. You will learn about the different types of acceleration and how to calculate them. So, register for this course today and begin your next learning journey in physics!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}