{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4006","title":"High School Algebra - Probability and Statistical Analysis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This course covers Venn diagrams, probability evaluation, dispersion and distribution of data and Bernoulli’s theories.","description":"‘Probability and Statistical Analysis’ is a free online course from Alison that discusses the principles and methods of these parts of algebra. Learn about Venn diagrams, methods of evaluating probabilities, and Bernoulli's experiments. You explore the concepts of statistics, modes of displaying data, measures of dispersion, and normal distribution. Register now and improve your math results today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Having difficulty applying probability theory to predict possible outcomes and learning the principles of statistics? Then this high-school algebra course is for you! Here, the definition of sample space, as well as tree diagrams and fundamental principles of counting, will be discussed in practical terms. Learn about Venn diagrams as an additional means of visualizing probability ideas. You will be taught the probability of simple and compound events, and master about the definition of and formula used to calculate empirical probabilities. Study the types and functions of probabilities in addition to the formula for calculating theoretical probability. This course also covers the evaluation and sum of probabilities, and complementary events. Learn about simple probabilities, certainties, and impossibilities, and delve into the probability of mutually exclusive or inclusive events.</p><p>Furthermore, this course analyzes the principle of counting and probability principles. You will learn how to solve the probability of independent and dependent events. A brief history and application of Bernoulli's experiments in addition to the conditions it must satisfy will be explained. Study the probability of exactly 'x' successes in 'n' trials and the probability that at least (or at most) a certain number of successes will occur. Learn about the brief history and application of statistics. Study the requirements for sampling, ways of gathering data and its various classifications. The measures and different types of central tendency in understanding the importance of an entire set of a given data is broken down. Taking this course gives you insight into the application of the ‘mean’, ‘median’ and ‘mode’. You will learn the various ways of representing, displaying and graphing data. Learn about pictorial graph representation and the steps used to determine the size of each sector of a pie graph.</p><p>Lastly, the definition of and method for constructing a cumulative frequency histogram from given data will be covered. Topics such as understanding percentiles, quartiles, and median will be analyzed extensively. You will learn about the method for determining the median for individual observations and how to find quartiles on a graph. Study the various methods and advantages of data dispersion along with mean absolute deviation, range, variance and square deviation. Learn about normal bell-shaped distribution and the guidelines the normal curve is constructed by. This course will greatly benefit those who want to improve their high school mathematics results or their understanding of basic stats and probabilities.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}