{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3738","title":"High School Chemistry: Matter and Intermolecular Forces","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the properties of different states of matter, as well as their intermolecular forces.","description":"Everything around us is made of matter: the water we drink, the air we breathe and even the computer you’re using. As substances, they obey the basic scientific definition of matter being anything that has weight and takes up space. Have you ever wondered what the smaller constituents of matter are? Or how they combine to make up the different states of matter? Take this foundational chemistry course today to learn more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Our universe is made up of matter. Matter is found within our bodies and around our close environment too. It occupies space within our observable sight and at molecular levels we cannot simply see with our bare eyes. Curious minds have been investigating concepts relevant to matter since the fifth century, giving rise to interesting theories including those of ancient Greek philosophers like Empedokles. He suggested that the roots of matter were ‘eternal and invariable’ consisting of water, air, fire and earth. The concept of Plato’s bodies was later developed to improve representations of Epedokles’ “roots of matter”. This would, in turn, support many arguments regarding the constituents of matter forming what eventually gave rise to modern-day atomic theory. Learn about the scientific experimentation and proofs that made modern-day atomic theory outlive other theories regarding matter.</p><p>This course explores the chemistry behind the existence of matter in its different states of solid, liquid and gas. It maintains its characteristics of occupying space (or having volume) and having weight. Each state of matter has its own unique properties that distinguish it from the others. The properties of each state are analyzed in this course together with their relationships and expected effects from varying forces or energies. You will learn about common variables affecting gas pressure including volumes of the containers used, temperature of gasses surrounding us, and the number of measurable gas molecules in containers. In addition, the different states of matter have varying factors of the strength of attraction between molecules. For instance, liquids have different types and strengths of attractions to one another following common intermolecular forces involving dipole and induced dipole forces.</p><p>Science students interested in increasing their chances of passing their high school chemistry exams should enroll in this free online course. Your proficiency in calculations involving ideal gas laws, Dalton’s law, Charles’s law, Boyle’s law, Avogadro’s law, and Gay-Lussac’s laws will be improved. You will also learn about calculations related to various chemical solutions and their molar concentrations. The material covers molecular forces, subatomic particles, and the basic aspects of chemical bonding. Do you want to understand what happens when matter changes from one form to another? Start this course today to comprehend the chemical concepts of matter relevant to their different states alongside the intermolecular forces at play.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}