{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4447","title":"Home Education - Assessment and Methods","totalEnrolled":"1,326","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the principles behind home education and track your child’s progress with this free online homeschooling course.","description":"Is homeschooling the best option for you and your child? Explore the latest concepts of home education and its requirements, advantages and disadvantages. We will show you the different methods of homeschooling that will help you adapt your teaching according to your child’s interests and aptitude. Discover how to assess your child’s progress and prepare them for formal examinations so that they can pursue further studies.","courseOutcomes":["Explain why many parents choose home...","Describe the different legalities th...","Outline the advantages and disadvant...","Differentiate between the different ...","Explain why many parents choose home education over traditional school education","Describe the different legalities that encompass home education","Outline the advantages and disadvantages of homeschooling","Differentiate between the different homeschooling methods and styles","Discuss the benefits of Charlotte Mason and Montessori method over the classical homeschooling methods","Distinguish the different homeschooling methods adapted by parents/teachers","State the different approaches a parent/tutor can take to assess the child's progress in education","Explain why many parents choose home...","Describe the different legalities th...","Outline the advantages and disadvant...","Differentiate between the different ...","Explain why many parents choose home education over traditional school education","Describe the different legalities that encompass home education","Outline the advantages and disadvantages of homeschooling","Differentiate between the different homeschooling methods and styles","Discuss the benefits of Charlotte Mason and Montessori method over the classical homeschooling methods","Distinguish the different homeschooling methods adapted by parents/teachers","State the different approaches a parent/tutor can take to assess the child's progress in education"],"courseDescription":"<p>Are you dissatisfied with the pedagogical pattern of public or private schools? Do you wonder whether your children are learning what they ought to know and when they need to know it? You can opt to teach your child at home, either full- or part-time, using a curriculum best suited to your child’s needs. Homeschooling has become increasingly popular as people from all backgrounds choose to educate their children independently rather than enrol them in traditional schools. It offers a range of benefits as well as challenges for both parents and children. The first step is to determine when and how to start your homeschooling program in terms of the laws that regulate it in your state or country. We explore the world of homeschooling to help you decide if it would be a good fit for your child or ward.</p><p>Homeschooling is legal throughout Europe, Australia, New Zealand, North America, Hong Kong and South Africa and is popular in Canada, France, the United Kingdom and the United States. The laws regulating homeschooling are unique to each state so knowing local homeschool laws is of utmost importance. This course will give you an outline of the home education laws in the UK and will guide you with your legal responsibilities. We teach you the numerous benefits and challenges of home education. We discuss the different homeschooling methods, the principle behind each and their benefits and drawbacks. This will help you plan your teaching methodology and select the curriculum and schedule to best fit your child and family. Finally, we will show you the different ways to assess your child’s learning progress that will help them reach their potential, pursue further studies and develop a career.</p><p>Homeschooling your children will have an impact on practically every part of your family's life. You will need to consider schooling options, your children’s learning styles, the cost and more. Homeschooling is a one-on-one job where you, as the parent, are the instructor. You will take on the duties and responsibilities of a teacher and administrator. We have designed this course for parents, guardians and anyone who considers homeschooling the best option for their child or ward. There is no prerequisite required and all you need is a passion for teaching. Every parent wants the best for their children. If you contemplate homeschooling, we will help you develop the right mindset and confidence. This course answers many questions on the various learning styles and provides facts about testing and socialization tips. So why wait? Take complete charge of your child or ward's education and register today!</p><a href=\"https://alison.com/resume/courses/4447\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4447\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Homeschooling","description":"This module will help you understand the pros and cons of homeschooling. You will learn how to start homeschooling your child, what role any educational body have and whom you need to inform of your decision. The module will also acquaint you with various methods of homeschooling, assessing the child’s progress and preparing for formal exams.","topics":["Homeschooling - Learning Outcomes","Introduction to Home Education","Methods of Homeschooling and Assessment","Homeschooling - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Home Education - Assessment and Methods - Course Assessment"]}]}