{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4442","title":"How to Play the Cello","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the practical, step-by-step technique of playing the cello from beginner to advanced in this free online course.","description":"Does the deep sound of the cello intrigue you? This course studies all the practical, step-by-step techniques of playing the cello. We show you the basic concepts required to take you from a beginner to a professional cellist. Examine the ‘D major’ scale and the methods for playing a musical piece on the cello. By completing this course, you will master the creative skills that can make you a world-class cellist. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Music is an arrangement of harmonious sounds with a systematic blend of rhythm, pitch and tonality. Music is an auditory art that is universal in the human experience because it transcends the vital aspects of different cultures. A cello is a bowed string instrument with a hollow wooden body, two holes (also known as the ‘f-holes’) and four strings tuned in perfect fifths. This music course will first teach you how to obtain a cello and considers the possibility of hiring the instrument by visiting websites that lease it.</p><p>Next, you will become familiar with the accessories that are required for the cello to be able to function appropriately. The topic on maintenance for the cello will examine the care and preservation of the instrument from extreme temperatures and naturally dry climates. You will see why you must allow the newly shipped cello to acclimatize to your home climate before tuning the instrument and learning its systems for tuning. Similarly, you will examine the parts and components of the cello, and you will learn how to maintain good posture while playing and performing on the instrument. Then the techniques of plucking the harmonious strings of the cello, also known as the basic ‘pizzicato’, will be exquisitely demonstrated. We adopt the analogy ‘Cats Go Down Alleys’ to help you understand the ‘open strings’ technique for the lowest strings of a cello to help you further examine the subject and enhance your understanding.</p><p>Finally, you will study the left-hand technique of playing the cello and how you can master the system to become a professional cellist. The topic on the musical staff will highlight how it works as we go through concepts like note reading, the names and identity of musical notes and the bass clef. In addition, you will learn about the music scale, including how to play the ‘D major’ scale on your cello. We illustrate how to master the bow by considering the concepts and methods for bow hold, bow directions and bowing the open strings. You will then be ready to play a music piece on your cello using strings and a bow. By completing this course, you will learn creative music skills that set you on the right path to becoming a highly sought-after professional cellist. So why wait? Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}