{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5334","title":"How to Write Citations, References and Bibliographies","totalEnrolled":"626","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to cite sources and use references to write bibliographies in this free online academic writing course.","description":"Are you confused by the different roles of citations and references in your bibliographies? This academic writing course is designed to help students, writers and researchers conform to publishing conventions regarding the use of sources in their work. We dispel common misconceptions regarding these terms and explore the complexities of style guides and reference management systems to prepare you for the peculiar demands of academic writing.","courseOutcomes":["Explain the concept and importance o...","Describe what sources should be cite...","Define ‘citations’, ‘references’ and...","Discuss the different roles of citat...","Explain the concept and importance of documenting sources","Describe what sources should be cited in academic writing","Define ‘citations’, ‘references’ and ‘bibliography’","Discuss the different roles of citations and references in bibliographies","Outline the role of style guides or manuals in academic writing","List the various types of style guides or manuals used in research","Discuss the benefits of reference management systems","Summarise the importance of reference management systems in organising the sources of your information","Explain the concept and importance o...","Describe what sources should be cite...","Define ‘citations’, ‘references’ and...","Discuss the different roles of citat...","Explain the concept and importance of documenting sources","Describe what sources should be cited in academic writing","Define ‘citations’, ‘references’ and ‘bibliography’","Discuss the different roles of citations and references in bibliographies","Outline the role of style guides or manuals in academic writing","List the various types of style guides or manuals used in research","Discuss the benefits of reference management systems","Summarise the importance of reference management systems in organising the sources of your information"],"courseDescription":"<p>Citations serve a significant purpose in academic writing beyond preventing plagiarism. They are used to credit the work of other authors and sources in scholarly communication. The core purpose of this course is to provide a comprehensive understanding of the terms ‘citations’, ‘references’ and ‘bibliography’. We also explore various styles guides and explain the role of reference management systems in organising the sources used to create content.</p><p>How significant is documenting sources in scientific work? We will begin this course by explaining the rationale of such documentation before demonstrating the methods used to cite sources. We lay out the various categories of such sources of information and explain what you should and shouldn’t document. The course then compares the role of citations and references and explains how to include them in your bibliographies.</p><p>We then establish the importance of style guides or manuals in research and show you how to use them to make sure your work meets the expected standard. The course discusses various reference management systems and explains how to use them to organise your references, which can be daunting in long documents. Finally, we investigate various commercial and free reference management systems that can make your life easier. This academic writing course is designed to help scholars, students and researchers source their work properly and avoid accusations of plagiarism. These skills are crucial to anyone writing non-fiction and can make the difference between success and failure in schools, universities and the world of publishing.</p><a href=\"https://alison.com/resume/courses/5334\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5334\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Citation, References, Bibliography and Reference Management Systems","description":"This module begins by outlining the key topics and the procedure for citing sources of information. The differences between citations, references, and bibliographies will next be covered, as well as a reference book that provides instructions on how to write in specific fields. Finally, you will learn how to collect, manage, and use references.","topics":["Citation, References, Bibliography & RMS - Learning Outcomes","Documenting Sources","Citation, References and Bibliography","Style Guides","Reference Management Systems","Citation, References, Bibliography & RMS - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["How to Write Citations, References and Bibliographies? - Course Assessment"]}]}