{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4389","title":"How to Feed Your Dog a Raw Diet Using BARF or RMB Methods","totalEnrolled":"690","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course shows you how to feed your dog a raw, natural diet that leaves them lean, fit and healthy.","description":"During this dog care course, you will learn how to feed your dog a raw diet that contains no preservatives, colourants, additives or low-quality ingredients. You'll learn a natural feeding method that is easy for dogs to digest and gives them vibrant health - regardless of their age, current health or weight. Additionally, raw feeding is a great way to reduce your dog food bills and will save you a fortune at the vet’s office.","courseOutcomes":["Define ‘raw feeding’ and discuss why...","Explain how to switch from conventio...","Identify how much to feed your dog d...","Describe the different types of raw ...","Define ‘raw feeding’ and discuss why it's so beneficial to dogs","Explain how to switch from conventional feeding to raw feeding","Identify how much to feed your dog daily","Describe the different types of raw feeding methods and explain where to get the food","Summarize how to feed your dog a diet that has no preservatives, colourants, additives or low-quality ingredients","Describe how to feed your dog the way nature intended so that they have optimum health, body weight and longevity","Identify how to save money on your dog food and veterinary bills","Define ‘raw feeding’ and discuss why...","Explain how to switch from conventio...","Identify how much to feed your dog d...","Describe the different types of raw ...","Define ‘raw feeding’ and discuss why it's so beneficial to dogs","Explain how to switch from conventional feeding to raw feeding","Identify how much to feed your dog daily","Describe the different types of raw feeding methods and explain where to get the food","Summarize how to feed your dog a diet that has no preservatives, colourants, additives or low-quality ingredients","Describe how to feed your dog the way nature intended so that they have optimum health, body weight and longevity","Identify how to save money on your dog food and veterinary bills"],"courseDescription":"<p>Do you want to feed your puppy or dog a diet that is designed to give them optimum health, body weight and longevity and one that has no preservatives, colourants, additives or low-quality ingredients? This dog care course is designed for owners who would like to reduce their dog food bills and save a fortune at the vet’s office. Some dog food ingredients can cause health problems and behavioural issues such as hyperactivity and aggression. When dogs are fed the right diet, unwanted behaviours can disappear and training becomes much easier. It's time to take back control and feed your dog the way nature intended. Raw feeding (often called BARF or RMB) is a natural way of feeding puppies and dogs of all ages and gives them clean teeth, fresh breath, bright eyes, a shiny coat, a strong immune system, healthy joints, optimum health and longevity. It also prevents foul-smelling stools and wind and stops dogs from ‘dragging' their bottoms across the carpet, big vet's bills, recurring illnesses, unwanted dog behaviours caused by food allergies and deficiencies and much more.</p><p>‘You are what you eat’ and your dog is what you feed them. Long before the dog food industry took a firm hold on us, dogs were lean, fit and didn't suffer from the numerous illnesses (or unwanted behaviours) we see today. Back then, there were no cans or packets of dog food to open. Dogs were fed like dogs and were healthy, balanced and well-behaved. During this raw feeding course, you'll discover three different ways you can feed your dog a raw diet and where to buy the food to do so. You'll learn that this is not only a much healthier way of feeding your dog but is also much cheaper than regular dog food. This course provides the answers to common questions and myths about raw feeding that can stop people from properly feeding their dog, which in turn fills veterinary surgeries with sick dogs. A poor diet also creates the need for additional dog training in order to resolve the unwanted behaviours caused by feeding dogs conventional dog food.</p><p>During this raw feeding course, you'll learn the exact diet Sharon fed her two dogs, which stopped their scooting their bottoms across the floor within days and kept them away from veterinary clinics for most of their lives. You'll also get a checklist of what you need to get started feeding a raw diet straight away (it's much easier than you might think). By the end of this dog care course, you'll know enough to switch to feeding your dog to a raw diet, what to feed them, how much to feed them and where to get your supplies. You'll know exactly how to take control of what is fed to your dog - which comes without nasty side-effects, promotes optimum health and will save you a fortune at the vet’s office. Imagine your dog with a shiny coat, optimum body weight and vibrant health. That's what you can look forward to after completing this course. It's never too early or too late to feed dogs raw food and you don’t need any prior knowledge of raw feeding to start.</p><a href=\"https://alison.com/resume/courses/4389\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4389\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"How to Feed Your Dog a Raw Diet","description":"In this module, you will learn how to describe three different raw feeding methods for dogs, which are BARF, Raw Meaty Bones and ready-made BARF. You will be able to explain how to switch from conventional feeding to raw feeding, what to feed your dog, how much to feed them and where to get your supplies.","topics":["How to Feed Your Dog a Raw Diet - Learning Outcomes","Introduction to Sharon Bolt and Good Dogs!","BARF (Biologically Appropriate Raw Food) for Dogs","RMB (Raw Meaty Bones) or Prey Model Feeding for Dogs","Ready Made BARF for Dogs","How to Feed Your Dog a Raw Diet - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - How to Feed Your Dog a Raw Diet Using BARF or RMB Methods"]}]}