{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1729","title":"Inflation in Modern Economies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about inflation in this free online economics course that explains its role in shaping modern economies.","description":"This economics course explains the role that inflation plays in modern economies and describes its impact on the life of an average person. Inflation is the rate at which the average price of goods and services increases over time. It is the regular rise in the general level of prices where a unit of currency buys less than it did in the previous years. This course breaks down such complex ideas to help you understand the global economy.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course explains the meaning of inflation, how it is measured and how it affects the consumer. We then examine data about inflation going up and down during a course of a year. This will help you understand the exact meanings of deflation and hyperinflation and how they are used to discuss inflation. We also trace the links between inflation and price increases prompted by a fall in the supply of common goods and services.</p><p>The course then establishes why good economies tend to be associated with a moderate level of inflation and investigates the strange combination of inflation and stagnation. We show you how stagflation can cause massive inflation in one part of the economy while affecting other parts of the economy differently. Finally, we cover the negative effects of higher inflation and provide a macroeconomic overview.</p><p>Many of us have heard our grandparents talk about how a candy bar cost barely anything during their childhood. In the early twentieth century, a Hershey's chocolate bar cost just two cents but that same chocolate bar now costs over a dollar. Inflation explains the change in price and makes a massive difference in the average person's daily life. Sign up for this course to understand the economic forces that drive the world around you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}