{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5310","title":"Intermediate Chemistry: Hydrocarbons","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online chemistry course delves into alkanes and alkenes, which are saturated and unsaturated hydrocarbons.","description":"The first four members of an alkane prefix identify its characteristics or origin; for instance, \"Meth-\" is the Greek name for wine. This intermediate chemistry course will teach you the essentials of saturated alkanes and alkenes, unsaturated hydrocarbons. You'll learn about their extraction from crude oil by refining, as well as their different physical properties, combustion and substitution reactions, and industrial applications.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Hydrocarbons obtained from crude oil are a good source of energy. Their combustion produces carbon dioxide and water. This chemistry course describes hydrocarbons in detail and outlines the key differences between their two main categories, saturated and unsaturated compounds, known as alkanes and alkenes. The first topic explored is saturated alkanes, compounds with only single bonds, which are sigma C-C or C-H covalent bonds. You'll also learn about their general formula, naming convention and some of the physical properties of alkanes, such as their states based on the carbon numbers, boiling points and solubility in organic solvents.</p><p>After that, we investigate the drilling and refining of crude oil procedures together with all the fractional distillation columns. Next, we explore how alkanes can undergo combustion or substitution reactions and why burning hydrocarbons results in air pollution. The course moves on to discuss alkenes, which are a series of homologous hydrocarbons with one double bond per molecule. You'll study the rules for naming them and their various reactions, such as the addition of hydrogen and the addition of halogen halides and water that follows Markovnikov's rule.</p><p>Then we examine the oxidation of alkenes, which generates carbon dioxide and water, and the reaction of dilute and concentrated potassium manganate with them, which produces diols and ketone or aldehyde. Following that, you'll discover the testing of unsaturation using bromine and potassium manganate. You'll learn about polymerization, various addition polymerization reactions, and the polymers that result from these processes and are used to create plastic goods. Finally, you'll find out why plastics take a long time to decompose and the benefits and problems associated with their burning. Advance your understanding of organic chemistry with this engaging course!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}