{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3521","title":"International Relations","totalEnrolled":"12,875","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online international relations course will improve your skills in addressing contemporary global issues.","description":"In this free online course, you will be presented with a complete introduction to international relations which is an important academic discipline. This course will make you a better thinker and speaker by giving you the knowledge and understanding of the key aspects and basics principles of international relations along with the unique relationships that exist between many nations, sovereign states and their respective cultures.","courseOutcomes":["Define international relations...","Discuss the theories of internationa...","Describe the evolution of inter-stat...","Discuss the history of international...","Define international relations","Discuss the theories of international relations","Describe the evolution of inter-state relations","Discuss the history of international relations","Explain the classic definition of war","Analyze the principle of collective security","List the levels of analysis of international relations","Recall why Edward Hallett Carr criticized the idealist and the League of Nations","Define international relations...","Discuss the theories of internationa...","Describe the evolution of inter-stat...","Discuss the history of international...","Define international relations","Discuss the theories of international relations","Describe the evolution of inter-state relations","Discuss the history of international relations","Explain the classic definition of war","Analyze the principle of collective security","List the levels of analysis of international relations","Recall why Edward Hallett Carr criticized the idealist and the League of Nations"],"courseDescription":"<p>International relations (IR) is the scientific study of the international connections between the world's sovereign states. This certificate in international relations will begin with exploring the concepts and history of international relations, and the great debates that surround the cause of World War I. Some great resources such as 'The Great Illusion' by Norman Angell and 'Introduction to Global Politics' by Richard W. Mansbach will be discussed to further expand your knowledge on international relations. Some of the most important theories relating to international relations such as realism, liberalism, constructivism and feminism will then be taught. The theory of IR is a set of ideas that explain how the international system functions and the key assumptions of IR theory as a part of social science and as an analytic tool, focusing on the problems of war, peace and foreign policy decision-making are then explored in detail. International relations generally distinguishes between three levels of analysis and in IR, the thought of several levels of analysis indicates that the spectator and analyst can choose to focus on the entire international system, components of the system in interaction with one another or specific parts of the system - you will be shown what forms the parts or components of this system.</p><p>The study of international relations revolves around states and this international relations course will analyze governments, agencies, bureaucracies, how states are organized, the role of agencies and bureaucracies within states and the impact that they have on the foreign policy of the state. This course will also discuss how inter-state relations have evolved since the Middle Ages and what the Westphalian system means. A peace treaty is a legal agreement between two or more hostile parties, typically nations or governments, that formally ends the parties' state of war. You will be shown the peace treaties of Augsburg and Westphalia and the emergence of modern statehood. Power in international relations is defined in different ways and there are different approaches to how power is measured in IR. This course goes on to explore the different forms of power, power in the Middle Ages, the evolution of European states and religious wars. What exactly is war? You will be shown the actual meaning and causes of war and the&nbsp; approaches that can be used to achieve international peace. International politics deals with the interaction between political and economic forces. The course content thoroughly explains the concepts of liberalism, realism and Marxism and their different approaches to the international political economy and globalization. This course goes on to discuss the relationship between the organization of political authorities within states and how effective they are in responding to the Covid19 pandemic.&nbsp;</p><p>This course is important if you want to have an understanding of international relations in a broad sense, become a diplomat, or if you are simply interested in learning more about how the world works and how we have reached our current global state of affairs.</p><a href=\"https://alison.com/resume/courses/3521\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3521\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"History, Theories and Evolution of IR","description":"In this module, you will be introduced to the concept of international relations and its history. Learners will also be introduced to the theories and evolution of international relations. You will learn about the evolution of inter-state relations and the driving force behind their emergence. You will be shown how cooperation is achieved and sustained in world politics and the political powers that existed in the middle ages.","topics":["History, Theories and Evolution of IR - Learning Outcomes","Course Introduction","Definitions Of International Relations","Types Of Theories","Theories of International Relations","More Theories of International Relations","Evolution Of Inter-State Relations","History, Theories and Evolution of IR - Lesson Summary"]},{"name":"Module","details":"Conflicts And Globalization","description":"In this module, you will be introduced to the definitions of war and its causes. You will be taught the Bretton Woods system of monetary cooperation and its institutions. On top of this, you will learn about the effect of the Covid-19 pandemic on globalization. Furthermore, learners will gain an understanding of the idea of collective security, how to reform capitalism and Marxism in international relations.","topics":["Conflicts And Globalization - Learning Outcomes","Causes Of War","Quest For International Peace","Security And Organizations","International Political Economy","Economy And Globalization","Conflicts and Globalization - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - International Relations"]}]}