{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4518","title":"Introduction to Arboriculture","totalEnrolled":"1,752","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain in-depth knowledge of tree biology and tree establishment, care and maintenance from this free online course.","description":"Trees are vital to our survival on earth since they give us oxygen, store carbon, stabilize the soil and give life to wildlife. It is therefore essential to preserve and sustainably manage them. This course will help you develop the expertise and skills needed to work in arboriculture. It provides indispensable knowledge and background training in tree identification, selection and care. Enrol now and broaden your understanding of arboriculture.","courseOutcomes":["Explain appropriate procedures for p...","Discuss the characteristics of plant...","Summarize appropriate procedures for...","Recall the solutions for the managem...","Explain appropriate procedures for planting a range of trees in different conditions","Discuss the characteristics of plant nutrition necessary for healthy plant growth","Summarize appropriate procedures for pruning trees","Recall the solutions for the management of a range of common pests and diseases","Identify the importance of organic matter in soil management","Describe the importance of photosynthesis in seed germination and tree growth","Explain appropriate procedures for p...","Discuss the characteristics of plant...","Summarize appropriate procedures for...","Recall the solutions for the managem...","Explain appropriate procedures for planting a range of trees in different conditions","Discuss the characteristics of plant nutrition necessary for healthy plant growth","Summarize appropriate procedures for pruning trees","Recall the solutions for the management of a range of common pests and diseases","Identify the importance of organic matter in soil management","Describe the importance of photosynthesis in seed germination and tree growth"],"courseDescription":"<p>Arboriculture involves the caring and maintenance of individual trees, shrubs and other perennial woody plants. It is a science that focuses on proper tree planting, pruning, fertilizing, watering and other maintenance issues. Trees are one of the oldest lasting species on the planet and they provide immense benefits to our community and improve our quality of life. Have you ever wondered what would happen if there were no trees around us? Trees produce oxygen through photosynthesis. They serve as windbreakers, reduce air pollution, reduce global warming, produce shade and even beautify our surroundings. Working in a demanding and stimulating arboriculture profession requires a basic understanding of these magnificent species, their tree health, their amenity value and their undeniable environmental worth. Explore the theory and skills of arboriculture and learn how to identify, plant, prune and maintain trees.&nbsp;</p><p>This course will introduce you to arboriculture and explains basic seed selection and harvesting methods. Explore the seed storage and maintenance best practices and the steps involved in planting trees. A favorable environment will encourage a tree to be healthy and grow to optimum size and shape. It is vital to understand the biology of trees and their species to decide where and how to plant them. Gain insight into selecting trees for planting based on their species. Delve into planting techniques, tree nutrition, photosynthesis and more. Understanding soil composition gives room for its improvement and encourages tree growth. We’ll teach you the composition of the soil and the importance of particle size in the movement of water, which impacts the growth of trees. We explain the essential nutrients that plants must have to survive, manage soil pH and control pathogens.&nbsp;</p><p>Proper pruning of young trees by removing or shortening live branches significantly impacts their future growth and longevity. We examine the objectives of pruning, pruning strategies, when to prune and the tools used in pruning. The final part of the course discusses tree diseases and management, including the essential equipment that an arboriculturist should possess. We investigate their exposure to health risks and discover how to protect, diagnose and treat any disease-related problems. Do you enjoy working outside and are passionate about planting, pruning and protecting trees? If you answer ‘yes’, then this arboriculture course is designed for you. Regardless of whether you want to work for a company, a park, in the city, start your own business or continue studying arboriculture, this course will lay the groundwork for your future. Earning a certificate can help you develop invaluable skills and knowledge that can allow you to perform your job duties more effectively. So why wait? Start this course now.</p><a href=\"https://alison.com/resume/courses/4518\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4518\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of Arboriculture","description":"This module covers a broad foundation of arboriculture, with a strong focus on tree biology, pruning, soil and tree growth. You will develop a broad sound technical understanding of arboricultural principles and practices, including seed collection methods, tree nutrition, soil pH management, tree disease and management.","topics":["Basics of Arboriculture - Learning Outcomes","Tree Biology and Planting Techniques","Tree Care and Maintenance","Arboriculture - Equipment and Operation","Basics of Arboriculture - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Introduction to Arboriculture"]}]}