{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3142","title":"Beginner Earth Rotation Measurements","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the Earth’s rotation and the methods used to fix positions and find sextant angles.","description":"This course teaches you the principles behind the Earth’s rotation, how sailors used the development of the gyrocompass in marine navigation, the directions on the compass card, gyro error and how you can fit the magnetic compass on ships. You will also learn how to sail on a true course using a magnetic compass, how you can cause a magnetic deviation, the reasons for using magnetic courses and the concept of parallel sailing.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>By midway through the 1900s, most educated people accepted that the Earth rotates on its axis. This introductory course discusses this phenomenon. It introduces you to the Earth’s rotation before investigating how to use the gyrocompass for marine navigation and the directions on the compass card. The course also discusses gyro error and how to fit the magnetic compass on ships. Then the application, the significance of position lines and positions, the various plotting positions on a chart and the source of errors in position lines and position fixes are outlined. Learn how to use the horizontal sextant angles in position fixing on a chart. Review the primary method of position fixing, position accuracy and the celestial fix, along with how you can use navigators to plot a fix consisting of the intersection of two or more distance arcs. Next, we will highlight the fix by distance races, visual fixes and how to use the vertical sextant angle (VSA) of a terrestrial charted object to get range and position. You will also research how you can obtain the position circle and how to use the three-point bearing to obtain a position.</p><p>The course then explains how to sail on a true course using a magnetic compass, how to cause a magnetic deviation, the reasons for using magnetic courses, the concept of parallel sailing and how to solve it. You will study how a navigator can use the traverse table and use it for plane sailings. You will then analyse the procedure for using the traverse table for plane sailing and find course and distance. This course will teach you the distance between two positions, how to use plane trigonometry without any error, formulas that you can use to find course and distance as well as examples of calculating plane sailing. You will learn how to solve parallel sailing, a rhumb line practical approach to navigation, and how the magnetic deviation can correct both deviation and variation. We will demonstrate how you can use the magnetic course to convert a true course into a compass course and the application of the marine compass.</p><p>It is close to 500 years since Copernicus discovered that the Earth moves around the sun. This discovery has been fascinating to navigators for centuries. This course will explore how the Earth rotates on its axis and revolves around the sun in an elliptical orbit. The fixed orientation and the tilt of the axis cause different seasons as the Earth orbits around the sun. Understand how the gyrocompass applies the mutual effects of gravity and the Earth's rotation, the gyroscope’s characteristics and what you should observe to use the gyrocompass as a compass on the Earth. We will teach you the thumb rules required for converting compass bearings to true bearings and vice versa. We will examine the lines of position (LOPs), determine the position by horizontal angles and use a sextant to measure them. This course will help you improve your knowledge of the essential concepts in navigating. It will be of great interest to students, researchers and anyone interested in understanding the rotation of the Earth in marine navigation. So register today and start a new adventure!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}