{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3225","title":"Beginner Maritime Watchkeeping and Rules of the Road","totalEnrolled":"785","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about applying the collision regulation rules and how to guide vessels at sea from this free online course.","description":"‘Introduction to Maritime Watchkeeping and Rules of the Road’ analyses the basic aspects of the international regulations for preventing collisions at sea. Learn about the required conduct or responsibilities of different vessels in any condition of visibility, in sight of one another and in limited visibility to avoid collisions. Register for this course today and begin your next learning experience!","courseOutcomes":["Evaluate the importance of the 'Rule...","Explain the general rules of applica...","Analyse the application of the steer...","Describe the required conduct of ves...","Evaluate the importance of the 'Rules of the Road'","Explain the general rules of application and responsibility in COLREG 72","Analyse the application of the steering and sailing rules","Describe the required conduct of vessels in any condition of visibility","Analyse the required conduct of vessels in sight of one another","Outline the required conduct of vessels in restricted visibility","Evaluate the actions of vessels at sea to avoid collisions","Discuss the application of traffic separation schemes","Discuss the actions required by a stand-on vessel","Evaluate the importance of the 'Rule...","Explain the general rules of applica...","Analyse the application of the steer...","Describe the required conduct of ves...","Evaluate the importance of the 'Rules of the Road'","Explain the general rules of application and responsibility in COLREG 72","Analyse the application of the steering and sailing rules","Describe the required conduct of vessels in any condition of visibility","Analyse the required conduct of vessels in sight of one another","Outline the required conduct of vessels in restricted visibility","Evaluate the actions of vessels at sea to avoid collisions","Discuss the application of traffic separation schemes","Discuss the actions required by a stand-on vessel"],"courseDescription":"<p>To navigate a vessel safely at sea, a mariner must understand the Convention on the International Regulations for Preventing Collisions at Sea, 1972 (COLREGs). They aim to establish rules to avoid collisions at sea. The increasing traffic on the lines of communication makes COLREGs regulations of extreme importance for safety at sea. This course introduces you to COLREGs general rules, along with the principal sections of the steering and sailing rules. We outline the required conduct of vessels in any condition of visibility, the conduct of vessels in sight of one another and the conduct of vessels in restricted visibility. We teach you the application of the rules, responsibilities and vessel types in the context of COLREGs. You will study the general definitions guiding COLREGs, RAM vessels and the rules applicable in any visibility conditions. This course will cover how to maintain a proper look-out, the factors to be considered in determining a safe speed and the risk of collisions.</p><p>Next, this course will teach you the actions required to avoid a collision, actions to be taken by the vessels in narrow channels and the traffic separation schemes. To avoid a collision, learn the required effort that you should take when two sailing vessels are approaching one another. Investigate the rules that apply to the traffic separation schemes adopted by the relevant organisation and the actions needed from a vessel using the theme traffic separation scheme. Evaluate the steps that should be taken when the draft, ship's width and contour of the bottom of the channel are unsafe or not practicable to comply with this rule. We will help you understand the proper and effective action and stopping distance for vessels. Explore the responsibilities of vessels in overtaking and head-on situations when two power-driven vessels are meeting on reciprocal or nearly reciprocal courses. Discover the important actions required when two power-driven vessels are crossing, which may involve risks of collisions. We describe the action by give-way vessel, stand-on vessel and the responsibilities between vessels.</p><p>The course will help you improve your knowledge of the conduct of vessels in restricted visibility, the application of the rule and how to prevent a sailing vessel underway from a vessel not under command. Familiarise yourself with preventing collisions between power-driven vessels underway from a vessel not under command and how vessels engaged in fishing can be prevented from a vessel restricted in her ability to manoeuvre. We discuss using all equipment, traditional and electronic, to enlighten users of the actual conditions. This course teaches you all the important rules that apply to all vessels on the high seas and in all waters navigable by seagoing vessels. It will be of significant interest to students, mariners and anyone with interest in gaining credible, advanced knowledge in the principles of watchkeeping together with the ‘Rules of the Road’. So register for this course today and improve your knowledge of the maritime watchkeeping systems and ‘Rules of the Road’ at sea.</p><a href=\"https://alison.com/resume/courses/3225\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3225\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Knowledge of the Collision Regulation","description":"This module explains the International Regulations for the Prevention of Collision at Sea. You will discuss the features of the general rules as well as the steering and sailing rules of COLREGs required for vessels in sight of one another.","topics":["Knowledge of the Collision Regulation - Learning Outcomes","Introduction to Collision Regulation","Applications and Responsibilities","Steering and Sailing Rules","Knowledge of the Collision Regulation - Lesson Summary"]},{"name":"Module","details":"Visibility of Vessels","description":"In this module, you will discuss important aspects of maritime watchkeeping and rules of the road. You will learn about the responsibilities of vessels in sight of one another and cases of restricted visibility.","topics":["Visibility of Vessels - Learning Outcomes","Actions to Avoid Collision","Vessels in Sight of One Another","Actions by Stand-On Vessels","Visibility of Vessels - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Maritime Watchkeeping and Rules of the Road - Course Assessment"]}]}