{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5242","title":"Introduction to Criminology and the UK Justice System","totalEnrolled":"1,811","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the basics of criminology and explains how the UK’s criminal justice system works.","description":"Crime can be caused by many factors, including poverty, parental neglect, drug abuse, poor home values and a low sense of self-worth. This course broadens your understanding of criminology and the UK's criminal justice sector. We examine types of evidence, crime scene processing and reconstruction, criminal psychology, forensic science and more. Sign up for this criminology course to enhance your knowledge of crime and the justice system.","courseOutcomes":["Analyse the causes of crime and desc...","Explain how to generate a criminal p...","Outline the tactics used to process ...","Discuss the criminal process and res...","Analyse the causes of crime and describe the world’s primary legal systems","Explain how to generate a criminal profile","Outline the tactics used to process and reconstruct crime scenes","Discuss the criminal process and research techniques employed in criminal psychology","Describe the role of criminal profiling, offender profiling and victimology in legal systems","Discuss the criminal justice system of the United Kingdom","Analyse the causes of crime and desc...","Explain how to generate a criminal p...","Outline the tactics used to process ...","Discuss the criminal process and res...","Analyse the causes of crime and describe the world’s primary legal systems","Explain how to generate a criminal profile","Outline the tactics used to process and reconstruct crime scenes","Discuss the criminal process and research techniques employed in criminal psychology","Describe the role of criminal profiling, offender profiling and victimology in legal systems","Discuss the criminal justice system of the United Kingdom"],"courseDescription":"<p>Do you want to understand what motivates people to commit crimes? Does the criminal justice system fascinate you? This criminology course goes through the professional and legal approaches taken to prevent and solve crimes. We begin with an overview of the major elements that define criminology and describe major legal systems found around the world. We investigate the root causes of crime and lay out the five-step process used to profile criminals.</p><p>The course then examines the classification of crimes. We outline how the police investigate violent crimes and domestic abuse and show you how they process, reconstruct and link crime scenes. We then study the tactics used to interview suspects, victims and eyewitnesses and identify the key factors that affect witness performance. The course delves into criminal psychology as one of the focal points of criminology as we research the criminal process and the mindsets that motivate criminal activity.</p><p>Forensic evidence plays a major role in crime-solving so we explain how toxicology, ballistics, anthropometry and DNA profiling work. We demonstrate how to examine and classify evidence, investigate offender signatures and generate a criminal profile. We also establish the importance of science, critical thinking, logic and metacognition in criminal profiling. This course suits anyone who wants to build a career in criminology, criminal justice, law enforcement, public safety and legal studies. Sign up to understand what motivates criminals and the processes employed to catch and prosecute them.</p><a href=\"https://alison.com/resume/courses/5242\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5242\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Criminology, Profiling, and Criminal Justice","description":"In this module, you will discern the three tributaries of crime, the causes and motives of crime, and approaches to criminal profiling. You will also study types of crime, criminal psychology, and forensic science. In addition, we will examine offender profiling, victimology, and the criminal justice system in England and Wales.","topics":["Basic Criminology, Profiling, and Criminal Justice - Learning Outcomes","Criminology and Profiling Fundamentals","Criminal Psychology and Forensic Science","Understanding Criminal Profiling","Victimology and Criminal Justice in the UK","Basic Criminology, Profiling, and Criminal Justice - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Criminology and the UK Justice System - Course Assessment"]}]}