{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3364","title":"Beginner Complex and Imaginary Numbers for General Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course teaches you about complex and imaginary numbers and explains the transformations of functions.","description":"If you have a keen interest in understanding complex numbers and types of functions, this mathematics course has been designed especially to help you. Study the characteristics of functions and function notation before focusing on the different types of special functions. The material covers arithmetic operations, composition and the graphical and multiple transformations of a function.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This is a captivating course that has been specifically developed to teach you about pure imaginary numbers. When working with imaginary numbers, you should learn about the addition, subtraction and other operations of imaginary numbers. This course also analyzes the concepts of the field of complex numbers. If you are asked about combining pure imaginary numbers with real numbers, you should know that the field of complex numbers is essential to do this. For example, to perform algebraic operations with the imaginary number ‘i’, it is necessary to understand how to raise ‘i’ to any power. Do you know that a complex plane consists of a real number line and a number line for all the pure imaginary numbers? Prepare yourself to learn about the conjugates and division of a complex number, rationalising denominators, domain and range of a relation as well as the vertical and horizontal line test for a function. Likewise, you must learn about the algebraic rules for the multiplication of two binomials, multiple ways to represent a function and behaviour and characteristics of functions.</p><p>If you want to learn about the different types of special functions and their properties, you should complete this course. You will be able to identify the other special functions from their equations and plot their graphs. We will cover the differences between the constant and identity functions, help you understand the algebraic definitions of the absolute value functions and teach you the linear and greatest integer function properties. Do you know that when you plot the graph of a quadratic function, the resulting figure is called a ‘parabola’? To better understand the parabola, you will also need to understand the vertex and its coordinates. It is also imperative that you learn about the features and differences between polynomial and rational functions. The equation and graph of an exponential function will also be covered extensively, along with the differences, domain, properties and the rules of the piecewise and signum functions.</p><p>Learning how to perform various arithmetic operations and calculate the inverse of a function will challenge your thinking and round off the course. For example, do you know that a graph may be translated vertically, horizontally or both? Gain insight by understanding the concepts and properties of ‘translations’. Learn about the graphical transformations of functions and dilations, and reflections over the x- and y-axis. We will help you become familiar with the properties preserved under a point reflection and assist you in understanding the multiple transformations of a function and the order in which they are performed upon a prototype. Finally, we will guide you with finding the inverse of functions and proving how functions are inverses. Students, researchers and anyone interested in understanding complex and imaginary numbers will find this course worthwhile. So register today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}