{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3333","title":"Introduction to Western Political Thought","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore Western political theory to discover the foundations of the modern world with this free online politics course.","description":"This free online course introduces you to some of the principles that underpin Western political doctrine, including sovereignty, citizenship, constitution and democracy. We take you through the evolution of the political ideas we encounter today. We cover the pioneers of political thought, dubbed the ‘Classics’, along with the various approaches and methods adopted since their day as ideas continue to evolve in the turbulent world of politics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Society requires rules and regulations to function, which raises questions about order, the State, government and justice. This course probes contemporary questions surrounding sovereignty, citizenship, constitution, democracy and more. These questions have a rich history and continue to evolve and this course looks into the past to explain the present. Are you fascinated by politics and the philosophies that affect people’s daily lives? Because of Europe’s history of colonial dominance, most of the ideas and concepts central to modern political discourse are firmly rooted in Western political thought. This course links the theories and philosophies of the past to hot-button issues and conflicts playing out on streets and televisions near you.</p><p>This course demonstrates the importance of studying political theory as we delve into texts known as ‘the Classics’, which embody the knowledge and perspective of gifted thinkers from the past. For some scholars, a text is ‘classic’ if it goes against the grain of prevailing contemporary thought and accurately predicts the future. In this field, such a text endures past its day and deals with eternal questions, like those pertaining to just rule or ideal government. We introduce you to the questions raised by Plato’s ‘Republic’ and the works of Aristotle.&nbsp;</p><p>We employ three methods when studying texts: textual, interpretative and contextual. The textual method gives autonomy to the text and focuses exclusively thereon. This leads to close study of ‘Republic’ but this approach has some limits that are addressed by the contextual method, which places such text within a framework of historical methods and approaches. We employ the interpretative mode, which considers the role of our own subjectivity when interpreting a text and links ancient texts to modern issues. This course can help anyone who wants to understand why today’s world works the way it does. We trace the roots of today’s ideas about power to their source and explain the role of theorists in informing the conflicts you encounter in the news or even in your daily life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}