{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4942","title":"Introduction to Parapsychology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the field of parapsychology and investigate paranormal mysteries in this free online course.","description":"In this course, we will introduce you to the field of parapsychology, which studies psychic phenomena and many paranormal claims. The first part of the course focuses on the human mind, while the second section explores beliefs, legends and theories. This course will be helpful for those looking to familiarise themselves with this niche field and explore opportunities to conduct research through the scientific investigative method.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Imagine hearing about near-death or apparitional experiences. Do these incidents make you curious? If the human mind and psychology as a subject appeal to you, this course on parapsychology will offer you valuable insights into the paranormal phenomena. People face unusual circumstances and start believing in coincidences. We begin this course by learning about conditional probabilities that explain coincidences. Many patients respond well to placebo therapy, where their mind tricks the body into accepting fake treatment. Is the placebo effect a real thing? You will acquire some valuable insights into this therapy. The human brain does not remain still. It leads to actions or movements by our body when it is thinking hard, stressed or anxious.&nbsp;</p><p>The subconscious mind controls all aspects of our lives and you will explore this characteristic of the human psyche before learning more about meditation. How do you meditate and what exactly does it do? You will learn about its attributes and why it is essential. The second module begins with the beliefs around astrology. Astrologers have a significant influence over some people and it is worth understanding if there is any scientific basis. Similarly, psychics or people who refer to themselves as 'mediums' also significantly impact human behaviour. You will analyse the psychology of psychic fraud, followed by an insight into the mysterious world of aliens and UFOs.&nbsp;</p><p>The excitement of venturing into the territory of 'unanswered questions' will resume as you learn about the origins and legends of supernatural things worldwide. Finally, we will investigate the different theories of paranormal beliefs and experiences. Mental health professionals and scientists debate certain conclusions on the relevance of parapsychology in psychiatric practice. Professionals need to be able to analyse data or claims from different perspectives. This course will provide you with the basic information on parapsychology, which will be helpful to those who are either mental health professionals or interested in psychology. You can take advantage of this free online course and enrol right away.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}