{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2937","title":"Introduction to Applied Ecology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn some of the fundamental concepts of human ecology, the ecology of change, ecotoxicology and pollution management.","description":"Be introduced to human ecology and the ecology of change in this free online course on applied ecology. You will study the impacts of humans on ecology, human population growth, food requirements, and sustainable development. This course will help you learn about plastic pollution and biodiversity, components of climate change, the working of the climate system, ecotoxicology, pollution management and restoration ecology.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Look at the impact humans have had on the environment and ecosystems in this free online course in applied ecology. This study will take you through population growth and the effect that has. Is the rising population in the world sustainable? This question will be answered and its many nuances addressed throughout this course. You will also examine a case study of an oil spill and how that event can bring out a change in the ecology surrounding it. Do we know the environmental and ecological impact we have on the world?</p><p>This course will help you understand plastic pollution and biodiversity, components of climate change and the working of the climate system in detail. Then, it will help you to learn about applied ecology in greater detail. You will tackle the optimal yield problem and numerical analysis of population size using different theories and graphs. The material then describes the differences between controlled, uncontrolled and secondary pests, and you will explore the impact of pesticides and detailed pest control methods on the environment. At the end of this course, you will study ecotoxicology (the effects of toxic chemicals on biological organisms), pollution management and restoration ecology (the ‘practice of renewing and restoring degraded, damaged or destroyed ecosystems and habitats in the environment by active human intervention and action’).</p><p>This free online course will be of significant benefit to those with an interest in learning about or working in the area of applied ecology. If you are planning on studying ecology as part of further education or want to apply for a job in conservation or environmental protection, this course would be of great advantage to you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}