{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3484","title":"Introduction to Trigonometry for General Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the applications of trigonometry, from measuring angles to trig identities, in this free math course.","description":"Trigonometry is the branch of mathematics that studies the relationship between the lengths of the sides in a triangle. Proficiency in trig is necessary for studying other advanced courses in maths such as pre-calculus and calculus, and in science courses such as physics. This course gives you a comprehensive understanding of various rules and concepts for getting started with solving problems using trigonometry.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course has been specially prepared to take you through an introductory level of the rules, concepts and applications of trigonometry. Trig, as the name suggests, is about right-angled triangles and is said to be the most important mathematical relationship ever discovered. It is a crucial tool for evaluating measurements of height and distance. Trigonometry is not narrowed to a career path or profession as it plays an important role in surveying, navigation, engineering, astronomy, computer-generated imagery and many other branches of physical science. Remembering trigonometric functions can be difficult and confusing but this course will make your learning process easier. It covers in detail the three basic functions in trigonometry, where each is one side of a right-angled triangle divided by another. It also explores reciprocal trigonometric functions: cosecant, secant and cotangent. This course prepares you for basic real-life problems that can be solved using trigonometry. It takes you through illustrations that show the step-by-step procedures on how to complete different types of problems in trig.</p><p>If you want to learn about special right-angle triangles, similar triangles and the methods for proving similar triangles, it is important that you complete this course. While working with trigonometry, it is also critical to understand how to solve triangles using trig ratio. Learn about the measurement of angles as well as how to convert between degrees and radians. You will also see how to determine the length of the arc of a circle. This course illustrates quadrants, angle classification and coterminal angles. Study reference or related angle and the formulae for finding the reference angle when the terminal ray of the angle lies in quadrants II, III and IV. You will also learn about cofunctions and trigonometric values of quadrantal angles.</p><p>Furthermore, the material outlines the angle of elevation and depression as well as the line of sight. If you want to learn about the three Pythagorean identities and how to implement them, then this course is for you. Trigonometry is a useful supplement to geometry and actual measurements, and as such is worth developing an understanding of the basics. This course will take you through determining the trig value of any angle measure. You will learn about the method for finding the values of the trigonometric functions using a special property called the even and odd properties. The course explores how to find the remaining trigonometric values when one value is known. The content is fundamental and will be of great interest to maths students, land surveyors or anyone needing an excellent working knowledge of trigonometry. So, register now and start your next learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}