{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3285","title":"Beginner Meteorological Instruments and Atmospheric Pressure","totalEnrolled":"397","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores shipborne meteorological instruments and focuses on the layers in the atmosphere.","description":"It is important to understand the various procedures and instruments needed for measuring atmospheric pressure and the quantity of water vapour present in the atmosphere when sailing ships. If you want to become a seaman, this course on shipborne meteorological instruments and their diverse applications is crucial to add to your repertoire. Learn to handle different shipborne devices and study the modes of heat transfer in the atmosphere.","courseOutcomes":["Distinguish between the aneroid baro...","Analyse the use of the hygrometer an...","Describe the functions of the whirli...","Explain the various layers of the at...","Distinguish between the aneroid barometer and barograph for measuring atmospheric pressure.","Analyse the use of the hygrometer and Stevenson screen","Describe the functions of the whirling psychrometer","Explain the various layers of the atmosphere","Define the concept of atmospheric pressure","Describe the phenomena of change of pressure with height","Explain isobars, isallobars and ‘barometric tendency’","Discuss evaporation and condensation in terms of the water cycle","Distinguish between absolute humidity and relative humidity","Distinguish between the aneroid baro...","Analyse the use of the hygrometer an...","Describe the functions of the whirli...","Explain the various layers of the at...","Distinguish between the aneroid barometer and barograph for measuring atmospheric pressure.","Analyse the use of the hygrometer and Stevenson screen","Describe the functions of the whirling psychrometer","Explain the various layers of the atmosphere","Define the concept of atmospheric pressure","Describe the phenomena of change of pressure with height","Explain isobars, isallobars and ‘barometric tendency’","Discuss evaporation and condensation in terms of the water cycle","Distinguish between absolute humidity and relative humidity"],"courseDescription":"<p>This course has been specially prepared to teach you about shipborne meteorological instruments. When working with shipborne meteorological instruments, it is crucial to learn about preventive measures. If you measure the weather, you should know that weather maps help indicate the atmospheric conditions of various portions of the Earth’s surface. Some weather variables produce environmental conditions that form a chain reaction but may not remain entirely in the atmosphere. Do you know that temperature, pressure and humidity (moisture) can interact to form clouds? If you take your ship out without understanding the atmospheric conditions, you will risk your life and the shipping vessel. Prepare yourself by understanding the terms: ‘aneroid barometer’, ‘Stevenson screen’, ‘whirling psychrometer’, ‘relative humidity’ and different types of hygrometers used when measuring atmospheric pressure.</p><p>You will then discover the seawater temperature bucket and the procedures for using it to measure sea surface temperature. We will identify the various layers of the atmosphere starting from the ground level. The layers of the atmosphere include the troposphere, the stratosphere, the mesosphere, the thermosphere and the exosphere. We help you analyse the environmental curve and the environmental lapse rate (ELR). We explore temperature inversion and the classification of the atmosphere. Do you know that there are certain losses in solar radiation? To learn about these losses, you need to understand the modes of heat transfer and how heating happens in the atmosphere. Study the factors influencing the heating effect, insolation, evaporation and condensation.</p><p>We continue by exploring vapour pressure changes and how to apply vapour pressure to a liquid. Do you know that absolute humidity and relative humidity are not the same? We investigate their differences and discuss the formula for calculating relative humidity. Finally, you will become acquainted with terms such as ‘typical isobaric pattern’, ‘isallobars’ and ‘barometric tendencies’. Estimating the type of weather to expect is essential for a navigator so understanding the ‘barometric tendency’ characteristics is vital. If you do not complete this course, you will lack critical knowledge about handling shipborne instruments. This free online course will be of great interest to students, researchers and anyone interested in understanding the atmosphere and shipborne meteorological instruments. So register for this course today.</p><a href=\"https://alison.com/resume/courses/3285\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3285\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Sea Instruments and Atmospheric Layers","description":"In this module, you will be introduced to shipborne meteorological Instruments, their manipulations and precautionary measures. This module will also introduce you to the various layers of the atmosphere and their individual characteristics. It explores the environmental curve and environment lapse rate (ELR).","topics":["Sea Instruments and Atmospheric Layers - Learning Outcomes","Operations of Shipborne Meteorological Instruments","Wind Sensors and the Atmosphere","Composition of the Atmosphere","Sea Instruments and Atmospheric Layers - Lesson Summary"]},{"name":"Module","details":"Humidity and Pressure","description":"In this module, you will be introduced to evaporation, condensation and the modes of heat transfer. It also introduces you to the concept of dew point and dew point temperature. This module illustrates atmospheric pressure, change of pressure with height as well as average pressure. You will also be introduced to barometric tendency and its characteristics.","topics":["Humidity and Pressure - Learning Outcomes","Insolation, Evaporation and Condensation","Heat, Dew Point and Humidity","Atmospheric Pressure","Humidity and Pressure - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Meteorological Instruments and Atmospheric Pressure - Course Assessment"]}]}