{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3286","title":"Introduction to Wind, Clouds, and Weather Services","totalEnrolled":"1,060","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online meteorology course covers wind, precipitation and the role of weather services in shipping and sailing.","description":"This free online meteorology course delves into the different forces associated with wind, which can significantly affect events on land and sea. We show you how to measure wind speed and pressure as we examine the Beaufort scale of wind force and Buys Ballot’s law. Aspiring seafarers, pilots and meteorologists can benefit as we explore the formation of clouds and fog and gauge their impact on visibility.","courseOutcomes":["Discuss the formation of the Corioli...","State Buys ballot's law and discuss ...","Identify the different types of clou...","Define the concept of precipitation ...","Discuss the formation of the Coriolis force due to the Earth's rotation","State Buys ballot's law and discuss its application","Identify the different types of clouds and their formation","Define the concept of precipitation and the hazards for navigation","Cope with various types of precipitation","Explain the mechanism behind the formation of fog, mist and haze","Describe the types of weather services for shipping","Outline the various classifications of weather routing service","Discuss the formation of the Corioli...","State Buys ballot's law and discuss ...","Identify the different types of clou...","Define the concept of precipitation ...","Discuss the formation of the Coriolis force due to the Earth's rotation","State Buys ballot's law and discuss its application","Identify the different types of clouds and their formation","Define the concept of precipitation and the hazards for navigation","Cope with various types of precipitation","Explain the mechanism behind the formation of fog, mist and haze","Describe the types of weather services for shipping","Outline the various classifications of weather routing service"],"courseDescription":"<p>Mariners and pilots need to know current and forecast weather information and can generally obtain a fairly accurate picture through free national weather forecasting services. We analyze in detail the weather facsimile that allows you to access meteorological information and investigate sample weather charts. This course covers the Beaufort Scale, pressure gradient force and Coriolis force. We show you how to distinguish apparent wind from true wind and how to measure its speed and direction. We then study Buys ballot’s law and its procedures and limitations.&nbsp;</p><p>This course takes you through the formation of clouds and their classifications. We survey the effects of fogs, mist, haze and other atmospheric conditions before moving on to snow, rain, ice crystals and other types of precipitation. The proper use of weather forecasting and satellite communication tools can assist marine vessels and keep them safe and we unpack technologies like the Navigational Telex system (NAVTEX), which is responsible for weather broadcasts.</p><p>There are different types of weather services for shipping, including the meteorological services and warnings provided by relevant governments. We explain weather routing services and their limitations before laying out the aims and history of the World Meteorological Organization (WMO). This course addresses the enhanced group call system (EGC) and the Maritime safety information (MSI) element of the Global Maritime Distress and Safety System (GMDSS), which&nbsp; contains information on navigational warnings, meteorological information and distress alerts. This free online course helps you to identify nautical warnings, bulletins and data and is particularly useful to those involved in shipping and sailing. It is also of interest to any aspirant meteorologists or those fascinated by clouds and precipitation.</p><a href=\"https://alison.com/resume/courses/3286\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3286\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Wind Laws and Cloud Formation","description":"In this module, you will be introduced to forces and laws associated with the wind. It analyzes the Beaufort Scale of Wind force and Buys Ballot’s Law. It describes the formation of clouds, the different types of clouds as well as their compositions. Also, it explores the different types of precipitation and illustrates how they are formed.","topics":["Wind Laws and Cloud Formation - Learning Outcomes","Forces and Laws of Wind","Apparent, True Wind and Cloud Formation","Types of Cloud","Wind Laws and Cloud Formation - Lesson Summary"]},{"name":"Module","details":"Visibility and Weather Services for Shipping","description":"This module describes visibility and outlines the reason for the reduction in visibility. It illustrates with diagrams the formation of fog, mist and haze. Also, it explores the different types of fog and explains fog, mist, haze as well as other meteorological conditions. This module highlights the weather services for shipping and weather information available to shipping.","topics":["Visibility and Weather Services for Shipping - Learning Outcomes","Visibility and Fogs","Weather Services for Shipping","Weather Routing Services","Digital Weather Receivers","Visibility and Weather Shipping Services - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Wind, Clouds, and Weather Services - Course Assessment"]}]}