{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4642","title":"Introduction to Archaeology","totalEnrolled":"2,554","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course delves into Archaeology, its origins, history, aims, functions, disciplines and purpose.","description":"Archaeology offers a unique historical and cultural experience as it provides us with a better understanding of our origin. Discover the various fields of Archaeology, including how archaeologists retrieve and record cultural and biological remnants discovered in the ground. We will show you the dating techniques and interpretation skills of archaeologists. By the end of this course, you will be able to unveil the secrets of human history.","courseOutcomes":["Recall the aim and function of Archa...","List and explain the types of Archae...","Summarise the eight distinct archeol...","Discuss how to research, plan and ca...","Recall the aim and function of Archaeology","List and explain the types of Archaeology","Summarise the eight distinct archeological time periods","Discuss how to research, plan and carry out archaeological campaigns","Recognise the various methods used in the post-excavation analysis","Explain the methods of excavation","Describe the process of excavation and documentation in Archaeology","Outline the various dating techniques used by archaeologists to date past events","Recall the aim and function of Archa...","List and explain the types of Archae...","Summarise the eight distinct archeol...","Discuss how to research, plan and ca...","Recall the aim and function of Archaeology","List and explain the types of Archaeology","Summarise the eight distinct archeological time periods","Discuss how to research, plan and carry out archaeological campaigns","Recognise the various methods used in the post-excavation analysis","Explain the methods of excavation","Describe the process of excavation and documentation in Archaeology","Outline the various dating techniques used by archaeologists to date past events"],"courseDescription":"<p>Are you fascinated by human evolution, ancient culture and language? Do you have a passion for history and wish to learn about the rise of early civilisations? Archaeology gives you the chance to discover past human behaviour through the hidden material or objects they left behind. Archaeology is all about discovering and investigating the ancient world to modern society. We learn how people lived their lives, where they lived and what they wore and ate. This course explores various techniques used to conduct site surveys and interpret artefacts. First, we introduce you to the concept of Archaeology, its goals, roles and responsibilities. We’ll show you the relationship between archaeology and other disciplines. Gain in-depth knowledge of its history and archaeological timelines.&nbsp;</p><p>Archaeologists are always searching for ways to predict how cultures will change in the future and how to plan better. A person with clear objectives and a campaign plan is more likely to succeed than someone with neither. We discuss how archaeologists carry out their research and strategy, set their objectives and approach archaeological surveys. Artefacts are the objects people in the past left behind and they help archaeologists answer questions or explain problems. Artefacts can be exciting to find and sometimes no digging is necessary. You’ll learn how to find archaeological sites through surveys and how to record and map sites. The excavation of an area is a destructive process requiring the systematic removal of soils. Different types of technology are used to predict what is under the ground without digging. This course will explore these technologies and the best excavation methods for each unique situation.</p><p>Once an area has been excavated, attention switches to the laboratories, processing the finds and site records. These include the excavation's full report with text on the features and structures, catalogues and drawings of discoveries and specialists' reports. Discover various methods used in the post-excavation analysis, including the excavation and documentation process. You will study the multiple ways in which archaeologists date past events within our timespan. Humans have always used ideas and models to interpret the world around us. It is almost impossible to describe something or someone without linking them to a source for verification. The same is true in this field. Assess the strengths and weaknesses of different interpretations. Archaeology is a unique subject offering a wide range of analytical, practical and social skills that you can develop. Government agencies and non-governmental organisations rate individuals with archaeological backgrounds highly. If you have a passion for history and site expeditions and wish to expand your knowledge in Archaeology, then this course is designed for you.</p><a href=\"https://alison.com/resume/courses/4642\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4642\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Archaeological Survey and Documentation","description":"This module covers the history of archaeology, the purpose and responsibility of archaeologists. You will gain insights into how archaeologists research, plan and set the objectives of their archaeological survey. You will learn about excavation, post-excavation and dating techniques used by archaeologists to date past events.","topics":["Archaeological Survey and Documentation - Learning Outcomes","Archaeology: An Introduction","Archaeology - Surveying and Feature","Archaeology - Excavation and Documentation","Archaeological Survey and Documentation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Introduction to Archaeology"]}]}