{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1402","title":"Introduction to the Learning Process for Teachers and Trainers","totalEnrolled":"26,562","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain an understanding of the teacher learning process, and improve abilities to create and deliver effective lessons.","description":"Alison's free online Introduction to the Learning Process for Teachers and Trainers course will teach you how to fulfill your instructional role effectively by using teaching methods that are grounded in the learning process of education. You will look into a framework for planning, creating, and delivering effective lessons and assessing a student's learning, as well as Piaget's theory of cognitive development and Bloom's Taxonomy of Learning.","courseOutcomes":["Describe the process of learning in ...","Differentiate between the two major ...","Compare and contrast the two subtype...","Identify various psychologists, phil...","Describe the process of learning in terms of educational learning theory","Differentiate between the two major learning theories: behaviourism and constructivism","Compare and contrast the two subtypes of constructivism: psychological constructivism and social constructivism","Identify various psychologists, philosophers and researchers associated with educational learning theory","Provide everyday examples of operant conditioning and strategies for constructivist style teaching","Describe the process of learning in ...","Differentiate between the two major ...","Compare and contrast the two subtype...","Identify various psychologists, phil...","Describe the process of learning in terms of educational learning theory","Differentiate between the two major learning theories: behaviourism and constructivism","Compare and contrast the two subtypes of constructivism: psychological constructivism and social constructivism","Identify various psychologists, philosophers and researchers associated with educational learning theory","Provide everyday examples of operant conditioning and strategies for constructivist style teaching"],"courseDescription":"<p>Learning is defined as relatively permanent changes in behavior, skills, knowledge or attitudes resulting from identifiable psychological or social experiences. This course will first introduce you to the two main learning theories which are behaviorism and constructivism. Behaviourism is a perspective on learning process that focuses on changes in individuals observable behaviors or the changes in what people say or do. This course will also discuss the key concepts associated with operant conditioning including Extinction, Generalisation, Discrimination, Schedules of Reinforcement and Cues.</p><p>Constructivism is a perspective on learning that focuses on how students actively construct knowledge out of experiences. This course will discuss the theoretical differences between social constructivism and psychological constructivism. You will learn the different strategies for helping students to develop their thinking including how they think about learning and development. You will also study theories of learning strategies according to Piaget, as well as Bloom's Taxonomy of Learning.</p><p>This teachers learning process course will also discuss the contributions to the study of learning processes made by John Dewey (who is an educational philosopher), Lev Vygotsky (a Russian psychologist), Jerome Seymour Bruner (an American psychologist), and Jean Piaget (a Swiss psychologist). Upon completion of this course, you will have a much better understanding of the theories on behaviorism and constructivism and will have greatly enhanced your teaching abilities. So, check out the teachers learning course today and start bringing your professional skills to the next level.</p><a href=\"https://alison.com/resume/courses/1402\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1402\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to the Learning Process","description":"This module will introduce you to two main learning theories and four different domains of learning. You will also learn about curriculum learning and incidental learning.","topics":["The  Learning Process - Learning Outcomes","The Learning Process","Teachers’ Perspective on Learning","The  Learning Process - Lesson Summary"]},{"name":"Module","details":"Behaviourism","description":"You will be introduced to behaviourism and operant conditioning. You will learn about research into operant conditioning using laboratory rats and how this research has influenced learning in the classroom.","topics":["Behaviourism - Learning Outcomes","Introduction to Behaviourism","Operant Conditioning","Operant Conditioning and Students’ Learning","Further Key Concepts about Operant Conditioning","Behaviourism - Lesson Summary"]},{"name":"Module","details":"Constructivism","description":"You will be introduced to constructivism and its two main branches - psychological constructivism and social constructivism. You will also learn about assimilation and accommodation in relation to constructivism.","topics":["Constructivism - Learning Outcomes","Introduction to Constructivism","Psychological Constructivism","Social Constructivism","Theoretical Differences between Psychological and Social Constructivism","Implications of Constructivism for Teaching","Constructivism - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to the Learning Process for Teachers and Trainers Assessment"]}]}