{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3282","title":"Beginner Solar System Measurement","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online astronomy course explores the Solar System and explains the Earth's role in celestial navigation.","description":"Did you know that the Earth revolves around the Sun in an anti-clockwise direction? This course provides such interesting facts and delves deeper into astronomy and its rich history. We introduce you to the Solar System and examine the role of celestial poles in understanding solstices and equinoxes. We also show you how navigators use the position of planets, stars, moons, comets, meteors and asteroids to find their way.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Astronomy has been around for thousands of years and has many uses, including telling the time, explaining tides and facilitating navigation. This course explores the cosmos and explains terminology that may initially appear daunting. You may already be familiar with the celestial pole, solstices and equinoxes, but we explain them in more detail.</p><p>The course discusses the ‘perihelion’ and ‘aphelion’, which refer to a celestial body’s farthest and closest points to the Sun respectively. We then outline Kepler’s laws of planetary motion to explain the orbits of planets around the Sun. This brings us to the practical details of celestial navigation, including Greenwich hour angle (GHA), local hour angle (LHA) and sidereal hour angle (SHA).</p><p>We study astronomical zenith and nadir and show you how to calculate true altitude, azimuth and true zenith distance. Each concept is clearly explained and broken down. The course covers eclipses and their causes and lays out the Earth-Moon system. We can help you enjoy astronomy like never before as the American Digital University takes you on a tour of the stars.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}