{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1541","title":"E-Learning Theory and Practice for Publishers","totalEnrolled":"19,188","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your ability to apply e-learning theories and methodologies in order to create effective e-learning courses.","description":"This course on e-learning theory and practice will give you an overview of research-based e-learning methodologies for the creation of effective e-learning courses. E-learning content is a great way to share your expertise with a large audience, boosting your revenue and reputation along the way. By the end of this course, you will have the skills and confidence required to build high-quality online courses.","courseOutcomes":["Discuss the Cognitive Theory of Mult...","Describe the cognitive processes inv...","Summarise the use of effective instr...","Explain the steps involved in develo...","Discuss the Cognitive Theory of Multimedia Learning","Describe the cognitive processes involved in learning","Summarise the use of effective instructional design methods","Explain the steps involved in developing course content","Explain the purpose of learning outcomes in e-learning","Describe how to use different instructional techniques","Distinguish between Formative and Summative assessment","Discuss the Cognitive Theory of Mult...","Describe the cognitive processes inv...","Summarise the use of effective instr...","Explain the steps involved in develo...","Discuss the Cognitive Theory of Multimedia Learning","Describe the cognitive processes involved in learning","Summarise the use of effective instructional design methods","Explain the steps involved in developing course content","Explain the purpose of learning outcomes in e-learning","Describe how to use different instructional techniques","Distinguish between Formative and Summative assessment"],"courseDescription":"<p>E-learning courses are delivered via digital devices like computers and smartphones, using words in the form of spoken or printed text and pictures such as illustrations, photos, animations, or videos. This course will first discuss the benefits of studying e-learning courses. You will study the Cognitive Theory of Multimedia Learning, the cognitive processes involved in learning, and the steps involved in developing course content. You will also learn the use of effective instructional design methods.</p><p>Learning outcomes help identify what a learner will know by the end of a course or program. This course will explain the purpose of learning outcomes in e-learning. You will study the level of detail and language used in e-lessons and look into Storyboards and Gagné's Nine Events of Instruction. You will also learn how to use different instructional techniques, examples, and media elements in e-lessons, as well as study the difference between formative and summative assessment.</p><p>By the end of this course, you will have a much stronger understanding of how to create a high-quality e-learning course. This will allow you to share your knowledge with students all over the world, and bring your international teaching reputation to the next level. With e-learning being the educational format of the future, these are great skills to develop now. So why wait? Start your e-learning journey, today.</p><a href=\"https://alison.com/resume/courses/1541\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1541\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cognitive Theory and Instructional Design","description":"This module introduces you to the key concepts and benefits of E-Learning. It expands on the Cognitive Theory of Multimedia Learning and its use in e-learning design and course content development.","topics":["Cognitive Theory and Instructional Design - Learning Outcomes","Course Introduction and Concepts","Benefits of E-Learning","Cognitive Theory of Multimedia Learning","E-Learning Resources","E-Learning Design","Course Content Development","Cognitive Theory and Instructional Design - Lesson Summary"]},{"name":"Module","details":"Facilitating Learning - Content Development","description":"This module covers the importance of Learning Outcomes when considering what content to include in a course. You will be introduced to the use of storyboards and slides when designing an online course. The module also covers instructional techniques, good use of media elements, and the importance of developing effective assessments.","topics":["Facilitating Learning: Content Development - Learning Outcomes","About Learning Outcomes","Content and Language Style","Storyboards for Course Development","Instructional Techniques","Examples and Media Elements","Developing Assessments","Facilitating Learning: Content Development - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["E-Learning Theory and Practice for Publishers - Course Assessment"]}]}