{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1689","title":"Introduction to Common Medical Conditions","totalEnrolled":"11,256","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about common medical conditions such as diabetes and heart disease as well as the importance of Vitamin C.","description":"This free online course will give you an overview of a range of common medical conditions such as diabetes, heart disease, and cancer. as well as insight into how we might prevent or cure those diseases. Thanks to the constant advancements in medicine which have emerged from modern medical and scientific research, we now understand a lot more about how diseases affect the human body, as well as how we might prevent or cure those diseases.","courseOutcomes":["Discuss aspects of human physiology ...","Explain the causes of heart attack a...","Describe how the endocrine system wo...","Discuss how cancer can be initiated,...","Discuss aspects of human physiology related common medical conditions","Explain the causes of heart attack and heart failure","Describe how the endocrine system works","Discuss how cancer can be initiated, spreads and how it works","Describe the symptoms of childhood meningitis","Discuss aspects of human physiology ...","Explain the causes of heart attack a...","Describe how the endocrine system wo...","Discuss how cancer can be initiated,...","Discuss aspects of human physiology related common medical conditions","Explain the causes of heart attack and heart failure","Describe how the endocrine system works","Discuss how cancer can be initiated, spreads and how it works","Describe the symptoms of childhood meningitis"],"courseDescription":"<p>Diabetes is a disease in which a person's blood glucose (or blood sugar) levels are too high. This course will first discuss glucose, insulin, diabetes, and blood sugar levels. You will then study heart disease and heart attacks, and arterial thrombo-emboli and thromboembolisms which are sudden interruptions of blood flow to an organ or body part resulting in a blood clot. You will then learn that a stroke is a “brain attack” which can happen to anyone at any time. You will also look into stenosis, ischemia, and heart failure.</p><p>The course will then discuss normal colon tissue and colon tissue hyperplasia, which is an initial stage in the development of cancer. You will study the adequacy and assessment of the lateral cervical spine X-Ray, and look into the endocrine system which is the collection of glands that produce hormones that regulate several bodily functions. The course will then discuss how to conduct a bedside exam and overview modern systemic thinking about cancer.</p><p>Diseases are medical conditions that are associated with specific symptoms and signs. This course will give you an insight into how the body works and how medical professionals diagnose common diseases. By the end of the course, you will have gained a much better understanding of common diseases and their best known treatments. This is powerful knowledge that can really make a difference in someone's life, so check out the course today and start learning something truly meaningful.</p><a href=\"https://alison.com/resume/courses/1689\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1689\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Common Medical Conditions","description":"In this module learn more about common medical conditions that affect millions around the world. This module explains in detail conditions such as heart failure, strokes, cancer, meningitis and scurvy. Get a deep insight into the inner workings of our body, beginning with the functions of our cells, the issues with blood sugar levels and some of the diseases it can cause such as diabetes. It highlights prevention and diagnosis for various conditions and the key aspects of these diseases.","topics":["Introduction to Common Medical Conditions - Learning Outcomes","Glucose Insulin and Diabetes","Blood Sugar Levels","Glucose Concentration Conversion","A1C Levels","Heart Disease and Heart Attacks","Arterial thrombo-emboli and Thromboembolisms","Stenosis, ischemia and heart failure","Strokes","Normal Colon Tissue","Hyperplasia in Colon Tissue","Colon Dysplasia","Cancerous Colon Tissue","Adequacy of the Lateral Cervical Spine X-Ray","Assessing Alignment of the Lateral Cervical Spine (neck) X-Ray","Cervical Spine Protection in Airway Management (not a substitute for formal training)","Introduction to the Endocrine System","Bacterial Meningitis","Precocious Puberty","Childhood Growth","Ritual of the Bedside Exam","Systemic Thinking About Cancer","Vitamin C And The Limeys","Inflammation","Introduction to Common Medical Conditions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Common Medical Conditions - End of Assessment"]}]}