{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1731","title":"Introduction to Elements, Atoms and the Periodic Table","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about atoms, elements, and the periodic table as well as ionisation and chemical bonds with this course.","description":"This free online course on elements, atoms and the periodic table will give you comprehensive knowledge of the two fundamental aspects of chemistry which are first, the structure of the atom and the role of the subatomic particles neutrons, protons and electrons, and second, the atomic structure of elements. You will learn how the structure of each element determines its place in the Periodic table, and much more!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>We all know that an atom is the basic unit of a chemical element and is made up of three kinds of particles. With this course, you will look closely into these subatomic particles namely protons, neutrons, and electrons. You will also study valence electrons which are outer shell electrons associated with an atom. In addition, you will learn about orbitals, the periods and groups in the Periodic Table, and the electronic configuration of an element.</p><p>You will then study ionization, the process by which an atom or a molecule acquires a negative or positive charge by gaining or losing electrons. This often happens in conjunction with other chemical changes. You will learn that the resulting electrically charged atom or molecule is called an ion. What's more? You will study the different types of chemical bonds which include ionic, covalent, and metallic bonds as well as the Periodic Table trends.</p><p>This course will give you a comprehensive view of the core building blocks in chemistry. Once you gain better insight into the makeup of atoms and elements, it becomes both easier and more interesting to study the Periodic Table of Elements. You will also study the attraction and repulsion between subatomic particles acts according to Coulomb's Law. If you want to dig deeper into some of the groups of the periodic table such as noble gases, alkaline earth metals, alkali metals and halogens, take this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}