{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3859","title":"Beginner Kinematics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on kinematics introduces you to the concepts of distance and displacement in basic motion.","description":"In this free physics course on kinematics, you will master the concept of distance and displacement in basic motion. Learn how to ascertain the value of average velocity and instantaneous velocity and study position function and velocity-time graphs. By the end of this course, you will be better informed about the relationship between displacement average velocity and the time travelled by an object. Register today to master kinematics.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Kinematics is a branch of mechanics and is the science that illustrates the movement of objects using graphs and equations. This free online introduction to kinematics focuses on the principles and laws that govern the movement of objects. You will discuss terms such as acceleration, displacement, instantaneous velocity, free fall and relative motion. See how kinematics is used to explore the motion of the earth in relation to other bodies in the universe. Did you know that even though distance and displacement are similar, they have many differences, especially in terms of direction movement? Did you also know that there is a difference between instantaneous velocity and average velocity?</p><p>This easy-to-understand course explains the concepts of distance and displacement in basic motion. It breaks down how to ascertain the average value of average speed and average velocity. You will learn to solve a number of problems comparing the speed of two particles. The material describes instantaneous speed and how it affects the rate of change of position of an object for a time interval. It then explains how to determine the rate of change of velocity on an object in practical terms. You will learn how to calculate the acceleration of an object and the impact acceleration has on the distance covered. In this course, learn about the relationship between speed, velocity and acceleration. Do you know the importance of the position function in kinematics? See how to use the position function to find velocity and acceleration on an object. The course then describes how to calculate the velocity of a particle at a particular time interval using a general equation and examples.</p><p>Finally, you will be introduced to uniform motion and how it impacts a body travelling in a straight line. The material explains the uniform motion graph along with examples. Study how the velocity-time graph shows the speed and direction an object travels over a specific period of time. You will also learn how velocity-time graphs are called speed-time graphs in some instances. The course goes on to explain uniformly accelerated motion and how the velocity of an object is constantly changing. You will discuss examples of natural occurrences where uniform acceleration exists. Learn how to calculate the displacement of an object in motion. Explore the relationship between displacement, average velocity and the time travelled by an object. You will study different equations of motion and the methods used in deriving them. Get to analyze numerical and position-time graphs. Another interesting concept discussed is objects only under the influence of gravity or in ‘free fall’. If you are interested in learning more about mechanics and physics, then this kinematics course is for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}