{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4459","title":"Introduction to Environmental Issues","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course introduces a range of today’s critical environmental issues and discusses ways to address them.","description":"This course aims to give you an understanding of the most pressing environmental issues that we are facing. We will cover resource depletion, waste, pollution, climate change and biodiversity loss. You will discover that all of these issues are interrelated so taking action to resolve one will affect the others. This course delves into the causes of environmental issues and explains what will happen if we do not take action.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The world is currently on the brink of a series of environmental crises that will affect all regions, countries, people and other species that inhabit the earth. The more people who understand these critical issues and their consequences, the greater chance we can make the necessary changes to all aspects of our lives. These changes include how we interact with each other, do business and travel. We have developed this course to introduce several of the most pressing environmental concerns. The material comprises a series of short animations, supplemented by text sections interspersed with knowledge checks. We invite you to watch a series of conversations between two characters. The conversations take place in different settings to highlight each issue. Alison is an interested learner and is Naomi an experienced environmental advisor who explains the problems. Alison's understanding develops as the course progresses and she begins to identify actions she can take.</p><p>Learn the differences between renewable and finite natural resources and the need to conserve them. Naomi advises Alison about waste management and questions why householders are not expected to follow the waste hierarchy for managing it. Some waste material becomes pollution and the conversation turns to the problem of air pollution with particular reference to children's health. Naomi and Alison then discuss water pollution and aquatic ‘dead zones’ before moving on to contaminated land and the issue of plastic pollution. We describe the Greenhouse Effect and explain how greenhouse gases aid climate breakdown, making this the most challenging environmental issue. The final critical point is the loss of biodiversity and the idea of a sixth mass extinction.</p><p><br>Throughout the course, Naomi reminds Alison and students that the environmental issues we face are all related. The case study of deforestation illustrates that resolving one issue may also affect others. This study highlights the importance of ‘systems thinking’. We will provide you with a resource document containing links organised according to each topic to complement the information. This course is relevant to everyone as the subject matter deals with the world in which we live but it is of particular interest to anyone working in the field of Ecology or the environment, including those seeking employment as environmental compliance officers, environmental field technicians or health, safety and environmental specialists.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}