{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3935","title":"Beginner Magnetism","totalEnrolled":"691","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the fundamentals of electricity and magnetism and master these key concepts in this free online physics course.","description":"Electricity and magnets are all around us in our daily lives. This course on the fundamentals of electrical technology gives you a better insight into how magnetism works. It introduces you to the basic concepts, key terms, and important functions and formulas related to magnetism that you can apply to your practical and professional life. Take this course and enhance your career or scientific education now!","courseOutcomes":["Distinguish between different types ...","Discuss the properties of magnets...","Explain magnetic flux and magnetic f...","Describe the magnetic field of the e...","Distinguish between different types of magnets","Discuss the properties of magnets","Explain magnetic flux and magnetic field lines","Describe the magnetic field of the earth ie geomagnetism","Explain what a compass is and how is it used to find direction","Identify magnetic flux and magnetic permeability with formulae","Categorize magnetic materials into various classes","Compare the properties of magnetic materials","Distinguish between different types ...","Discuss the properties of magnets...","Explain magnetic flux and magnetic f...","Describe the magnetic field of the e...","Distinguish between different types of magnets","Discuss the properties of magnets","Explain magnetic flux and magnetic field lines","Describe the magnetic field of the earth ie geomagnetism","Explain what a compass is and how is it used to find direction","Identify magnetic flux and magnetic permeability with formulae","Categorize magnetic materials into various classes","Compare the properties of magnetic materials"],"courseDescription":"<p>Magnetism exists all around us in our daily lives. Whether it’s using our planet's magnetic field to direct our airplanes and ships to the workings of everyday appliances, magnetism has a direct impact on our lives. This free online course gives you an introduction to magnetism that will help you understand its overarching concepts. The course kicks off by taking you through a brief history of the object called a ‘magnet’. The learner will be provided with a classification of the various types of magnets that exist. A key portion of the material will look at the differences between them and an analysis of the different properties of magnets will be carried out. Whether it's magnetic attraction or repulsion or attractive and directive properties you want to know more about, this course has got you covered. Another key part of magnetism is the magnetic field surrounding a magnet. Identification of magnetic flux lines and the properties of magnetic lines of force will be the main focus within this part of the course.</p><p>Are you aware that magnetism is a universal phenomenon? And that the earth also has its own north and south magnetic poles? If not, then you have clicked on the right course! The next section provides the learner with an introduction to the concept of the earth’s magnetic field or geomagnetism. It describes how the magnetic fields from different sources permeate things in distant galaxies, humans and even minute atoms. An illustration explaining terrestrial magnetism will be provided so that the learner can grasp the mapping of a magnetic field at different points in space. Next, a key instrument that is used widely in today’s world will be explained when the key concepts and workings of a compass will be discussed. How this instrument can be used in order to find direction will also be illustrated.</p><p>As the course moves on, you look at some key formulas and terms used in the science of magnetism. Firstly, you will analyze magnetic flux and its density along with key formulae. Secondly, an explanation of magnetic and relative permeability and their formulas will be provided. Once you understand these concepts, you will be provided with a classification of magnets into different materials based on their susceptibility and relative permeability. An analysis will be carried out by the learner of each type of magnetic material along with examples and their respective susceptibility. A detailed comparison will also be carried out and presented between the various classes of materials. With magnetism playing such a crucial part in and around our lives, it is important that a solid foundation of knowledge about it is achieved. Create your account, enrol and complete the course for free.</p><a href=\"https://alison.com/resume/courses/3935\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3935\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Concepts of Magnetism","description":"In this module, you will be learning about the types of magnets and their properties. An analysis of the magnetic field and field lines of force will also be carried out. The module also looks into geomagnetism, the measurement of magnetic flux, and permeability. The classification of magnetic materials into various types will also be explained.","topics":["Basic concepts of magnetism - Learning Outcomes","Magnetism - Basics","Geomagnetism","Measurement of Magnetic Field","Classification of Magnetic Materials","Basic concepts of magnetism - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Electrical Technology - Course assessment"]}]}