{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2139","title":"Introduction to Legal Concepts","totalEnrolled":"12,782","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online course about basic legal concepts, including courts, trials, laws, crime, and legal terminology.","description":"This free online course will teach you about basic legal concepts as well as the law and crime. You will learn about the courts and different types of courts, such as state courts and appellate courts. Then, you will study the arrest to arraignment procedure and the important parts and players in that process, including trials, judges, juries and legal terminology. Start this online course today and learn about basic legal concepts.","courseOutcomes":["Identify different types and levels ...","Contrast civil and criminal trails. ...","Describe the arrest to arraignment p...","Explain trials and the role of every...","Identify different types and levels of courts.","Contrast civil and criminal trails.","Describe the arrest to arraignment process.","Explain trials and the role of every party involved from judge to the jury","Recognize legal terminology used throughout the process and it's role in court.","Identify different types and levels ...","Contrast civil and criminal trails. ...","Describe the arrest to arraignment p...","Explain trials and the role of every...","Identify different types and levels of courts.","Contrast civil and criminal trails.","Describe the arrest to arraignment process.","Explain trials and the role of every party involved from judge to the jury","Recognize legal terminology used throughout the process and it's role in court."],"courseDescription":"<p>This free online course, \"Introduction to Legal Concepts\", will provide you with an understanding of the basics of legal concepts. You will learn about what it takes to be a Legal Secretary, from potential careers to required traits. You will be learning about the courts and the criminal justice system, including the roles of people in the courthouse, the jury box, and the difference between trial courts and appellate courts. Next, you will learn about the grand jury, arraignment, pretrial motions, and plea negotiations.</p><p>Furthermore, this online course will teach you about the basics of law and crime. You will learn about the basics of American Law, common law heritage, Judge-made law, and how to read legal citations. Then, you will learn about the criminal procedure amendments, the bill of rights, and types of civil disputes as well as civil remedies for fighting crime.</p><p>Finally, you will learn about the trials, juries, the history of trials by jury, what the jury is and the role it plays in the criminal justice system, as well as the steps in the trial process. Studying this course will be of great benefit to everyone interested in the legal field or interested in becoming a legal secretary. Enroll in this online course today and start learning about the the American legal system and its concepts.</p><a href=\"https://alison.com/resume/courses/2139\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2139\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Legal Secretary Introduction","description":"In this module, Legal Secretary Introduction, students will learn about what it means to be a Legal Secretary. Students will also learn about potential careers and legal secretary job functions, as well as required traits of a Legal Secretary. Finally, this module will wrap up by giving students an employment outlook on potential career paths.","topics":["Topic A - Legal Secretary Introduction","Review Quiz"]},{"name":"Module","details":"Courts, Crime, and Controversy","description":"In this module, Courts, Crime, and Controversy, students will learn about; The courts and the criminal justice system. As well as actors in the courthouse and their roles. This module will also cover the differences between criminal vs civil court cases. Finally it will cover law on the books and in action.","topics":["Topic A - The Courts and the Criminal Justice System","Topic B - Actors in the Courthouse","Topic C - Criminal vs Civil Court Cases","Topic D - Law on the Books and in Action","Review Quiz"]},{"name":"Module","details":"Law and Crime","description":"In this module, Law and Crime, students will learn about such topics as the basis of American law, such as Common Law and Judge-Made Law. As well as the sources of American law and the Bill of Rights and Due Process. Finally, students will learn about the differences and procedures of civil disputes and criminal law.","topics":["Topic A - The Basis of American Law","Topic B - Sources of American Law","Topic C - Civil Disputes and Criminal Law","Review Quiz"]},{"name":"Module","details":"State Courts","description":"In this module, State Courts, students will learn about state courts. Including the history of state courts as well as state courts today. It will also go into the topic of the four layers of typical state courts. It will also cover courts from lower courts, to intermediate courts of appeals, to state supreme courts.","topics":["Topic A - State Courts","Review Quiz"]},{"name":"Module","details":"Arrest to Arraignment","description":"In this module, Arrest to Arraignment, students will learn about such as Crime and Arrest. A Comparison of Type I and Type II UCR Offenses. As well as bail, forms of bail, the effects of the bail system, bail agents and bounty hunters. It will also cover preliminary hearing, grand jury, and arraignment","topics":["Topic A - Crime and Arrest","Topic B - Bail","Topic C - Preliminary Hearing, Grand Jury, and Arraignment","Review Quiz"]},{"name":"Module","details":"Appellate Courts","description":"In this module, Appellate Courts, students will learn about the nature of the Appellate Process, limitations on the Right to Appellate Review, as well as the Standard of Review. Students will also learn about Appellate Court procedures, criminal appeals, post-conviction review, State Supreme Courts, and the U.S. Supreme Court and Criminal Justice Policy.","topics":["Topic A - Nature of the Appellate Process","Review Quiz"]},{"name":"Module","details":"Trials and Juries","description":"In this module, Trials and Juries, students will learn about the history of trials by jury. Students will also receive an overview of basic evidence and the types of evidence. They will also learn the steps in the trial process; such as opening statements, closing arguments, jury deliberations and the verdict.","topics":["Topic A - History of Trials by Jury","Topic B - Overview of Basic Evidence","Topic C - Steps In The Trial Process","Review Quiz"]},{"name":"Module","details":"Legal Terminology","description":"In this module, Legal Terminology, students will learn about contract terms, including taking a look at a sample contract, and being prompt and reasonable. Students will also learn about types of damages, such as compensatory damages, punitive damages, and nominal damages. Finally, we will cover negligence, subrogation, and choice of law.","topics":["Topic A - Legal Terminology","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Legal Concepts - Course Assessment"]}]}