{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4843","title":"Introduction to Hydroponics Gardening","totalEnrolled":"3,406","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how to grow a fresh and healthy garden using hydroponic techniques in this free online course.","description":"Do you know that fresh and healthy crops can be grown without using fertile soil? Growing produce in a nutrient solution aids in faster plant growth and improves yield. In this course, we demonstrate how to grow plants in this manner, hydroponically, both indoors and outdoors and help stems to grow roots. In addition, you will learn about effective pest management techniques in hydroponics and how to design and construct a backyard greenhouse.","courseOutcomes":["Define ‘hydroponics’...","List and explain the hydroponic syst...","Summarise the essential elements and...","Describe how to manage pests in hydr...","Define ‘hydroponics’","List and explain the hydroponic systems","Summarise the essential elements and minerals in plants as well as their function","Describe how to manage pests in hydroponics and how to grow crops indoors","Identify the growing media in hydroponics","Recognise the optimum environmental condition for growing crops in hydroponics","Outline the nutrient deficiency problems of crops in hydroponics","Recall the benefits of a greenhouse","Discuss the layout and construction of a backyard greenhouse","Define ‘hydroponics’...","List and explain the hydroponic syst...","Summarise the essential elements and...","Describe how to manage pests in hydr...","Define ‘hydroponics’","List and explain the hydroponic systems","Summarise the essential elements and minerals in plants as well as their function","Describe how to manage pests in hydroponics and how to grow crops indoors","Identify the growing media in hydroponics","Recognise the optimum environmental condition for growing crops in hydroponics","Outline the nutrient deficiency problems of crops in hydroponics","Recall the benefits of a greenhouse","Discuss the layout and construction of a backyard greenhouse"],"courseDescription":"<p>Hydroponics is a technique for growing plants without the use of soil. Unlike traditional crop growing, plants cultivated through hydroponics methods and systems use small amounts of water. It is an efficient way of growing produce, increasing crop yield and food quality. We'll introduce you to the concept of hydroponics, its methods and systems as well as its advantages and disadvantages. Although plants can grow without soil, they cannot thrive without the nutrients soil offers. Without soil, how can plants get the nutrients they need? You will learn about the units of measurement of nutrients, abbreviations of elements and how to supply nutrient solutions to plants. Following that, we will teach you about the mineral content in plants, the essential elements and their function. Next, you will study how plant roots absorb water and minerals, the composition of mineral soils and how to determine the level of alkalinity or acidity in the solid using the pH scale.</p><p>Proper crop irrigation is paramount for plant growth and development and revegetates soils lacking water. We analyse effectively designed irrigation systems that ensure enough water reaches every plant in the hydroponic garden. On top of that, we will help you understand how to use growing pots and trays, substrates for starting seeds and the equipment for growing crops indoors. Managing pests in the garden is important because they cause various diseases and plant mortality so you must control them adequately. We highlight the physical, biological, chemical and cultural ways of managing pests. Upon that, you'll discover what tools and equipment are best for enhancing plant care and how to use them. Gain insight into the various rooting media used when starting new plants from seeds or cuttings.</p><p>The following section examines the process of seeding and seedling production and the best environmental condition for growing crops. You'll discover the optimum carbon dioxide concentration and temperature in which they will thrive best. Discover nutrient problems in plants, nutrient solution reagents and nutrient formulation. Due to the adverse weather, environmental temperature changes often affect plant growth. With that in mind, a greenhouse that protects plants from extreme temperatures is used to grow crops. We discuss the greenhouse environment, its benefits and how to design and construct a backyard greenhouse. Hydroponics methods can let you develop a large volume of high-quality food in areas with large populations. Are you passionate about tackling the problem of food scarcity in your neighbourhood by growing crops and improving crop yield? Enrol and start this course right away.</p><a href=\"https://alison.com/resume/courses/4843\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4843\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Methods and Systems of Hydroponics","description":"In this module, you’ll be introduced to hydroponics, its methods, advantages and disadvantages. You will learn about the water-based nutrient solution, essential elements that plants require for growth and development, growing media and equipment as well as seeding. You’ll also learn about pest management and greenhouse construction.","topics":["Methods and Systems of Hydroponics - Learning Outcomes","System of Hydroponic Culture and Plant Nutrition","Hydroponic Equipment, Rooting Media and Plant Maintenance","Nutritional Problems and Growing in Greenhouses","Methods and Systems of Hydroponics - lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Hydroponics Gardening - Course Assessment"]}]}