{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3141","title":"Introduction to Earth and Nautical Charts","totalEnrolled":"633","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course defines longitude and latitude coordinates and examines the concept of nautical miles.","description":"This course focuses on the antimeridian, which lies at 180 ° from the primary meridian, and explains how it divides the Earth into different halves (eastern and western hemispheres). We explore the format of expressing the longitude coordinates and the concept of the geographical, statute and nautical miles. Learn how you can measure the meridional parts of a given latitude and how you can use the natural scale in chart measurements.","courseOutcomes":["Identify the equatorial and polar ra...","Explain the application of the great...","Explain the tilt of the Earth's axis...","Describe the measurement of a platit...","Identify the equatorial and polar radii of the shape of the Earth","Explain the application of the great circle as well as the small circle","Explain the tilt of the Earth's axis and the effect of the tilt","Describe the measurement of a platitude and parallels of latitude","Explain the significance of the referential meridian prime meridian","Explain the measure and significance of a geographical statute and nautical mile","Identify the equatorial and polar ra...","Explain the application of the great...","Explain the tilt of the Earth's axis...","Describe the measurement of a platit...","Identify the equatorial and polar radii of the shape of the Earth","Explain the application of the great circle as well as the small circle","Explain the tilt of the Earth's axis and the effect of the tilt","Describe the measurement of a platitude and parallels of latitude","Explain the significance of the referential meridian prime meridian","Explain the measure and significance of a geographical statute and nautical mile"],"courseDescription":"<p>The Earth is fascinating and studying its numerous components has intrigued humankind for years. This course probes into the Earth’s shape and its nautical charts. We introduce Aristotle and Pythagoras, who first made propositions regarding the Earth’s shape. We explain how we can draw a great circle on the surface of a sphere and how the spherical triangle can be formed on the globe by arcs of three great circles. Review the concept of the Earth axis and how the polar axis connects the poles of a body. Discuss how the Earth’s axis connects the North and South Poles and how the Earth’s equator surface is equidistant from the true north and south poles. The course will also explain the shape of the planet, the nautical charts, the concept of the knot, cable, the datum, nautical publications and how to gather this important information required during sailing. Discover the features of the terrestrial coordinates and how navigators use the nautical chart to plot courses and interpret daily operations. The greatness of the nautical charts for marine navigation, the use of the title block, datum and soundings are covered in this course.</p><p>The course then explains the prime meridian and how the anti-meridian can help form a great circle to divide the Earth into different halves. We will also demonstrate the format of expressing the longitude coordinates, the concept of the geographical, statute and the nautical mile. Explore how you can measure the southern parts of a given latitude and the difference between the two latitudes. Study the natural scale and how you can use it to determine the relationship between a given distance on the chart and the Earth. This course will teach you the symbols and abbreviations that you can use on charts and consciously avoid charted dangers during passage planning. We will explain how to group the symbols and abbreviations under the required heading, the features of the notice to mariners and the light list. You will learn about tide, current tables, the coast pilots, the important nautical publications of the United States and essential admiralty nautical publications.</p><p>Become familiar with the pole of a great circle, a small circle, how you can measure the spherical angle, as well as the properties of a spherical triangle. You will also learn how the interjection of different circles can form spherical triangles. The course will teach you how to solve equations regarding oblique spherical triangles, quadrantile spherical triangles, bi-quadrantal spherical triangles, triquadrantal spherical triangles and symmetrical triangles. Understand the difference and compare latitude and longitude and how you use the sun to determine your position here on Earth. We highlight this principle for finding latitude and longitude using the sun and show you how to measure the distance between two positions on a Mercator chart. This Earth’s shape and nautical charts course will help you improve your knowledge of the procedures for correcting charts, publications and admiralty notices to mariners. This course will be of great interest to students, researchers and anyone interested in marine navigation. So register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3141\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3141\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Shape of the Earth","description":"In this module, you will be introduced to the shape of the earth, great circle, small circle, spherical triangle, as well as the earth axis. You will also be introduced to the poles, equator, meridians, as well as the latitude and parallels of the latitude.","topics":["Shape of the Earth - Learning Outcomes","Introduction to Shape of the Earth","Earth Axis","Prime Meridian","Cable and Knot","Shape of the Earth - Lesson Summary"]},{"name":"Module","details":"Nautical Charts","description":"In this module, you will be introduced to the nautical charts, Mercator charts, as well as the Lambert conformal charts. You will also be introduced to the meridional part, the natural scale, as well as how a nautical chart can be used as a graphical two-dimensional representation of the maritime area.","topics":["Nautical Charts - Learning Outcomes","Introduction to Nautical Chart","Meridional Parts and Natural Scale","Symbols and Abbreviations Used on Admiralty Charts","Lights and Other Publications","Nautical Charts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Earth and Nautical Charts - Course Assessment"]}]}