{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4471","title":"Introduction to Mushroom Farming","totalEnrolled":"3,167","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course offers an in-depth understanding of the concept and biological techniques of mushroom farming.","description":"Do you love eating mushrooms? Unfortunately, not all mushrooms are edible and they only grow when conditions are favourable. With this in mind, how can we tell if a mushroom is edible? What environmental parameters do we need to consider to maximize mushrooms' growth and survival? We'll explore how to grow mushrooms using several approaches, the benefits of mushroom cultivation, how to identify edible mushrooms and more.","courseOutcomes":["Categorize the groups of mushrooms b...","Explain the techniques for mushroom ...","Discuss the mushroom-hunting process...","Describe the methods of creating mus...","Categorize the groups of mushrooms based on their nutritional mode","Explain the techniques for mushroom cultivation and the cultivation process","Discuss the mushroom-hunting process and list the equipment used in mushroom hunting","Describe the methods of creating mushroom cultures and identify their required nutrients","Analyze how substrates are inoculated and the materials used in the inoculation process","Identify the stages of the composting process of preparing nutrients to grow mushrooms","Summarize the bulk system in the second stage of the composting process of preparing nutrients to grow mushrooms","Categorize the groups of mushrooms b...","Explain the techniques for mushroom ...","Discuss the mushroom-hunting process...","Describe the methods of creating mus...","Categorize the groups of mushrooms based on their nutritional mode","Explain the techniques for mushroom cultivation and the cultivation process","Discuss the mushroom-hunting process and list the equipment used in mushroom hunting","Describe the methods of creating mushroom cultures and identify their required nutrients","Analyze how substrates are inoculated and the materials used in the inoculation process","Identify the stages of the composting process of preparing nutrients to grow mushrooms","Summarize the bulk system in the second stage of the composting process of preparing nutrients to grow mushrooms"],"courseDescription":"<p>Microorganisms come in a wide variety of shapes and sizes, which has led to the development of taxonomy as a system for classifying and naming them. This course will show you the taxonomy of living things, the group to which mushrooms belong and their evolution over time. Many creatures, including mushrooms, have different methods of feeding, some of which include interaction with other organisms, either plant or animal. We teach you how to classify mushrooms according to their mode of nutrition and how to feed them. Mushrooms have been around for a long time and humans have consumed edible mushrooms in the past. However, not all are edible. What characteristics should you look for while recognizing edible mushrooms? In this course, we explore the different features that you can find in edible mushrooms.</p><p>Mushrooms grow in specific habitats and when hunting mushrooms, one must be familiar with the particular places they grow. This course highlights mushroom-hunting methods and techniques, the optimal time to go mushroom hunting and the essential equipment required. Temperature, soil composition and other factors influence mushroom growth and development in their natural habitat. We will examine the essential and nutritional aspects that mushrooms require to survive in their natural environments. We'll work through the most critical nutritional factors and apply them to ensure optimal mushroom development, both indoors and outdoors. Culture media are platforms to grow nutrified mushrooms and require the right ingredients to make mushrooms grow. This course explores the steps and ingredients you use to make various culture media for mushrooms to grow in.</p><p>The next section of this course goes through the various forms of culture media and the recipes for preparing them. You'll learn about agar media, its components or formula and how to prepare it for large-scale mushroom production. We discuss other processes such as subculturing, subbing and supplementation at casing to enhance mushroom growth. The course analyzes the concept of mushroom spawning and the elements required in the spawning process. Finally, we look at the composting process of mushrooms, each stage of the composting process, the role of water and oxygen in the composting process and the key raw materials for the composting process. This course does not require any prior expertise. It is intended for those who wish to know about mushroom farming. Do you want to acquire the skills and methods needed for mushroom farming? Enrol now and get started on this course.</p><a href=\"https://alison.com/resume/courses/4471\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4471\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Mushroom Farming","description":"This module begins by exploring the classification of mushrooms and categorising them based on their mode of nutrition. You will be shown how to go mushroom hunting, cultivate and culture mushrooms. Additionally, learners will learn the process of mushroom spawning, the materials required for the process of composting and how to identify mushrooms.","topics":["Mushroom Farming - Learning Outcomes","Mushroom Cultivation and Culture","Mushroom Culture and Spawning","Mushroom Compost","Mushroom Farming - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Mushroom Farming - Course Assessment"]}]}