{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5487","title":"Introduction to Climate Breakdown","totalEnrolled":"273","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to respond to global climate change in this free online course that explains the term ‘climate breakdown’.","description":"This sustainable development course explains climate breakdown and provides some actions we can take to address this critical environmental issue. We delve into the science behind this pressing issue and explain how goals like net zero greenhouse gas emissions can help mitigate the harm done to the planet by industry. Sign up to explore this major environmental issue and learn what it means to us and future generations and what can be done.","courseOutcomes":["Summarise why we use the term ‘clima...","Recall the causes of climate breakdo...","Identify why climate breakdown is su...","Recognise why the future we may see ...","Summarise why we use the term ‘climate breakdown’","Recall the causes of climate breakdown","Identify why climate breakdown is such an important issue","Recognise why the future we may see is not the one we would like to see","Explain the basic science behind climate breakdown","Relate ‘tipping points’ to rapid changes to the global climate","Explain the issues surrounding climate breakdown confidently to others","Summarise why we use the term ‘clima...","Recall the causes of climate breakdo...","Identify why climate breakdown is su...","Recognise why the future we may see ...","Summarise why we use the term ‘climate breakdown’","Recall the causes of climate breakdown","Identify why climate breakdown is such an important issue","Recognise why the future we may see is not the one we would like to see","Explain the basic science behind climate breakdown","Relate ‘tipping points’ to rapid changes to the global climate","Explain the issues surrounding climate breakdown confidently to others"],"courseDescription":"<p>The world is currently on the edge of an environmental crisis that may have profound implications for the continuing existence of humanity as climate breakdown will affect the entire planet. If more people understand this critical issue and its consequences, there will be a greater chance that we make the necessary changes to all aspects of our lives. These changes include the policies enacted by our governments, the ways we interact with each other, how we do business and how we travel.</p><p>The course includes a series of short animations, text sections and knowledge checks. Richard, the course developer, presents the course material and is helped by Kate, a climate scientist. We define ‘climate breakdown’, identify the importance of net zero goals and explain how climate breakdown will impact the future. Kate explains the greenhouse effect, the role of carbon dioxide and other greenhouse gases and why we should be aware of ‘tipping points’. The course also discusses some measures we could adopt to avoid the worst effects of climate breakdown. We also discuss how we adapt to its consequences.</p><p>The course asserts that the changes in the climate we are experiencing are caused by mankind and our actions. Many people now recognise the importance of climate breakdown but are unwilling to make the changes necessary to avoid the worst effects. This course addresses current and urgent concerts and is of interest to anyone, but particularly suits those working in the field of environmental management or anyone seeking employment as environmental compliance officers, environmental field technicians or health, safety and environmental specialists. Sign up to understand how human activity drives global climate change and learn what you can do to address it.</p><a href=\"https://alison.com/resume/courses/5487\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5487\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Climate Breakdown","description":"In this module, you will be introduced to climate breakdown, given some background and context to this major environmental issue and be introduced to some ways of visualising climate breakdown.","topics":["Introduction to Climate Breakdown - Learning Outcomes","Climate Breakdown - What Do We mean?","Background and Context","Visualising Climate Breakdown","Introduction to Climate Breakdown - Lesson Summary"]},{"name":"Module","details":"Climate Breakdown - The Future","description":"In this module, we will encourage you to imagine the type of future we currently face before outlining some of the things we hope to see. We then go on to look at the future we will be facing if we do not take action to mitigate the effects of climate breakdown.","topics":["Climate Breakdown: The Future - Learning Outcomes","Imagine the Future","A View of the Future","The Future We Are Building","Climate Breakdown: The Future - Lesson Summary"]},{"name":"Module","details":"Climate Breakdown - The Science","description":"In this module, we introduce you to Kate, who is a climate scientist and who speaks to you from the Climate Lab. Kate explains the importance of greenhouse gases, particularly carbon dioxide and the important difference between climate and weather. She uses models to demonstrate the greenhouse effect.","topics":["Climate Breakdown: The Science - Learning Outcomes","The Climate Lab","The Greenhouse Effect","The Enhanced Greenhouse Effect and the Role of Carbon Dioxide","The Enhanced Greenhouse Effect and the Role of Other Gases","Climate Breakdown: The Science - Lesson Summary"]},{"name":"Module","details":"Tipping Points and Call to Action","description":"In this module, Kate will use models to help you learn about tipping points and their potential for accelerating climate breakdown. You will then go on to find out what action you can take to help minimise the effects of climate breakdown.","topics":["Tipping Points and Call to Action - Learning Outcomes","Tipping Points","An Introduction to Net Zero","What Should We Do About Climate Breakdown?","Tipping Points and Call to Action - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Climate Breakdown – Course Assessment"]}]}