{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2840","title":"Introduction to Ethnography","totalEnrolled":"566","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you the core elements of ethnography like 'the other' and research methodologies..","description":"Ethnography is the study of people and their interactions within their environment. In this free online course, you will be introduced to some of the fundamental elements of this field, including the notion of ‘the other’ and 'othering', specific ethnographic processes and different research methodologies and their limitations.","courseOutcomes":["Discuss ethnography in the context o...","Explain the three major components o...","Explain the process of ethnography...","Explain the fundamental concepts of ...","Discuss ethnography in the context of 'the other'","Explain the three major components of ethnography","Explain the process of ethnography","Explain the fundamental concepts of ethnography","Outline aspects of research design","Explain the research question","Explain how accessing existing knowledge informs the researcher","Discuss ethnography in the context o...","Explain the three major components o...","Explain the process of ethnography...","Explain the fundamental concepts of ...","Discuss ethnography in the context of 'the other'","Explain the three major components of ethnography","Explain the process of ethnography","Explain the fundamental concepts of ethnography","Outline aspects of research design","Explain the research question","Explain how accessing existing knowledge informs the researcher"],"courseDescription":"<p>This course begins by taking you through the terminology that is used in the field of ethnography. You will learn about the concept of ‘the other’, the notion of ‘othering’ and why they are important to consider when doing ethnographic research. You will also study differing ideas of ‘reality’ and how they affect people’s perceptions of the world, including your own perception of your study.</p><p>Next, the material moves on to introducing the ethnographic process. You will grapple with understanding the underlying principles of the process, which enables a better understanding of the research. The process also looks at ways of engaging with the study participants in their context, which helps to better observe and analyse their behaviour. At this point, you will be taught about ethnography as a ‘product’ as well as a ‘process’, looking at the fundamental concepts that make up the structure of ethnographic research.</p><p>Finally, the course looks at research design. It introduces the ‘research question’ and describes its importance as a guide for the rest of your research operations and methods. You will analyze the nature of knowledge, which you are seeking, along with the necessary tools and methods to use in order to access this knowledge. The course also looks at accessing existing knowledge in order to aid your research, and at designing effective fieldwork. Lastly, it shows you how these elements are applied in real case studies and highlights the importance of othering, proper interview techniques and thorough research design.</p><a href=\"https://alison.com/resume/courses/2840\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2840\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Ethnography","description":"This module, Introduction to Ethnography, covers the basics of Ethnography and contextualises the method of research. The module also covers aspects around the \"other\" and different ways of understanding alternative viewpoints.","topics":["Introduction to Ethnography - Learning Outcomes","Introducing Ethnography","Understanding the Other","Introduction to Ethnography - Lesson Summary"]},{"name":"Module","details":"The Process and Concepts of Ethnography","description":"This module, The Process and Concepts of Ethnography, discusses the major components which make up Ethnography, namely the process and the fundamental concepts. In this module, you will learn about the different parts of the Ethnographic Process, Ethnography as a product, and the principles that guide the process to give Ethnography a different way of seeing.","topics":["The Process and Concepts of Ethnography - Learning Outcomes","The Ethnographic Process","Fundamental Concepts","The Process and Concepts of Ethnography - Lesson Summary"]},{"name":"Module","details":"Research Surrounding Ethnography","description":"This module teaches you about designing the research around Ethnography. In this module, you will learn about the research process and how to apply it. You will also learn how to apply the concepts in real life by looking at case studies.","topics":["Research Surrounding Ethnography - Learning Outcomes","Designing the Research","Ethnographic Case Studies","Research Surrounding Ethnography - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Ethnography - Course Assessment"]}]}