{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3267","title":"Introduction to Microbiology","totalEnrolled":"4,672","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the fundamental principles of microbiology and encounter microscopic organisms with this free online course.","description":"Explore an exotic world too small to see with this free online course as we study microscopic organisms, otherwise known as ‘microorganisms’. We cover a range of relevant subjects, including cell structures, microbial diversity and chemical metabolisms. This course moves from the laboratory to the world around you as we examine the role of microorganisms in medical and culinary fields.","courseOutcomes":["Identify the basic principles of mic...","Summarize the theories of microbial ...","Explain the ways humans and microbes...","Define and compare ‘prokaryote’ and ...","Identify the basic principles of microbiology","Summarize the theories of microbial diversity","Explain the ways humans and microbes interact","Define and compare ‘prokaryote’ and ‘eukaryote’ cells","Describe how microorganisms exist in the environment","Outline how microbiology works within the food industry","Identify the basic principles of mic...","Summarize the theories of microbial ...","Explain the ways humans and microbes...","Define and compare ‘prokaryote’ and ...","Identify the basic principles of microbiology","Summarize the theories of microbial diversity","Explain the ways humans and microbes interact","Define and compare ‘prokaryote’ and ‘eukaryote’ cells","Describe how microorganisms exist in the environment","Outline how microbiology works within the food industry"],"courseDescription":"<p>Microbiology studies extremely small organisms found in our world, including bacteria, viruses, fungi and protozoa. We begin with microscopes as we investigate their lenses and usage. This course teaches you definitions and how to group microorganisms and outlines the history and foundation of microbiology. We provide specific definitions like ‘prokaryotic’ and ‘eukaryotic’ cells, which make up organisms, and explain their structure and differences. We go through metabolic processes and illustrate why enzymes are essential for living things. This course introduces you to microbes, what they need to survive and grow and the phases of bacterial growth. This helps you discover how we grow and measure microbes and what kind of chemical agents can control them.</p><p>This course takes a look at the different types of prokaryotes found in the world, which are divided into different types of archaea and bacteria. Classifications are everywhere in microbiology and we expose you to various types of phyla and eukaryota: fungi, algae, protozoa and slime and water moulds. We then cover viruses, viroids and prions and unpack the difference between deoxyribonucleic acid (DNA) and ribonucleic acid (RNA) virus entry in animals and the diseases that threaten plants. We show you how microbes infect their hosts and how medical professionals try to prevent infections from spreading. We help you study how microbial diseases are acquired, which includes covering the different forms of infectious diseases and their transmission. Do you know how your immune system works to fight off infections? Do you know what cells help to prevent you from falling ill? These basic and interesting questions are answered during this course. The immune system is a complex and amazing system worth studying in detail and we establish its purpose and how antibodies boost your body’s protection.</p><p>Our attention then moves on to the nature and purpose of vaccines. We begin with the history of vaccine development and the process whereby a vaccine protects the human body. We explain the concerns raised by the presence of microorganisms in our environment and look into their effect and the carbon, nitrogen and sulphur cycles. This course finishes with a look at the use of microorganisms and microbiology in the food industry and other sectors. This course provides a solid understanding of the basics when it comes to identifying the practical role of microorganisms, for example in developing vaccines. It will interest anyone who wants a zoomed-in view of the world around them as we offer a fascinating glimpse through the microscope.</p><a href=\"https://alison.com/resume/courses/3267\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3267\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Microbiology","description":"In this module, you will be introduced to the fundamental principles of microbiology, as well as the history of microbiology and how to use a microscope. This will include identifying cell parts, growing microbes in culture media, comparing Prokaryote and Eukaryote cells, examining the human immune system and developing vaccines for viral diseases and viruses. You will also learn about micro-organisms and the role they play in the soil, freshwater, natural environments and the food industry.","topics":["Introduction to Microbiology - Learning Outcomes","Cell Structure and Microbial Growth","Microbial Diversity","Vaccines and Microorganisms","Introduction to Microbiology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}