{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5407","title":"Junior Certificate Project Maths - Higher Level","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Review maths content in preparation for the Junior Certificate Higher Level in this free online course.","description":"Are you preparing for the higher-level Junior Certificate mathematics assessment? Whether you need to review statistics, shapes or even calculus this course has everything listed and more! This course covers Junior Cert geometry and fractions using videos, as well as the area, length and degrees of various shapes using different formulas. Although it is based on the Irish curriculum, anyone doing high-school maths will find it useful.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>How strong are your maths skills? Do you feel that you could benefit from reviewing high-level maths content? This course is for students interested in studying the Project Maths Junior Certificate Higher Level course and provides students with tutorial videos. It starts off teaching you about probability and statistics where you will learn about constructing a stem and leaf diagram, arrangements and selections, and the probability of events.</p><p>In the next module, you will learn about the shape, size, relative position and properties of space of objects with geometry, and about the relationships between the sides and angles of the objects with trigonometry. In the third module, you will learn about number formats such as decimal, scientific notation, and how to work with indices (negative, positive and fractional).</p><p>Next, you will be taught algebra, starting with simple formulae, expanding brackets and factorising. The second part of algebra will teach you about solving different types of equations. This course would be of great interest to anyone studying for the Irish Junior Certificate, or anyone looking to gain a good understanding of fundamental high school maths skills and knowledge.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}