{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4510","title":"Kitchen Gardening: The Complete Guide","totalEnrolled":"2,169","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Turn your yard into a garden full of fresh vegetables, fruits, herbs and flowers with this free online gardening course.","description":"Do you dream of the perfect garden but don't know where to start? This course is a complete guide to converting a portion of your land into a vibrant kitchen garden in which you can grow vegetables, herbs, fruits and flowers of your choice. Explore how to identify the soil type in your garden so you can select the best crops suited to grow. Discover how to cultivate, harvest and store plants while you manage pests in an eco-friendly manner.","courseOutcomes":["State the advantages of kitchen gard...","Explain the necessity of crop rotati...","List the vegetables best suited for ...","Distinguish between the different ty...","State the advantages of kitchen gardening","Explain the necessity of crop rotation and intercropping in a well-planned garden","List the vegetables best suited for your kitchen garden","Distinguish between the different types of soil","Identify the different types of crops suitable for growing in different soils","Describe the process of preparing beds for planting your crops","Recall the best practices for maintaining your garden and gardening tools","Outline the different eco-friendly approaches to managing the pest in your kitchen garden","Summarize the different harvesting and storage conditions for different vegetables and fruits","State the advantages of kitchen gard...","Explain the necessity of crop rotati...","List the vegetables best suited for ...","Distinguish between the different ty...","State the advantages of kitchen gardening","Explain the necessity of crop rotation and intercropping in a well-planned garden","List the vegetables best suited for your kitchen garden","Distinguish between the different types of soil","Identify the different types of crops suitable for growing in different soils","Describe the process of preparing beds for planting your crops","Recall the best practices for maintaining your garden and gardening tools","Outline the different eco-friendly approaches to managing the pest in your kitchen garden","Summarize the different harvesting and storage conditions for different vegetables and fruits"],"courseDescription":"<p>Kitchen gardens can be small, attractive and productive. You do not need a large property or complex agricultural tools to start one. Vegetables of your choice can grow abundantly in your backyard or in containers overflowing with produce or pots hanging on the balcony of your home. Growing food at home means you will have fresh, nutrient-dense nourishment right at your fingertips with complete control over when to harvest them and what kinds of fertilizer to use. Would you rather drive long distances to purchase basic produce like tomatoes, chillies, spinach, salad leaves and more or simply pick them fresh from your garden? This course explores the many facets of kitchen gardening and lays out its objectives and advantages. It is important to figure out the exact crops you want in your garden. You'll need to consider how much space and time is required for each, if the soil condition is correct and whether the climate is suitable for your chosen crop. Explore the basics of planning a garden, preparing the soil, choosing the right crop and fertilizers and preventing weeds from growing.</p><p>Kitchen gardening goes beyond farming a small portion of land to grow crops. You may not have the space available to cultivate the crop of your choice. Have you considered growing them in a pot or container? We will help you understand the concept of sustainable organic gardening, composting and container-gardening when space is limited. We guide you through the easy steps to growing leafy vegetables, root crops, herbs and various fruits and go through their harvesting techniques and storage. Gain insight into how to plan your mixed vegetable crop by intercropping annual and perennial vegetables such that you get food all year round from your garden. This will help you save space and resources while ensuring higher yields if the main crop returns are poor. Protecting your garden from different pests and diseases is one of the most important steps in gardening. We will teach you environmentally friendly approaches to controlling different garden pests and diseases.</p><p>If you have been planning to grow your own vegetables in your backyard or want to learn more about cultivating crops, designing your garden or giving a boost to your plant-parenting skills, then this course is ideal for you. It is never too late to start learning how to set up, design and cultivate a vegetable garden. We will help any beginner gain a basic understanding of kitchen gardening. Gardening can be very rewarding and relaxing. You will be surprised what you can grow in your garden as your efforts yield more fresh produce than you can handle. So if you plan to set up a garden and grow food, this course will get you started and keep your garden flourishing for many years to come. So why wait? Take the course and become a professional ‘green thumb’.</p><a href=\"https://alison.com/resume/courses/4510\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4510\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Kitchen Gardening","description":"This module will guide you through the different aspects of kitchen gardening, from planning the garden, selecting crops, preparing the soil and beds, harvest and storing your produce. You will learn about the best practices of maintaining your garden, growing root crops, leafy vegetables, herbs and fruits, as well as eco-friendly pests management.","topics":["Kitchen Gardening - Learning Outcomes","Introduction to Kitchen Gardening","Soil, Bed and Planting Description","Garden Maintenance and Eco-friendly Pest Management","Kitchen Gardening - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Kitchen Gardening: The Complete Guide - Course Assessment"]}]}