{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3919","title":"Laws of Exponents and Factoring in Algebra","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about non-positive exponents in algebra and how to factor polynomials from this free online math course.","description":"This course provides you with a comprehensive guide to the functions of monomial and non-positive exponents. Explore the commonly used vocabulary of monomials along with the relationship between variable expressions with exponents. This course shows you how fractional equations are solved in algebra. Begin today to improve your numeracy and algebra skills!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course begins by introducing you to the concept of monomial as an algebraic expression in mathematics. You will learn about the relationship between variables and exponents, along with the multiplication, addition, and division of monomials. You will also learn about the components of a monomial. This course delves into what makes the exponents of a monomial a negative integer or zero. Learn how to simplify the non-positive monomial exponents and what scientific notation is used for in algebra. This course teaches you about the various ways to solve fractional equations. You will also learn how an expression with two or more monomial terms is combined by addition, subtraction, and division. Understand the use of associative and commutative properties in solving monomial equations along with the laws for dividing monomials in mathematics.</p><p>Do you know how to find the lowest common denominator (LCD) when solving algebraic equations? This course explains in detail how to multiply both sides of an equation with the lowest common denominator. Understand the functions of the greatest common factor (GCF) as the first step of factoring polynomial equations. The material further explains how to reverse distributive properties in factoring polynomials as well as how to get the difference of two perfect squares using the FOIL (first, outside, inside, last) method. Learn about the combination of factors that can be added together to get the coefficient of the middle term of a polynomial. This course also shows you how exponents are arranged in descending order in polynomial equations. Study how to factor the sum of two perfect cubes as well as the difference between two perfect cubes in the real number system.</p><p>Finally, it exposes you to the formula for factoring the sum of two perfect cubes and what it means to factor a polynomial completely. You will be introduced to the procedures involved in factoring a polynomial completely. Learn about the different approaches to the multiplication of polynomials. This course is designed to teach you about the associative, commutative, and distributive properties of multiplying polynomials. On the successful completion of this course, you will be equipped with the requisite knowledge of the laws guiding the multiplication of monomials and polynomials in algebra. You will also be able to differentiate between the composition of a monomial and a polynomial. This course is targeted at students who need help solving algebraic equations. Start today to expand your knowledge on the laws of exponents as well as factoring monomials and polynomial expressions.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}