{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2138","title":"Legal Office Administration","totalEnrolled":"26,229","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains the various practices required to work in administration in a legal practice.","description":"This course teaches you how to perform the various procedures and functions of the legal profession. We take you through the preparation of legal documents, litigation and contracts as we explore various types of law, including its criminal, family, business, real estate and bankruptcy applications. Sign up for this short course to master the incredibly useful tools you can use in the legal field while you advance your career.","courseOutcomes":["Arrange and prepare legal documents ...","Evaluate bankruptcy and understand t...","Analyze contracts and their language...","Understand criminal law and procedur...","Arrange and prepare legal documents for any field","Evaluate bankruptcy and understand the process of filing","Analyze contracts and their language","Understand criminal law and procedure","Discuss estate planning and guardianship with elderly clients","Arrange and prepare legal documents ...","Evaluate bankruptcy and understand t...","Analyze contracts and their language...","Understand criminal law and procedur...","Arrange and prepare legal documents for any field","Evaluate bankruptcy and understand the process of filing","Analyze contracts and their language","Understand criminal law and procedure","Discuss estate planning and guardianship with elderly clients"],"courseDescription":"<p>This course covers everything you need to know to work in various legal settings. We explain certification for paralegals, including the American National Association of Legal Assistant (NALA) certification, the National Federation of Paralegals Association (NFPA) certification and National Association of Legal Assistants (NALA) certification. We then go through the preparation of legal documents and explore the workings of a legal office in terms of billing, litigation and contracts.</p><p>We examine the dynamics of criminal law and procedure, including torts, felonies and misdemeanors. The course then investigates family law in terms of marriage, divorce and child custody before delving into business law and topics like sole proprietorship and financial partnerships. We also study real estate laws concerning mortgages, deeds and basic ownership rights.</p><p>The course then moves on to elder law governing various types of will, estate planning and guardianship. We conclude with bankruptcy and show you how to file a ‘Chapter Seven’ case as we compare dischargeable and non-dischargeable debt. This course benefits aspiring legal students and anyone interested in learning about important legal procedures and file management to perform effective legal office administration. If you are an aspiring paralegal or legal assistant, we can help you take that next step towards your dream.</p><a href=\"https://alison.com/resume/courses/2138\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2138\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Certification for Paralegals","description":"In this module, Certification for Paralegals, students will learn about preparation for certification and the examination for certification. As well as the exam format. They will also learn about NALA Certification, NAFP Certification, and NALS Certification. It will also cover the difference between a paralegal and legal Assistant?","topics":["Topic A - Certifications","Review Quiz"]},{"name":"Module","details":"The Law Office","description":"In this module, The Law Office, students will learn about ethical considerations. As well as client relations. They will also learn about dealing with mail. It will also cover file management. Students will learn the use of technology for the law office and skills that every legal secretary should have.","topics":["Topic A - Ethical Considerations","Topic B - The Basics","Topic C - Client Relations","Topic D - Dealing With Mail","Topic E - File Management","Topic F - Use Of Technology","Topic G - Skills that Every Legal Secretary Should Have","Review Quiz"]},{"name":"Module","details":"Billing","description":"In this module, Billing, students will learn all about how attorneys charge. This course will also cover factors that impact an attorney’s fee. Students will gain an understanding time and cost entries as well as billing. How trust accounts work. Students will also learn about docket administration.","topics":["Topic A - How Attorneys Charge","Topic B - Time and Cost Entries","Topic C - Trust Accounts","Topic D - Docket Administration","Review Quiz"]},{"name":"Module","details":"Preparing Legal Documents","description":"In this module, Preparing Legal Documents, students will learn all about the basic preparation of legal documents and how to begin the case. It will break down the title, the body, signature and COS. It will also cover legal citations. Students will also learn about the law library and legal research for a case.","topics":["Topic A - Basic Preparation","Topic B - Legal Citations","Topic C - The Law Library","Review Quiz"]},{"name":"Module","details":"Litigation","description":"In this module, Litigation, students will learn all about what litigation is. This module will also cover opening the file and the delivery of documents. It will also go into additional pleadings. As well as what discovery is. Students will also learn all about motions prior to as well as during trial.","topics":["Topic A - What is Litigation","Topic B - Delivery of Documents","Topic C - Motions Prior to and During Trial","Review Quiz"]},{"name":"Module","details":"Contracts","description":"In this module, Contracts, students will learn about the basics or contracts. Students will also learn about the essential elements. As well as remedies for breach of contract. Including information on general damages, consequential damages, and reliance damages as well as the differences between them.","topics":["Topic A - The Basics","Topic B - The Essential Elements","Topic C - Remedies for Breach of Contract","Review Quiz"]},{"name":"Module","details":"Torts","description":"In this module, Torts, students will learn about the goal of tort law and the basic of tort law. As well as topics such as negligence. Students will also learn about the 3 main types of torts. As well as intentional torts and intentional infliction of emotional distress. It will also cover injunctive relief and strict liability.","topics":["Topic A - The Goal of Tort Law","Topic B - Negligence","Topic C - Strict Liability","Review Quiz"]},{"name":"Module","details":"Criminal Law and Procedure","description":"In this module, Criminal Law and Procedure, students will learn about Criminal Law Basics. Students will gain an understanding of misdemeanors and felonies. They will also learn definitions of some common crimes. As well as criminal procedure and some of the defenses a defendant may use. It will also cover the 4th, 5th and 6th amendments.","topics":["Topic A - Criminal Law Basics","Topic B - Criminal Procedure","Review Quiz"]},{"name":"Module","details":"Family Law","description":"In this module, Family Law, students will learn about marriage and the premarital agreement. It will also cover annulment and divorce including no fault divorce. Students will also learn about child custody and support agreements. It will also cover the attorney’s role in a divorce. The module will also touch on uniform laws.","topics":["Topic A - Marriage","Topic B - Annulment and Divorce","Topic C - Child Custody","Review Quiz"]},{"name":"Module","details":"Business Law","description":"In this module, Business Law, students will learn about types of organizations. It will also cover sole proprietorship and the sole proprietor. As well as partnerships and limited liability partnerships. Students will also learn about corporations. The module will also cover limited liability companies.","topics":["Topic A - Types of Organizations","Topic B - Corporations","Review Quiz"]},{"name":"Module","details":"Real Estate","description":"In this module, Real Estate, students will learn about the basics of real estate and ownership rights. Students will also learn about 4 methods of acquiring property. This module will also cover types of concurrent ownership. As well as deeds. It will also go into detail on mortgages. It will also go into detail on documenting transactions.","topics":["Topic A - The Basics","Topic B - Documenting Transactions","Review Quiz"]},{"name":"Module","details":"Estate Planning and Guardianship","description":"In this module, Estate Planning and Guardianship, students will learn about estate plan documents. This module will as go into detail on types of trusts and funding, as well as elements of a Trust. Students will also learn about elder law and types of wills. It will also discuss Guardianship and conservatorships.","topics":["Topic A - The Basics","Topic B - Characteristics of a Will","Topic C - Types of Trusts and Funding","Topic D - Elder Law","Review Quiz"]},{"name":"Module","details":"Bankruptcy","description":"In this module, Bankruptcy, students will learn about filing a chapter 7 case. They will also learn about means testing. The module will also go into detail about the automatic stay and 341 meeting. It will also cover chapter 11 and chapter 13 cases. Students will also learn about dischargeable and Non-dischargeable debt.","topics":["Topic A - The Basics","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Legal Office Administration - Course Assessment"]}]}