{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4429","title":"Lifeguard Training Fundamentals","totalEnrolled":"4,901","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online lifeguard training course teaches you to anticipate, recognize and manage emergencies in the water.","description":"This course arms you with the knowledge and skills required to prevent and respond to any aquatic emergency in a facility or natural environment. We outline the various duties and responsibilities of a lifeguard, including making decisions, having an efficient emergency action plan and knowing the legal obligations. Understand crucial elements to prevent drownings and injuries in and around the water. This course is vital to help you save lives!","courseOutcomes":["Define the characteristics of a prof...","List the duties of a professional li...","Distinguish between a person in dist...","Describe the effective observation s...","Define the characteristics of a professional lifeguard","List the duties of a professional lifeguard","Distinguish between a person in distress and a person drowning","Describe the effective observation skills that a professional lifeguard must have","Outline the step involves in activating an emergency action plan in an aquatic facility","Distinguish between the different methods and equipment used in rescuing a drowning victim","State why a lifeguard should know how to take care of victims with cardiac emergencies","Recognize the necessity of first-aid and health support training for a professional lifeguard","Evaluate the different ways injuries can happen and ways to prevent them","Define the characteristics of a prof...","List the duties of a professional li...","Distinguish between a person in dist...","Describe the effective observation s...","Define the characteristics of a professional lifeguard","List the duties of a professional lifeguard","Distinguish between a person in distress and a person drowning","Describe the effective observation skills that a professional lifeguard must have","Outline the step involves in activating an emergency action plan in an aquatic facility","Distinguish between the different methods and equipment used in rescuing a drowning victim","State why a lifeguard should know how to take care of victims with cardiac emergencies","Recognize the necessity of first-aid and health support training for a professional lifeguard","Evaluate the different ways injuries can happen and ways to prevent them"],"courseDescription":"<p>Do you love to swim? Have you considered leveraging your passion for swimming to save lives? Then taking a course on lifeguarding will help you achieve your goal. Lifeguarding is a dynamic, in-demand profession. It is also exciting and rewarding and comes with great responsibility. A lifeguard is a rescuer who supervizes the safety of swimmers, surfers and other water sports participants in a swimming pool, water park, beach, river or lake. Some lifeguards are trained in advanced treatments like CPR/AED first aid and certified in using a variety of aids and equipment like oxygen or defibrillators and personal watercraft. We will introduce you to the duties and responsibilities of a lifeguard. We will show you how to assess the danger, identify the hazards in an aquatic facility and reduce the associated risks. You will then learn how quick response times and an effective emergency action plan can save lives and prevent injuries around water enthusiasts.</p><p>Lifeguard observation is a tool to provide information to the lifeguard to advance their lifeguarding skills further and contribute to a safe and fun aquatic experience. In this light, we will show you how to recognize ‘distress drowning’ and prevent the process of drowning. You will gain insight into the importance of constant supervision, risk management, communication and conflict management. Discover the assistance methods and safety and rescue techniques used in different situations like accidents or natural disasters (tornadoes, high winds, heavy rain, thunderstorms and lightning). Upon that, we will introduce you to in-water rescues, unconscious protocols and spinal immobilization. We then explain how to provide care for breathing and cardiac emergencies, injuries and sudden illnesses until emergency medical services (EMS) personnel take over. Finally, we explore the different legal considerations you should consider while planning emergency actions or decision-making.</p><p>Lifeguarding can be more than just a summer job. We require lifeguards for many reasons. Imagine you are on vacation at a destination with a hotel pool, waterpark, beach or on a cruise liner. The lifeguard career path could take you to new and exciting heights in places like these. New parents can also benefit from a lifesaving course. Why not learn a new skill that will give you complete peace of mind when you are with your children at the beach or just the local swimming pool? Lives will be safer around you thanks to the skills studied in this course such as first aid, CPR and the dos and don'ts that apply in the event of a head, back or spine injury and bleeding. If you have prior training, such as treading water and performing a surface dive, and are interested in kickstarting your lifeguarding career or furthering it with new concepts and education, enrol in this course and start an exhilarating and rewarding career.</p><a href=\"https://alison.com/resume/courses/4429\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4429\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Professional Lifeguard Training","description":"In this module, you will learn about the duties and responsibilities of a professional lifeguard. You will understand why a lifeguard should be proactive and must have first-aid and basic life support training. You will also learn about the legal aspects a lifeguard should consider while making a decision or activating an emergency action plan.","topics":["Professional Lifeguard Training - Learning Outcomes","Duties of a Professional Lifeguard","Assess Emergencies and Provide Care","Professional Lifeguard Training - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Lifeguard Training Fundamentals - Course Assessment"]}]}