{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3065","title":"Major Filmmakers of New Hollywood","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online cinema course explores the origins of New Hollywood and introduces you to its major filmmakers.","description":"Let us transport you back to the late twentieth century and the anti-establishment and free-spirited world of New Hollywood cinema in this free online course. We examine the socio-cultural and political roots of the movement, its rise and finally its fall. We analyze the works of major filmmakers of the ‘Hollywood Renaissance’ to enrich your understanding of the evolution of film as this era still defines what we see on the silver screen.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>New Hollywood is also referred to as the ‘American New Wave’ or the ‘Hollywood Renaissance’ and refers to an American cinematic movement spanning the period from mid-1960s to the early 1980s. This course introduces you to a new generation of new famous filmmakers, including Martin Scorsese, Roman Polanski, Dennis Hopper, Steven Spielberg and George Lucas. We lay out the socio-cultural and political factors that led to the emergence of this movement, such as the Vietnam war, the 1968 Democratic Convention and the political assassinations of Dr Martin Luther King Jr and the Kennedy brothers. We establish the influence of European cinema and motorcycle clubs on the new genre, which took on an anti-authoritarian voice. Producers became more open to new forms of storytelling amid the development of hand-held cameras and other cheap, lightweight equipment. These factors combined to create New Hollywood.</p><p>We pay close attention to several major films of this era, including ‘Easy Rider’, ‘Bonnie and Clyde’, ‘The Graduate’, ‘The Conversation’, ‘The Last Picture Show’, ‘Targets’, ‘M*A*S*H’, ‘McCabe and Mrs Miller’, ‘Nashville’, ‘Two Men and a Wardrobe’, ‘Rosemary's Baby’, ‘Frantic’, ‘All the President's Men’, ‘Jaws’, ‘Star Wars’, ‘Manhattan’. The directors of New Hollywood enjoyed more power and prestige than their predecessors and aspired to be ‘auteurs’, commanding respect as artists. Some of these directors made films to pay homage to one of the greatest auteurs: Alfred Hitchcock. This course discusses the works of key directors, such as Hal Ashby, William Friedkin, Paul Schrader, Martin Scorsese and Roman Polanski. We explain the evolving socio-cultural trends that fed contemporary American society's appetite for creepy tales of demonic possession to explain this period’s embrace of themes of pessimism, horror and paranoia.</p><p>This course examines the idea of ‘high concept’ films such as the ‘Ocean's Eleven’ series, ‘Mission Impossible’ and the James Bond movies. Lastly, we study the works of Steven Spielberg and George Lucas and argue that 'Jaws' and 'Star Wars' began the decline of New Hollywood. We outline the reasons for that decline and identify the relevant external cinematic dynamics as changes in technology and the social and political landscape affected audiences' tastes. This course suits anyone interested in cinema and movie buffs and students of film studies can benefit from our analysis of the ongoing influence of New Hollywood. It can help writers and anyone working in media and communications to appreciate how today’s popular culture was established, thus honing their ability to tell today’s stories.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}