{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3227","title":"Maritime Rules of the Road - Signals and COLREG Annexes","totalEnrolled":"377","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the requirements of using marine light and sound signals and the COLREG Annexes in this free online course.","description":"This course on maritime rules of the road explains the ranges of navigation lights for different vessel sizes. Learn about identifying various types of ships and compare the differences between the anchored and vessels aground. Research the disparity between a vessel ‘not under command’ and a vessel that is ‘restricted in its ability to manoeuvre’. Register for this course today and learn about these important maritime rules!","courseOutcomes":["Classify the various types of naviga...","Describe a vessel ‘not under command...","Identify a vessel constrained by dra...","Outline sound signals given in restr...","Classify the various types of navigation lights","Describe a vessel ‘not under command’ and restricted in ability to manoeuvre","Identify a vessel constrained by draft and pilot vessel","Outline sound signals given in restricted visibility","Discuss the caution to be exercised when using sound and light signals","Describe the positioning and technical details of lights and shapes","List the additional signals for fishing vessels fishing in close proximity","State the technical details of sound signal appliances","Analyse the signals used to indicate ‘distress’ situations at sea","Explain the concept of horizontal positioning and spacing of lights","Describe the colour specifications of light","Classify the various types of naviga...","Describe a vessel ‘not under command...","Identify a vessel constrained by dra...","Outline sound signals given in restr...","Classify the various types of navigation lights","Describe a vessel ‘not under command’ and restricted in ability to manoeuvre","Identify a vessel constrained by draft and pilot vessel","Outline sound signals given in restricted visibility","Discuss the caution to be exercised when using sound and light signals","Describe the positioning and technical details of lights and shapes","List the additional signals for fishing vessels fishing in close proximity","State the technical details of sound signal appliances","Analyse the signals used to indicate ‘distress’ situations at sea","Explain the concept of horizontal positioning and spacing of lights","Describe the colour specifications of light"],"courseDescription":"<p>Become an authority on the rules in part C (Rules 20-31) and D (Rules 32-36) of the Maritime Rules of the Road together with the Convention on the International Regulations for Preventing Collisions at Sea, 1972 (COLREG) annexes with this course. You can apply some of these rules in good and bad weather conditions. Each navigation light's range is specified and divided based on the ship's length. This course discusses the lights displayed by normal power-driven vessels, towing and pushing vessels. Variations of the standard power-driven vessel need to show additional flashing lights to highlight their peculiarity. Discover that a sailing vessel needs additional lights other than the sidelights and stern light. Compare the differences between the ‘Not Under Command’ light (NUC) and the distress signal. This course provides information on vessels constrained by their draught, vessels engaged in pilotage duty, anchored vessels and vessels aground. We take you through the sound and light signalling equipment requirements for vessels and present an overview of the COLREG Annexes.</p><p>Next, we will examine the application of the maritime rules of the road relating to lights and shapes. We describe how the rules concerning lights must be complied with from sunset to sunrise. We demonstrate sidelights and the details of the range of navigation lights involving vessels of different lengths, the rules of towing and pushing and the nature of lights to be displayed by towing and pushing vessels. You will learn about vessels engaged in fishing, whether underway or at anchor, exhibiting only the lights and shapes prescribed in the fishing vessels rule. You will also study the positioning and technical details of lights and shapes, including additional signals for fishing vessels fishing nearby. Then we analyse the technical details of sound signal appliances and the distress signals that can indicate distress situations at sea.</p><p>This course will help you identify the attributes exhibited by vessels ‘not under command’ or restricted in their ability to manoeuvre. Become familiar with the major reasons you describe NUC vessels as ‘disabled vessels’. The course teaches the leading causes of engine breakdown or rudder damage in vessels. Vessels restricted in ability to manoeuvre have known limitations. We will guide you through the enabling factors that ensure you restrict a mine-clearance vessel in her ability to manoeuvre and how these rafts would show masthead light, sidelights and stern lights while moving through water. We introduce you to the dynamics of vessels engaged in dredging operations that do not require you to show anchor lights. Explore how vessels engaged in clearance have a unique combination of navigation lights due to the nature of their hazardous work. If you are interested in exploring the rules that guide the operation of vessels at sea, then this course is a great fit for you. So enrol today!</p><a href=\"https://alison.com/resume/courses/3227\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3227\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Rules of the Road","description":"In this module, you will learn about the various types of navigation lights used for different sizes of vessels. You will discuss how to identify power-driven, towing, and sailing vessels, as well as vessels not under command or restricted in the ability to manoeuvre.","topics":["Rules of the Road - Learning Outcomes","Lights and Shapes","Fishing Vessels","Sounds and Light Signals","Sound Signals in Restricted Visibility","Rules of the Road - Lesson Summary"]},{"name":"Module","details":"COLREG Annexes","description":"In this module, you will learn about the technical details of lights and shapes peculiar to various vessels at sea. You will study the additional signals for fishing vessels fishing in close proximity, technical details of sound signal appliances, as well as distress signals used to indicate distress situations at sea.","topics":["COLREG Annexes - Learning Outcomes","Annex I - Positioning and Technical Details of Lights and Shapes","Annexes II & III -  Signals for Fishing Vessels & Whistles","Annex IV - Distress Signals","COLREG Annexes - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Rules of the Road - Signal and COLREG Annexes - Course Assessment"]}]}