{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3604","title":"Master the MetaTrader Platform","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the principles and strategies involved in the MetaTrader online trading platform.","description":"Having the best tools is essential for success and this free online course on MetaTrader (MT4 and MT5) will help you master the online trading world. This Forex course will introduce you to the most popular Forex trading platform and you will gain an in-depth understanding of why more than 90% of brokers use MetaTrader as their primary trading interface because of the sheer power and possibilities that the platform provides.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you interested in mastering the most popular trading platform for forex, stock and cryptocurrency traders? This Forex trading course will introduce you to essential features of the MetaTrader platform that you can customize to take advantage of its hidden features. Gain insight into the difference between the MetaTrader 4 (MT4) and MetaTrader (MT5) trading platforms which are that MT4 is designed primarily for Forex traders, while MT5 allows you to trade in Forex and other financial markets. This online trading platform is very popular, in part because of the high level of customization; you can choose any chart of your liking such as candlestick charts, line charts and bar charts and the toolbar is fully customizable as well.</p><p>At first, the course will introduce you to the different time frames available in MetaTrader that you can use as the basis of your analysis. These time frames are suitable for both “scalpers” and “day traders,” and you will also learn how to customize the time frame section. Have you ever needed to create a custom currency symbol set in your MetaTrader market watchlist? This skill is very useful if you use different styles on different currency pairs, such as scalping on all the major pairs as they have high liquidity and swing trading on the minors. Discover how to use the terminal window in MetaTrader, which is a multifunctional window that allows you access to various platform features. You will be able to view the status of open positions, pending orders and manage all your trading activities on the trade window. As a market trader, you will inevitably want to use different trading strategies, and for that reason, you will appreciate the course content that covers template creation. The next section covers a host of interesting topics such as how to draw setups that will help you analyze the market correctly, the process of opening a buy and sell trade, the importance of using the “stop loss” and “take profit” tools, and indicators, which is used for technical forecasting analysis. The last section studies “buy and stop” limits, horizontal lines, the object trendline, and duplicating objects.&nbsp;</p><p>Online- , Forex and Cryptocurrency trading has grown in popularity over the last few years and platforms such as MetaTrader make it easy for anyone to trade. MT4 and MT5 are particularly user-friendly and enrolling in this free online course will simplify how the platform works and how you can get the most out of your entire trading portfolio. Whether you are a beginner or more experienced trader, this MetaTrader course will teach you all you need to know, and more.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}