{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4519","title":"Master the Tricks of Microsoft Excel","totalEnrolled":"3,545","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master amazing and effective tricks in Microsoft Excel using easy-to-understand videos in this free online course.","description":"Discover some amazing and helpful tricks you can effectively use in Microsoft Excel with these short practical training videos. This course will introduce you to handling day-to-day life data, filling data automatically, and linking different sheets. In addition, we explore how to extract the required data from a complex source of information, make cell data conditional, and so much more. Enrol today and become an expert in Microsoft Excel!","courseOutcomes":["Indicate how to fill data in a sprea...","Describe how to link data from diffe...","Explain how to freeze a specific sec...","Select and extract the desired data ...","Indicate how to fill data in a spreadsheet automatically","Describe how to link data from different spreadsheets","Explain how to freeze a specific section","Select and extract the desired data from a complex data source","State and control the input values in the cells","Compare the values in the data set","Recall crucial steps when creating an income spreadsheet","Evaluate the numbers of the input data in a complete spreadsheet","Indicate how to fill data in a sprea...","Describe how to link data from diffe...","Explain how to freeze a specific sec...","Select and extract the desired data ...","Indicate how to fill data in a spreadsheet automatically","Describe how to link data from different spreadsheets","Explain how to freeze a specific section","Select and extract the desired data from a complex data source","State and control the input values in the cells","Compare the values in the data set","Recall crucial steps when creating an income spreadsheet","Evaluate the numbers of the input data in a complete spreadsheet"],"courseDescription":"<p>Microsoft Excel is a powerful and helpful program used to save and analyze numerical data. It is a spreadsheet program that contains several columns and rows. There are various editing methods and formatting techniques that you can do on an Excel spreadsheet. This course will discuss some handy tricks found in Excel to make your day-to-day work easier and faster. An exciting aspect of this course is that you will not need to memorize any complex formulas or make overly detailed notes to learn these tricks.</p><p>We begin by viewing the first video tutorial, where you will automatically fill data into selected cells. Then we explore the process of data linking between different spreadsheets and discover how to freeze a specific part of the Excel spreadsheet. This tool is a beneficial technique to keep your headline visible while you scroll down the sheet or to the right. As you move through the course, you will learn how to create data conditioning and a dropdown list to select any entry from predefined options. By viewing the easy-to-understand videos, you will learn how to extract valuable data from tangled and very complex data. However, what if Excel gives you an error in your document? This course covers a variety of solutions to these error issues.</p><p>Towards the end of the course, we demonstrate creating a simple account sheet that will be worthwhile and useful to help maintain records of income and expenses. The video tutorial will outline the first steps in performing this technique. Anyone interested in entering or learning more about Microsoft Excel will profit greatly from this course. You will be able to create and expertly manoeuvre around all the different sheets viewed in the course. Maintaining your data, whether it is financial, employee records or simply day-to-day information, is made easy. Start this course now and become a master of Microsoft Excel!</p><a href=\"https://alison.com/resume/courses/4519\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4519\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Tips and Tricks of Microsoft Excel","description":"In this module, you will be introduced to the features of Microsoft Excel. Study how to handle complex data and how to make it simple. In addition, you will be able to link data from different spreadsheets. Finally, see how to control the input entered in a cell.","topics":["Tips and Tricks of Microsoft Excel - Learning Outcomes","Smart Tricks of Microsoft Excel Part One","Magic Tricks of Microsoft Excel Part Two","Account Budget Sheet","Tips and Tricks of Microsoft Excel - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Master the Tricks of Microsoft Excel - Course Assessment"]}]}