{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3871","title":"Mastering the Academic Desk Research Paper","totalEnrolled":"3,547","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn all the necessary skills you need for developing a top-quality desk research paper in this free online course.","description":"Desk research papers are widely assigned in college and university. This research paper writing course gives you detailed guidance in creating a top-quality desk research paper – the kind of guidance that you may not get in your classes. Learn how to analyze an assignment, write a thesis statement or research question, set research goals, collect and analyze information, organize your paper, and edit and revise your paper for outstanding results.","courseOutcomes":["Relate a focused research question o...","Collect and analyze the information ...","Indicate appropriate ways to organiz...","Identify the qualities of effective ...","Relate a focused research question or thesis statement","Collect and analyze the information needed for a desk research paper","Indicate appropriate ways to organize a desk research paper","Identify the qualities of effective academic writing","Describe how to edit and revise a desk research paper","Define skills to other types of academic writing","State valuable collegial support to your peers by developing your peer editing skills","Relate a focused research question o...","Collect and analyze the information ...","Indicate appropriate ways to organiz...","Identify the qualities of effective ...","Relate a focused research question or thesis statement","Collect and analyze the information needed for a desk research paper","Indicate appropriate ways to organize a desk research paper","Identify the qualities of effective academic writing","Describe how to edit and revise a desk research paper","Define skills to other types of academic writing","State valuable collegial support to your peers by developing your peer editing skills"],"courseDescription":"<p>This research course gives you a detailed explanation of the desk research writing process, starting with assignment analysis and ending with polishing the final paper. Crucial stages of the paper development process - such as developing a narrow topic, writing an effective thesis statement or research question, identifying sources, carrying out targeted research, information analysis, proper citation, peer editing, revision, and rewriting are all explained and demonstrated in over four hours of video. In addition, downloadable supplementary materials are provided.&nbsp;&nbsp;</p><p>The course is divided into six sections which includes (1) developing your research question or thesis statement, (2) carrying out your research, (3) analyzing your information, (4) organizing your paper, (5) qualities of effective academic writing, and (6) editing and revision. The skills you learn in this course will make the task of researching and writing a desk research paper more organized and efficient, resulting in a paper that meets the higher standards college and university instructors look for in student academic writing.</p><p>If you would like to sharpen your academic writing skills, then this academic writing course is exactly what you need. As a bonus, you will find that the skills learned in this course on desk research writing are transferable to other forms of academic writing that you will inevitably be assigned in the future.</p><a href=\"https://alison.com/resume/courses/3871\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3871\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Linking Purpose and Process for Success","description":"In this module you will learn how to analyze an assignment, write a thesis statement or research question, set research goals, collect and analyze information, organize your paper, and edit and revise your paper for outstanding results.","topics":["Linking Purpose and Process for Success -- Learning Outcomes","Developing Your Thesis Statement or Research Question","Carrying Out Your Research","Analyzing Your Information","Organizing Your Paper","More Features of the Paper","Qualities of Effective Academic Writing","Mastering the Academic Desk Research paper - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Mastering the Academic Desk Research Paper - Course Assessment"]}]}