{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3505","title":"Mathematics for Business Studies - Polynomial Functions and Derivation","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the definition, graphing, equations and derivations of polynomial functions from this free online course.","description":"Polynomial Function and Derivation is a free online course from Alison that provides an in-depth discussion on the methods of drawing a polynomial equation graph and the ways to find the equation of a Polynomial Function. Students will gain the requisite knowledge of derivations, differentiability, and continuity along with the applications of the intermediate value theorem. Register for this course today and begin an exciting learning journey!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Polynomial Function and Derivation is a free online course from Alison that provides an introduction to the functionalities of polynomial functions and derivations. You will be taught the definition, degree, and classification by degree of the polynomial functions. Study the various cases used to show the domain and range of a polynomial function. You will be introduced to the basics and principles used in finding zeros of a polynomial function. The possible end behaviors of a polynomial function in addition to the method used in finding intercepts of the graph of a polynomial function will also be introduced in this course. Explore the steps needed to draw a reasonable polynomial equation graph as well as the graphing of a polynomial function by using reflections, dilations, and translations. Learn about the number of turning points as well as the creation of sign charts of the polynomial factors. Taking this course will expose learners to the approaches used in finding the equation of a Polynomial Function. The conjugate root theorems, as well as the special techniques for 2nd and 3rd-degree polynomials, will also be evaluated in this course.</p><p>This course highlights reasons why a polynomial function, P(x) of degree 'n' must have one and only one y-intercept. You will also be taught the reasons why the x-intercepts, P(x) = 0, may be anywhere from zero to \"n\" on a graph. This course connects to past known teachings which show that we can simply create a table of values for a function by selecting points at random, and then connect the dots. You will learn that you may or may not include the most important features of the function when attempting to plot a graph. For example, when graphing a parabola, we took the trouble to locate its axis of symmetry, which then gave us a way of getting the vertex or turning point of the parabola. Do you want to learn how to show the essential features of a graph, then this course is for you. Study the creation of a table of values with the vertex as the center. The method of locating the y-intercept of the parabola and any real zeros that might exist will be explained to you. You will learn that when one variable quantity, y, depends on another, x, the derivative will tell us the instantaneous rate of change of y with respect to x. Learn about the quantities associated with the polynomial graph which are usually distance and time, momentum and velocity, financial assets and time, air pressure and height, to name just a few examples. Study the numerous pairs of variable quantities that the derivative deals.&nbsp;</p><p>Lastly, If you seek to understand the derivation of polynomials, this course is best for you as the average and instantaneous rate of change will be discussed in this course. You will learn about the methods used in finding the slope of a curve at a point and the slope of the tangent to a curve. Study the concept and methods to finding the equation of the normal line of a curve at a given point in addition to one-sided derivatives. You also be taught about the definition as well as the application of a derivative and notation. You will learn about the essential concepts, important principles, and applications of Differentiability and Continuity. Finally, the appropriate concepts and illustrative used to explain the Intermediate Value Theorem will also be covered in this course. This course will be of great benefit to learners, students, researchers in business mathematics, commercial enterprises, business majors, and all who have an interest in mathematics for business studies. Register for this course today and begin your next learning journey!<br><br></p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}