{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1682","title":"Media Studies - Entertainment and Broadcast Media","totalEnrolled":"11,872","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how music, radio, movies, and television have influenced culture and society, with this free media studies course.","description":"This free online Media Studies course will introduce you to entertainment and broadcast media. Different types of media such as music, radio, movies, and television have faced many challenges with the emergence of digital technology. With this course, you will learn about the impact new technology has had on these types of media. You will also learn the pros and cons of different media types as well as how they are evolving and adapting.","courseOutcomes":["Assess the impact of technologies th...","Describe the evolution of pop music ...","Explain the defining characteristics...","Describe the effects of networks and...","Assess the impact of technologies that have changed the face of the music industry","Describe the evolution of pop music during the last century","Explain the defining characteristics of radio’s Golden Age","Describe the effects of networks and conglomerates on radio programming","Explain the use of formats in the development of modern radio stations","Summarize key developments and technology in the motion picture industry","Explain how movies reflect cultural attitudes and trends","Discuss how movies influence culture and society","Identify three important developments in the history of television, since 1960","Assess the impact of technologies th...","Describe the evolution of pop music ...","Explain the defining characteristics...","Describe the effects of networks and...","Assess the impact of technologies that have changed the face of the music industry","Describe the evolution of pop music during the last century","Explain the defining characteristics of radio’s Golden Age","Describe the effects of networks and conglomerates on radio programming","Explain the use of formats in the development of modern radio stations","Summarize key developments and technology in the motion picture industry","Explain how movies reflect cultural attitudes and trends","Discuss how movies influence culture and society","Identify three important developments in the history of television, since 1960"],"courseDescription":"<p>This course begins by discussing how certain technologies changed the face of the music industry. You will study major record labels and independent labels, illegal file sharing, and legitimate digital downloads. You will then study the major technological changes in radio since its inception, the Golden Age of Radio, the Fairness Doctrine on political radio, and the development of new radio technologies. The course will also discuss the radio as a form of mass media.</p><p>You will then study the key developments of the motion picture industry and technology, the influence of movies on culture, the effects of piracy on the movie industry, and the impact of digital cinematography on the film industry. Finally, the course will discuss the three important developments in the history of television since 1960, its effect in the development of culture, the difference between satellite and cable television, and the effect of the Internet on content delivery and viewing patterns.</p><p>If you are interested in a career in the media then this Entertainment and Broadcast Media online course will give you a deeper understanding of the development of the different genres of music, the radio industry and its history, the effects of movies and television on culture, and how these different types of media have adapted to the changing times. This is really interesting and useful knowledge for anyone hoping to work in media, so check out the course today and give your media skills a real boost.</p><a href=\"https://alison.com/resume/courses/1682\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1682\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The World of Music","description":"This module looks at the world of music and includes topics such as History of Popular Music; Music Technology and Genres; Music and Culture; Music Labels; Music Online.","topics":["The World of Music - Learning Outcomes","History of Popular Music","Music Technology and Genres","Music and Culture","Music Labels","Music Online","The World of Music - Lesson Summary"]},{"name":"Module","details":"The World of Radio","description":"This module looks at the world of radio and covers topics such as Radio History and Technology; Radio Content and Regulation; Radio Formats; Radio and Consumer Culture; New Radio Technology.","topics":["The World of Radio - Learning Outcomes","Radio History and Technology","Radio Content and Regulation","Radio Formats","Radio and Consumer Culture","New Radio Technology","The World of Radio - Lesson Summary"]},{"name":"Module","details":"The World of Film","description":"This module looks at the world of film and covers topics such as History of Cinema; Developments in Cinema; Cinema and Culture; Film: Investment and Return; Digital Film Technology.","topics":["The World of Film - Learning Outcomes","History of Cinema","Developments in Cinema","Cinema and Culture","Film: Investment and Return","Digital Film Technology","The World of Film - Lesson Summary"]},{"name":"Module","details":"The World of Television","description":"This module looks at the world of television and covers topics such as Television Technology; Television Programming; Television Networks and Sponsors; Digital and Satellite TV.","topics":["The World of Television - Learning Outcomes","Television Technology","Television Programming","Television Networks and Sponsors","Digital and Satellite TV","The World of Television - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Media Studies: Entertainment and Broadcast Media - End of Course Assessment"]}]}