{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4488","title":"Medieval History: Art and Architecture","totalEnrolled":"1,861","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the history, government systems, religions, art and science of the Middle Ages in this free online course.","description":"The Middle Ages helped shape our modern world in the fields of technology, politics and theology. This history course divides the medieval era into three distinct periods and discusses important religious and political events. We explore the power struggles among Christian and Muslim rulers from Byzantium to Antioch and trace their impact on society. We examine key components of the medieval world, including lifestyle, food, science and art.","courseOutcomes":["Distinguish between different period...","Identify factors that lead to the co...","Analyze the rise and spread of Chris...","Explain the major schisms in Christi...","Distinguish between different periods of the Middle Ages","Identify factors that lead to the collapse of the Roman Empire","Analyze the rise and spread of Christianity and Islam and their relationship","Explain the major schisms in Christianity and Islam and their political significance","Discuss the everyday lives of Medieval people in terms of the law, food, entertainment and fashion","Outline the status and role of women in medieval society","Compare Byzantine, Catholic, Islamic and Gothic art and architecture","Recognize different genres and traditions of Medieval literature and writing systems","Distinguish between different period...","Identify factors that lead to the co...","Analyze the rise and spread of Chris...","Explain the major schisms in Christi...","Distinguish between different periods of the Middle Ages","Identify factors that lead to the collapse of the Roman Empire","Analyze the rise and spread of Christianity and Islam and their relationship","Explain the major schisms in Christianity and Islam and their political significance","Discuss the everyday lives of Medieval people in terms of the law, food, entertainment and fashion","Outline the status and role of women in medieval society","Compare Byzantine, Catholic, Islamic and Gothic art and architecture","Recognize different genres and traditions of Medieval literature and writing systems"],"courseDescription":"<p>Starting roughly from the fall of the Western Roman Empire in 476 CE, the Middle Ages lasted until roughly 1500. The course shows you how the periods of the Middle Ages are defined and lays out its subdivisions: Dark Ages, High Middle Ages and the Late Middle Ages leading up to the dawn of the Renaissance. Europe went through a tremendous political, social and religious transformation during the early Middle Ages. We study the fall of Rome, the survival of Byzantium, the establishment of England and the spread of Christianity and Islam throughout Europe and the Middle East. We show you how various schisms divided religions into distinct groups with different beliefs and practices and explain the political impact of such conflicts. We focus on the power struggle between Muslims and Christians and the Muslim conquests of Byzantine territory.</p><p>Any study of medieval history is incomplete without exploring ordinary people's everyday lives and means of living. We take you through various aspects of medieval life, including fashion and entertainment, food and health, courts and laws. The medieval classification of men and women differed sharply from today’s as society considered women to be the property of their closest male family members and their roles and responsibilities were mostly limited to their households. We explore the role of marriage, motherhood and widowhood in the lives of medieval women and some famous queens. The course aims to delight you by examining medieval art and architecture and its various forms, including Catholic, Byzantine, Islamic, Nomadic and Gothic styles. The Middle Ages was a fascinating time when ideas about magic and science co-existed and we delve into their interaction to explain the genesis of the Renaissance.</p><p>This course is designed for those intrigued by the history of language, culture, science and art of Europe and the Middle East. We present an overview of the Middle Ages and you require no prior knowledge of the period to get the most out of the classes. Human history is a fascinating field for scholars because it sheds light on how we survived and thrived through difficult times and explains how past cultures and civilizations influenced the modern world. This course covers notable characteristics and components of the Middle Ages to give you an idea of the profound impact of its social, political and religious developments on today’s world. We will analyze momentous medieval events in chronological order to help you understand the cause and effect of those events and help you see the ‘big picture’ of history. We also provide a pictorial representation of medieval art, architecture and lifestyles to make the course fun and engaging. Sign up to gain a nuanced insight into the rich and sometimes bloody history of the Middle Ages.</p><a href=\"https://alison.com/resume/courses/4488\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4488\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Life in the Middle Ages","description":"This module will introduce you to Medieval Era and its division into distinct periods of time. Learners will acquire knowledge of important political and religious events in Europe and the Middle East. You will learn about the everyday lives and status of women of the Middle Ages as well as Medieval literature, traditions, science and art.","topics":["Life in the Middle Ages - Learning Outcomes","Introduction to Medieval History","Medieval History - Life and Means of Living","Medieval Art and Architecture","Life in the Middle Ages - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Medieval History: Art and Architecture - Course assessment"]}]}