{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1967","title":"Media, Society and Culture","totalEnrolled":"6,480","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn how to critically analyse relations between Media, Society, and different Cultures.","description":"This free online media, culture, and society course will give you an introduction to mass media, legacy media, social media, and society digital culture. You will learn how mass media products work and look into the influence of TV, film, and music on society and culture. You will also look into Agenda-Setting Theory and Gatekeeping Theory, the Limited Effects Paradigm and Limited Capacity Processing Model, and a whole lot more.","courseOutcomes":["Define the meaning of mass media, \"l...","Explain the role of digital culture ...","Discuss media literacy and different...","Discuss the influence of TV, films, ...","Define the meaning of mass media, \"legacy media\" and culture","Explain the role of digital culture and social media in society","Discuss media literacy and different mass communication theories","Discuss the influence of TV, films, music and radio broadcasting on society and culture","Define what \"superbug\" media products are","Explain the use of narratives and platforms in digital gaming and its role in digital culture","Discuss the role and future of newspapers and digital news in society","Outline the role of advertising, marketing and PR as mass communication tools","Define the meaning of mass media, \"l...","Explain the role of digital culture ...","Discuss media literacy and different...","Discuss the influence of TV, films, ...","Define the meaning of mass media, \"legacy media\" and culture","Explain the role of digital culture and social media in society","Discuss media literacy and different mass communication theories","Discuss the influence of TV, films, music and radio broadcasting on society and culture","Define what \"superbug\" media products are","Explain the use of narratives and platforms in digital gaming and its role in digital culture","Discuss the role and future of newspapers and digital news in society","Outline the role of advertising, marketing and PR as mass communication tools"],"courseDescription":"<p>This free online Media, Society and Culture course will help you to understand the role of mass media in society and its cultural implications. This course is designed to help equip students and professionals with the skills and knowledge needed to critically analyse today's sociology of media culture and media society around the world.</p><p>The course begins by providing a brief overview of the origins of mass communication and the role of mass media in today's society. Next, you will learn about the practice of digital culture as an expression of individualization, post-nationalism, and globalization. You will also learn about the role of social media and the concept of social capital. The course then moves on to explain media literacy and critical media theories established in media studies research. Next, you will learn about the cultural implications of television, films, music, and radio broadcasting on society. You will also learn about \"superbug\" media products, such as podcasting, and digital gaming as a mass communication platform. The course will then proceed to explain the role and future of newspapers and digital news in today's society.</p><p>Lastly, you will learn about the role of advertising, marketing, and PR as mass communication tools. This course will be of interest to anyone working in mass-media related fields or for anyone who wants to learn about how to critically analyse today's media culture and media society. So, why wait? Start the course today and by the end of the week, you will have gained some valuable knowledge and skills you can apply in real life!</p><a href=\"https://alison.com/resume/courses/1967\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1967\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Media, Society and Culture - Part 1","description":"In this module, Media, Society and Culture - Part 1, you will learn about the general of mass media in society, digital culture, social media and media literacy. You will also learn about the impact of film, television, music recording and the information economy on both society and culture.","topics":["Media, Society and Culture - Part 1 - Learning Outcomes","Introduction to Media, Society and Culture","Digital Culture and Social Media","Media Literacy and Media Studies Research","Film and Bricolage","Impact of Television on Society","Music Recording, \"Sharing\" and the Information Economy","Media, Society and Culture - Part 1 - Lesson Summary"]},{"name":"Module","details":"Media, Society and Culture - Part 2","description":"In this module, Media, Society and Culture - Part 2, you will learn about the influence of radio, supermedia products and digital gaming on society. You will also learn about the role and effects of newspapers, advertising, marketing and PR on society. Lastly, you will be provided with a complete glossary of terms used in this course.","topics":["Media, Society and Culture - Part 2 - Learning Outcomes","Radio Broadcasting, Podcasting and \"Superbug Media\"","Digital Gaming","Newspapers and Digital News","Advertising and Marketing","Public Relations and Propaganda","Glossary of Terms","Media, Society and Culture - Part 2 - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Media, Society and Culture"]}]}