{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1733","title":"Modern Economics","totalEnrolled":"3,257","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This course covers inflation, deflation, jobless rates, the CPI and more for a solid grounding in modern economics.","description":"This free modern economics course will teach you about inflation, deflation, capacity utilisation, employment rates, and the Consumer Price Index (CPI). Economics is a social science that studies how society uses limited resources. It deals with the production, distribution, and consumption of goods and services. To help you understand these concepts, this course will also teach you about the China-US currency situation and Chinese inflation.","courseOutcomes":["Define economic concepts such as 'ca...","Discuss the principles behind earnin...","Examine the rise of the Chinese econ...","...","Define economic concepts such as 'capacity utilization rate', 'return on assets', 'gross profit' and 'cost of goods sold'","Discuss the principles behind earnings before interest and taxes, breakeven point, aggregate capacity, aggregate demand and aggregate utilization","Examine the rise of the Chinese economy and how it affects US economy","Define economic concepts such as 'ca...","Discuss the principles behind earnin...","Examine the rise of the Chinese econ...","...","Define economic concepts such as 'capacity utilization rate', 'return on assets', 'gross profit' and 'cost of goods sold'","Discuss the principles behind earnings before interest and taxes, breakeven point, aggregate capacity, aggregate demand and aggregate utilization","Examine the rise of the Chinese economy and how it affects US economy"],"courseDescription":"<p>Inflation is often expressed as a percentage and indicates a decrease in the purchasing power of a nation's currency. You will learn how it acts as a quantitative measure of the rate at which the average price level of selected goods and services in an economy increases over a period of time. You will then look into its opposite, which is deflation. Deflation is the decline in prices for goods and services and happens naturally when the money supply of an economy is corrected.</p><p>The Consumer Price Index (CPI) is used to examine the weighted average of prices of a basket of consumer goods and services. This may include transportation, food and medical care. This course will discuss the CPI index along with the unemployment rate. You will then study the data on Chinese foreign assets and the Chinese-US balance of payments. You will also look into the effects of floating exchange on China and the United States.</p><p>Following the recent global financial crisis, there has been a huge increase in people seeking to learn about how economies and modern economic systems work. By the end of this course, you will understand how economic decisions taken in one country can dramatically affect the economies of other countries around the world. So check out the course today, start gaining a deeper understanding of modern economic concepts and principles, and the interrelationship of global economies.</p><a href=\"https://alison.com/resume/courses/1733\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1733\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Understanding Modern Economics","description":"Learn about modern economics and how it effects the economies of countries around the world. This module examines in detail economic concepts and principles such as Capacity Utilization Rate, Return on Assets, Gross Profits, Cost of Goods Sold, Earnings Before Interest and Taxes, Breakeven point, Aggregate Capacity, Aggregate Demand and Aggregate Utilization. The module also looks at the rise of the Chinese economy and how it affects the economy of a country like America.","topics":["Learning Outcomes","Modern Economics - Example: Economics of a Cupcake Factory","Economics of a Cupcake Factory - Part 2","Economics of a Cupcake Factory - Part 3","Inflation, Deflation & Capacity Utilization - Part 1","Inflation, Deflation & Capacity Utilization - Part 2","Inflation & Deflation 3: Obama Stimulus Plan","Unemployment","CPI Index","Simple Analysis of Cost per Job Saved from Stimulus","Unemployment Rate Primer","Floating Exchange Resolving Trade Imbalance","China Pegs to Dollar to Keep Trade Imbalance","China buys US Bonds","Review of China US currency situation","Data on Chinese M1 Increase in 2010","Data on Chinese Foreign Assets Increase in 2010","Data on Chinese US Balance of Payments","Chinese Inflation","Floating Exchange Effect on China","Floating Exchange Effect on US","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Modern Economics - Course Assessment"]}]}