{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4119","title":"Moles Calculations","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basic chemistry concepts of mole, concentration, and chemical equations in this free online science course.","description":"This course introduces you to the fundamental concepts used to describe substances in chemical reactions. It teaches you how to calculate the number of moles and grams of a substance, and you will learn how to write the chemical equation. If you want to know how to calculate the concentration, volume of gases, and solve many exercises, then enrol for this free self-paced chemistry course today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the concept of relative isotopic and atomic masses, and how to use the relative atomic mass to calculate the relative molecular and formula masses. It also teaches you how to deduce the empirical and molecular formulas, balance chemical equations, write ionic equations, simplify precipitation equations, and calculate the formal charges. The material then moves on to give you a clear explanation of the units used to describe the amount of a substance, and how to convert between them. It also discusses formulas used to deduce the moles of a reaction, volumes, concentrations, percentage composition by mass, and Avogadro’s number. You will learn acid/base titrations and how to use the information of one solution to deduce the concentration of another solution using titration.</p><p>The key points covered in the course are: the relative atomic mass is the weighted average mass of atoms of an element, the relative molecular mass is the sum of the relative atomic masses of elements in a compound and the relative isotopic mass of a substance can be calculated using a mass spectrometer. The mole is the IS unit used to describe the amount of a substance: one mole of a substance contains a number of particles equal to the same number found in 12 grams of carbon-12. The molecular formula is a set of symbols used to describe the total number of atoms in a compound. The simplification of the molecular formula is called the empirical formula. The mole can be used to calculate reacting masses in grams, volumes of gases in cubic centimetres, and volumes and concentration of solutions.The stoichiometry of a reaction is the molecular ratio of reactants and products; it can be calculated using the volumes, concentrations, and masses of the reactants and products.</p><p>The basic concepts of describing a chemical reaction and the stoichiometry of a reaction are essential skills for any student who is enrolled in any science major. This free online course will help you understand and practice your knowledge of the included topics using examples, and exercises.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}