{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1375","title":"Motivating Students to Learn","totalEnrolled":"31,905","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This motivational training course help students look forward to learning by studying and applying motivation theories.","description":"This online student motivation training course will teach you the different factors that affect student motivation and show you to create a classroom environment that will promote highly motivated learning. Being an effective teacher requires a variety of skills but one of the most important is how to motivate a student to learn. Once the students are motivated, they will spend more time on their tasks and complete them much more effectively.","courseOutcomes":["Describe the theory of Behaviorism a...","Discuss operant conditioning in term...","Describe the difference between the ...","Explain how to generate interest in ...","Describe the theory of Behaviorism and how it relates to motivation","Discuss operant conditioning in terms of motivation","Describe the difference between the type of goals that affect a student’s motivation","Explain how to generate interest in a topic to help students get motivated","Discuss the different attributions about success and failure, and how they affect a student's motivation","Describe the theory of self-efficacy","Identify sources of self-efficacy beliefs in a student, and how to influence them positively","Define and describe self-determination","Define and describe the TARGET model","Describe the theory of Behaviorism a...","Discuss operant conditioning in term...","Describe the difference between the ...","Explain how to generate interest in ...","Describe the theory of Behaviorism and how it relates to motivation","Discuss operant conditioning in terms of motivation","Describe the difference between the type of goals that affect a student’s motivation","Explain how to generate interest in a topic to help students get motivated","Discuss the different attributions about success and failure, and how they affect a student's motivation","Describe the theory of self-efficacy","Identify sources of self-efficacy beliefs in a student, and how to influence them positively","Define and describe self-determination","Define and describe the TARGET model"],"courseDescription":"<p>This free online motivational training course will first introduce you to the theory of Behaviorism, operant conditioning, and how to apply them to motivation. You will learn about the different types of goals that affect student motivation as well as how to encourage mastery goals. You will study the effect of student interest on learning and motivation, and learn how to generate student interest in a topic. The student motivation course will also cover the different attributions of success and failure and how to encourage attributions that positively affect student motivation.</p><p>You will then learn about the theory of self efficacy, learned-helplessness, and the sources of self-efficacy in motivating students. The motivational training course will discuss the theory of self-determination, the three basic human needs that lead to self-determination, and extrinsic and intrinsic motivation. You will also learn teaching strategies that support students needs. Finally, you will study the expectancy of success, the value of success, and how to combine the two to create motivation as well as study the TARGET model.</p><p>Helping your students set achievable goals and motivating them to work towards them can be easily done when you acquire proper teaching techniques and understand important learning theories. The theories of motivation in education included in this motivational training course for motivating students can help you develop effective teaching skills and provide appropriate learning conditions to your students. So, check out the motivational training course today and start applying these lessons in your educational setting by the end of the week!</p><a href=\"https://alison.com/resume/courses/1375\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1375\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Behavior and Goals as Motivation Sources","description":"In this module, you will learn about the theory of Behaviorism, operant conditioning, and how to apply them to motivation. You will also learn about the different types of goals that affect student motivation such as mastery goals, performance goals, and failure-avoidance goals. Lastly, you will learn how to encourage mastery goals and how to avoid failure-avoidance goals.","topics":["Behavior and Goals as Motivation Sources - Learning Outcomes","Behavior as a Source of Motivation","Cautions about Behavioral Perspectives on Motivation","Goals that Contribute to Achievement","Goals that Affect Achievement Indirectly","Behavior and Goals as Motivation Sources - Lesson Summary"]},{"name":"Module","details":"Motivation Related to Attributions and Interests","description":"In this module, you will learn about the effect of student interest on learning and motivation. You will also learn how to generate student interest in a topic to help students get motivated. Furthermore, you will learn about different attributions of success and failure and how to encourage attributions that positively effect student motivation. Lastly, you will learn how to provide appropriate learning conditions.","topics":["Motivation Related to Attributions and Interests - Learning Outcomes","Interest as Motivation","Motives Related to Attribution","Motivation Related to Attributions and Interests - Lesson Summary"]},{"name":"Module","details":"Self-Efficacy","description":"In this module, you will learn about the theory of self-efficacy, learned-helplessness, and the sources of self-efficacy in a student.","topics":["Self-Efficacy - Learning Outcomes","Effects of Self-Efficacy on Students' Behavior","Learned Helplessness","Sources of Self-Efficacy Beliefs","Self-Efficacy - Lesson Summary"]},{"name":"Module","details":"Self-Determination","description":"In this module, you will learn about the theory of self-determination, the three basic human needs that lead to self-determination, and extrinsic and intrinsic motivation. You will also learn teaching strategies that support students’ needs.","topics":["Self-Determination - Learning Outcomes","Self Determination and Intrinsic Motivation","Using Self-Determination Theory in the Classroom","Self-Determination - Lesson Summary"]},{"name":"Module","details":"Combining Motivation Theories","description":"In this module, you will learn about the expectancy of success, the value of success, and how to combine the two to create motivation. You will also learn about the TARGET model, which uses a combination of motivation theories, and how to apply theories of motivation to your own teaching","topics":["Combining Motivation Theories - Learning Outcomes","Expectancy x Value: Effects on Students' Motivation","The TARGET Model","Motivation: Sustaining Focus on Learning","Combining Motivation Theories - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 6: Motivating Students to Learn Assessment"]}]}