{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4644","title":"Nuclear Warfare 101 - Survival Guide","totalEnrolled":"657","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover what you need to know and the actions required in case of a nuclear strike in this free online course.","description":"Old fears are rising of a nuclear war in the future. Rather than avoiding the prospect entirely, why not find out the facts? Simple steps can improve the chances of surviving for those on the perimeter of a nuclear explosion. Taking shelter, lying face down and covering your eyes are vital measures to take. Fallout is a major hazard in the wake of a blast so find out what it is and how to deal with it in this easy-to-follow free online course.","courseOutcomes":["State the types of threats resulting...","Describe the consequences and impact...","Outline the safety measures to take ...","Recognise the steps necessary to red...","State the types of threats resulting from a nuclear explosion","Describe the consequences and impact of a nuclear blast","Outline the safety measures to take during a nuclear attack","Recognise the steps necessary to reduce the effect of a blast","Identify what ‘fallout’ is and how to deal with it","List the types of food and drink that you can safely consume after fallout","Explain some of the injuries that a nuclear explosion might cause","Outline how to build a shelter","Describe the essential items you may wish to store","Discuss the return to health and vigour of Japan's bombed cities of Nagasaki and Hiroshima","State the types of threats resulting...","Describe the consequences and impact...","Outline the safety measures to take ...","Recognise the steps necessary to red...","State the types of threats resulting from a nuclear explosion","Describe the consequences and impact of a nuclear blast","Outline the safety measures to take during a nuclear attack","Recognise the steps necessary to reduce the effect of a blast","Identify what ‘fallout’ is and how to deal with it","List the types of food and drink that you can safely consume after fallout","Explain some of the injuries that a nuclear explosion might cause","Outline how to build a shelter","Describe the essential items you may wish to store","Discuss the return to health and vigour of Japan's bombed cities of Nagasaki and Hiroshima"],"courseDescription":"<p>Nobody wants to face the prospect of a deliberate nuclear attack but arming yourself with information could not only alleviate some of your fears but increase your chances of surviving an incident unscathed, particularly if you are not in the immediate vicinity of an explosion. There are many straightforward precautions you can take to safeguard yourself and your family. We begin this course by exploring the impacts a nuclear explosion can have and what you should do if a warning has been sounded, what sort of places afford the most protection and what position to adopt to minimise the risk of injury.</p><p>Depending on whether a nuclear warhead impacts the ground or is detonated in the air, there can be varying amounts of radioactive fallout and its direction is influenced by the wind. This makes the area affected by fallout difficult to predict and means it is more important than ever to know what to do if you are contaminated by fallout from an explosion. Discover how to identify fallout and what to do if it lands on your clothes or skin as well as how to know which food and drinks are safe to consume afterwards.&nbsp;</p><p>The course continues by looking at some of the risks associated with this sort of explosion. Equip yourself with the knowledge of injuries you may encounter, such as burns and breaks. We cover shelter building and the sort of supplies that you might require should you need to remain indoors to avoid fallout. Being informed about what you can do should help you face your fears and move forward with greater confidence. It also gives you the opportunity to store some useful items that hopefully you will never need to use. Finally, we look at modern-day Hiroshima and Nagasaki and celebrate their resilience and capacity for life after a nuclear catastrophe.</p><a href=\"https://alison.com/resume/courses/4644\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4644\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Hacks for Surviving a Nuclear Blast","description":"This module describes the various types of threats occurring due to nuclear blasts. The effects of sparks, heat, and fire surges are among these threats, as are early radioactivity and the protracted consequences of nuclear fallout.","topics":["Hacks for Surviving a Nuclear Blast - Learning Outcomes","Nuclear Explosions - Survival Strategies","Nuclear Fallout","Hazards of Nuclear Explosions","Finding or Creating a Shelter","Hacks for Surviving a Nuclear Blast - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Nuclear Fallout Hazards and Protective Measures - Course Assessment"]}]}