{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3340","title":"Number Operations and Algebra for General Studies","totalEnrolled":"2,126","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamental structure of numbers and the basics of algebra in this free online course.","description":"Isn’t it amazing how some people seem to have an affinity for numbers? This course on number operation and algebra will bridge the gap and help you become more comfortable with the different types of numbers, their properties, and operations. Understand how to simplify numerical and algebraic expressions, as well as the rationality of numbers. Discover the basics of algebra and explore inequalities by enrolling today!","courseOutcomes":["Explain the order of operations...","Identify how to simplify numerical e...","Analyze variables and algebraic expr...","Define 'absolute value'...","Explain the order of operations","Identify how to simplify numerical expressions","Analyze variables and algebraic expressions","Define 'absolute value'","Discuss the applications of ratios and proportions","Summarize how to graph a solution set on the number line","Identify how to write equations and formulas","Recall operations with fractions","List the properties of real numbers","List the properties of inequality","Differentiate between conjunction and disjunction","Explain the order of operations...","Identify how to simplify numerical e...","Analyze variables and algebraic expr...","Define 'absolute value'...","Explain the order of operations","Identify how to simplify numerical expressions","Analyze variables and algebraic expressions","Define 'absolute value'","Discuss the applications of ratios and proportions","Summarize how to graph a solution set on the number line","Identify how to write equations and formulas","Recall operations with fractions","List the properties of real numbers","List the properties of inequality","Differentiate between conjunction and disjunction"],"courseDescription":"<p>Mathematics is an exciting and varied subject that can open up many opportunities for you. Studying maths (or math) makes you better at solving numerical and analytical problems and gives you skills that you can apply in many different job roles. This course on number operations and algebra will guide you through an introduction to the foundation of math, ranging from sets and Venn diagrams to fractions and algebra. Algebra is a powerful tool for problem-solving in science, engineering, economics, finance, architecture, ship-building, and many other day-to-day tasks. The skills you develop while working on mathematical functions will develop your problem-solving abilities in other ways, such as pattern spotting and logical reasoning.</p><p>This course introduces you to the vocabulary and definition of working with sets. Being familiar with the terminology helps you grasp the different concepts covered by the material. Venn diagrams show the relationship between a finite collection of sets. We will consider operations between sets as illustrated with the help of Venn diagram examples, and analyze the different types and orders of mathematical operations. Number lines are necessary as they present numbers in real life. Primarily because you can represent negative numbers in a way that makes sense, learn about number lines and graphing, a visual representation of the set of real numbers. Integers are the numbers that can be positive, negative or zero but cannot be a fraction. You use these numbers to perform various arithmetic operations like addition, subtraction, multiplication and division. Appreciate these different arithmetic operations of integers with the aid of examples. You will also learn about the properties of rational numbers</p><p>Next, you will learn about algebraic expressions and how to simplify them. Learn how to write such equations and formulae and describe the relationship between the variables. We will take you through a step-by-step process of solving equations with the aid of illustrations. In mathematics, an inequality is a relation that makes a non-equal comparison between two numbers or other mathematical expressions. For example, you use it often to compare two numbers on the number line by their size. This course analyzes solving inequalities along with the different operator types in mathematics and the problem-solving applications of inequalities. Without conjunctions and disjunctions, we won't join statements logically. The material explicitly demonstrates how to use these compounds with the aid of examples. A ratio is defined as a tool used to compare the size of two or more quantities in relation to each other. Ratios allow us to measure and express quantities by making them easier to interpret. This engaging introductory course will teach you all you need to know to use ratios and proportions confidently. Don’t delay - register today!</p><a href=\"https://alison.com/resume/courses/3340\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3340\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Numbers and Operations","description":"In this module, you will be introduced to how numbers and operations work. You will also learn about the different types of operations and their order. The module also gives an insight into integers, fractions, and decimals.","topics":["Numbers and Operations - Learning Outcomes","Working with Sets and Operations","Mathematical Operations","Introduction to Integers","Forms of Numbers","Numbers and Operations - Lesson Summary"]},{"name":"Module","details":"Basics of Algebra","description":"In this module, you will be introduced to the basics of algebra, how to solve algebraic equations, and the properties of real numbers. This module analyzes the steps to solving equations using different operators and inequalities. You will also learn about the applications of ratios and proportions.","topics":["Basics of Algebra - Learning Outcomes","Basics of Algebra","Solving Equations","Inequalities","Ratios and Proportions","Basics of Algebra - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Number Operations and Algebra for General Studies - Course Assessment"]}]}