{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1886","title":"Numbers and Sequences in Mathematics","totalEnrolled":"5,659","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain an understanding of how numbers are arranged, stored, displayed, and used in Mathematics.","description":"This free online mathematics course will teach you about numbers and their sequences. Numbers, the foundation of mathematics, can be simple or complex. This course cover important mathematical topics about numbers, from writing them in scientific notation and multiplying powers, imaginary numbers, natural numbers rational numbers, and irrational numbers. Start this free course today and give your mathematical skills a solid boost.","courseOutcomes":["Identify how to write large numbers ...","Discuss how to you multiply and add ...","Define a quadratic number pattern, c...","Define what imaginary numbers, ratio...","Identify how to write large numbers in the standard form or scientific notation","Discuss how to you multiply and add power of numbers(indices)","Define a quadratic number pattern, calculate and equation for a quadratic number pattern","Define what imaginary numbers, rational and irrational numbers are","Discuss proof by contradiction","Identify how to change the base of a logarithm","Discuss the concept of a limit in mathematics","Define what both an Arithmetic series and a Geometric series are","Recognize how to derive the amortisation formula from a geometric series","Recognize how to manipulate complex numbers and the algebra of complex numbers","Recognize how to write complex numbers in polar form","Identify how to multiply and divide complex number in the polar form","Identify how to write large numbers ...","Discuss how to you multiply and add ...","Define a quadratic number pattern, c...","Define what imaginary numbers, ratio...","Identify how to write large numbers in the standard form or scientific notation","Discuss how to you multiply and add power of numbers(indices)","Define a quadratic number pattern, calculate and equation for a quadratic number pattern","Define what imaginary numbers, rational and irrational numbers are","Discuss proof by contradiction","Identify how to change the base of a logarithm","Discuss the concept of a limit in mathematics","Define what both an Arithmetic series and a Geometric series are","Recognize how to derive the amortisation formula from a geometric series","Recognize how to manipulate complex numbers and the algebra of complex numbers","Recognize how to write complex numbers in polar form","Identify how to multiply and divide complex number in the polar form"],"courseDescription":"<p>An understanding of whole numbers is the essential and fundamental foundation of mathematics, and, along with the infinite sequence in which they are arranged, stored, and displayed, are vital to your understanding and ability in Mathematics.</p><p>The course starts off by discussing how large decimal numbers are written in the standard form or in scientific notation. You will learn how to convert from decimal format to the standard form and back again. You will also learn about working with indices or powers when they are negative, fractional, equal to 0, a set of natural numbers, and how to multiply and divide numbers with indices.</p><p>Next, you will be tought about patterns with imaginary numbers, what imaginary numbers are, and the definitions of rational, irrational, and prime numbers. Then you are introduced to the mathematical concept of proof by contradiction, how to find cubed roots, along with how to change the base of a logarithm and work out a logarithmic equation.</p><p>The second half of module two will introduce you to the limit of sequences in mathematics, taking you through an example. After which you will learn about an arithmetic series and a geometric series and the formula for both of them. You will learn about deriving an amortisation formula from a geometric series, and about four different circumstances under which, proof by induction can be applied.</p><p>In the last module, you will learn about what complex numbers are and how to manipulating and use them in mathematics. You will learn about what an Argand diagram is and what the modulus is, along with the meaning of I, counting numbers, and imaginary numbers. You will learn how to convert complex numbers to the polar form and multiply and divide them in the polar form. Lastly, you will learn about proving De Moivre's Theorem, solving equations that have complex numbers, and find complex and cubed roots.</p><a href=\"https://alison.com/resume/courses/1886\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1886\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Numbers Part 1","description":"In this module you will learn how to work with and solve number systems including indices, converting decimal numbers to the standard form, multiplying indices, and Argand diagrams.","topics":["Numbers Part 1 - Learning Outcomes","Large Numbers in Standard Form","Changing Decimals to Standard Form","Changing Large Numbers from Standard Form","Changing Small Numbers from Standard Form","Adding and Multiplying Simple Powers","Working with Indices","Negative Indices","Fractional Indices, Numerator of 1","Index Power Equal to 0","Positive Fractional Indices All Types","Negative Fractional Indices","Writing Index Numbers as a Power of 2","Quadratic Number Patterns","Numbers Part 1 - Lesson Summary"]},{"name":"Module","details":"Numbers Part 2","description":"In this module you will learn more on how to work with number including imaginary numbers, rational & irrational numbers, logarithms, sequences, Proof by induction, and finding cubed roots.","topics":["Numbers Part 2 - Learning Outcomes","Patterns with Imaginary Numbers","Rational or Irrational","Proof by Contradiction – Root 2 is Irrational","Finding the Cube Roots of 8","Changing the Base of a Logarithm","Logarithmic Equations","Limit of Sequences","Arithmetic Series","Geometric Series","Infinite Geometric Series - Part 1","Infinite Geometric Series - Part 2","Deriving Amortisation Formula from Geometric Series","Proof by Induction – The Sum of the First N Natural Numbers","Proof by Induction Applied to a Geometric Series","Further Proof by Induction – Multiples of 3","Further Proof by Induction – Factorials and Powers","Numbers Part 2 - Lesson Summary"]},{"name":"Module","details":"Complex Numbers","description":"In this module you will learn to work with complex numbers and what they are, including manipulating complex numbers, the complex conjugate, pattern with imaginary numbers, writing complex numbers in the polar form, De Moive's Theorem, solving quadratic equations, and cubic equations with complex numbers.","topics":["Complex Numbers - Learning Outcomes","Manipulating Complex Numbers and The Complex Conjugate","The Argand Diagram and Modulus","The Meaning of i","Patterns with Imaginary Numbers","Writing Complex Numbers in Polar Form","Multiplying and Dividing in Polar Form (Proof)","Multiplying and Dividing in Polar Form (Example)","Proof of De Moivre’s Theorem","Complex Numbers When Solving Quadratic Equations","Cubic Equations with Complex Roots","Finding the Cube Roots of 8","Complex Numbers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Numbers and Sequences in Mathematics - Course Assessment"]}]}