{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4285","title":"Organic Chemistry | Bonding and Shapes of Molecules","totalEnrolled":"1,192","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the shapes and bonds of molecules and molecular orbital theory in this free online chemistry course.","description":"This organic chemistry course introduces you to the different types of bonds that can form between atoms and explains how to draw compounds using various models. It also unpacks the reasons behind the formation of these bonds. In addition, the course covers the key features of chemical bonding and describes how to predict the shapes and structures of molecules and the angles between atoms. So why wait? Enrol now!","courseOutcomes":["Explain the electronic structure of ...","Know how to write the Lewis model st...","Evaluate the formal charge of atoms ...","Distinguish the Lewis structure from...","Explain the electronic structure of atoms","Know how to write the Lewis model structure for atoms and molecules","Evaluate the formal charge of atoms and moleclules","Distinguish the Lewis structure from the condensed structure","Identify the bond angles for various shapes of molecules","Define quantum mechanics and the dual nature of light","Recognize different types of bonds","Define valence bond, the molecular orbital theory and the combined approach to the covalent bond","Describe the resonance contributing structures","Indicate curved arrows and push electrons in contributing structures","Identify the different types of functional groups","Distinguish between the differences in bond length and bond strength of alkanes, alkenes, and alkynes","Explain the electronic structure of ...","Know how to write the Lewis model st...","Evaluate the formal charge of atoms ...","Distinguish the Lewis structure from...","Explain the electronic structure of atoms","Know how to write the Lewis model structure for atoms and molecules","Evaluate the formal charge of atoms and moleclules","Distinguish the Lewis structure from the condensed structure","Identify the bond angles for various shapes of molecules","Define quantum mechanics and the dual nature of light","Recognize different types of bonds","Define valence bond, the molecular orbital theory and the combined approach to the covalent bond","Describe the resonance contributing structures","Indicate curved arrows and push electrons in contributing structures","Identify the different types of functional groups","Distinguish between the differences in bond length and bond strength of alkanes, alkenes, and alkynes"],"courseDescription":"<p>This organic chemistry course on covalent bonding and shapes of molecules starts by explaining the basic components of an atom and how to draw its electronic structure. It also describes the involvement of electrons in chemical reactions and bond formation, and shows how to represent them using the Lewis model.</p><p>It moves on to explain the formal charges of molecules and how to easily solve them. The material provides you with detailed information regarding the various types of bonds and how to decide which type of bond should form between atoms. You will also be introduced to the basic concepts of quantum mechanics and molecular orbital theory, and the different theories used to describe covalent bonds, and valence bonds. Go on to learn about the concept of resonance, how to use curved arrows to draw contributing resonance structures, and how to use molecular orbital theory to describe delocalized electrons.</p><p>Lastly, you study the different types of organic functional groups, and the relation between the bond lengths and bond strengths of alkanes, alkenes, and alkynes. This course is of great benefit to chemists and biochemists who are starting their journey or career in organic chemistry. Enroll now, and learn about the principles of bonding in organic chemistry and how organic compounds are formed.&nbsp;</p><a href=\"https://alison.com/resume/courses/4285\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4285\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Covalent Bond and Shapes of Molecules","description":"In this module you will learn about the principles of bond formation in organic chemistry, the electrons involved in bond formation, how to represent them, bond angles & shapes of molecules of organic compounds. The topics covered include: distribution of electrons in atomic orbitals, valence bond model, molecular orbital theory and hybridization.","topics":["The Covalent Bond and Shapes of Molecules - Learning Outcomes","Types of Bonds and Shape of Molecules","Hybridization and Quantum Mechanics","Curved Arrows and Functional Groups","Covalent Bonding and Shapes of Molecules - Course Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Organic Chemistry | Bonding and Shapes of Molecules - Course Assessment"]}]}