{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1791","title":"Outdoor Education - Adventure - Revised","totalEnrolled":"3,717","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you all about outdoor adventure activities and the best ways to market them like a pro.","description":"This course explores Outdoor Education and its potential as a recreational learning activity. We lay out examples of adventure activities and examine the factors that can affect your assessment of certain options. We then study the Media's influence on public perception of outdoor adventurous activities, grading, guidebooks, how to market adventure activity packages, types of equipment and contemporary improvements in technology.","courseOutcomes":["Define ‘adventure’ and its historic ...","Outline the logistic factors to cons...","Discuss what motivates people to tak...","...","Define ‘adventure’ and its historic themes","Outline the logistic factors to consider before attempting adventure, like safety, cost and group size","Discuss what motivates people to take part in such activities","Define ‘adventure’ and its historic ...","Outline the logistic factors to cons...","Discuss what motivates people to tak...","...","Define ‘adventure’ and its historic themes","Outline the logistic factors to consider before attempting adventure, like safety, cost and group size","Discuss what motivates people to take part in such activities"],"courseDescription":"<p>This course offers a comprehensive exploration of Outdoor Education and its appeal as a fun way to learn. We explain the meaning of ‘adventure’ through history as stories of great journeys like Captain Cook's voyages of discovery and Mawson's epic journey to the South Pole continue to inspire today’s thrill-seekers.</p><p>We then outline the factors that must be considered when planning a trip or adventure, including safety, cost, group size and other important logistic concerns. The course identifies factors that affect your assessment of certain types of adventures and tracks the media's impact on public perfection of available outdoor adventures. We also cover grading and guidebooks before delving into the marketing of adventure packages and the types of equipment offered by improved modern technology.</p><p>This course can benefit anyone who wants to use Outdoor Education to teach and entertain others. We can also help anyone who is interested in outdoor adventures, either as a hobby or in a professional capacity such as an outdoor adventure guide or a group leader. Sign up for this training course to learn more about this enchanting career option.</p><a href=\"https://alison.com/resume/courses/1791\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1791\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Adventure Activities","description":"In this module, you will learn about the meaning of adventure, key elements and characteristics of adventures. You will also learn about history and motivation behind adventures, exploration, experimentation, aspects of confidence, danger under control, competence in an adventure and how to determine the dangers and risks of embarking on an adventure course.","topics":["Adventure Activities - Learning Outcomes","The Meaning of Adventure","Characteristics of Adventures","Motivation for Adventures","Safety in Adventure","Different Types of Adventure","Grading And Guidebooks","Adventure Activities - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Outdoor Education - Adventure Final Assessment"]}]}