{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1792","title":"Outdoor Education - Outdoor Recreation and Land Management","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about outdoor recreation education, land management and conservation from this free online course.","description":"This free online course on Recreation and Outdoor Education teaches you about outdoor recreation and land management. Proper land management is a core aspect of ensuring a sustainable environment. This online course will teach you about land as a commodity, the World Conservation Strategy, and conservation management, as well as the different ways we treat our environment.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The way we view the environment has significant implications for how we interact with and treat our landscape. This free online course on Environmental Education will first discuss the different ways of viewing the environment, then we will learn about the indigenous people who don't see a separation between themselves and the land. Next, you will learn about the three different categories that most perceptions of land fit into as well as the concept of land as a commodity.</p><p>Conservation is the management of the biosphere so that it can yield the greatest sustainable benefit to present generations while maintaining its potential to meet the needs of future generations. This course will discuss world conservation, the importance of the environment, and the conflict between land development and conservation. It will also look into the Aboriginal peoples of Australia and their customs, traditions, way of life, and their connection to the land.</p><p>This Outdoor Education free online course examines the environmental impact of human activity and conservation, environmental management, and sustainable living in the context of aboriginal Australia. Upon the completion of this online course you will have gained a much stronger understanding of land management, of the main ways in which land is treated, and of outdoor recreation. Enroll in this online course today and improve your knowledge and skills on land conservation and outdoors recreation education.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}