{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4532","title":"Painting using One Stroke Technique","totalEnrolled":"4,117","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to create stunning paintings using this free online course’s easy-to-learn one stroke method.","description":"Are you looking for an effective technique for making beautiful paintings? Beginner and experienced painters rely on the one stroke painting technique as an efficient way to add shade, highlights, shadows and colour changes with literally one brushstroke. This course will help you start using this technique and guide you to complete three easy but aesthetically-pleasing painting projects using basic strokes and the required materials.","courseOutcomes":["Recall some materials needed for one...","Identify the basic strokes in one st...","Outline the process for painting flo...","Recall some tips for loading the dif...","Recall some materials needed for one stroke painting","Identify the basic strokes in one stroke painting","Outline the process for painting flowers","Recall some tips for loading the different brush types","Discuss the guidelines for caring for brushes while using acrylic paint","Summarize the process of adding stems and leaves to a flower composition","Describe the process of painting pine leaves","Discuss techniques for adding details to petal stroke flowers","Outline the process for detailing daisies","Explain the relationship between brush pressure and the quality of strokes","Recall some materials needed for one...","Identify the basic strokes in one st...","Outline the process for painting flo...","Recall some tips for loading the dif...","Recall some materials needed for one stroke painting","Identify the basic strokes in one stroke painting","Outline the process for painting flowers","Recall some tips for loading the different brush types","Discuss the guidelines for caring for brushes while using acrylic paint","Summarize the process of adding stems and leaves to a flower composition","Describe the process of painting pine leaves","Discuss techniques for adding details to petal stroke flowers","Outline the process for detailing daisies","Explain the relationship between brush pressure and the quality of strokes"],"courseDescription":"<p>While paintings can be hypnotically attractive, undertaking such a painting project might feel overwhelming. By learning the simple one stroke technique, you can create amazing painting projects using simple brushstrokes. This short course will teach you to create artworks that catch the eye using the one-stroke painting technique. It begins by introducing you to the materials needed for using this technique. Next, you will learn to use basic strokes like the teardrop, petal and daisy strokes while we examine the strategy for painting leaves.</p><p>Using the basic strokes you have learned so far, you will create beautiful flowers. A simple flower composition will be your first of three projects. On your path to completing this project, you will discover how to select colours. You will explore basic brush care, brush loading and the techniques for painting stems and leaves. You will create more complex paintings of flowers, starting with a composition consisting of pedal strokes, pine leaves and cherries for the following two projects.</p><p>On the path to completing your final project, you will learn to paint daisy-like flowers and mix multiple flower types to create a composition. You will also learn to detail the different flower types and add embellishments to make your painting appear ‘fuller’. One stroke painting is a valuable skill to have in the bag for new and experienced artists as it provides a simple yet effective way for creating beautiful paintings. Start now and learn how to add highlights, shade and shadows in under three hours using single brush strokes!</p><a href=\"https://alison.com/resume/courses/4532\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4532\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Strokes and Simple Flower Composition","description":"In this module, you will be introduced to the materials needed for one stroke painting. You will learn some of the basic strokes in one stroke painting such as the teardrop stroke, daisy stroke, and petal stroke. You will also learn to paint a basic floral composition using teardrop strokes.","topics":["Basic Strokes and Simple Flower Composition – Learning Outcomes","Introduction and Basic Strokes","Painting Flowers","Adding Blue Flowers, Stem and Leaves","Basic Strokes and Simple Flower Composition – Lesson Summary"]},{"name":"Module","details":"Advanced Flower Compositions","description":"In this module, you will learn to create two advanced paintings, using the one-stroke technique. You will learn to paint flower compositions consisting of multiple flower types and colors, more leaf and stem types, and high level of detail. On the path to completing these projects, you will learn to draw daisy flowers and pine leaves, and cherries.","topics":["Advanced Flower Compositions – Learning Outcomes","Painting a Flower Using Petal Strokes","Painting Daisy-like Flowers","Adding Teardrop Stroke Flowers and Leaves","Advanced Flower Compositions – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Painting with One Stroke Technique – Course Assessment"]}]}