{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1879","title":"Parental Separation - Implications for the School","totalEnrolled":"6,072","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the role and responsibilities of school principals and teachers following a parental separation.","description":"This free online parental separation course teaches you about the implications that parental separation has for a child's school staff, and will clarify the role, responsibilities of the child's school following parental separation. It will teach you about parental separation, the rights of parents, custody disputes and the courts, children in care, school communication, school collection requirements according to parental status, and more.","courseOutcomes":["Describe the implications for the sc...","Explain the difference between guard...","Describe the four main kinds of prot...","Describe school communication requir...","Describe the implications for the school following parental separation","Explain the difference between guardianship, custody and access","Describe the four main kinds of protection for children available through the courts","Describe school communication requirements depending on parental status","List the schools responsibilities for school collection arrangements","You will also be able to view a sample Custody & Separation Policy that you may wish to implement in your school and you can review a selection of relevant frequently asked questions in this area","Describe the implications for the sc...","Explain the difference between guard...","Describe the four main kinds of prot...","Describe school communication requir...","Describe the implications for the school following parental separation","Explain the difference between guardianship, custody and access","Describe the four main kinds of protection for children available through the courts","Describe school communication requirements depending on parental status","List the schools responsibilities for school collection arrangements","You will also be able to view a sample Custody & Separation Policy that you may wish to implement in your school and you can review a selection of relevant frequently asked questions in this area"],"courseDescription":"<p>This course begins by discussing guardianship. You will learn that guardianship is the legal relationship between a parent and his/her child. With this course, you will learn that the duty of the guardian is to properly care for the child and to make decisions about the child’s education, health, religious upbringing, and general welfare. You will also learn that a child needs a guardian until the age of 18 years.</p><p>You will then look into the parental status and school communication. This course will teach you how to communicate with the parents if they are married to each other and are living together; are married to each other and are living apart; are married to each other but are not living together and have a separation agreement; are married to each other, living apart, and might be in a new relationship(s); are not married and either live together or apart; and are not married and are in other relationships.</p><p>The diversity of family units and the increase in parental separation has resulted in increased demands being made on schools where their child or children are enrolled. Upon the completion of this course, you will gain a better understanding of the school's responsibilities for collection arrangements and communication requirements depending on the parental status, and more. Sign up for this course and learn how to cooperate and emotionally support both the parents and kids in the event of a separation.</p><a href=\"https://alison.com/resume/courses/1879\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1879\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Parental Separation - Implications for the School","description":"The diversity of family units and the increase in parental separation has resulted in increased demands being made on schools where their child or children are enrolled. In this module learn more about parental separation and its implications for the school.","topics":["Introduction And Learning Outcomes","Parental Separation And Rights Of Parents","Children In Childcare","Parental Status And School Communication","Frequently Asked Questions","Custody And Separation Policy - Sample Document"]},{"name":"Module","details":"Course assessment","description":"","topics":["Parental Separation - Implications for the School - Course Assessment"]}]}