{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4509","title":"Pedagogy Practices Surrounding Dyslexia","totalEnrolled":"2,341","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the pedagogical practices needed to help students cope with dyslexia in this free online course.","description":"Dyslexia is a learning disorder that involves difficulty reading due to problems identifying speech sounds and learning how they relate to letters and words. Understanding dyslexia can help educators best meet their students’ needs. We will help you understand the concept of pedagogy and its principles, including developing the best teaching method by combining pedagogical approaches that support and engage students with dyslexia.","courseOutcomes":["Define ‘pedagogy’...","Discuss the importance of pedagogy i...","Explain how the proper design of les...","Analyse and select appropriate teach...","Define ‘pedagogy’","Discuss the importance of pedagogy in education","Explain how the proper design of lessons can be used to create effective learners","Analyse and select appropriate teaching methods from studies in pedagogy","Summarise how teachers can improve their teaching methods using smart pedagogy","List and explain the types of dyslexia","Outline the symptoms of dyslexia","Recognise how to diagnose students with dyslexia","Describe how to select teaching methods that aim to help dyslexic students","Define ‘pedagogy’...","Discuss the importance of pedagogy i...","Explain how the proper design of les...","Analyse and select appropriate teach...","Define ‘pedagogy’","Discuss the importance of pedagogy in education","Explain how the proper design of lessons can be used to create effective learners","Analyse and select appropriate teaching methods from studies in pedagogy","Summarise how teachers can improve their teaching methods using smart pedagogy","List and explain the types of dyslexia","Outline the symptoms of dyslexia","Recognise how to diagnose students with dyslexia","Describe how to select teaching methods that aim to help dyslexic students"],"courseDescription":"<p>Are you a teacher? Do you find it difficult to get through to some students? We have designed this course to help you with teaching strategies and tips that will enable you to engage your students more in the classroom, especially those with dyslexia. The demand for high-quality education is rising as parents want to ensure that their children receive the best education. Teachers are becoming more responsible for selecting and using the best method to deliver educational content based on individual needs. There are several ways teachers can impart knowledge to their students and engage them in the learning process. Pedagogy is the study of teaching methods, education goals and how you might achieve them. This course will identify the different pedagogical approaches to learning and explain why they are essential for teachers. First, we introduce you to pedagogical principles and concepts. Explore how to design lessons and structure learning by breaking lessons down into episodes. We’ll show you how to inspire students to learn using various strategies and tactics and create a practical learning experience by using assessment practice in classroom routines.&nbsp;</p><p>Pedagogy has evolved to accommodate today's students' skills and learning styles. Technology and information and communications technology (ICT) have been the major factor in this evolution. The traditional classroom teaching pattern is no longer as effective as it once was. The teaching process has expanded to include new forms of imparting knowledge, such as interactive and collaborative projects and ICT to accommodate more flexible schedules. Studies have shown that ICT improves the learning and teaching process. This course explores the relationship between the instructors' use of ICT as a teaching medium and the development of a child's capability to learn. Discover how to use ICT to enhance learning, including creating effective conditions for learning. You will gain insights into smart pedagogy and the use of animations and virtual reality in classroom education.&nbsp;</p><p>The aim of an educator should be to deliver educational content in a way that is relevant to student needs. Students require excellent pedagogical approaches, especially those with special needs or who suffer from a specific disorder such as dyslexia. Dyslexia is a disorder that impacts an individual's literacy skills and it manifests as challenges when reading, writing and sometimes speaking. This course will teach you about dyslexia, its symptoms, forms and the various tests used for its diagnosis. Explore the types of dyslexia such as auditory dyslexia, visual dyslexia, phonological dyslexia and more. In addition, we explain how to identify students with dyslexia and how to diagnose this disorder. We analyse the other forms of this disorder and their symptoms, such as dyspraxia, dysgraphia and dyscalculia. Those with dyslexia may feel frustrated or embarrassed and it is vital to give them the support they require. This course covers the teaching techniques that would be helpful for both teachers and parents to support their children with or without any disorder. So why wait? Enrol now.</p><a href=\"https://alison.com/resume/courses/4509\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4509\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pedagogy and Dyslexia","description":"In this module, you will be introduced to pedagogy, its principles and its importance to classroom teaching. Learners will gain insights into the uses, different aspects and importance of smart pedagogy. This module also covers dyslexia, it's symptoms, forms as well as the various tests used for its diagnoses.","topics":["Pedagogy and Dyslexia - Learning Outcomes","Introduction to Pedagogy","Introduction to Dyslexia","Managing Dyslexia in School","Pedagogy and Dyslexia - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment -  Pedagogy and Dyslexia Awareness"]}]}