{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3577","title":"Photoshop CC For The Web","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore how to create and optimize images for any web project using Photoshop CC fundamentals in this free online course","description":"Are you in graphic design, web development or photography? If you are, or in any related field, learn advanced Adobe Photoshop CC productivity techniques as a powerful tool in this free online course. Discover the fundamental design and optimization skills you need to create beautiful, fit-for-purpose web images along with the principles of colour schemes, image formats and other handy tips and tricks to get the most out of Photoshop CC.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Photoshop CC is a must-have if you are doing any kind of online design or development. This popular, reliable and fast tool is very versatile because of the vast number of tools, options and functionalities. All of it can sometimes be overwhelming, even to a seasoned Photoshop professional and this easy-to-understand course discusses some common and not-so-common techniques that you can use in your web projects to create original web elements and process your graphic images quickly and efficiently.&nbsp;</p><p>You will be taught some fantastic Photoshop CC features through engaging and practical video lectures where you will start by learning about the different kinds of images, colour spaces, and file formats. The process of setting up your images for the web, using the Image Size dialogue box is then covered along with some essential techniques to resize images for web and the role resolution plays. In the second part of the course, you will explore image optimization using the Save for the Web dialogue box which includes topics such as retina graphics, automation, creating droplets, batch processing, and image processing. The next piece of content takes a close look at some web styling techniques for buttons, headers, navigation menus, and generating assets.</p><p>The power of Photoshop CC is widely known which explains it’s increasing popularity. Learning to get the most out of this software can be a game-changing competitive advantage for your career in graphic design, image editing or web development and all it takes is just a couple of clicks to enrol and a few very short hours taking this free online Photoshop course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}