{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2672","title":"Physics: Motion and Gravity","totalEnrolled":"3,273","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the main principles and concepts of motion and gravity in this free online physics course.","description":"Alison's free online certificate physics course will give you a solid grounding in the principles and concepts of motion and gravity. You will cover a range of topics, from Newton's Third Law to momentum and impulse and from gravitational force to the wave-like nature of light. This course will be fascinating for anyone who wants to build towards a career in science or who wants to know more about the world around us. So start learning today!","courseOutcomes":["Discuss motion and forces, Newton's ...","Explain the concept of gravity, incl...","Describe energy transfer in space, t...","Describe the working principles of k...","Discuss motion and forces, Newton's law and its applications, friction, air resistance, and collision","Explain the concept of gravity, including calculating weight and acceleration","Describe energy transfer in space, torque, static equilibrium, and Hooke's laws and its limitations","Describe the working principles of kinetic and gravitational potential energy as well as the conservation of energy","Identify the principle behind circular and elliptical orbits in motion","Explain the wave nature of light as well as the emission and absorption spectra","Discuss motion and forces, Newton's ...","Explain the concept of gravity, incl...","Describe energy transfer in space, t...","Describe the working principles of k...","Discuss motion and forces, Newton's law and its applications, friction, air resistance, and collision","Explain the concept of gravity, including calculating weight and acceleration","Describe energy transfer in space, torque, static equilibrium, and Hooke's laws and its limitations","Describe the working principles of kinetic and gravitational potential energy as well as the conservation of energy","Identify the principle behind circular and elliptical orbits in motion","Explain the wave nature of light as well as the emission and absorption spectra"],"courseDescription":"<p>This free online physics course starts off looking at motion. You will study normal reaction and Newton’s Third Law of Motion as well as looking at friction and air resistance. You will then move on to study constant and vertical circular motion and explore calculations with projectile motion. The course then moves on to look at momentum and impulse, as well as elastic potential energy.</p><p>The course then gives an introduction to gravity, discussing weightlessness and how to calculate apparent weight. You will also look into gravitational force and acceleration due to gravity before moving on to look at structures and materials. Here you will study compressive and tensile forces and look at rules for analysing structures as well as Young’s Modulus. Finally, you will move on to explore the wave-like nature of light as well as emission and absorption spectra.&nbsp;</p><p>Proficiency in science is a skill that opens up exciting and high-paying jobs and careers around the world. All of this starts with an understanding of the basics and this physics certificate puts you on the path to learning and opens up a wide world of further study and work. By the end of the course, you will have increased your knowledge set, learned something really interesting, and possibly kickstarted a great career.</p><a href=\"https://alison.com/resume/courses/2672\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2672\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Motion and Gravity","description":"In this module, you will be introduced to motion, electric fields, spectra, energy transfers, force, acceleration, gravity Newton laws, projectiles, and light. Also, this module can serve as an additional resource material in regular classes, study and revision aid, and resource for someone with an interest in basic science.","topics":["Motion and Gravity - Learning Outcomes","Motion Normal Reaction","Motion Constant and Vertical Circular Motion","Motion Momentum and Impulse","Introduction to Gravity","Structures and Materials","The Wave-Like Nature of Light","Emission and Absorption Spectra","Motion and Gravity - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Physics: Motion and Gravity Course Assessment"]}]}