{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1793","title":"Physical Education - Coaching Styles and Techniques","totalEnrolled":"23,987","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the different types of coaching styles and coaching techniques from this free online course.","description":"This free online course on Physical Education teaches you about the different coaching styles and coaching techniques. Coaching helps people achieve their personal best and produce the results they are looking for. In this online course, you will learn about how to improve team performance, the role of a coach as well as study the elements that make up a professional coaching routine.","courseOutcomes":["Describe the effectiveness of a coac...","Illustrate effective coaching styles...","Explain legal ergogenic aids such as...","Explain illegal ergogenic aids such ...","Describe the effectiveness of a coach in improving team perfomance and the elements that need to be considered to be a good coach","Illustrate effective coaching styles and techniques","Explain legal ergogenic aids such as nutrition, creatine, sodium bicarbonate, colostrum, re-hydration and many more important factors that need to be considered in physical activity","Explain illegal ergogenic aids such as amphetamines, ephedrine, beta-blockers, caffeine, anabolic steroids and many others","Describe sports psychology, limits to performance, sporting injuries, and how physical activity affects different social groups as children, teenagers, adults and the elderly","Describe the effectiveness of a coac...","Illustrate effective coaching styles...","Explain legal ergogenic aids such as...","Explain illegal ergogenic aids such ...","Describe the effectiveness of a coach in improving team perfomance and the elements that need to be considered to be a good coach","Illustrate effective coaching styles and techniques","Explain legal ergogenic aids such as nutrition, creatine, sodium bicarbonate, colostrum, re-hydration and many more important factors that need to be considered in physical activity","Explain illegal ergogenic aids such as amphetamines, ephedrine, beta-blockers, caffeine, anabolic steroids and many others","Describe sports psychology, limits to performance, sporting injuries, and how physical activity affects different social groups as children, teenagers, adults and the elderly"],"courseDescription":"<p>A coach is someone who helps people improve in the way they wish to improve and go in the direction they want to go. This free online course on Coaching Techniques and Styles will first discuss the role of a coach in improving performance as well as the fundamental attributes and skills of a good coach. You will then learn about the different coaching styles and coaching techniques, legal and illegal ergogenic aids, and about the importance of feedback.</p><p>Some people say that performance is 90% mental conditioning and 10% physical conditioning. This online course on Coaching Style and Techniques also covers sports psychology, where you will learn how it can influence athletes. Next, you will be learning about different injuries in sports, the intrinsic and extrinsic influences on fitness, and the socio-cultural considerations when participating in physical activity. You will also be learning about the role physical activity plays in the lives of different groups within society.</p><p>Upon completion of this online course, you will understand the different motivational factors in physical fitness exercises such as health benefits, the discharge of built up emotions, status symbols or social outlets, relaxation, improving personal appearance, or simply as a challenge. You will also learn how participation in physical activity can be promoted using role models and sponsorship. Check out this online course today and start learning about effective coaching methods, styles and techniques.</p><a href=\"https://alison.com/resume/courses/1793\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1793\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Coaching And Fitness","description":"In this module, you will learn about the core components of fitness like muscle strength, muscle power, flexibility, agility, speed, balance, coordination and reaction time, the role of the coach, coaching styles, and coaching techniques.","topics":["Coaching and Fitness - Learning Outcomes","The Core Components Of Fitness","The Role Of The Coach","Coaching Styles","Coaching Techniques","Coaching and Fitness - Lesson Summary"]},{"name":"Module","details":"Improving Physical Fitness","description":"In this module, you will learn about ways of improving physical fitness and ergogenic aids, illegal ergogenic aids, sports psychology, anatomical and physiological differences affecting performance, limitations to performance, sporting injuries and prevention.","topics":["Improving Physical Fitness - Learning Outcomes","Legal Ergogenic Aids","Illlegal Ergogenic Aids","Sports Psychology","Sporting Injuries","Improving Physical Fitness - Lesson Summary"]},{"name":"Module","details":"Physical Activity And Society","description":"In this module, you will learn about recreation and physical activity for different groups within society, and promoting involvement in physical activity and the positive and negative influential factors of promoting involvement in physical activity.","topics":["Physical Activity and Society - Learning Outcomes","Different Groups Within Society","Intrinsic/Extrinsic Influences On Fitness","Socio-Cultural Considerations","Motivational Factors and Participation Rates","Fact Or Fiction Activity","Physical Activity And Society - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Physical Education - Coaching Styles and Techniques - Final Assessment"]}]}