{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1794","title":"Physical Education - Fitness Training Principles and Methods","totalEnrolled":"16,600","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about sports science, effective methods and the principles of training programs in this free online course.","description":"This free online Physical Education program course focuses on fitness training methods and principles. You will learn about the area of sports science, effective training principles and techniques as well as basic muscle physiology, the different groups of muscles and how the heart functions. You will also learn about the energy system of the body and how food is converted to energy.","courseOutcomes":["Describe muscle architecture and mus...","Explain the benefits of involvement ...","Relate heart rate to ATP-PC, and lac...","Explain about food conversion for en...","Describe muscle architecture and muscle groups such as the motor unit, muscular force, muscle fibres, and joint actions","Explain the benefits of involvement in fitness activities","Relate heart rate to ATP-PC, and lactic acid to aerobic energy systems","Explain about food conversion for energy","Describe the four training principles: overload, specificity, reversibility and individual differences","Illustrate the importance of maximum volume of oxygen consumed by the body, acute responses, fatigue, recovery and glycogen restoration","Describe muscle architecture and mus...","Explain the benefits of involvement ...","Relate heart rate to ATP-PC, and lac...","Explain about food conversion for en...","Describe muscle architecture and muscle groups such as the motor unit, muscular force, muscle fibres, and joint actions","Explain the benefits of involvement in fitness activities","Relate heart rate to ATP-PC, and lactic acid to aerobic energy systems","Explain about food conversion for energy","Describe the four training principles: overload, specificity, reversibility and individual differences","Illustrate the importance of maximum volume of oxygen consumed by the body, acute responses, fatigue, recovery and glycogen restoration"],"courseDescription":"<p>This free online course on Physical Education begins by helping you to identify basic muscle physiology and its interior components. You will study the motor unit, the regulation of muscular force, and the firing pattern of muscles in the body. Then, you will learn about the major groups of muscles, their microscopic structure, the different fibre types and their distinctive features as well as the various types of muscle contractions.</p><p>Furthermore, in this free online course you will learn how the human body converts food into energy. Next, you will study the energy systems as well as their characteristics and fitness components. Training is a cyclical process of tearing down and building up and even the most untrained body has a built-in reserve capacity to handle a substantial degree of stress. You will also be learning about exercise science, principles of training, overload, specificity, reversibility, and individual differences.</p><p>Finally, in this Methods and Principles of Fitness Training free online course, you will learn that when designing a fitness exercise program, it is important that the methods are relevant and focused on the important fitness component and that the exercises within the training method are specific to the sport. Enroll in this online course today and start learning about sports science and the importance of different training techniques!</p><a href=\"https://alison.com/resume/courses/1794\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1794\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Physiology For Physical Education","description":"In this module, you will learn about basic muscle physiology, muscle architecture, interior components, motor unit, regulation for muscular force, firing pattern, muscle fibre types, types of muscle contractions, sliding filament theory, the heart, energy systems, and conversion of food to energy.","topics":["Basic Physiology For Physical Education - Learning Outcomes","Basic Muscle Physiology","Muscle Groups","Information On The Heart","Energy Systems","Converting Food To Energy","Basic Physiology For Physical Education - Lesson Summary"]},{"name":"Module","details":"Training Methods","description":"In this module, you will learn about the principles of training, overload principles, the principle of specificity, reversibility principle, the principle of individual differences, training principles, training methods, benefits of training intervals, oxygen consumption, factors changed by exercise, fatigue and recovery.","topics":["Training Methods - Learning Outcomes","The Principles Of Training","Training Principles","Training Methods","Maximal Oxygen Uptake","Acute Responses","Chronic Training Responses","Fatigue And Recovery","Training Methods - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Physical Education - Fitness Training Principles and Methods Final Assessment"]}]}