{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3067","title":"Diploma in Poems, Plays and Stories From Around the World","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Come with us as we cross time and space to explore famous literary works in this free online world literature course.","description":"This free online world literature course introduces you to diverse genres: poetry, dramas, short stories, novels and essays. We examine literary traditions from different times and places, including works originally written in English and translations. This course covers both canonical and obscure writings to provide you with a wide perspective on the scope and development of world literature as such stories resonate across the years and miles.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course examines how civilizations and cultures from around the world have defined themselves through literature. The term ‘World Literature’ is a translation of the German word ‘Weltliteratur’, which was coined by Johann Wolfgang Goethe, and describes writing that crosses borders. Since antiquity, nations have established their identity by drawing on myths, religions and histories. These narratives have been passed through generations by various storytelling media and some travelled across nations. This course introduces you to 'The Epic of Gilgamesh', which is considered the first true work of world literature and circulated widely as early as in 1000 BC and has since been translated into several languages. We demonstrate how to understand world literature in its historical context and unpack the relationship between antiquity and modernity.</p><p>The course explains the relevance of the ‘openness’ of Western canon with the narrative poem 'Beowulf', the longest epic poem in Old English. We provide insight into 'The Lusiads', a Portuguese epic poem written by Luís Vaz de Camões and first published in 1572. Then follows Wislawa Szymborska's poem 'Tortures' and the sonnets of William Shakespeare and Pablo Neruda. We go through the four main challenges associated with world literature in the context of different modes of translation as well as some postmodern narrative elements. We investigate postmodernism’s instability of meaning and resistance to narrative closure as we study its fragmentation and hypertextual references across the globe. The course then covers the distinctive narrative technique used by Jorge Louis Borges, an Argentine poet, essayist and author of short stories. We focus on 'The Garden of Forking Paths', which was his first short story to be translated into English. We then travel further in time and space to trace literary accomplishments in Africa, Asia and beyond as you encounter changing views of women and marriage, African traditions and ‘partition literature’ through the short stories 'The Yellow Wallpaper', 'Oroonoko' and 'Toba Tek Singh'.</p><p>In the later part of the course, we scrutinize the theme of ‘Othello’, one of Shakespeare’s greatest tragedies. Shakespeare transformed classical notions of theatre and used existing narratives as plots for many of his plays. We then study Norwegian playwright Henrik Ibsen’s 'A Doll's House', to appreciate why he is widely considered the ‘Father of Realism’. Finally, we examine the contributions of Aristotle and Longinus to literary criticism by unpacking their seminal texts 'The Poetics' and 'On the Sublime'. Learning about the early history of world literature can help you to understand how works of art are transformed by cultural and social ‘transmissions’. This course explains how to critically analyze text, a skill that transcends the classroom, and suits anyone pursuing a career in academe, media and communication. Beyond its academic and practical benefits, this course offers you a sense of beauty that spans the globe and millennia and lets you follow the threads that connect people and nations.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}