{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3237","title":"Poetry in the Romantic Period","totalEnrolled":"753","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online poetry course takes you on a journey through the lyrical and passionate poetry of the Romantics.","description":"The Romantic era is defined by its celebration of emotion, imagination and sensuality. Writers like William Wordsworth and Samuel Coleridge made this a movement of free thinking, expression and creativity. You will discover the key elements that made the poetry of this period so evocative and vivid as we explore the forms and devices employed by various artists through a close reading of their work.","courseOutcomes":["Discuss the context of the early 19t...","Explain the tenets of the Romantic m...","Appreciate the contrasts between thi...","Describe Romantic poetic forms and f...","Discuss the context of the early 19th century in Europe","Explain the tenets of the Romantic movement","Appreciate the contrasts between this and other artistic trends","Describe Romantic poetic forms and functions","Expand on the influence of Wordsworth, Coleridge, Keats and Shelley","Understand the elements and devices that define Romantic poetry","Discuss the context of the early 19t...","Explain the tenets of the Romantic m...","Appreciate the contrasts between thi...","Describe Romantic poetic forms and f...","Discuss the context of the early 19th century in Europe","Explain the tenets of the Romantic movement","Appreciate the contrasts between this and other artistic trends","Describe Romantic poetic forms and functions","Expand on the influence of Wordsworth, Coleridge, Keats and Shelley","Understand the elements and devices that define Romantic poetry"],"courseDescription":"<p>Many Romantic poets welcomed freedom and rejected ideas of class and nobility. They embraced nature and delved into the subconscious, often through reference to the supernatural. Through close analysis of various lyrical ballads, we examine both theory and practice to see how these writers unpacked thoughts and dreams. The Romantics prized subjectivity as they wrote fiery verse to protest neoclassical poetic objectivity, which they saw as cold and inhibited.</p><p>Once we have established the literary and historical context of the Romantics, we plunge into the life and works of Wordsworth. This entails an in-depth look at his poem ‘The Prelude’ as we unpack its elements and relate them to overarching Romantic concerns. This brings us to Coleridge and his masterpiece ‘Kubla Khan’. Also called ‘A Vision in a Dream: a Fragment’, this epic work was born while Coleridge was sleeping and captures the sense of the ethereal through its use of hazy metaphor and language.</p><p>You will also meet John Keats and Percy Shelley as we explore their world through their poems as they demonstrated Romantic ideals in their adventures and writing. This course lets you appreciate the era’s artistic legacy and enhances your ability to analyse and unpack hidden meanings, in poetry and beyond.</p><a href=\"https://alison.com/resume/courses/3237\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3237\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Poetry in the Romantic Period","description":"In this module, Poetry in the Romantic Period, you will learn about the forms poetry took on during this era. You will also learn about the important and influential poets of this time.","topics":["Poetry in the Romantic Period - Learning Outcomes","Introduction to Romantic Poetry","William Wordsworth","Other Romantic Poets","Poetry in the Romantic Period - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Poetry in the Romantic Period - Course Assessment"]}]}