{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3384","title":"Polynomials and Factorization for General Studies","totalEnrolled":"457","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches polynomial concepts, factorisation methods and rational expressions.","description":"Delve into the world of Mathematics by taking this introductory course on polynomials and factorisation, exploring the basic concepts of working with polynomials and factoring methods in algebra. It is important to understand how to simplify and manipulate polynomials when dealing with numbers. Factorisation helps in performing arithmetic operations. Study problem-solving applications of factoring and how to simplify rational expressions.","courseOutcomes":["Identify the characteristics of a po...","Explain how to divide monomials and ...","Analyse operations with rational exp...","Identify how to solve fractional equ...","Identify the characteristics of a polynomial","Explain how to divide monomials and polynomials","Analyse operations with rational expressions","Identify how to solve fractional equations","Explain the different types of polynomials","Analyse factoring the difference of two perfect squares","Explain the sum and difference of two perfect cubes","Describe how to multiply monomials and polynomials","Identify how to solve equations by factoring","Explain how simplify rational expressions","List some of the problem-solving applications of factoring","Identify the characteristics of a po...","Explain how to divide monomials and ...","Analyse operations with rational exp...","Identify how to solve fractional equ...","Identify the characteristics of a polynomial","Explain how to divide monomials and polynomials","Analyse operations with rational expressions","Identify how to solve fractional equations","Explain the different types of polynomials","Analyse factoring the difference of two perfect squares","Explain the sum and difference of two perfect cubes","Describe how to multiply monomials and polynomials","Identify how to solve equations by factoring","Explain how simplify rational expressions","List some of the problem-solving applications of factoring"],"courseDescription":"<p>This course is the third in a series of algebra Mathematics courses and has been specially prepared to take you through the fundamentals of working with polynomials and factorisation. Learning about the applications of polynomials and factoring can be challenging because it is such a vast topic. However, we have designed this course to make the learning process easier. What are polynomials and how do you add and subtract them? What are operations with rational expressions? In this course, each section will help you understand polynomials and factoring with the aid of examples. You form a polynomial by combining two or more monomials using the operations of addition and/or subtraction. Each monomial making up the polynomial is known as a ‘term’. You will learn about the different polynomials, the terms and various definitions.</p><p>We then prepare you further by taking you step by step through mathematical operators with polynomials. You can add and subtract polynomials using the associative, commutative and distributive properties. The ‘like’ terms (monomials) can be combined using the indicated operation. We then discuss the multiplication and division of polynomials. To do this, you must learn about their properties and how they can be applied. We illustrate how synthetic division works. Synthetic division is a quick condensed way of performing long division when a polynomial with a degree greater than or equal to 1 is divided by a binomial in the form of (x-c). The synthetic division also indicates if the binomial is a factor of the polynomial or not. We demonstrate the differences between using long division and synthetic division. We explore how to solve fractional equations by finding the lowest common denominator (LCD) for all the terms and multiplying both sides of the equation by the LCD.</p><p>This course moves on to factoring in algebra. To ‘factor’ a polynomial means that you express it as the product of other polynomials. Like in arithmetic, it can be useful to represent a polynomial in factored form. One way to do this is by finding the greatest common factor of all the terms. You will discover how to find the greatest common factor of a polynomial or monomial. We investigate other factoring methods like factoring the difference of two perfect squares, factoring the trinomials, factoring by grouping terms and factoring completely. The fundamental tools for solving equations are addition, subtraction, multiplication and division. These methods work well for equations like x + 2 = 10 - 2x and 2(x - 4) = 0. But what about equations where the variable carries an exponent, like x2 + 3x = 8x - 6? This is where solving equations with factoring comes in. So register for this course and learn to solve equations by factoring and the problem-solving application of factoring.</p><a href=\"https://alison.com/resume/courses/3384\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3384\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Polynomials","description":"In this module, you will be introduced to Polynomials in algebra, the various definitions, vocabulary, and concepts. The module analyzes the different mathematical operators and how they are expressed with polynomials and monomials.","topics":["Introduction to Polynomials - Learning Outcomes","Definitions and Vocabulary","Multiplication of Polynomial","Division of Polynomial","Introduction to Polynomials - Lesson Summary","Introduction to Polynomials - Assessment"]},{"name":"Module","details":"Introduction to Factorization","description":"In this module, you will be introduced to how to factor various types of polynomials in algebra. This module analyzes the different factoring techniques that can be applied in solving equations and inequalities. You will also learn about the problem-solving applications of factoring.","topics":["Introduction to Factorization - Learning Outcomes","Factoring Methods","Perfect Square Trinomials","Grouping Polynomials","Rational Expressions","Introduction to Factorization - Lesson Summary","Introduction to Factorization - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Polynomials and Factorization for General Studies - Course Assessment"]}]}