{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3066","title":"Postmodern Cinema and Westerns","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online cinema course analyzes genre through an exploration of postmodern film, gangster movies and westerns.","description":"This free online cinema course breaks down the idea of genre through an analysis of postmodernism in films. We delve into genre blending and bending by citing the views of prominent film theoreticians. We ground our examination of postmodernism in a study of American classics, including gangster movies and westerns. This course helps any film buff understand the role of genre in telling stories on the silver screen.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Postmodernism is a complex classification of works that attempt to subvert and resist the ideas of Modernism across many fields, including music, architecture, fine arts and cinema. The mid-twentieth century emergence of postmodernism was prompted by changes in global media culture. This course introduces you to the concept of genre and its dynamic effect on storytelling. We examine the popular gangster film genre with scenes from ‘Once Upon a Time in America’, ‘The Godfather’ and the spy thriller ‘The Bourne Identity’. Prohibition and the Great Depression during the Roaring Twenties brought the underworld into prominence in Hollywood cinema. This period saw the rise of the gangster hero as a symbol of a revolutionary force who subverted authority and popular morality and ultimately redefined popular culture. We explain how filmmakers experimented with genre bending and blending. For example, the film ‘Brazil’ blends elements of romance, science fiction, war and satire.</p><p>The period of New Hollywood between the sixties and eighties sought the ‘enemy’ within American society but postmodern cinema challenged this perspective and questioned the idea of ‘enemies’ itself. This course studies the views of film theoreticians like Linda Hutcheon, Fredric Jameson and Ihab Hassan to make clear the theories that define postmodern cinema. Postmodernist artists would not only invent new perspectives and new modes of expression but would also operate as ‘bricoleurs’ by recycling previous works and styles. Postmodernism offers dialogic and heteroglossic perspectives and often takes the form of self-conscious, self-contradictory and self-undermining statements. We go through the key features of the movement with illustrations from films like ‘Dead Ringer’, ‘No Country for Old Men’, ‘Babel’, ‘Crash’, ‘Pulp Fiction’, ‘Blade Runner’ and ‘Run Lola Run’. We then conduct case studies of ‘Face/Off’ and ‘Natural Born Killers’ to demonstrate how film directors have used the features of postmodernism to experiment with fractured narratives and non-linear editing. The course delves into the quirky complexity of self-conscious cinema.&nbsp;</p><p>Apart from gangster movies, westerns are the oldest film genre and evoke America's fascination with the frontier as they explore the theme of regeneration through violence. We study the myths of the American western with discussions of the genre’s key directors: John Ford, Howard Hawks and Sam Peckinpah. Cinema lovers and students of film studies can benefit from this course’s analysis of genre. We can also help journalists and bloggers to appreciate the history and evolution of postmodern cinema and its role in popular culture.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}