{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3446","title":"Precalculus: Polynomial Functions and Rational Inequalities","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online course that shows you how to solve a polynomial equation and use factoring and number line analysis tools.","description":"This course will teach you how to solve a polynomial equation or to find its zeros, as well explain the definition of a polynomial function. You will learn how to determine the degree together with the specific names that can be used for classifying a variety of polynomial functions. If you want to develop your skills in precalculus polynomial and rational inequalities analytical concepts, then this advanced math course is for you.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This precalculus course provides you with in-depth examples on how to solve a polynomial equation or to find its zeros and helps you understand what a polynomial function is. Before writing its terms in descending order, it is important to understand the other kinds of text that can be used for formatting and the different usable list items. The course takes you through how to determine the degree together with the specific names that can be used for classifying a variety of polynomial functions. It introduces you to the steps involved in identifying the domain and range of a polynomial function.&nbsp;</p><p>If you want to learn the factor theorem that can be used to identify the degree of a polynomial and determine the number of roots, then sign up. You will work through the process of investigating the four possible end behaviours of a polynomial function as the independent variable approaches positive or negative infinity. Also, this course will help you understand the steps needed to graph a polynomial function, identify the degree, determine the maximum number of turning points, and find the intercepts. Do you know that multiplicity of a root can be used to determine the equation of a polynomial function? The material also describes conjugate root theorems, as well as how to find the domain with the range of various rational functions. It explains the x- and y-intercepts of a graph of a polynomial function and the higher degree polynomial functions. Moreover, it will clarify your understanding of the y-intercept of the fourth-degree polynomial function.</p><p>You will also learn how factoring and number line analysis can be useful to solve polynomial inequalities. This course will take you through how to solve the polynomial inequalities algebraically and graphically. You will also learn the methods that can be used to find vertical asymptotes for rational functions. Do you know there are methods that can be used to find horizontal and oblique or slant asymptotes for rational functions? The material will help you get a better understanding of the six-step process, SEPIA (simulation-based evaluation of prIoritization algorithms) , used for graphing rational functions and other types of functions. This course will explain in detail how the condensed method can be used for dividing a polynomial of degree greater than 1 by a binomial factor. This free online course will be of great interest to advanced math students and anyone studying precalculus in preparation for doing calculus. Register for free and start your next learning journey today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}