{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5166","title":"Preschool Education: The Reggio Emilia Approach","totalEnrolled":"3,240","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online pedagogy course covers the basics of the student-centred Reggio Emilia approach to preschool education.","description":"This course explores the Reggio Emilia approach to preschool education and its brief history. We explain how this approach defines the roles of children and teachers and study the environmental factors that play an influential role in childhood development. We also establish the importance of creativity and pedagogic documentation in this teaching model. Sign up to learn how to nurture the social and creative development of preschoolers.","courseOutcomes":["Explain the importance and purpose o...","Discuss the difference between the c...","Outline key aspects of the Reggio Em...","Summarise how the Reggio Emilia appr...","Explain the importance and purpose of preschool education","Discuss the difference between the constructivist model and other contemporary educational approaches","Outline key aspects of the Reggio Emilia approach","Summarise how the Reggio Emilia approach defines children’s and teachers' responsibilities","Describe the role of the environment in all aspects of preschool learning and teaching","Explain the importance of pedagogical documentation in encouraging reflective thinking in children","Summarise how the Reggio Emilia approach prioritises creativity in early childhood education","Compare the Montessori, Waldorf and Reggio Emilia teaching models","Explain the importance and purpose o...","Discuss the difference between the c...","Outline key aspects of the Reggio Em...","Summarise how the Reggio Emilia appr...","Explain the importance and purpose of preschool education","Discuss the difference between the constructivist model and other contemporary educational approaches","Outline key aspects of the Reggio Emilia approach","Summarise how the Reggio Emilia approach defines children’s and teachers' responsibilities","Describe the role of the environment in all aspects of preschool learning and teaching","Explain the importance of pedagogical documentation in encouraging reflective thinking in children","Summarise how the Reggio Emilia approach prioritises creativity in early childhood education","Compare the Montessori, Waldorf and Reggio Emilia teaching models"],"courseDescription":"<p>This teacher training course provides a brief overview of the Reggio Emilia approach to preschool education. We discuss the factors that have a positive effect on young children's development and explain how early childhood education contributes to their success. We then examine the key factors that define this teaching model in detail. The course explains the characteristics of the contemporary educational doctrine known as ‘constructivism’, which argues that children play an active role in their own education instead of passively absorbing it.</p><p>The course then explains how to understand the facial language of children, which can convey several different and profound meanings. We examine the role of the preschool environment and discuss how to integrate it into the Reggio Emilia educational philosophy. We then define ‘pedagogical documentation’ and outline why keeping comprehensive records of classroom interactions is important. This includes its role in cultivating reflective thinking in children.</p><p>The Reggio Emilia approach emphasises the critical notion of creativity and its role in preschool education. We discuss how creativity develops in early childhood and examine its defining characteristics before comparing the Montessori, Waldorf and Reggio Emilia teaching models and weighing their respective advantages and disadvantages. This course is ideal for parents, preschool teachers or child psychologists who want to develop their knowledge about this innovative approach to preschool education. The Reggio Emilia model has only been around since World War Two but it has already changed the way we understand childhood development and the role of preschool in guiding it.</p><a href=\"https://alison.com/resume/courses/5166\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5166\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Reggio Emilia Approach","description":"In this module, we will explore Reggio Emilia's approach to preschool education as well as the factors that contribute to its success. We will next examine the role of the teachers and environment in all aspects of preschool learning as defined by the Reggio Emilia approach. In addition, we will also discuss creativity and reflective thinking.","topics":["Fundamentals of Reggio Emilia Approach - Learning Outcomes","Intro to Reggio Emilia Approach","The Importance of Preschool Education","Reggio Emilia Approach","Child in Reggio Emilia Approach","The Environment in Reggio Emilia Approach","Pedagogic Documentation","Reflective Thinking and Pedagogic Documentation","Creative Thinking","Comparison with Montessori and Waldorf","Fundamentals of Reggio Emilia Approach - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}