{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3486","title":"Quadrilaterals and Similarity of Triangles for General Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free math course describes the properties of quadrilaterals, similarity of triangles and Thales’s theorem.","description":"This geometry course introduces you to the different quadrilaterals, their properties, and the similarities between the triangles. A quadrilateral, in general, has sides of different lengths and angles of different measures. By the end of this general maths course, you will be able to identify the similarity of triangles, and how to determine the differences between two figures.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course is the second in a series of geometry topics in mathematics for general studies. It begins by introducing you to quadrilaterals. A quadrilateral, in general, has sides of different lengths and angles of different measures. However, squares, rectangles, etc. are special types of quadrilaterals with some of their sides and angles being equal. This is the reason that the area of the quadrilateral depends on the type of quadrilateral it is. This course outlines the different types of quadrilaterals, their properties, and similarities with the aid of examples. The formal definitions of these quadrilaterals only give some information about them. Each quadrilateral has other properties that can be proved. For example, while a parallelogram is defined as a quadrilateral with two pairs of parallel sides, it can be proved that the opposite sides of a parallelogram must be congruent. You will learn about how to prove which type of quadrilateral a shape is.</p><p>Next, the course introduces you to similarities in Euclidean geometry. Two objects are similar if they have the same shape, or one has the same shape as the mirror image of the other. You will learn about the characteristics of similarity, and how to determine whether two figures are similar or not. This will help you in proving geometric theorems and solve some problems with polygons and triangles. Ratio and proportion will be explained based on fractions. When a fraction is represented in the form of a:b, then it is a ratio, a and b are any two integers. The ratio and proportion are the two important concepts, and it is and it is an important foundation needed to understand various concepts in math and science. By the end of this course, you will have a clear vision of these two concepts and be able to apply that knowledge in your daily life.</p><p>Lastly, the course introduces you to Thales’s theorem, attributed to Thales, a Greek mathematician and philosopher. Thales initiated and formulated the theoretical study of geometry to make astronomy a more exact science. You will learn about Thales’s theorem and its converse. Then, the course analyzes the triangle midsegment theorem and midpoint theorem. A midsegment of a triangle is a segment that connects the midpoints of two sides of a triangle. There are several proportions that can be found when a perpendicular line is drawn. You will learn about these proportions and the Pythagorean theorem. Then, you will be introduced to special right-angle triangles in geometry. A special right triangle is a right triangle with some regular feature that makes calculations on the triangle easier. Knowledge of the relationships between angles and ratios allows one to quickly calculate various geometric problems without resorting to more advanced methods. If you want to improve your overall geometry skills, register for this course now and start learning more today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}