{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3283","title":"Rational Horizons and Positioning in Celestial Navigation","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains rational horizons and the steps for calculating position lines in celestial navigation.","description":"When learning about celestial navigation, it is essential to learn about the types of horizons: visible, sensible and rational. Learning about position-fixing and calculating position lines is of utmost importance. You will become able to explain the relationship between time and longitude and measure local mean time (LMT). Start this course today to improve your understanding of the horizon types and their positioning.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Rational Horizons and Positioning in Celestial Navigation’ is a course specifically developed to teach you about visible, sensible and rational horizons. We will improve your understanding of sextant altitude, sensible horizon and the horizon system of coordinates. We expose you to very important concepts in celestial navigation. You will learn about the angle that you can obtain after correcting the index error and the concept of the parallax. Do you know there is a relationship between time and longitude and between time and the hour angle? We explore how you can measure the local mean time (LMT) westerly from the inferior meridian of the observer. Prepare yourself to study the position-fixing of a ship when the ship is out of sight of land and the time of meridian altitude of the sun with the meridian passage calculation. You will discover a method called the ‘Ex-meridian of the sun’, which we will investigate.</p><p>Completing this course will help you calculate and deduce calculated longitudes and intercepts. We examine the intercept methods of sight calculation and how to deduce the true azimuth and use it to obtain the compass error. In navigation, it is important to learn about simultaneous and staggered observations. We help you derive the direction of the position lines by observing the sun and calculating the direction of the position lines by following the planet. To learn about these position line calculations, you need to find the approximate GMT mer pass. It is necessary to learn how to obtain the declination for the time of mer pass. We demonstrate how to calculate the obs lat and state direction of LOP.</p><p>This course will help you become familiar with the longitude by chronometer and intercept methods of sight calculation. Master the intercept or Marc St Hilaire method and procedure for solving longitude by using the chronometer problem. We explain the process that you can use to find the latitude of the observer when the heavenly body is near the observer’s meridian. This course will help you become acquainted with the fundamentals of navigation. Do you know that you can illustrate the visible sunrise and sunset? We will cover the calculation of compass error by amplitude measurement in this course. We analyse the relationship between the GHA of the sun and GMT. This free online course will be of great interest to students, researchers and anyone interested in celestial navigation. Register for this course and start learning today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}