{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3365","title":"Real Numbers and Monomials for General Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the mathematical applications of real numbers and manipulating monomials in this free online course.","description":"This course on real numbers and monomials in mathematics introduces you to the types of numbers, their properties and how to change rational numbers to and from decimals. For instance, roots are the opposite operation of applying exponents and the most common roots are square roots. You will learn how to simplify roots with examples and how to approximate square roots. Register for this course today and begin your next learning journey!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course is the second in a series of algebra topics in mathematics. It explains more about mathematical concepts of real numbers and monomials and begins by introducing you to rational numbers. We explain the standard definition of a rational number, the properties of rational numbers and types. You will study the two types of rational numbers and their differences with the aid of examples. ‘Interval notation’ is a way to describe continuous sets of real numbers by the numbers that bound them. Sometimes it is more convenient to write sets of numbers using interval notations rather than using inequality statements. This course gives you a summary of the possible inequality and interval notations. Learners find square roots confusing, especially when dealing with more than one variable. This course will help you gain more confidence and teach you about the most commonly used roots and cube roots.</p><p>Then the course introduces you to the various operations with radicals. These operations will be valid for square roots, cube roots, fourth roots, etc. Simplifying radicals is one of the easiest yet confusing aspects of algebra. Using examples, we will gradually take you through this process. An algebraic expression containing only one term is called a ‘monomial’. Discover the various definitions, vocabularies and words associated with monomials to help you better understand each concept. Not all algebraic expressions are monomials. By the end of this course, you should be able to differentiate between monomial expressions and non-monomial expressions. You can add and subtract monomials by using the distributive property and then adding or subtracting their coefficients. What is the distributive property? This course outlines the various properties and definitions of each operator and how they work.</p><p>Furthermore, this course will teach you how to analyse non-positive exponents in algebra. For example, the exponents of a monomial can be negative integers or zero or positive integers. Investigate the different properties of non-positive exponents with the aid of examples. Rational exponents (also called ‘fractional exponents’) are expressions with exponents that are rational numbers (as opposed to integers). While all the standard rules of exponents apply, it is helpful to think about rational exponents carefully. How do you express numbers too large or small to be conveniently written? Scientific notation is instrumental in dealing with extremely large or small numbers. It allows a person to write or compute these disproportionate numbers more efficiently, which you will learn about in this course. Solving equations with rational exponents can be challenging when you don't follow the rules and regulations associated with notations. The learning content in this course is crucial to master these techniques and will be of great interest to students, researchers and analysts. So register for this course and start learning today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}