{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5565","title":"Reversing Underachievement in Students","totalEnrolled":"221","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to help struggling school students reach their full potential in this free online teacher training course.","description":"This teacher training course explains how to reverse underachievement in school students whose personal issues are affecting their academic performance. We examine the two factors that most often contribute to student underachievement. We then provide a new model you can use to help struggling students. Sign up to pick up the techniques and leadership skills required to inspire students to overcome challenges and reach their full potential.","courseOutcomes":["Define ‘underachievement’...","Identify behaviours typical of under...","Discuss the difference between under...","Explain how students can be motivate...","Define ‘underachievement’","Identify behaviours typical of underachieving students","Discuss the difference between underachievement and learning disabilities/disorders","Explain how students can be motivated to become more successful","List the four characteristics of the best kind of adversities, experiences and challenges that motivate underachieving students","Define ‘the mind’","Outline how the Sharzelos Model works and describe how it is used to reverse underachievement","List the four rules of reversing underachievement","Discuss the role of students’ mindsets in improving performance","Explain how to solve random cases of underachievement","Discuss how to create reversal plans","Define ‘underachievement’...","Identify behaviours typical of under...","Discuss the difference between under...","Explain how students can be motivate...","Define ‘underachievement’","Identify behaviours typical of underachieving students","Discuss the difference between underachievement and learning disabilities/disorders","Explain how students can be motivated to become more successful","List the four characteristics of the best kind of adversities, experiences and challenges that motivate underachieving students","Define ‘the mind’","Outline how the Sharzelos Model works and describe how it is used to reverse underachievement","List the four rules of reversing underachievement","Discuss the role of students’ mindsets in improving performance","Explain how to solve random cases of underachievement","Discuss how to create reversal plans"],"courseDescription":"<p>This teacher training course explores the factors that drive underachievement in students and explains how to recognise underachieving students. We identify the two factors that most often contribute to academic underachievement and show you how to reverse such cases. This course provides the training you need to guarantee that your students reach their potential within a defined scholastic period.</p><p>To help you recognise underachieving students and influence them to do better, we discuss their behaviour they show and how you can encourage behavioural changes and identify what triggers them. This course also outlines techniques used to encourage underachievers to think about their future, become excited about life, show confidence to lead others and rise above their troubles to excel in the classroom despite them.</p><p>The course delves into the ’Sharzelos Model’, an educational approach designed to reverse academic underachievement by students affected by personal issues. We explain how to harness the Sharzelos Model to create a detailed ‘reversal plan’ for struggling students in your classroom. This teacher training course equips you with the leadership skills required to inspire students to overcome personal challenges and reach their full potential. Sign up to become a better teacher and watch your students soar.</p><a href=\"https://alison.com/resume/courses/5565\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5565\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Understanding Student Underachievement","description":"In this module, you will be introduced to underachievement, how to recognize underachieving students and the “two factors” that majorly contribute to underachievement. You will learn the differences between underachieving students and students who have learning disabilities and how underachieving students can be motivated to reach their potential.","topics":["Understanding Student Underachievement - Learning Outcomes","Understanding Underachievement","Proof of Underachievement","How Students Can Be Motivated to Become Achievers","Understanding Student Underachievement - Lesson Summary"]},{"name":"Module","details":"How to Reverse Student Underachievement","description":"In this module, you will learn how to deal with an underachieving student in your care and you will learn first-hand, what it takes to reverse student underachievement using a model called the Sharzelos Model.","topics":["How to Reverse Student Underachievement – Learning Outcomes","The Sharzelos Model for Reversing Student Underachievement","Creating Reversal Plans","Reversing Underachievement Based on Mindset","Solving Random Cases of Underachievement","How to Reverse Student Underachievement – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Reversing Underachievement in Students – Course Assessment"]}]}