{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3205","title":"Screenwriting","totalEnrolled":"10,925","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the essentials of scriptwriting to see your ideas on the screen with this free online screenwriting course.","description":"This free online screenwriting teaches you the fundamentals of scriptwriting and explores various genres and formats. We show you how to carry out research, develop a script and turn your vision into a screenplay. The course demonstrates how to develop compelling characters, polish your script and create a pitch that sells your idea. We also take you through the common ‘do’s and ‘don’t’s of writing for the big or small screen.","courseOutcomes":["Define ‘screenwriting’...","Understand how to maintain motivatio...","Recognize the importance of research...","Analyse the evolution of the genre...","Define ‘screenwriting’","Understand how to maintain motivation","Recognize the importance of research and development to screenwriting","Analyse the evolution of the genre","Outline the role of plot, character and dialogue","Structure a script","Create synopses, outlines and treatments","Discuss script marketing and troubleshooting","Define ‘screenwriting’...","Understand how to maintain motivatio...","Recognize the importance of research...","Analyse the evolution of the genre...","Define ‘screenwriting’","Understand how to maintain motivation","Recognize the importance of research and development to screenwriting","Analyse the evolution of the genre","Outline the role of plot, character and dialogue","Structure a script","Create synopses, outlines and treatments","Discuss script marketing and troubleshooting"],"courseDescription":"<p>Working on a screenplay can be long and frustrating but once you have a good idea - you have to get it down on paper! This course walks you through the process of moving your screenplay notion from your head to the printed page as we cover the fundamentals of screenwriting. Every successful screenplay went through highs and lows and enduring this process demands motivation and we can help you stay inspired and driven. This course shows you how to conduct research to conceive and develop ideas.</p><p>We introduce you to the concept of genre and unpack how it affects your story as knowledge of genre and subgenre elements is vital for a screenwriter. While writing, it's worth working out the plot ahead of time and we explain how to write a plot outline. Dialogue is an incredibly important part of screenplay writing and getting it right means matching tone and inflection with the characters personality and the overall story. This brings us to the concept of character and archetypes and their ability to drive the narrative which is all discussed throughout this course.</p><p>Creating a unique screenplay is not easy but this course provides you with the tools to create a good balance of the key components involved in telling a story as a screenplay which includes the formatting needs of a screenplay. A script has specifications and needs to be written to a certain standard and should not look like or sound like an email, for example, or a novel. This course provides an understanding of script structure and format and outlines how to write a synopsis thereof. Furthermore, selling a screenplay requires the presentation of a business idea to potential investors and we teach you how to create a credible pitch. This course can help you turn your private inspiration into a public work of art as you move a story from your mind to the page and screen.</p><a href=\"https://alison.com/resume/courses/3205\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3205\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Screenwriting","description":"In this module, you will be introduced to 'Screenwriting'. You will learn how to stay motivated while writing a screenplay, how to come up with an idea for a screenplay, how to carry out research and develop a script. Also, you will be taught the concept of genre, story, plot, character and dialogue. Furthermore, learners will gain an understanding of script structure and format, synopses, outline, how to troubleshoot script and how to create a pitch that sells an idea.","topics":["Introduction to Screenwriting - Learning Outcomes","Screenwriting","Structure and Format","Introduction to Screenwriting - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Screenwriting - Course assessment"]}]}