{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5413","title":"Strand 4 Leaving Certificate Ordinary Level Algebra","totalEnrolled":"6","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to solve simultaneous and cubic equations, as well as inequalities, with this free online course.","description":"Are you preparing for your Leaving Certification exam and require some extra time covering mathematics? You will learn about expressions, formulas and quadratics, which are used to determine anything from areas to a product's profit or the speed of an object. You will also learn about square roots, equations, complex numbers (which are a combination of real numbers and imaginary numbers), and more. Start learning, today!","courseOutcomes":["Describe how to factorise quadratic...","Calculate the difference of two squa...","State how to expand brackets using b...","Explain how t rearrange algebraic fo...","Describe how to factorise quadratic","Calculate the difference of two squares in algebra","State how to expand brackets using both the grid and FOIL methods","Explain how t rearrange algebraic formulas","Solve linear equations that contain fractions","Solve quadratic equations, using formulae and graphics","Solve simultaneous equations","Solve equations that include indices","Identify inequalities from shaded regions on a graph","Solve linear inequalities with fractions","Manipulate complex numbers","Identify an Argand diagram and its use","Discuss the meaning of i","Discuss patterns with imaginary numbers","Describe how to factorise quadratic...","Calculate the difference of two squa...","State how to expand brackets using b...","Explain how t rearrange algebraic fo...","Describe how to factorise quadratic","Calculate the difference of two squares in algebra","State how to expand brackets using both the grid and FOIL methods","Explain how t rearrange algebraic formulas","Solve linear equations that contain fractions","Solve quadratic equations, using formulae and graphics","Solve simultaneous equations","Solve equations that include indices","Identify inequalities from shaded regions on a graph","Solve linear inequalities with fractions","Manipulate complex numbers","Identify an Argand diagram and its use","Discuss the meaning of i","Discuss patterns with imaginary numbers"],"courseDescription":"<p>This course begins by showing you how to factor quadratics. You will learn how to factor the difference of two squares and expand brackets using the grid and FOIL (first, outside, inside, last methods. In addition, you will also learn how to expand any two brackets and rearrange simple formulae. You will study the two steps of rearranging simple formulae, rearrange formulae with squares and square roots, and rearrange formulae where subjects appear twice.</p><p>An equation is a statement that asserts the equality of two expressions. This course will teach you the steps in solving equations. You will look into inequality which is an equation that uses symbols for \"\"less than\"\"(&lt;) and \"\"greater than\"\"(&gt;) where an equation uses a symbol for \"is equal to\" (=). You will also learn how to solve complex numbers which are the building blocks of algebra and can be applied to different aspects of real life.</p><p>It will also show you how to represent numbers with letters and convert problems into equations among other algebraic concepts. On the completion of this course, you will have a better understanding of the steps involved in solving linear simultaneous equations with two unknowns, solving basic inequalities, interpreting the solutions of simple simultaneous equations, forming quadratic equations with given roots, and more. Check out the course and start expanding your algebra skills today! You do not have to be doing the Leaving Cert exam - anyone who wants to improve their understanding of algebra is welcome to enrol.</p><a href=\"https://alison.com/resume/courses/5413\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5413\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Strand 4 - Algebra","description":"In this module, you will learn how to solve expressions and formulas. Work through quadratic equations, including those with brackets with either the same or different signs while also covering quadratic inequalities using different methods. You will study the Argand Diagram and review the proof of De Moivre's Theorem as well.","topics":["Algebra - Learning Outcomes","Factorising and Rearranging","Simultaneous and Quadratic Equations","Complex Numbers","Algebra - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strand 4 Leaving Certificate Ordinary Level Algebra: Course Assessment"]}]}