{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1823","title":"Strand 1 Junior Certificate Higher Level Probability and Statistics","totalEnrolled":"2,074","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study higher level probability and statistics for the Irish Junior Certificate examination in this free online course.","description":"This free online statistics course includes all the lessons contained in the Strand 1 Junior Certificate Ordinary Level Probability and Statistics course along with additional topics such as cumulative frequency and the Ogive Curve, the probability of compound events and probability using tree diagrams. This course will help you prepare for several professional fields or to be more confident for your next school maths exam.","courseOutcomes":["Contrast how to determine the probab...","Distinguish between working with nor...","Describe how to work with different ...","Explain how to calculate the mean of...","Contrast how to determine the probability of simple and compound events","Distinguish between working with normal and binomial distributions","Describe how to work with different statistical methods, such as sampling methods, correlation and regression, and stem and leaf diagrams","Explain how to calculate the mean of grouped frequency tables","Contrast how to determine the probab...","Distinguish between working with nor...","Describe how to work with different ...","Explain how to calculate the mean of...","Contrast how to determine the probability of simple and compound events","Distinguish between working with normal and binomial distributions","Describe how to work with different statistical methods, such as sampling methods, correlation and regression, and stem and leaf diagrams","Explain how to calculate the mean of grouped frequency tables"],"courseDescription":"<p>Probability and statistics is one of the strands of the Project Maths course in the Irish curriculum and the UK GCSE curriculum. This free online course prepares students for the higher level, Junior Certificate, exam with teaching on how to use a range of statistical tools to handle and analyze data and interpret the results.</p><p>It begins with lessons from the Strand 1 Junior Certificate Ordinary Level Probability and Statistics course covering Arrangements and then Selection and Arrangements, where you are taught how many variations you can have of a group of objects beside each other, and also how many variations you might have if trying to fit eight books into five spaces. Next, this course introduces a new topic - Cumulative Frequency and the Ogive Curve. This is followed by a lesson demonstrating how the Ogive Curve is useful for finding the median and quartiles of a set of data. The lesson from the Ordinary Level course, demonstrating how to find the mean, median class, modal class and range of grouped frequency tables follows. Another way of arranging data for analysis is to construct a stem and leaf diagram which is also covered in the Ordinary Level course. This course expands the topic to include a comparative stem and leaf diagram. The example cited is comparing the amount boys and girls spend on downloads monthly. You will then look into a histogram which is a type of bar chart that is useful for visualising the underlying frequency distribution (shape) of a set of continuous data.</p><p>The course then moves on to probability, which is concerned with the likelihood of something happening. The information can be used to make informed decisions or to infer the fairness of an event. It can be evaluated using a diagram or a rule-based approach. This strand attempts to merge the mathematical aspects of probability and statistics with their real-life applications. It includes lessons on the probability of simple events, the probability of compound events and finally, using a tree diagram to work out probabilities. It is an interesting topic that is very accessible to all students, not just those undertaking the Junior Certificate. Anyone who wants to revise high-school stats and probability for their school or work life can benefit from this course.</p><a href=\"https://alison.com/resume/courses/5415\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5415\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Probability and Statistics","description":"In this module, you will learn how to work out the probability of simple and compound events and work with normal distributions and binomial distributions. You will also learn how to work with statistical methods including sampling methods, correlation and regression, and stem and leaf diagrams.","topics":["Probability and Statistics - Learning Outcomes","Probability and Statistics","Probability and Statistics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strand 1 Junior Certificate Higher Level Probability and Statistics - Course Assessment"]}]}