{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5410","title":"Strand 1 Leaving Certificate Ordinary Level Probability and Statistics","totalEnrolled":"59","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Probability and statistics are covered by Project Maths of the Irish curriculum in this free online course.","description":"Get ready for your Ordinary Level Maths Leaving Certificate today! This course covers vital topics found in both probability and statistics. As you progress you will review how to calculate the probability of simple and compound events, work through simple Bernoulli trials, create a stem and leaf diagram, use Excel to calculate Pearson's correlation coefficient and even more with these video tutorials. Brush up on your maths skills today!","courseOutcomes":["Calculate the mathematical ways of m...","Recognise the concept of expected va...","Discuss and define what probability ...","Calculate the probability of simple ...","Calculate the mathematical ways of making arrangements and selections","Recognise the concept of expected value","Discuss and define what probability is","Calculate the probability of simple and compound events","Recognize what a tree diagram is and describe its functions","Define what Bernoulli Trials are used for","Calculate the cumulative frequency of a distribution","Calculate the mean of a grouped frequency table","Compare two stem and leaf diagrams","Calculate the area frequency of a histogram","Define what statistical correlation is","Calculate the mathematical ways of m...","Recognise the concept of expected va...","Discuss and define what probability ...","Calculate the probability of simple ...","Calculate the mathematical ways of making arrangements and selections","Recognise the concept of expected value","Discuss and define what probability is","Calculate the probability of simple and compound events","Recognize what a tree diagram is and describe its functions","Define what Bernoulli Trials are used for","Calculate the cumulative frequency of a distribution","Calculate the mean of a grouped frequency table","Compare two stem and leaf diagrams","Calculate the area frequency of a histogram","Define what statistical correlation is"],"courseDescription":"<p>Statistics can be very useful for making sense of the information around us and how it might affect us. Statistics looks at the cycle of data handling and the collection of analysed data. This involves a question, a collection of data on that question, a presentation of that data and an analysis of the data (using spread and centre) and interpreting the results. In answering questions, it is important to contextualise findings in order to justify them.</p><p>Probability looks at the likelihood of any event(s) happening. The information can help to make decisions. The uses of probability can be seen in the world of sport, insurance and finance among others. Probability can be used to examine how fair an event or series of events might be. It can be evaluated in different ways such as using a diagram or a rule-based approach.</p><p>This course attempts to combine the theoretical aspects of probability and statistics with some real-life applications. Although it is based on the Irish maths curriculum and is designed to help prepare pupils for the Strand 1 Ordinary Level Leaving Certificate, it is a good primer for anyone wanting to learn the basics of probability and stats at their own pace.</p><a href=\"https://alison.com/resume/courses/5410\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5410\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Strand 1 - Probability and Statistics","description":"In this module, you will begin your review of probability and statistics for the Leaving Certificate (ordinary level). This includes simple & compound events, normal & binomial distributions, cumulative frequency and statistical correlation. You will also learn how to use Excel's built-in functions to calculate Pearson's Correlation Coefficient.","topics":["Probability and Statistics - Learning Outcomes","The Probability of Events","Creating a Stem and Leaf Diagram","Statistical Correlation","Strand 1 - Probability and Statistics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strand 1 Leaving Certificate Ordinary Level Probability and Stat: Course Assessment"]}]}