{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1826","title":"Strand 4 Junior Certificate Higher Level Algebra","totalEnrolled":"2,107","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Enhance your maths skills with the help of this free online algebra course covering surds, quadratics and more.","description":"This free online Junior Certificate course teaches you Higher Level Algebra. You will learn about simple formulae and how to rearrange them, how to factorize quadratic equations and calculate the difference of two squares, as well as how to use a discriminant. You will also study simplifying surds, solving linear and quadratic inequalities, solving simultaneous equations graphically, and more. Start learning, today!","courseOutcomes":["Examine how to solve expressions and...","Demonstrate how to solve quadratic e...","Identify how to solve quadratic equa...","Explain how to work with complex num...","Examine how to solve expressions and formulas, and simplify surds","Demonstrate how to solve quadratic equations and equations with indices, including simultaneous equations","Identify how to solve quadratic equations using different methods","Explain how to work with complex numbers","Examine how to solve expressions and...","Demonstrate how to solve quadratic e...","Identify how to solve quadratic equa...","Explain how to work with complex num...","Examine how to solve expressions and formulas, and simplify surds","Demonstrate how to solve quadratic equations and equations with indices, including simultaneous equations","Identify how to solve quadratic equations using different methods","Explain how to work with complex numbers"],"courseDescription":"<p>A quadratic is a type of problem that deals with a variable multiplied by itself. This operation is known as ‘squaring’ and is derived from the area of a square with its side length multiplied by itself. This course will teach you how to factorize quadratics. You will look at equations with linear functions in the denominator, quadratic equations with both brackets of the same sign, and quadratic equations with both brackets of different signs. You will also study quadratic equations using specific formulae.</p><p>Surds are numbers left in root form (√) to express their exact value. They are left as surds because, in the decimal form, they would go on infinitely. This course will teach you how to simplify surds with some simple rules. You will learn how to use discriminants for quadratic equations and how to solve linear inequalities with fractions. You will also study the different methods for solving quadratic inequalities.</p><p>Algebra is one of the strands of the new Project Maths course in the Irish curriculum. On completion of this course, you will have a much better understanding of factorization as well as addition, subtraction, multiplication, and division of expressions. You will also have a stronger grasp of word problems leading to simultaneous and quadratic equations, equations involving fractions, and solutions of linear inequalities.&nbsp;</p><a href=\"https://alison.com/resume/courses/1826\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1826\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Algebra","description":"This first module looks at some basic expressions and formulas. It takes the learner through Inequalities and then moves on to complex numbers. Within each topic are a number of videos which will cover various sub-topics, such as Argand diagrams for complex numbers.","topics":["Algebra - Learning Outcomes","Quadratic Equations and Formulae","Simultaneous Equations","Algebra - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strand 4 Junior Certificate Higher Level Algebra - Revised - Course Assessment"]}]}