{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1828","title":"Strand 1 Junior Certificate Ordinary Level Probability and Statistics","totalEnrolled":"4,765","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a better understanding of probability and statistics, arrangements and more in this free online course.","description":"Learn how statistics are used in real life and how to calculate the probability of events. Statistics can help us to make sense of the information around us and how it affects us. This course, for the Irish Junior Certificate examination and GCSEs in the UK, covers a number of areas in short, clearly taught video lessons. Topics include arrangements & selections, grouped frequency tables, stem and leaf diagrams, histograms, probability and more.","courseOutcomes":["Indicate an awareness of the basic c...","Recogise how to solve word probabili...","Identify how to interpret stem and l...","Explain how to calculate the mean of...","Indicate an awareness of the basic concepts of probability","Recogise how to solve word probability problems","Identify how to interpret stem and leaf digrams","Explain how to calculate the mean of grouped data","Indicate an awareness of the basic c...","Recogise how to solve word probabili...","Identify how to interpret stem and l...","Explain how to calculate the mean of...","Indicate an awareness of the basic concepts of probability","Recogise how to solve word probability problems","Identify how to interpret stem and leaf digrams","Explain how to calculate the mean of grouped data"],"courseDescription":"<p>Study statistics and probability today, in preparation for your junior certificate! You will begin with computing arrangements and discovering how to use factorials to quickly arrive at the answer. The next lesson demonstrates how to work out how many selections you can make for an arrangement using an example of a shelf that has space for just five out of eight books. Maths formulae provide quick ways to arrive at the answer. You will then look at a group frequency table to compute for the estimated mean, median class, modal class, and range.</p><p>Stem-and-leaf diagrams are a visual representation of grouped discrete data and are an excellent tool for organizing information. This course will teach you how to draw a comparative stem-and-leaf diagram for data. You will then look into a histogram which is a graphical display of data using bars of different heights to help you discover and visualise the underlying frequency distribution (shape) of a set of continuous data. You will also look into the probability of simple events, such as a football team winning the league, or in the case of dice, rolling a six.</p><p>Statistics helps with the handling and analysis of collected data. Upon the completion of this course, you will be able to understand the process involved in posing a question, collecting data on that question, presenting that data, analyzing the data using measures of spread and centre, and interpreting the results. This course is an excellent revision aid and demonstrates how to use probability and statistics to make informed decisions.</p><a href=\"https://alison.com/resume/courses/1828\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1828\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Probability and Statistics","description":"In this module, you will learn how to work out the probability of simple and compound events and work with normal distributions and binomial distributions. Bernoulli's trials and Bayes' Theorem are covered too. You will also learn how to work with statistical methods including sampling methods, correlation and regression, stem and leaf diagrams.","topics":["Probability and Statistics - Learning Outcomes","Probability and Statistics","Probability and Statistics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strand 1 Junior Certificate Ordinary Level Probability and Statistics - Course Assessment"]}]}