{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5416","title":"Strand 2 Leaving Certificate Higher Level Geometry and Trigonometry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Get to grips with geometry and trig to pass the Irish Leaving Certificate exams in this free online course.","description":"Are you looking to brush up on your geometry and trigonometry? Your Leaving Certification exam is fast approaching and you are looking for additional study material? Look no further than this video-based study-based prep course covering topics such as synthetic geometry, equations of lines, graphing functions and more! These subjects can be seen in great detail throughout Paper 2 of the Project Maths course in the Irish curriculum.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Co-ordinate geometry and synthetic geometry are frequently used in real life to help us understand the transformations and dimensions of shapes and figures such as lines, polygons, triangles and circles. Synthetic geometry involves the examination of shapes by means of axioms and theorems. Co-ordinate geometry studies circles and lines using a fixed set of co-ordinates.</p><p>Trigonometry involves the 'real life' measurements of angles, length and circular measure in both three and two dimensions. The use of trigonometry can be seen in the areas of building and construction, quantity surveying, and in architecture generally. This strand is one of the most applicable areas of the Leaving Certificate Project Maths syllabus and allows students to gain experience of real-world applications</p><p>This strand will merge the mathematical aspects of geometry and trigonometry with good examples of real-life applications. This is a very accessible course that breaks down common problems and equations. It also serves as excellent study material for those preparing for their Leaving Certification! If mathematics interests you then this is the course for you, sign up today and see what you can learn.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}