{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5490","title":"Teaching: How to Promote Positive Behaviour in Children and Youth","totalEnrolled":"691","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to help kids build up their social-emotional skills in this free online course full of anti-bullying tips.","description":"The anti-bullying strategies covered in this course aim to help kids build their social and emotional skills by identifying and avoiding the factors that might result in bullying. We also study the benefits of positive values and the ‘ABC’s of behaviour. We cover behaviour management, the role of teaching assistants (TAs) and teamwork to provide you with policies and procedures that deter bad behaviour and encourage positive social interactions.","courseOutcomes":["Define the concept of ‘Behaviour Pol...","Discuss the policies and procedures,...","Explain behaviour management strateg...","Identify the different types of bull...","Define the concept of ‘Behaviour Policy’","Discuss the policies and procedures, including discouraging undesirable behaviour, conflict resolution and setting support","Explain behaviour management strategies, inappropriate behaviour and discipline problems","Identify the different types of bullying","Describe the methods of promoting positive behaviour, the ground rules and the role of TA and teamwork","Recognise the factors which influence behaviour","Explain how to build strong relationships and a positive learning environment","List the benefits of positive values, collaboration and effective group process skills","Define the concept of ‘Behaviour Pol...","Discuss the policies and procedures,...","Explain behaviour management strateg...","Identify the different types of bull...","Define the concept of ‘Behaviour Policy’","Discuss the policies and procedures, including discouraging undesirable behaviour, conflict resolution and setting support","Explain behaviour management strategies, inappropriate behaviour and discipline problems","Identify the different types of bullying","Describe the methods of promoting positive behaviour, the ground rules and the role of TA and teamwork","Recognise the factors which influence behaviour","Explain how to build strong relationships and a positive learning environment","List the benefits of positive values, collaboration and effective group process skills"],"courseDescription":"<p>Bullying and harassment may take many facets and create grief and suffering for the victim. This course shows you how to deal with instances of bullying and explains how to stop them using effective anti-bullying techniques. We explore various policies and procedures designed to promote positive social behaviour and prevent bullying. We then delve into conflict avoidance and resolution, including the provision of clear instructions and guidance and applying the various proven strategies employed by school staff to deal with challenging behaviour. The next step is learning how to assist children and young people in establishing goals and limits for their actions and using those limits to cultivate positive behaviour.</p><p>The course then explains how to manage behaviour by utilising a behaviour support plan while motivating pupils with encouraging words and rewarding praise. We trace the numerous causes of behavioural issues (including age, abilities and familial problems) and investigate the significance of moral principles and some features of role modelling. The course covers various types of bullying, including its physical, verbal and covert forms, as well as the tactics employed when inappropriate behaviour occurs.</p><p>We then shift to the teaching assistant’s (TA's) duties as a behaviour role model for kids. We show you how to identify the root of bad behaviour and provide ways to inspire kids to behave better. Successful tactics for modelling children's best behaviour are also covered, including being fair and clear in all situations, providing rewards and creating interaction opportunities. Finally, we study the function of effective teamwork and its characteristics and lay out the benefits of collaboration and methods for sustaining a culture of positivity and high productivity in an organisation. Bullying can derail a child’s academic path and impact their mental health , so sign up to learn how to prevent bullying in your school.</p><a href=\"https://alison.com/resume/courses/5490\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5490\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Encouraging Positive Behaviour in Children","description":"Get ready to learn how to help children be their best selves! We'll cover positive behaviour, school rules, teamwork, and tips for encouraging good behaviour. You'll also see how teaching assistants and other adults can work together to support childern.","topics":["Encouraging Positive Behaviour in Children-Learning Outcomes","Policies, Procedures and Positive Aspects of Behaviour","Behaviour Management","Role of TA and Teamwork","Encouraging Positive Behaviour in Children - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Teaching: How to Promote Positive Behaviour in Children and Youth - Course Assessment"]}]}