{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1673","title":"Teach2030 Coach Training Course","totalEnrolled":"3,897","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the roles and responsibilities of Teach 2030 coaches in this free online coach training course.","description":"This free online coach training course will make sure that you fully understand how the Teach2030 model and programme work. You will learn how to support the headteacher with timetabling CPD and ensuring lessons take place as planned. It will discuss how you can guide teachers through the courses, keep them informed, and motivated. You will also study the key responsibilities that are required for the Teach2030 coach role.","courseOutcomes":["Examine the structure of a Teach2030...","Identify the key responsibilities re...","Discuss how to support the head teac...","Plan how to guide teachers through t...","Examine the structure of a Teach2030 course","Identify the key responsibilities required for the Teach2030 coach role","Discuss how to support the head teacher with timetabling CPD and ensuring sessions take place when planned","Plan how to guide teachers through the courses, and how to keep them informed and motivated","Explore learning partners","Examine the structure of a Teach2030...","Identify the key responsibilities re...","Discuss how to support the head teac...","Plan how to guide teachers through t...","Examine the structure of a Teach2030 course","Identify the key responsibilities required for the Teach2030 coach role","Discuss how to support the head teacher with timetabling CPD and ensuring sessions take place when planned","Plan how to guide teachers through the courses, and how to keep them informed and motivated","Explore learning partners"],"courseDescription":"<p>The Commonwealth Education Trust has created the teacher professional development programme Teach2030. Our high quality materials enable teachers to reflect on their classroom practice, teach more effectively, show them how to continue to develop their skills and improve learning outcomes for all their pupils.</p><p>The course begins by helping you explore the structure of a Teach2030 course. You'll learn how to determine the key responsibilities that are required for the Teach2030 coach role. The course also shows you the planning needed to support the head teacher with their initial training course and timetabling CPD. You'll also learn the most effective way(s) to communicate with and provide ongoing support to head teacher and Teach2030 facilitator.</p><p>This course is for all Teach2030 coaches, to ensure they are ready for the implementaion of the Teach2030 programme into their schools.&nbsp;So start this course today and it will help you fully understand how the Teach2030 model and programme works, and the important role you play in its success.</p><a href=\"https://alison.com/resume/courses/1673\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1673\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Teach2030 CoachTraining Course","description":"In this module you will be introduced to the structure of a Teach2030 course, and it covers topics such as the key responsibilities required for the Teach2030 coach role, how to support the head teacher with timetabling CPD and ensuring sessions take place when planned, how to guide teachers through the courses, and how to keep them informed and motivated.","topics":["Course Introduction and Objectives","To identify the benefits of working with a learning partner","To explore the structure of Teach2030 courses","To determine the key responsibilities that are required for the Teach2030 coach role","To discuss how to support the head teacher with timetabling CPD and ensuring lessons take place when planned","To plan how to guide teachers through the courses, and how to keep them informed and motivated","To plan regular meetings with the head teacher to discuss Teach2030 progress and any challenges","Action Plan","Reviewing Questions from Start of Course"]},{"name":"Module","details":"Course assessment","description":"","topics":["Teach2030 Coach Training Course Assessment"]}]}