{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2927","title":"The Fundamentals of Chromatography","totalEnrolled":"2,129","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the interactions and solutions involved in the fundamentals in chromatography.","description":"Chromatography is a technique that allows scientists to separate molecules of interest from a crude mixture. In this comprehensive free online course, you will learn the definition of cation exchange chromatography, column interactions, hydrophobic interactions and the techniques for using various chromatographic instruments.","courseOutcomes":["Discuss the mechanism of separation ...","Explain the different precautions to...","Describe the properties of a protein...","Outline the ion-exchange chromatogra...","Discuss the mechanism of separation in chromatography","Explain the different precautions to take while using the chromatography machine","Describe the properties of a protein molecule","Outline the ion-exchange chromatography purification steps","Explain the popular hydrophobic interaction column matrices","Describe the two methods of analyzing eluents","Explain the different ways of eluting an analyte from the hydrophobic interaction column","Discuss the mechanism of separation ...","Explain the different precautions to...","Describe the properties of a protein...","Outline the ion-exchange chromatogra...","Discuss the mechanism of separation in chromatography","Explain the different precautions to take while using the chromatography machine","Describe the properties of a protein molecule","Outline the ion-exchange chromatography purification steps","Explain the popular hydrophobic interaction column matrices","Describe the two methods of analyzing eluents","Explain the different ways of eluting an analyte from the hydrophobic interaction column"],"courseDescription":"<p>When you study the fundamentals of chromatography, you will explore the fact that it is a technique that allows scientists to separate molecules of interest from a crude mixture. The purpose of chromatography is to separate a complex mixture into individual components exploiting the partition effect which distributes the molecules into different phases, will also be discussed. You will find out that in cation exchange chromatography, the matric has a negatively charged functional group with an affinity towards positively charged molecules. You will be introduced to the concept of hydrophobic interaction chromatography (HIC), which exploits the ability of strong interactions between the hydrophobic group attached to the matrix and hydrophobic patches present on an analyte such as a protein. You will learn that in the presence of a high amount of salt, the water molecule shielding the protein side chains, are displaced completely with an exposure of hydrophobic patches on the protein surface to induce protein precipitation or a reduction in protein solubility. You will discover that the addition of a low amount of salt to the protein solution results in the displacement of bonded water molecules with an increase in protein solubility. Demonstrations, problems, examples and assessment questions in this instructor-led video-based course, are designed to provide you with a comprehensive foundation in chromatography.</p><p>The material introduces you to the mechanisms of separation in chromatography and the different physical properties that can be used to separate molecules. Then, the proteins will be discussed, which have minimum solubility in solutions with a pH that corresponds to their Pi and they often precipitate out of solution. You will explore the fact that the molecular weight and size of a protein is related to the shape of the molecule and the relationship between its molecular weight and the radius of gyration. You will discover the fact that the retention time refers to the time it takes for an analyte to come out from the column. It will be clarified that the two major forms of chromatography are partition chromatography and adsorption chromatography. You will discover that in column chromatography, a stationary phase is filled into a cylindrical tube made up of glass or steel. You will also learn that the plot of the elution volume, along with the absorbance, is known as a chromatogram. You will find out that the term resolution, refers to the ability of a chromatography column to separate two analyte peaks from one another.</p><p>Next, you will learn that for the fast protein liquid chromatography (FPLC) instrument the plastic columns are the most appropriate to use, whilst for the high-performance liquid chromatography (HPLC) instrument the stainless still columns are the most appropriate to use. You will gain insight into the fact the size of the loop depends on how much protein you want to inject and the column capacity. You will then discover that the four properties of a protein molecule are the charge, surface area, affinity and its hydrophobicity. You will be taught that the different chromatography techniques that you can use to exploit the properties of a protein molecule are ion-exchange chromatography (IEX), HIC, gel filtration chromatography and affinity chromatography. You will discover that when preparing matrix beads for chromatography, the first step is to swell the medium, followed by the removal of very small particles and the last step is the equilibration with counter ions. Finally, you will study chromatography techniques, column connections, cation exchange chromatography buffers, and methods of analyzing eluents. This course will be of interest to biotechnology students, or those professionals in experimental biotechnology who want to hone their technical knowledge.</p><a href=\"https://alison.com/resume/courses/2927\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2927\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Chromatography","description":"In this module, Chromatography, you will learn about Chromatography, a technique that allows scientists to separate molecules of interest from a crude mixture. You will also learn about different Chromatography Techniques and how to use Iron-Exchange Chromatography.","topics":["Chromatography - Learning Outcomes","Chromatography","Chromatography System","Chromatography Techniques","Iron-Exchange Chromatography","Hydrophobic Interaction Chromatography","Chromatography - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Fundamentals in Chromatography - Course Assessment"]}]}