{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3347","title":"The Basics of Neurophysiology","totalEnrolled":"1,913","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"See inside your own head as we examine the brain and explain how it works in this free online neurophysiology course.","description":"This free online course peers inside your head to examine the human brain, the most complicated organ we know. Some scientists say that we know more about the universe than the brain and neurophysiology seeks to change that. We explain how the brain lets neurons exchange information and how researchers can record and interpret brain activity. This course links the laboratory to the world beyond it as we investigate the origins of thought.","courseOutcomes":["Identify the structural design of a ...","Indicate the function of axons and d...","Analyze synapses in neuronal network...","Contrast intracellular and extracell...","Identify the structural design of a neuron","Indicate the function of axons and dendrites","Analyze synapses in neuronal networks","Contrast intracellular and extracellular recordings of neuronal activity","Describe the Resting Membrane Potential","Explain how to perform electroencephalograms","Identify the structural design of a ...","Indicate the function of axons and d...","Analyze synapses in neuronal network...","Contrast intracellular and extracell...","Identify the structural design of a neuron","Indicate the function of axons and dendrites","Analyze synapses in neuronal networks","Contrast intracellular and extracellular recordings of neuronal activity","Describe the Resting Membrane Potential","Explain how to perform electroencephalograms"],"courseDescription":"<p>The human brain is very complex and there’s still a considerable amount that we don’t know about it. Over the last few decades, technological advancements have helped us to create tools that allow us to peek into the microanatomy of this fascinating biological system. ‘Neurophysiology’ is the scientific branch of neuroscience that studies the function of the human central nervous system. Its main goal is to understand how the brain’s dysfunction can lead to disease, physical impairment and mental disorders. Can you imagine a cure for Parkinson's disease or multiple sclerosis? While we may still be several years away from such goals, neurophysiologists are already treating Parkinson’s, Alzheimer’s, schizophrenia and other mental disorders with experimental treatments that can alleviate symptoms. This course introduces you to neurophysiology and the technical tools available to its researchers and health professionals.</p><p>We begin by analysing the complex design of a neuron cell. Understanding the structure and function of the central nervous system’s neuronal level is the basis for understanding scalp-recorded electroencephalograms (EEGs) and event-related potentials. Discover the role of a neuron’s axon and dendrites in communicating with other neurons and the cell membrane’s complex role in initiating action potentials. We then explain the difference between electrical and chemical synapses before breaking down the anatomical structure of the central nervous system and the cerebrum's four lobes. We unpack the role of the cerebellum and spinal cord and delve deeper into the brain by examining the thalamus, hippocampus, medulla oblongata and other hidden parts of the brain. There are four well-defined microcircuits in our brain and the course maps the layout and purpose of each to help you appreciate the brain’s multiple sensory-motor and cognitive functions.</p><p>This course also teaches you about the electroencephalogram (EEG) and how it is used to detect electrical brain activity by connecting microscopic electrodes to the scalp. We describe how these electrodes and other components used in neuro-instrumentation are manufactured, including the use of nanotechnology to produce smart catheters, sensors and diodes. We demonstrate the placing of EEG electrodes using the international ‘10-20’ system for EEG electrode placement. The course covers the different uses for EEGs and their role in detecting and recording brain waves. This course can benefit anyone studying neuroscience or who might be interested in brain function, particularly health professionals. This course is complex but rewarding as it takes you through the complexities of the brain to help you understand the engine that drives your thoughts and feelings.</p><a href=\"https://alison.com/resume/courses/3347\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3347\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Neurophysiology","description":"This module will discuss the architectural design of the central nervous system. Special attention is given to the structure of the human cerebral cortex and its cellular structure to understand brain functions. It will also provide a brief introduction to the fabrication of electrodes used in neuro instrumentation technology.","topics":["Introduction to Neurophysiology - Learning Outcomes","Cellular Structure of the Central Nervous System","Anatomical Structure of the Central Nervous System","Introduction to Neuro-Instrumentation","Introduction to Neurophysiology - Lesson Summary"]},{"name":"Module","details":"Fundamentals of Electrophysiology","description":"This module will discuss how electronic signals are produced by neurons and how scientists can read, record, and measure these signals using electro-instrumentation technology.","topics":["Fundamentals of Electrophysiology - Learning Outcomes","Electrophysiological Readings","Applications of MEMS Fabrication Technologies","The Electroencephalogram","Fundamentals of Electrophysiology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Basics of Neurophysiology - Course Assessment"]}]}