{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4150","title":"The History of the Railways in Glasgow, Scotland","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the development of early railway lines around Glasgow, Scotland with this free online history course.","description":"Are you a railway enthusiast? Are you interested in history? Do you want to learn about the Industrial Revolution and the early development of railways? This free online course discusses the birth of railways in Britain and the development of related industrial works in and around Glasgow, Scotland. We bring this fascinating period to life and trace the progress of the railways that transformed Britain into an economic powerhouse.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Glasgow grew as a port and industrial centre from the late eighteenth century. The Forth and Clyde canal was opened in 1790 and stretched from the River Forth near Edinburgh to Glasgow. It brought coal to the burgeoning industries in the area - but not enough. From 1794, the Monkland canal provided direct access to the coalfields around Coatbridge but businesses in Glasgow soon resented the monopoly its owners held over the coal supply. This prompted the building of Monklands and Kirkintilloch railway to transport coal from the Monklands mines to Glasgow via the Forth and Clyde canal. From 1831, the Garnkirk and Glasgow railway brought coal directly into Glasgow and these two lines together would feature the first Scottish steam locomotives. This course tells the story of these pioneering efforts in detail.</p><p>We begin with the Monkland canal as we investigate its purpose and construction. We examine its history and compare its old map to those made more recently. We then compare the old and new maps of the Monkland and Kirkintilloch railway as it runs through Glasgow, discussing its developmental timeline, purpose, commencement and completion. The course then studies the Glasgow and Garnkirk railway and its changes over the years. This raises the importance of several industrial works in Springburn, including various railway works. We tell the stories behind these landmarks to explain their current status.</p><p>The course examines the fascinating life of Charles Tennant and the city of Springburn. As a whimsical bonus, we provide a brief story of the Ballachulish railway in the Scottish Highlands. We explain how it soon became a popular tourist line with a scenic setting and an intriguing history that includes an infamous incident near the village of Ballachulish in 1752 concerning the royalist ‘Red’ Colin Campbell and an assassin. Do these snippets intrigue you? Are you ready to explore the fascinating history of the railways in Glasgow? Sign up to step into the past and understand more about how today’s world came to be.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}