{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3096","title":"The Periodic Table and Periodic Trends","totalEnrolled":"1,037","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Expand your knowledge on the periodic table, various periodic trends and classifications with this free online course.","description":"Our understanding of elements and physics has grown exponentially since the inception of the periodic table of elements in the late 19th century. This free online course will give you a broader understanding of earlier- and modern periodic classifications, the specific periodic trends in atomic radii and ionic radii of elements as well as periodic trends in ionization enthalpy and the electron gain enthalpy of elements.","courseOutcomes":["Discuss Johann Dobereiner’s classifi...","Explain Newlands classification and ...","List the merits and demerits of Mend...","Summarize the modern periodic law an...","Discuss Johann Dobereiner’s classification and A.E.B. de Chancourtois classification","Explain Newlands classification and Lothar Meyer’s classification","List the merits and demerits of Mendeleev’s classification","Summarize the modern periodic law and long form of periodic table","Recall the characteristics and properties of s, p, d and f - block elements","Distinguish covalent radius, metallic radius and Van der Waal’s radius","Paraphrase the periodic trends in atomic radii and ionic radii of elements","Recognize the factors affecting ionization enthalpy and electron gain enthalpy","Outline the periodic trends in ionization enthalpy and electron gain enthalpy of elements","Describe the variation of electronegativity and valence in periods and groups","Discuss Johann Dobereiner’s classifi...","Explain Newlands classification and ...","List the merits and demerits of Mend...","Summarize the modern periodic law an...","Discuss Johann Dobereiner’s classification and A.E.B. de Chancourtois classification","Explain Newlands classification and Lothar Meyer’s classification","List the merits and demerits of Mendeleev’s classification","Summarize the modern periodic law and long form of periodic table","Recall the characteristics and properties of s, p, d and f - block elements","Distinguish covalent radius, metallic radius and Van der Waal’s radius","Paraphrase the periodic trends in atomic radii and ionic radii of elements","Recognize the factors affecting ionization enthalpy and electron gain enthalpy","Outline the periodic trends in ionization enthalpy and electron gain enthalpy of elements","Describe the variation of electronegativity and valence in periods and groups"],"courseDescription":"<p>Explore the vast field of physics with this free online chemistry course where you will first get an overview of Johann Dobereiner’s classification and the A.E.B. de Chancourtois classification. You will then move on to other classifications such as the Newlands classification, Lothar Meyer’s classification, and the merits and demerits of Mendeleev’s classification.</p><p>This course will give you a better understanding of modern periodic law and long form of periodic table, and it will assist you to understand the characteristics and properties of s, p, d and f - block elements. You will be guided through the basics of atomic radii and methods to express atomic radii. The content of this course is designed to give you the periodic trends in atomic radii and ionic radii of elements as you work through various points of discussion such as the factors affecting ionization enthalpy and periodic trends in ionization enthalpy of elements. As you move on in this free online science course, you will gain insight into the factors affecting electron gain enthalpy and periodic trends in electron gain enthalpy of elements. You will then learn about electronegativity and variation of electronegativity in periods and groups, and study the periodic trends in the valence of elements.</p><p>Whether you are a budding physics student or simply love science and want to understand the periodic table, various periodic trends and classifications, then immerse yourself by enrolling in this free online course.</p><a href=\"https://alison.com/resume/courses/3096\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3096\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Periodic Classifications","description":"This module covers earlier periodic classifications and modern periodic classification. It will discuss modern periodic law. This module will help you to understand the characteristics and properties of s, p, d and f - block elements.","topics":["Periodic Classifications – Learning Outcomes","Earlier Periodic Classifications","Mendeleev’s Classification","Modern Periodic Table","Periodic Classifications - Summary"]},{"name":"Module","details":"Periodic Trends","description":"In this module learn about the periodic trends in atomic radii and ionic radii. This module covers the periodic trends in ionization enthalpy and electron gain enthalpy. It will also discuss the periodic trends in electronegativity and oxidation states.","topics":["Periodic Trends - Learning Outcomes","Atomic Radii and Ionic Radii","Ionization Enthalpy and Electron Gain Enthalpy","Electronegativity and Valence","Periodic Trends - Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}