{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4353","title":"Beginner's Guide to Thermodynamics","totalEnrolled":"356","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course is a beginner's guide to thermodynamics, which describes the ways of measuring energy.","description":"Thermodynamics studies the links between heat, work, temperature and energy. This course goes into detail concerning all the concepts and terminology of thermodynamics. We will explore energy, its various forms and the formulas used to measure it. How can you use the mechanism of energy transfer? What is an exothermic reaction? This course delves into these explanations, including the study of internal energy. Enrol today!","courseOutcomes":["Discuss the concepts and terminology...","Recognise the state functions and th...","Define ‘energy’ and discuss its form...","Identify the energy formulas and the...","Discuss the concepts and terminology of thermodynamics","Recognise the state functions and the path function","Define ‘energy’ and discuss its forms","Identify the energy formulas and the forms of energy media","Discuss the mechanisms of energy transfer","Discuss chemical reactions and enthalpy","Describe the exothermic reaction","Discuss the concepts and terminology...","Recognise the state functions and th...","Define ‘energy’ and discuss its form...","Identify the energy formulas and the...","Discuss the concepts and terminology of thermodynamics","Recognise the state functions and the path function","Define ‘energy’ and discuss its forms","Identify the energy formulas and the forms of energy media","Discuss the mechanisms of energy transfer","Discuss chemical reactions and enthalpy","Describe the exothermic reaction"],"courseDescription":"<p>This course is a beginner's guide to thermodynamics and presents accurate information on concepts and terminology. It explains and defines state and path functions, guiding you through specific details on the various forms of energy. You will be able to answer questions such as: What formulas measure energy? What are the forms of energy media or mechanisms of energy transfer? This course discusses these definitions of ‘net energy transfer’ and forms of energy media.&nbsp;</p><p>Next, we will teach you about enthalpy, its chemical reactions and the distinct varieties of applying the exothermic reaction in the work environment. Then we will compare an exothermic reaction to an endothermic reaction and discover how to employ internal energy properly. Finally, the course will end by describing internal energy at constant volume.</p><p>This course will provide you with a better understanding of the study of thermodynamics, giving you clear and precise methods to measure energy. Have you considered expanding your knowledge of the study of thermodynamics? This course is excellent for those in the scientific field and people who would like to familiarise themselves with this fascinating field. We encourage you to expand your knowledge by commencing this free course today.</p><a href=\"https://alison.com/resume/courses/4353\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4353\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Study of thermodynamics","description":"First, this module starts by explaining the concepts and terminology. You will view all the various applications and the working principles of the state functions. Next, the module provides information about forms of energy. Finally, the module will provide you with information enthalpy of chemical reactions and how to apply them in the workplace.","topics":["Study of thermodynamics - Learning Outcomes","General Concepts and Terminology","Energy and Different Forms of Energy","Enthalpy of Chemical Reactions","Study of thermodynamics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Beginner's Guide to Thermodynamics - Course assessment"]}]}