{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1730","title":"Trading in a Futures Market","totalEnrolled":"7,132","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a better understanding of the world of futures trading, as well as its importance in the world of finance.","description":"In this free online course on trading in a futures market you will learn all about futures contracts and trading, and why futures trading is so important. A futures market is defined as a contract to buy certain quantities of a product or financial instrument at a specified price, with the delivery date set at a specified time in the future. It is considered a central financial exchange where people can trade standardized futures contracts.","courseOutcomes":["Define Contango and Normal Backwarda...","Examine how Contango is used in the ...","Analyse futures curves...","Identify bullish and bearish signals...","Define Contango and Normal Backwardation","Examine how Contango is used in the financial markets","Analyse futures curves","Identify bullish and bearish signals in a commodity","Outline how spot markets and futures markets operate","Define Contango and Normal Backwarda...","Examine how Contango is used in the ...","Analyse futures curves...","Identify bullish and bearish signals...","Define Contango and Normal Backwardation","Examine how Contango is used in the financial markets","Analyse futures curves","Identify bullish and bearish signals in a commodity","Outline how spot markets and futures markets operate"],"courseDescription":"<p>This course starts off by helping you understand what Contango means, examining how Contango is used in the financial markets, and showing you how it reflects the demand for a commodity. It will further explain how money is made based on the demand for a certain commodity and the trade-off between wanting a commodity now or waiting for it at a later date for a given price.</p><p>High demand commodities are products that are normally traded in the futures market. Some examples of these commodities are gold, silver, oil, and corn. You will discuss how future curves will give you a snapshot of how much money you can earn if you acquire these high demand commodities today. Finally, you will learn the difference between Contango and backwardation and know more about the Contango theory and the normal backwardation theory.</p><p>Futures market trading dates back to the mid-1800s and has since been an important activity in the world of finance. It can have a great impact on all our lives as it affects the future prices of essential items such as food, energy sources, and raw materials. If you are a financial player, investor, or speculator who is wondering whether futures deserve a spot in your investment portfolio, you might want to check this course out.</p><a href=\"https://alison.com/resume/courses/1730\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1730\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Trading in a Futures Market","description":"This module outlines what futures trading is and how it works. This module explains the key terms and concepts in futures trading. This course begins by looking at contango and normal backwardation. It shows how these situations arise in commodity markets and highlights their defining qualities. This course demonstrates how to use futures curves to assess prices. This module will also describe spot prices, futures prices and the factors that affect prices.","topics":["Trading in a Futures Market - Learning Outcomes","Contango From Trader Perspective","Severe Contango Generally Bearish","Backwardation Bullish Or Bearish","Future Curves II","Contango","Backwardation","Contango And Backwardation","Trading in a Futures Market - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Trading in a Futures Market - Course Assessment"]}]}