{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/4109","title":"Traditional Handpoke Tattooing","totalEnrolled":"1,811","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the handpoke tattoo tools, setup, hygiene standards, aftercare and pricing in this free online course.","description":"‘Traditional Handpoke Tattooing’ is a free online course that provides you with a broad overview of various techniques, skills and procedures used in handpoke tattooing. You will explore the basic tools and required techniques needed for this technique. You will also learn about hygienic standards, proper workspace setup, and the techniques for making lines and dots. Sign up for this course today and improve your tattoo artistry!","courseOutcomes":["Discuss the techniques and basic exp...","Outline the application of various t...","Analyse the application of a liner, ...","Outline the procedures for creating ...","Discuss the techniques and basic expected outcomes of traditional handpoke tattooing","Outline the application of various tools of handpoking","Analyse the application of a liner, shader, filler and magnum","Outline the procedures for creating and converting handpoke tools","Discuss the hygienic standards in handpoke tattooing","Outline the proper way of setting up the workspace for an effective handpoke tattoo section","Analyse cross-contamination, disinfection and skin adaptation to handpoke tattoos","Outline the pre-tattoo procedures and materials that ensure a safe handpoking session","Analyse some handpoke tattoo designs and the preparation of stencils","Discuss preparations, hygiene standards and actual handpoking tattoo procedures on human skin","Explain the need to research the laws and regulations governing tattoos in the country of application","Explain the need to be responsible for the long-term effect of a tattoo and the right tattoo pricing","Discuss the techniques and basic exp...","Outline the application of various t...","Analyse the application of a liner, ...","Outline the procedures for creating ...","Discuss the techniques and basic expected outcomes of traditional handpoke tattooing","Outline the application of various tools of handpoking","Analyse the application of a liner, shader, filler and magnum","Outline the procedures for creating and converting handpoke tools","Discuss the hygienic standards in handpoke tattooing","Outline the proper way of setting up the workspace for an effective handpoke tattoo section","Analyse cross-contamination, disinfection and skin adaptation to handpoke tattoos","Outline the pre-tattoo procedures and materials that ensure a safe handpoking session","Analyse some handpoke tattoo designs and the preparation of stencils","Discuss preparations, hygiene standards and actual handpoking tattoo procedures on human skin","Explain the need to research the laws and regulations governing tattoos in the country of application","Explain the need to be responsible for the long-term effect of a tattoo and the right tattoo pricing"],"courseDescription":"<p>This course carefully analyses the tools, skills, procedures and aftermath of a handpoke tattoo session. Taking this course will introduce you to the techniques and expected outcomes of traditional handpoke tattooing. You will learn about the relevant types and applications of various tools and equipment. The proper application of the basic tools and equipment for traditional handpoking is also outlined. Learn about the recommended inks, blades, needles as well as the best places to acquire them. You will be taught the application, differences and conversion of the various needles used in handpoking. Taking this course will guide you on the importance of choosing good inks as well as other handpoking pieces of equipment. Learn about the hygienic standards required and the definition of ‘sterile’ in handpoke tattooing. Cross-contamination and disinfection will also be covered in this course.</p><p>Next, the key areas of creaming, shaving and skin adaptation to handpoke tattoos will be discussed extensively. Study the organisation and proper way of setting up the workspace for an effective handpoke tattoo session. Knowing that tattoos involve cuts into the skin, this course will outline the pre-tattoo procedures and materials that ensure a safe handpoking session. The types and applications of needles will also be analysed. You will gain in-depth knowledge of the requirements and procedures for building various tattoo tools from scratch. Study the importance of a good grip and adjustments of tools to make good traditional handpoking tattoos. You will also learn the differences between a traditional and a ritualistic tattoo. You will be taught some handpoke tattoo designs and the proper preparation of stencils.</p><p>Lastly, taking this course will expose you to the fundamental dos and don'ts of handpoke tattooing as well as an illustration with near-skin objects. You will study the various techniques for making lines and dots using different tools on near-skin objects. Cleaning up, cross-contamination and the aftercare of traditional hand poke tattoos will also be emphasised. Learn about the need to research the laws and regulations governing tattoos in the country of application. Also, study the need to be reasonable about and responsible for the long-term effect of a tattoo. Gain knowledge of tattoo pricing with respect to experience and proper aftercare for tattoos. You can improve your tattooing skills by enrolling in this free online tattoo art course whether you are a body art fan hoping to get more beautiful inks on your body or a tattoo artist wanting to grow and get better in the art of hand poke tattooing. So, what are you waiting for? Register for this course and start learning today!</p><a href=\"https://alison.com/resume/courses/4109\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4109\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Handpoke Tattoo Tools","description":"This module explains the foundation, tools and basic equipment needed for traditional handpoke tattooing. In this module, you will be taught the conversion, differences, and application of hand poking tools.","topics":["Handpoke Tattoo Tools - Learning Outcomes","Introduction to Handpoke Tattoo","Handpoke Equipment","Needles and Ink","Handpoke Tattoo Tools - Lesson Summary","Handpoke Tattoo Tools - Assessment"]},{"name":"Module","details":"Setup and Hygiene Standards","description":"This module analyses the hygienic standards from creaming, shaving and human skin adaption to handpoke tattoos. This module also covers the proper way of setting up the workspace for an effective handpoke tattoo session","topics":["Setup and Hygiene Standards - Learning Outcomes","Hygienic Standards","Workspace Setup","Building a Tattoo Tool","Setup and Hygiene Standards - Lesson Summary","Setup and Hygiene Standards -  Assessment"]},{"name":"Module","details":"Tattooing, Aftercare and Pricing","description":"This module analyses various tattoo designs along with the techniques for making lines and dots using different handpoke tools. Learn about the preparations, hygiene standards and actual handpoking tattoo procedures together with tattoo responsibilities and pricing.","topics":["Tattooing, Aftercare and Pricing - Learning Outcomes","Design, Stencil and Client","Tattoo Basics","Real Client and Aftercare","Legal Backing and Pricing","Tattooing, Aftercare and Pricing - Lesson Summary","Tattooing, Aftercare and Pricing - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Traditional Handpoke Tattooing - Course Assessment"]}]}