{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5372","title":"How to Clean an Oven","totalEnrolled":"462","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the best and most eco-friendly techniques for cleaning kitchens and industrial ovens in this free online course.","description":"Frequent and regular cleaning can help an oven to work properly and last a long time. This free online course lays out the basics of oven cleaning and identifies their different types, components and mechanisms. We explain how to properly clean the rest of the kitchen before focusing on commercial and industrial ovens. We go over important safety precautions and show you how to launch your oven-cleaning service. Sign up to make your oven sparkle.","courseOutcomes":["Identify the types, components and m...","Outline the benefits of cleaning kit...","Discuss the industrial furnace and i...","Explain how to clean a kitchen or co...","Identify the types, components and mechanisms of ovens","Outline the benefits of cleaning kitchens and commercial ovens","Discuss the industrial furnace and its applications in industrial cooking operations","Explain how to clean a kitchen or commercial oven","Describe the green and eco-friendly ways to clean an oven","Explain how to start an oven-cleaning service","Summarise the safety and legal requirements for cleaning ovens","Identify the steps taken to get rid of grease","Identify the types, components and m...","Outline the benefits of cleaning kit...","Discuss the industrial furnace and i...","Explain how to clean a kitchen or co...","Identify the types, components and mechanisms of ovens","Outline the benefits of cleaning kitchens and commercial ovens","Discuss the industrial furnace and its applications in industrial cooking operations","Explain how to clean a kitchen or commercial oven","Describe the green and eco-friendly ways to clean an oven","Explain how to start an oven-cleaning service","Summarise the safety and legal requirements for cleaning ovens","Identify the steps taken to get rid of grease"],"courseDescription":"<p>The oven is the most effective and widely used kitchen appliance. Did you know that a dirty microwave affects the taste and quality of the food it cooks? This oven-cleaning course identifies the different parts of ovens and explains how to clean and maintain them for better performance and healthier food. We establish the importance of cleaning kitchens and commercial ovens are essential and provide eco-friendly ways to use baking soda, vinegar and Citra Solv to leave your cooking area sparkling clean.</p><p>The course then provides effective tips for eco-friendly oven cleaning and identifies the ingredients you should avoid, like sodium hydroxide and butane. We describe the materials and tools needed to clean grease and point out the best oven cleaners. The course then lays out the important steps taken to start your kitchen-cleaning service and explores the factors that determine what kind of business you should start. We explain how to safely and effectively use chemicals for cleaning jobs that may involve physical and chemical hazards. We also cover the use of personal protective equipment (PPE) like chemical aprons.</p><p>This practical and useful course provides the skills and up-to-date information required in the job market to jump-start your career as a professional cleaner of kitchens and ovens. We explain how to make sure your devices are free from dirt and germs to make sure that ovens operate efficiently and cook food that tastes great. This course has no prerequisites and suits anyone who wants to know how to clean a kitchen, whether it’s their own or belongs to the clients served by their professional cleaning service. Sign up to learn how to protect your kitchen appliances, your health and the environment.</p><a href=\"https://alison.com/resume/courses/5372\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5372\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Oven Cleaning","description":"In this module, you will learn about the use of ovens, mechanisms, and different types and parts of the kitchen, commercial and industrial ovens with the effective cleaning process to halt the accumulation of debris and residue. We cover the materials, tools and chemicals required for cleaning with environmentally friendly and greener methods.","topics":["Oven Cleaning - Learning Outcomes","Introduction and Benefits of Cleaning Ovens","Oven Cleaning Process","Oven Cleaning Service","Oven Cleaning - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Training on Oven Cleaning - Course Assessment"]}]}