{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5239","title":"Training for School Counsellors","totalEnrolled":"1,854","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how school counsellors build healthy relationships through good communication in this free online course.","description":"Counselling in schools is a rising field of study. Many children and adolescents need to talk to someone outside their immediate circle of family and friends during periods of mental or physical distress. This course explains these challenges and how to approach them from a counselling perspective. We also show you how to use technology to advise students and families and how to handle children with psychological and behavioural problems.","courseOutcomes":["List the five defined types of couns...","Identify problem-solving and decisio...","Explain how to make effective use of...","Describe the duties and responsibili...","List the five defined types of counselling methods used by most counsellors","Identify problem-solving and decision-making tasks in school counselling","Explain how to make effective use of information in school counselling","Describe the duties and responsibilities of a school counsellor","Outline how to counsel children with psychological problems","Discuss how to communicate with suicidal adolescents during school counselling","List the five defined types of couns...","Identify problem-solving and decisio...","Explain how to make effective use of...","Describe the duties and responsibili...","List the five defined types of counselling methods used by most counsellors","Identify problem-solving and decision-making tasks in school counselling","Explain how to make effective use of information in school counselling","Describe the duties and responsibilities of a school counsellor","Outline how to counsel children with psychological problems","Discuss how to communicate with suicidal adolescents during school counselling"],"courseDescription":"<p>Counselling received in schools is one of the most common forms of psychotherapy available to children and young adults. Every child and adolescent experiences their own set of distinct developmental changes and may feel uncertain or even overwhelmed by those changes. Counselling helps them to understand themselves and the challenges they face better and teaches them how to manage these challenges. This training course provides a solid understanding of the theoretical aspects of school counselling.</p><p>We compare counselling and psychotherapy and explain why the British Association for Counselling changed their name in 2000 to include psychotherapy. We also provide various counselling methods and demonstrate how to establish a therapeutic rapport with your clients. The course then delves into school counselling and the working practices peculiar to educational environments. We describe the personal qualities required of a school counsellor if they hope to fulfil their duties and responsibilities effectively.</p><p>The course explains how to communicate with children of different ages and developmental levels. It is important to remember that children and adolescents spend more time at home than in the therapy room. We provide case studies to help you learn how to conduct a family counselling session with parents, who may be separated or divorced. We then show you how to conduct an online counselling session and help children with psychological problems and disorders. Sign up for this course to train as a school counsellor capable of guiding children and teenagers through troubled times as you seek to improve their mental health and wellbeing.</p><a href=\"https://alison.com/resume/courses/5239\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5239\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"School Counselling Training","description":"This module introduces you to school-based counselling and will teach you how to build a good counselling relationship with your clients. You will also learn about the roles and responsibilities of a school counsellor. Ways to deal with children and adolescents, parents, technology and children with psychological problems will also be examined.","topics":["School Counselling Training - Learning Outcomes","Introduction to School Counselling","Who is a School Counsellor?","The Work of a School Counsellor","School Counselling Training - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Training for School Counsellors - Course Assessment"]}]}