{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2081","title":"Training of Trainers - Training Methods","totalEnrolled":"6,918","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about effective training methods, group dynamics, and business games in this free online ToT course.","description":"This free online training methods course will teach you how to choose and tailor a training method to suit your training needs. Start the course and discover how training programs are delivered at global corporations; managing the dynamics of training groups; and the process of conducting business games in an organization. This course is ideal for trainers and anyone with an interest in training practices.","courseOutcomes":["Identify the areas and techniques of...","Discuss the various training methods...","Recognize the types of lectures as a...","Incorporate videos into a training p...","Identify the areas and techniques of executive development","Discuss the various training methods and techniques","Recognize the types of lectures as a presentation method","Incorporate videos into a training program","Analyze training methods and programs of different companies","Describe the dynamics of training groups","Recognize the importance of debriefing trainees in a business game","Identify the appropriate design and methodology in organizing a business game","Evaluate the outcome of a business game","Identify the areas and techniques of...","Discuss the various training methods...","Recognize the types of lectures as a...","Incorporate videos into a training p...","Identify the areas and techniques of executive development","Discuss the various training methods and techniques","Recognize the types of lectures as a presentation method","Incorporate videos into a training program","Analyze training methods and programs of different companies","Describe the dynamics of training groups","Recognize the importance of debriefing trainees in a business game","Identify the appropriate design and methodology in organizing a business game","Evaluate the outcome of a business game"],"courseDescription":"<p>Designed to teach you about training methods, this free online course is the third in the Training of Trainers suite of courses. The course begins by discussing the techniques of executive development and the various training methods. You will also analyze the criteria for choosing a suitable training method and case studies of training programs of global corporations such as McDonald's and Unilever.</p><p>Next, you will learn about the dynamics of training groups from the functional and dysfunctional behaviors in training groups, types of participants, and the roles of a trainer. Then, you will learn how business games can be designed and evaluated for training purposes including the importance of debriefing trainees.</p><p>Organizing in-house training sessions for employees is becoming a very vital and popular activity. This course on training methods will enhance your training knowledge and skills, and is ideal for students, researchers, professionals, trainers, and anyone with an interest in training practices. Start the course today and improve your training skill set.</p><a href=\"https://alison.com/resume/courses/2081\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2081\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Training Methods","description":"Learn about the various training methods available and the criteria for choosing a training method from this module.","topics":["Training Methods - Learning Outcomes","Introduction to Training Methods - 1","Introduction to Training Methods - 2","Choosing a Training Method","Case Studies","Training Methods - Lesson Summary"]},{"name":"Module","details":"Training Groups and Business Games","description":"Learn about the dynamics of training groups and the use of business games as a training method from this module.","topics":["Training Groups and Business Games - Learning Outcomes","Dynamics of Training Groups","Business Games - 1","Business Games - 2","Training Groups and Business Games - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Training of Trainers - Training Methods - Course Assessment"]}]}