{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3234","title":"Understanding Metaphysical Poetry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online literature course teaches you the complexities of Metaphysical poetry via close textual analysis.","description":"This free online literature course explores the philosophical roots of the Metaphysical genre to find the deeper meaning behind this famously intellectual and complex poetic form. These poets probed the connection between the human mind and the physical world and this course will enrich your own understanding of that relationship.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Metaphysics’ is the branch of philosophy that explores the link between mind and matter, between the physical world and our consciousness. This course introduces you to the great poets who deftly used verse to do the same and will reveal the technical complexities that defined Metaphysical poetry, which often used paradox and metaphor in subtle comparisons to convey meaning.</p><p>We will meet some of the significant poets who dominated the Metaphysical era, starting with John Donne. He saw a link between the physical and the spiritual world and set the tone for those that followed with his original, complex and intellectual verse. There’s no text without context and this course examines the historical and literary backdrop to this genre. This will accompany close reading of individual poems to enable you to continue your own solitary poetic pursuits after the course ends. We also encounter Donne’s successors, including George Herbert, Henry Vaughan and Andrew Marvell, and analyse their work to find deeper meaning both in the poems and in the world around us.</p><p>Finally, we reach the illustrious John Milton, who penned famous epic works like ‘Paradise Lost’ and ‘Samson Agonistes’. We study Milton’s poetry intensely as a critical part of understanding Metaphysical Poetry and to gain insight into the impact of the spiritual on the material. This course is aimed at people who appreciate highly intellectual art but its benefits go beyond the genre: the skills acquired in analysing strange and often opaque imagery will carry over to close reading of other poetic forms and even to comprehending the spoken world around you, from political speeches to song lyrics.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}