{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3022","title":"Understanding Molecular Biology","totalEnrolled":"4,096","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the building blocks of life and the techniques employed by molecular biologists with this free online course.","description":"This free online course offers a glimpse into living organisms at their most basic level: cells. We define ‘sequencing’ and explain ‘blotting’ and polymerase chain reaction (PCR) techniques. We demonstrate the ‘Northern’ blotting method, which is used to detect the ribonucleic acid (RNA) that is present in all cells. This course enriches your understanding of molecular biology and suits anyone interested in entering the field.","courseOutcomes":["Explain the polymerase chain reactio...","Outline the sources of template DNA...","Unpack the concept of ‘primer design...","Identify the three categories of PCR...","Explain the polymerase chain reaction technique","Outline the sources of template DNA","Unpack the concept of ‘primer designing’","Identify the three categories of PCR applications","Discuss the biomolecule sequencing techniques","Describe the Sanger sequencing method","Illustrate the steps in the Northern blotting procedure","List the steps taken in the genomic DNA isolation procedure","Explain the polymerase chain reactio...","Outline the sources of template DNA...","Unpack the concept of ‘primer design...","Identify the three categories of PCR...","Explain the polymerase chain reaction technique","Outline the sources of template DNA","Unpack the concept of ‘primer designing’","Identify the three categories of PCR applications","Discuss the biomolecule sequencing techniques","Describe the Sanger sequencing method","Illustrate the steps in the Northern blotting procedure","List the steps taken in the genomic DNA isolation procedure"],"courseDescription":"<p>This free online course introduces you to the world of molecular biology. We explore the role of the ‘polymerase chain reaction’ technique that uses an enzymatic method and cycling condition to ‘amplify’ many double deoxyribonucleic acid (DNA) molecules that have the same size and sequence. DNA is a nucleic acid that is composed of two complementary nucleotide building blockchains. These ‘nucleotides’ are made up of a phosphate group, five-carbon sugars and a nitrogen base. We explain the concept of ‘DNA replication’, which is a process of duplication of the entire genome before the division of cells. We then examine the four nitrogen bases that are found in DNA and are linked in a repeated pattern by hydrogen bonding between the nitrogen bases. The linking of the two complementary strands is called ‘hybridization’. Demonstrations, problems, examples and assessment questions in this instructor-led video-based course are designed to provide you with a comprehensive foundation that enables you to take serious steps into this field.</p><p>The course begins by examining DNA replication and PCR setup. Primers are short DNA stretches that serve as a starting point for DNA synthesis. We study their secondary structures and explain how they are created by intra- or intermolecular attraction within the primer, which eventually reduces the yield of amplification as the availability of single-stranded primers is limited for the PCR. We showcase the use of the thermal cycler, an instrument that carries out the amplification of DNA using the PCR. We clarify that primers should be designed in such a way that there should be no homology, which is similarity borne of shared ancestry, within the template other than the target site. This results in non-specific binding and amplification. This course teaches you to recognize the advantages of using the PCR technique: speed, ease of use, sensitivity and robustness when compared to other techniques used in clinical diagnostic tests.</p><p>PCR technology has become the basis for a broad spectrum of clinical diagnostic tests for various infectious agents and can detect the presence of infectious diseases in blood samples. We show you how the appearance of a smear that has visible bands indicates that the genomic DNA has been completely digested and is suitable for ‘Southern’ blotting, in contrast to the Northern blotting that is used to detect RNA. We provide two examples of methods that are used in DNA sequencing: Sanger and Maxam Gilbert. We wrap up with more attention to PCR techniques, sequencing and blotting methods, DNA amplification and the location of PCR in the tissue culture. This course suits aspiring biotechnology students, people looking to work as a biologist or even those who simply want to understand how our bodies work at their most fundamental level.</p><a href=\"https://alison.com/resume/courses/3022\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3022\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Polymerase Chain Reaction","description":"In this module, Polymerase Chain Reaction, you will learn about the Polymerase Chain Reaction, a technique that is used to amplify DNA. You will also learn about the key parameters in the designing of primers and the three categories of PCR Applications.","topics":["Polymerase Chain Reaction  - Learning Outcomes","DNA Amplification","Instrumentation","Primer Designing","Application of PCR","Polymerase Chain Reaction  - Lesson Summary"]},{"name":"Module","details":"Sequencing and Blotting Techniques","description":"In this module, Sequencing and Blotting Techniques, you will learn about the stages in the overview of protein sequencing. You will also learn about the steps in the Sanger Protocol and the steps in the northern blotting procedure.","topics":["Sequencing and Blotting Techniques - Learning Outcomes","Biomolecule Sequencing Techniques","Blotting Techniques","Southern Blotting Technique","Sequencing and Blotting Techniques  - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Molecular Biology - Course Assessment"]}]}