{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5302","title":"Understanding Marine Biology","totalEnrolled":"1,236","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the oceans in this free online course and learn how marine life is crucial to ecosystems and our survival.","description":"Water covers more than two thirds of the Earth's surface and marine organisms produce more than half of the oxygen we breathe while helping to regulate the planet's climate, which explains why we refer to the oceans as the ‘planet's heartbeat’. This marine biology course explains how oceans also provide us with food, jobs and entertainment. We go beneath the waves to show you how marine life interacts to create sustainable ecosystems.","courseOutcomes":["Define ‘marine biology’...","Explain the ecology of the ocean and...","Compare the physical characteristics...","Discuss the multicellular primary pr...","Define ‘marine biology’","Explain the ecology of the ocean and establish their importance","Compare the physical characteristics of the Arctic and Antarctic","Discuss the multicellular primary producers of marine life","Recognise the basic characteristics and features of marine environments","Outline the factors that affect the marine environment","Discuss the vertebrates' affinity with other chordates and the characteristics that make them unique","Explain the environmental factors affecting the distribution of marine organisms","Identify who plays what role down the levels of the ‘food chain’ or ‘food web’","Evaluate the damaging impact of human activity on marine life","State the aims of marine protected areas","Outline threats to the marine environment","Define ‘marine biology’...","Explain the ecology of the ocean and...","Compare the physical characteristics...","Discuss the multicellular primary pr...","Define ‘marine biology’","Explain the ecology of the ocean and establish their importance","Compare the physical characteristics of the Arctic and Antarctic","Discuss the multicellular primary producers of marine life","Recognise the basic characteristics and features of marine environments","Outline the factors that affect the marine environment","Discuss the vertebrates' affinity with other chordates and the characteristics that make them unique","Explain the environmental factors affecting the distribution of marine organisms","Identify who plays what role down the levels of the ‘food chain’ or ‘food web’","Evaluate the damaging impact of human activity on marine life","State the aims of marine protected areas","Outline threats to the marine environment"],"courseDescription":"<p>Evolutionary theory suggests that life on Earth originated in the sea. Marine organisms provide clues to our planet’s natural and human history that we still strive to understand. This course teaches you about the oceans and their impact on all life on Earth. Our first module introduces you to marine biology and its history while establishing the importance of the field. We then compare the characteristics of each significant ocean basin and discuss topics like the sea's salinity, oceanic ecology and marine microbes.</p><p>The course’s second module examines marine vertebrates and invertebrates. The seas are teeming with various species of marine life, from minuscule worms to enormous squids, and each fits a specific niche in their ecosystem. We discuss marine populations and their communities and lay out the characteristics and distribution of these communities. The course then explores the environmental factors affecting the distribution of marine organisms.</p><p>Producers and consumers are linked in every ecosystem by feeding relationships known as ‘food chains’. This course explains who plays what role at each level of the ‘food web’. The greatest threat to today’s marine life is Earth’s human population and we establish the urgent need to manage and protect this environment as even the vast oceans are vulnerable to the effects of human activity. A career in marine biology offers an exciting opportunity to study life in the ocean. It can take you to research stations anywhere in the world, which are often found in breathtaking locations. This course is not just for marine biologists but suits anyone interested in studying ocean life and appreciating its significance.</p><a href=\"https://alison.com/resume/courses/5302\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5302\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Marine Biology","description":"In this module, you are going to be introduced to marine biology and the necessity of studying marine biology. Then you will study the ocean and the origin of life and the ocean as a habitat. Other topics discussed in this module are the salinity of the sea, the characteristics of the marine environment, marine life and marine microbes.","topics":["Introduction to Marine Biology - Learning Outcomes","Marine Biology and the Ocean","Characteristics of the Marine Environment","Marine Life and Microbes","Introduction to Marine Biology - Lesson Summary"]},{"name":"Module","details":"Marine Ecology and Conservation","description":"This module will teach you about marine invertebrates and vertebrates, marine populations and communities, marine ecology, food chains, and food webs. The damaging impact of human activities on marine life and marine conservation are also discussed.","topics":["Marine Ecology and Conservation - Learning Outcomes","Marine Invertebrates and Vertebrates","Marine Ecology","Impact of Human Activities on Marine Life","Marine Ecology and Conservation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Marine Biology - Course Assessment"]}]}