{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/5125","title":"Understanding the Criminal Laws in the UK","totalEnrolled":"1,160","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online law course provides an overview of the UK’s criminal justice system used to prosecute suspects.","description":"Criminal law in the UK is administered through complex and highly regulated processes, which can also involve prosecutions of violations of international law through international tribunals such as the International Criminal Court (ICC). If you are interested in criminal justice, this course explains how to successfully prosecute or defend those facing criminal charges. We examine criminal laws in the UK and the legal processes that uphold them.","courseOutcomes":["Define ‘crime’...","Compare civil and criminal law...","Recognise various criminal offences...","List the steps involved in crime pre...","Define ‘crime’","Compare civil and criminal law","Recognise various criminal offences","List the steps involved in crime prevention","Identify the roles and responsibilities of police","Describe the prosecution, trial and sentencing process","Indicate the differences between fatal, non-fatal and sexual offences","Explain how the criminal justice system in the United Kingdom works","Define ‘crime’...","Compare civil and criminal law...","Recognise various criminal offences...","List the steps involved in crime pre...","Define ‘crime’","Compare civil and criminal law","Recognise various criminal offences","List the steps involved in crime prevention","Identify the roles and responsibilities of police","Describe the prosecution, trial and sentencing process","Indicate the differences between fatal, non-fatal and sexual offences","Explain how the criminal justice system in the United Kingdom works"],"courseDescription":"<p>This course provides a comprehensive view of crime and criminal law in the United Kingdom. We compare civil and criminal law and outline different categories of criminal offences. Then we discuss significant elements of crimes and their definitions and characteristics. The course identifies different types of inchoate offences and accomplices. We lay out the theoretical foundations of various crime prevention strategies.</p><p>Police are the first line of defence against crime and play a crucial role in providing security in almost every country. This course explores every aspect of police work and outlines the factors that influence the decision to prosecute. Furthermore, we delve into trials, trial roles, evidence, juries and the appeals system. We also go over the procedures, aims and determining factors of sentencing.</p><p>The course compares fatal, non-fatal and sexual offences as we distinguish between crimes like murder and manslaughter. We then examine the characteristics of theft, blackmail, robbery, burglary and ‘white-collar’ crime before moving on to terrorism, property crimes, cybercrime, piracy and war crimes. The course then discusses prisons and probation services. This law course explains the UK’s criminal justice system so sign up to understand the laws and supporting legal systems designed to protect society from crime.</p><a href=\"https://alison.com/resume/courses/5125\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5125\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"UK Criminal Laws","description":"This module will look at all aspects of UK criminal laws. You will learn about key elements of crime, including their definitions, concepts, and characteristics, as well as the various types of offences. You will also learn about the functioning of the UK justice system.","topics":["UK Criminal Laws - Learning Outcomes","Introduction to Criminal Law","Prosecution, Trial and Sentencing","Fatal, Non-Fatal and Sexual Offences","Other Aspects of Criminal Law","UK Criminal Laws - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding the Criminal Laws in the UK - Course Assessment"]}]}