{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3433","title":"Understanding Feminist Poetry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Words can change the world and this free online course covers the feminist poets who altered the way we see gender.","description":"This free online course explains the impact that feminist poetry had on the feminist movement and the world. What defines such verse and what makes it distinctive? We take you through the genre’s distinctive features and themes to help you understand how it challenged the rules governing both poetry and society. We focus on luminaries like Maya Angelou and Sylvia Plath to make clear how such exceptional poets changed the way we see gender.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Feminist poetry exploded as a movement in the second half of the twentieth century. During the 1960s, many writers challenged traditional gender roles and even the morality surrounding poetry itself. Before this wave of writing became popular, it was widely held that women and the female experience were not compatible with verse. This concept endured until the advent of ‘second-wave’ feminism, a cultural watershed movement that began in the ‘60s that saw women fighting for equal treatment and civil rights. On the other hand, women poets created structures to support each other while ultimately questioning the notions behind poetry itself. We take you through the exciting events that led to the rise of feminist poetry and explain how this shift in artistic thinking broke down the constraints surrounding all poetry.</p><p>We begin by giving you some background to the emerging feminist movement and its context, starting with a breakdown of the different ‘waves’ that define its activism at various points in its evolution. We describe the role of the first wave in convincing those of the second wave to rise up and make a difference with poetry. We then delve into the key features that make feminist poetry unique and introduce you to some riveting feminist poets like Maya Angelou and Adrienne Rich. We study each individually and examine their poetic influence and impact on the world. We then conduct a close reading of some of their poems, with a particular focus on Angelou’s ‘Phenomenal Women’.</p><p>The course then moves on to the Sylvia Plath and P.K. Page, paying close attention to their lives and how their experiences were echoed in their poetry. Along with these two renowned artists, we explore the historical and literary context that influenced the likes of Judith Wright as we analyze her poem ‘Woman to Man’ to discover its deeper meanings. This course offers insight into feminism via its poetry to illustrate how these verses spread new ideas about gender and justice. We hope to inspire you with the craft and courage of these poetic giants as you come to understand their role in creating the world you know today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}