{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3663","title":"Understanding Data Representation and Plotting in Biostatistics","totalEnrolled":"2,416","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the methods of presenting and plotting data in stats with this free online biology course.","description":"Are you familiar with the process of obtaining an accurate picture from a large number of data points? This course demonstrates how to use statistical techniques to summarize the characteristics of a data set to draw meaningful conclusions. Study the various methods for presenting information in the form of charts and graphs. Discover how to use R programming for statistical analysis, graphical representation, and data reporting.","courseOutcomes":["Define the concepts of descriptive a...","List the various types of quantitati...","Identify the significance of data re...","Describe the procedure for calculati...","Define the concepts of descriptive and inferential statistics","List the various types of quantitative and qualitative data","Identify the significance of data representation","Describe the procedure for calculating arithmetic and geometric mean","Indicate the geometric mean's relative strength over the arithmetic mean","Compute the variability of data using absolute and standard deviation","Explain the process of calculating the standard error of the mean","Outline the practical significance of the standard deviation","Describe the procedure for calculating the Z-score","Discuss the methods of assessing the skewness of statistical data","State the process of determining the moments of statistical data","Explain the methods of data plotting using R-programming","Define the concepts of descriptive a...","List the various types of quantitati...","Identify the significance of data re...","Describe the procedure for calculati...","Define the concepts of descriptive and inferential statistics","List the various types of quantitative and qualitative data","Identify the significance of data representation","Describe the procedure for calculating arithmetic and geometric mean","Indicate the geometric mean's relative strength over the arithmetic mean","Compute the variability of data using absolute and standard deviation","Explain the process of calculating the standard error of the mean","Outline the practical significance of the standard deviation","Describe the procedure for calculating the Z-score","Discuss the methods of assessing the skewness of statistical data","State the process of determining the moments of statistical data","Explain the methods of data plotting using R-programming"],"courseDescription":"<p>Biostatisticians play a unique role in protecting public health and improving people's lives. This course discusses the significance of plotting data to visualise variation or demonstrate relationships between variables. It begins by describing how statistics are used in data gathering, organisation, analysis, and interpretation. You will learn about various types of statistical studies as well as the process of selecting pre-arranged observations from a population in the form of a sample. In addition, you will also understand the importance of biostatistics in the development, implementation, and application of statistical methods in medical research. The concepts of descriptive and inferential statistics are then discussed. You explore the process of describing and making predictions from data. Additionally, the methods for summarising the characteristics of a data set in order to draw meaningful conclusions using statistical techniques are explained. Following that, you study the methods for calculating the values of the same and different units.</p><p>The next section deals with the main differences and the process of arithmetic and geometric calculation. Learn how to calculate the range, absolute mean, and standard deviation. In addition, you will study the process of determining the spread of data points from the centre using measures of variability. Following that, the procedure for calculating the standard error of the mean (SEM) is described. Discover the method of determining the deviations from the mean. You will also learn how to use the Z-score to calculate the chance of a score falling into a normal distribution and how to compare two scores from different normal distributions. Go on to see how to graphically display numerical group data based on quartiles using box plots. You will also discover how to use a box plot to show the form of distribution, as well as its central value and variability.</p><p>Finally, the concepts of moments, as well as the skewness of statistical distribution, are described. You will comprehend the significance of moments in studying a distribution's central tendency, dispersion, skewness, and kurtosis. Next, the process of using ‘skewness’ to measure the symmetry of distribution is explained. Discover how the variation of the distribution from the normal distribution can be measured by the skewness. Following that, you will explore how to use kurtosis to determine whether data is heavy-tailed or light-tailed in comparison to a normal distribution. In addition, you will learn how kurtosis helps in comprehending where the most information is hiding and how to analyse outliers in a given data set. Lastly, the course shows how to use the R programming language to perform a variety of statistical tasks such as data cleaning, analysis, and visualisation. It will help you understand how each form of data is processed, saved, and displayed within a device, as well as the implications for how it is used.</p><a href=\"https://alison.com/resume/courses/3663\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3663\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Representation, Central Tendency and Variability","description":"This module illustrates the process of representing and plotting data to visualize the relationship between variables. You will be taught about the process of calculating arithmetic and geometric mean and the methods of depicting the amount of dispersion in a dataset.","topics":["Data Representation, Central Tendency and Variability - Learning Outcomes","Introduction to Biostatistics","Descriptive and Inferential Statistics","Arithmetic and Geometric Mean","Measures of Variability","Data Representation, Central Tendency and Variability - Lesson Summary"]},{"name":"Module","details":"Data Distribution and R - Programming","description":"This module describes a numerical measurement that describes the relationship between a value and the mean of a group of values. You will learn about the concepts of moments and skewness in statistical distributions. The procedure for using the R programming language to perform various statistical tasks is also broken down for you.","topics":["Data Distribution and R Programming - Learning Outcomes","SEM, Z-Score, Percentiles and Box Plot","Moments and Skewness","Kurtosis and R-Programming","Data Distribution and R-Programming - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Data Representation and Plotting in Biostatistics - Course Assessment"]}]}