{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2859","title":"Understanding Proteomics","totalEnrolled":"1,887","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the functions and properties of proteins, and the uses of mass spectrometry in this free online course.","description":"The different functions and properties of amino acids and proteins, and the applications of modern protein-related technology are all discussed in this free online course in proteomics. You will also master the basics of mass spectrometry, its applications, and the various tools used in the study of bio-molecular interactions and the structure of proteins.","courseOutcomes":["Discuss the properties of amino acid...","State the aims of proteomic studies...","Outline the steps involved in proteo...","Explain why cyanine dyes are used fo...","Discuss the properties of amino acids","State the aims of proteomic studies","Outline the steps involved in proteome analysis","Explain why cyanine dyes are used for labelling samples","Highlight the key concepts in mass spectrometry","Summarise the methods for studying protein-protein interactions","Discuss the concepts of interatomics","State the principles of systems biology","Discuss the properties of amino acid...","State the aims of proteomic studies...","Outline the steps involved in proteo...","Explain why cyanine dyes are used fo...","Discuss the properties of amino acids","State the aims of proteomic studies","Outline the steps involved in proteome analysis","Explain why cyanine dyes are used for labelling samples","Highlight the key concepts in mass spectrometry","Summarise the methods for studying protein-protein interactions","Discuss the concepts of interatomics","State the principles of systems biology"],"courseDescription":"<p>This free online course in proteomics will teach you the various significant applications of protein-related technology, revealing the positive impact they have had in the large-scale study of proteins. The first section will discuss the basics of amino acids and proteins. You will also make comparisons between genomics (the study of the structure, function, evolution, mapping and editing of genomes) and proteomics, looking at the concepts of genome-sequencing projects and various technological approaches to understanding proteomic techniques for biological and clinical applications.</p><p>Next, you will learn how to retrieve the sequence of a gene and how to compare multiple sequences to study evolutionary relationships. The basics of mass spectrometry (an analytical technique that is used to measure the mass-to-charge ratio of ions) and its applications, as well as various methods used in the study of bio-molecular interactions, are also discussed. There will be series of laboratory demonstrations that reveal the practical applications of some proteomic techniques. Then, you will analyze protein interactions and microarrays as well as the aims of systems biology (the computational and mathematical analysis and modelling of complex biological systems as a whole).</p><p>Finally, you will be introduced to some applications of bioinformatics tools, where you will discern how the structure of proteins can be studied using them. Ethics in publishing and research will be highlighted, and you will examine examples of the major types of scientific misconduct and their consequences. This course will be highly beneficial to anyone in the fields of bioengineering, genetic engineering, biotechnology and other related disciplines.</p><a href=\"https://alison.com/resume/courses/2859\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2859\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Proteomics","description":"In this module, you will be introduced to the subject of proteomics. The history of proteomics will be highlighted and you will learn about the properties of amino acids, proteins and protein-related technology, considering how they have driven the field of proteomics. Basic techniques commonly used in the study of proteins will also be discussed.","topics":["Proteomics - Learning Outcomes","Amino Acids and Proteins","Proteins and Proteomics","Techniques to study Proteins and Proteome","Difference Gel Electrophoresis","Bioinformatics","Proteomics - Lesson Summary"]},{"name":"Module","details":"Protein Interactions","description":"In this module, you will study the basics of mass spectrometry and its applications in the field of proteomics. You will also learn about the methods used in the study of protein-to-protein interactions as well as the various tools used in the study of bio-molecular interactions and the structure of proteins.","topics":["Protein Interactions - Learning Outcomes","Mass Spectrometry","Protein Interactions and Micro-arrays","Protein Interactions and Systems Biology","Bioinformatic Tools","Ethics in Research and Publication","Protein Interactions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Proteomics - Course Assessment"]}]}