{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3235","title":"Understanding the Relevance of Poetry","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online poetry course enriches your understanding of verse through close study of its forms and functions.","description":"This free online poetry course will demonstrate the importance of verse as a medium of higher expression. We will explore poetic devices and forms used to convey subtle meanings. In addition to close reading of specific works, you will acquire an appreciation of rhythm as a poem can be ‘musical’. The skills acquired in careful poetic reading carry over to one’s approach to any form of communication, from the workplace to the home.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Poetry frees the mind to move beyond the constraints of ‘normal’ language. It is broadly considered to be a form of high art and this course establishes its importance in today’s world. We will delve into the elements that make up poetry, from voice to symbolism, in order to find its meaning and thus relevance. Beyond close reading, we will examine how verse can be affected by its wider literary and historical context. Appreciation of these elements will lead to an understanding of each poem as a whole.</p><p>This understanding leads us to study various poetic forms and functions, including odes, sonnets, epic poems and more, which use structure to tell different types of stories. We will also cover poetic devices used to emphasise meaning in each poem, such as metaphor and personification. This brings us to the ‘music’ of poetry, which is heard in its rhythm, rhyme and meter, as you learn how the pattern of syllables can audibly affect meaning.</p><p>The course pays close attention to the works of Geoffrey Chaucer and his importance as an influence and source of inspiration for many early poets. We will go through the different stages of Chaucerian writing and focus on the prologue to his famous work, ‘The Canterbury Tales’. This will entail close reading of his use of the poetic devices you mastered earlier. This course is a great learning tool for anyone who works in the field of language or values the beauty of the written word. It helps writers and marketers to unlock the power of poetic language to reach and touch a wider audience.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}