{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2959","title":"Understanding Research Methods and Approaches","totalEnrolled":"5,019","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Tackle qualitative research methods, fieldwork, literature reviews and more in this free Development Studies course.","description":"This free online course offers a general introduction to understanding different research methodologies and various approaches. Development research methods combine rigorous academic study with practical skills. You will learn the significance of linking the gap between theory and practice, where knowing how to write a persuasive proposal or budget plan is just as essential as understanding technical concepts.","courseOutcomes":["Discuss the book entitled 'The Field...","Define what a 'literature review' is...","Explain the purpose of a literature ...","Identify how to do a systematic revi...","Discuss the book entitled 'The Fieldworker and the Field'","Define what a 'literature review' is and state the different types available","Explain the purpose of a literature review","Identify how to do a systematic review of the current and available literature","Define what a 'qualitative purpose statement' is","Summarize some basic features for writing a qualitative statement","Indicate why fieldworkers carry out interviews","List the different types of interview methods","State what a 'focus group' is","Explain the considerations for using participatory methods","Recognise participatory methods in use","State what the case-study method is and when to use it","Discuss the book entitled 'The Field...","Define what a 'literature review' is...","Explain the purpose of a literature ...","Identify how to do a systematic revi...","Discuss the book entitled 'The Fieldworker and the Field'","Define what a 'literature review' is and state the different types available","Explain the purpose of a literature review","Identify how to do a systematic review of the current and available literature","Define what a 'qualitative purpose statement' is","Summarize some basic features for writing a qualitative statement","Indicate why fieldworkers carry out interviews","List the different types of interview methods","State what a 'focus group' is","Explain the considerations for using participatory methods","Recognise participatory methods in use","State what the case-study method is and when to use it"],"courseDescription":"<p>‘Understanding Research Methods and Approaches’ is a free online course that provides you with a general introduction to widely used research methods such as diary studies, case-study research and focus groups. See how researchers use multiple methods and approaches to conduct case studies and use diaries as a reflexive research tool. By taking this course, you will learn the purpose of a ‘literature study’ and how to use it to analyze a published body of knowledge through summary, classification and comparison.</p><p>Next, you will learn about qualitative research methods, what they entail and when they are most effective for undertaking research projects. How to get a community or group of people involved in the research process to increase the participatory process will be discussed in detail. Finally, this course will teach you how to analyze the data once it is collected. It will help you to develop your critical thinking expertise, as well as analytical, research, and communication skills that are globally sought-after and incredibly beneficial.&nbsp;</p><p>Those who understand the research methods in Development Studies have a wide range of career options. Careers in development research organizations, charities, lobby groups or roles in government are all possibilities. If you are interested in a career where you can create real-world change, then this course is for you. Start this course today and become an expert in understanding the various research methods and approaches in the exciting and growing field of Developmental Studies.</p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/2959\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2959\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Qualitative Research Methods","description":"In this module, you will discuss the literature study and find out why it is one of the most important stages of the research process. You will also be introduced to qualitative research methods and its many forms. Lastly, you will discuss a very famous and celebrated book titled “The Fieldworker and the Field”.","topics":["Learning Outcomes","Literature Study","M.N. Srinivas's \"The Fieldworker and the Field\"","Introducing Qualitative Research Methods","Lesson Summary"]},{"name":"Module","details":"Research Methods and Approaches","description":"This module outlines the different research methods and the many approaches that are applicable to obtain data. It explains how to do an interview, the different types available, the different participatory methods used and how to maintain field diaries.","topics":["Learning Outcomes","Introducing Qualitative Research Methods cont'd","Interviews and Focus Group Discussions","Participatory Methods and Approaches","Conducting Case Studies and Maintaining Field Diaries","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Research Methods and Approaches -  Course Assessment"]}]}