{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/3380","title":"Urban Gardening for Beginners","totalEnrolled":"2,711","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the strategies to create and maintain flourishing gardens with this free online urban gardening course.","description":"An urban garden is an excellent option for those living in a highly populated place. In this course, you will learn many popular methods for growing plants and flowers used in urban gardening and that it is possible to adapt green areas in your city home. Discover the important factors that all plants are dependent on to flourish and remain in a healthy state. We will also consider why certain plant types thrive in some places while others don't.","courseOutcomes":["Identify various garden space option...","Explain why it is crucial to have gr...","List the 12 zones of the USDA hardin...","Outline the various ingredients that...","Identify various garden space options available in your home","Explain why it is crucial to have great soil before planting","List the 12 zones of the USDA hardiness system","Outline the various ingredients that make up good soil","Indicate the different types of materials needed to create compost","Identify various garden space option...","Explain why it is crucial to have gr...","List the 12 zones of the USDA hardin...","Outline the various ingredients that...","Identify various garden space options available in your home","Explain why it is crucial to have great soil before planting","List the 12 zones of the USDA hardiness system","Outline the various ingredients that make up good soil","Indicate the different types of materials needed to create compost"],"courseDescription":"<p>Imagine walking down the street, near the downtown area of your city at dusk on a slightly windy evening. You start to notice that many homes have adorned their balconies and front patios with beautiful potted plants. Some of them have exquisite vertical gardens designed to resemble murals, landscapes or shapes. As you approach a particular house with an attractive front garden, you observe that they also have planted fruits and vegetables! You may start to ask yourself, ‘How is this possible? We are near the heart of the city’. You might believe that if you live in an urban area, you cannot grow plants, flowers, fruits or vegetables. However, this is simply not true. Did you know that researchers have found that green spaces in an urban area can have a positive impact by reducing aggressive behaviour, thus helping to lessen violence and crime? By studying this course, you will learn to create a green space in which you can grow food for yourself and your family. You will also discover how to create lovely, colourful spaces filled with green plants and eye-catching flowers.&nbsp;</p><p>We will start by considering your space options. When it comes to urban gardens, you might wonder if you have the necessary space or an appropriate place in which you can grow plants. In this course, you will learn that it is possible to adapt almost any area for a garden. If you are creative enough, there are many options for growing, even if you live in a highly-populated place. We will view the many popular methods used for urban gardening and each will be discussed in detail to help you choose which approach best fits your needs. We will then explore appropriate tools and supplies. Specific tools will help you keep plants well-trimmed and pruned, which will ultimately improve the quality of your garden. Before you buy plants that you may have in mind, it is very important that you understand what ‘hardiness’ means. We will consider in this course the 12 different USDA zones (United States Department of Agriculture) and the RHS (Royal Horticultural Society) Hardiness Rating System. Carefully studying these zones and ratings will help you choose plants that will thrive in the environmental conditions of your area.</p><p>In an urban garden, you will need to have a container or perhaps you are going to create a garden in the existing soil. Either way, you will have to prepare the soil properly. One of the most important factors to have a flourishing and beautiful garden is great soil. In order to get great soil, you must plan, test and adjust it. This course will show you how to test soils’ pH levels and what ingredients to look for. You will also learn that there are specific times in which it is optimal to plant. Anyone with an interest in learning about urban gardening will gain a lot from this material. Enrolling in this course will help first-time gardeners, urban residents and anyone thinking about creating and planting a garden in a city-type environment. It provides techniques and strategies behind creating flourishing gardens, adapting spaces for green spaces and preparing fertile soil. Groundskeepers, landscape gardeners and more can benefit from learning about the fundamentals of creating a thriving garden in an urban area.</p><a href=\"https://alison.com/resume/courses/3380\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3380\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Urban Gardening","description":"This module introduces you to a brief history of urban gardening. This section will explore the various garden tools and their specific work uses. We will also learn about how the USDA hardiness rating system works. Study the type of materials that make a high-quality compost and view how to deal with potential plant problems.","topics":["Introduction to Urban Gardening - Learning Outcomes","Introduction to Urban Gardening","Essential Gardening Tools","USDA Hardiness Rating and Budget Planning","Soil Preparation and Planning for Planting","Introduction to Urban Gardening - Lesson Summary"]},{"name":"Module","details":"Common Plant Problems and Composting","description":"In this module, you will learn about the various types of weed and pest species that bring harm to plants. Study how you can counteract and control these harmful organisms. We will also learn how we can decorate our house with colourful flowers using special techniques and methods.","topics":["Common Plant Problems and Composting - Learning Outcomes","Types of Weeds and Garden Pests","Transplanting and Common Garden UK Diseases","Creating Compost and Bottling Fruits","Drying Flowers and Collecting Plant Seeds","Common Plant Problems and Composting - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}