{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2444","title":"Urban Planning Criteria","totalEnrolled":"1,725","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you the diverse aspects and techniques of spatial analysis in regards to urban planning.","description":"This free course online course on Urban Planning Criteria covers important aspects of Landscape configuration and composition. This course explains urban growth analysis and teaches you the metrics to asses urban sprawl analysis as well as the patterns of urban growth.The course also teaches the most popular MCDA approaches and the software used in MCDA along with structures and variables involved.","courseOutcomes":["Explain how landscape composition im...","Discuss the properties of landscape ...","Describe Urban Sprawl Characterisati...","Recall patterns and metrics involved...","Explain how landscape composition impacts ecological assessments","Discuss the properties of landscape metrics and how landscape metrics are applied","Describe Urban Sprawl Characterisation","Recall patterns and metrics involved in Urban Sprawl","Define what is Multi-Criteria Decision Analysis (MCDA).","Explain the tools used for MCDA.","Explain how landscape composition im...","Discuss the properties of landscape ...","Describe Urban Sprawl Characterisati...","Recall patterns and metrics involved...","Explain how landscape composition impacts ecological assessments","Discuss the properties of landscape metrics and how landscape metrics are applied","Describe Urban Sprawl Characterisation","Recall patterns and metrics involved in Urban Sprawl","Define what is Multi-Criteria Decision Analysis (MCDA).","Explain the tools used for MCDA."],"courseDescription":"<p><span style=\"font-weight: 400;\">This free </span><span style=\"font-weight: 400;\">online </span><span style=\"font-weight: 400;\">course on Urban Planning Criteria, covers important aspects of Landscape configuration and composition and goes into depth about Landscape metrics. This course explains urban growth analysis and teaches you the metrics to asses urban sprawl analysis as well as the patterns of urban growth. The course also specifically cover metrics to asses urban growth in a gowing capital such as Shanghai.&nbsp;&nbsp;</span></p><p><span style=\"font-weight: 400;\">The course will also cover aspects involving modelling of spatial relationships which greatly entails the use of landscape metrics to determine patterns in urban sprawl and urban growth.&nbsp;</span><span style=\"font-weight: 400;\">Finally, this course will teach you about Multi-Criteria Decision Analysis (MCDA). The course explains the most popular MCDA approaches and the software used in MCDA along with structures and variables involved.</span></p><p><span style=\"font-weight: 400;\"> This free course is a valuable learning model that introduces you to the exciting world of urban planning and the necessary criteria that is needed. Any student in the engineering field of Civil Engineering and those who are interested in this field, will benefit from this course. Start the course today to uncover all the intricacies involved in understanding the field of urban planning.</span></p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/2444\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2444\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Modelling Spatial Relationships","description":"This module, Modelling Spatial Relationships, covers key aspects of Landscape metrics and the use of landscape metrics in Urban Sprawl characterisation. The module also teaches you about Multi Criteria Decision Analysis aspects.","topics":["Modelling Spatial Relationships - Learning Outcomes","Landscape Metrics and Applications","Urban Sprawl Characterisation using Landscape Metrics","Multi-Criteria Decision Analysis","Modelling Spatial Relationships - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Urban Planning Criteria - Course Assessment"]}]}