{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/2445","title":"US Presidential Election 2020","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"How well do you know policy issues ahead of the US presidential election? Test your knowledge before voting on Nov 3rd!","description":"This free online course covers the major issues in the 2020 US Presidential Election. The upcoming election is set to shape the future of America and understanding the issues surrounding this election is very important. This course presents Joe Biden and Donald Trump's positions on issues from health care, education to foreign policy and economy, showing how they will govern. Make sure you know what you are voting on!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This United States Presidential Election 2020 course begins by taking an in-depth look at domestic policy issues including education, climate change, gun control, health care, police reform, technology, and immigration. You will learn where both Joe Biden and Donald Trump stand on these key issues which affect the everyday lives and electoral votes of all Americans and the measures they intend to take over the next four years of their administration. You will then move on to learn about the issues of foreign policy and defense and the candidates’ views on the military.</p><p>The US presidential elections course then tackles the issues of government reform, housing and the economy, laying bare Biden and Trump’s thoughts on the role of the federal government, the problems with housing across the country and how tax policy differs between the two parties. Finally, the course takes you through a number of social issues facing the candidates, from abortion and criminal justice to LGBTQ+ rights and explains how each party would deal with them in government.</p><p>By the end of this course, you will have a strong understanding of all the major issues facing Joe Biden and Donald Trump in the 2020 president of the United States Election. You will know where both candidates stand on each subject and are able to make an informed decision when you cast your vote in November and help decide the future of the country with presidential election results. So why wait? Make sure you start your learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}