{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1403","title":"Working with Students with Special Educational Needs","totalEnrolled":"139,979","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your special education teaching methods with this free online course to make a greater impact in the classroom.","description":"This education course is ideal for teachers of all backgrounds. Children with special needs have different requirements, especially when it comes to classroom learning. An in-depth understanding of educational psychology can help you to better perform your role and communicate constructively with kids, including those who are harder to reach. This course can make your working day a little easier and more productive and meaningful.","courseOutcomes":["Describe the fundamentals of special...","Outline the most common disabilities...","Generate a basic individual educatio...","...","Describe the fundamentals of special education","Outline the most common disabilities encountered in the classroom","Generate a basic individual education plan (IEP) for a student with special educational needs","Describe the fundamentals of special...","Outline the most common disabilities...","Generate a basic individual educatio...","...","Describe the fundamentals of special education","Outline the most common disabilities encountered in the classroom","Generate a basic individual education plan (IEP) for a student with special educational needs"],"courseDescription":"<p>‘Special education’ means teaching that is tailored to meet the needs of learners with disabilities and challenges. This course teaches you the core elements of special education, including recent changes in educational legislation, particularly in the United States. We discuss the roles and responsibilities of teachers and trainers and explain how to develop an appropriate individual educational plan (IEP).</p><p>As a teacher or trainer, working with students with special needs requires specific skills and strategies to create and deliver effective programmes. This course describes the disabilities most frequently encountered in the classroom, which includes learning disabilities, attention deficit hyperactivity disorder (ADHD), intellectual disabilities, behavioural disorders, physical disabilities and sensory impairments. We describe each of these disabilities in detail and provide practical strategies to assist and teach students despite them.</p><p>This course suits teachers who would like to expand their skills and work with students with special education needs. It can also help parents of children with learning disabilities to understand their kids’ special situations. We can show you how to develop educational plans that can open the world to children who would struggle in silence without such training.</p><a href=\"https://alison.com/resume/courses/1403\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1403\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Special Education","description":"In this module you will learn how to correctly define special education and the main responsibilities of teachers who teach students with special educational needs. You will be introduced to the concept of least restrictive environment and how to modify assessments for students with special educational needs.","topics":["Special Education - Learning Outcomes","Special Education and Legalisation","Teachers’ Responsibilities for Special Education","The Individual Educational Plan","The Value of Inclusive Education","Categories of Disabilities","Special Education - Lesson Summary"]},{"name":"Module","details":"Learning Disabilities","description":"Learn how to correctly define learning disability and how to distinguish a learning disability from other types of disabilities. You will be introduced to strategies that can help students with learning disabilities.","topics":["Learning Disabilities - Learning Outcomes","Introduction to Learning Disabilities","Case Study: Assisting a student with a learning disability","Learning Disabilities - Lesson Summary"]},{"name":"Module","details":"Attention Deficit Hyperactivity Disorder (ADHD)","description":"This module introduces Attention Deficit Hyperactivity Disorder (ADHD) and behavioural signs exhibited by students. You will learn about the drugs that students with ADHD take to reduce their symptoms and practical problems associated with taking these drugs. The modules also describes strategies that a teacher can use to teach students with ADHD.","topics":["Attention Deficit Hyperactivity Disorder (ADHD) - Learning Outcomes","Introduction to ADHD","Teaching Students with ADHD","Attention Deficit Hyperactivity Disorder (ADHD) - Lesson Summary"]},{"name":"Module","details":"Intellectual Disabilities","description":"You will learn how to distinguish between an intellectual disability and a learning disability, and the strategies that teachers use when teaching students with intellectual disabilities.","topics":["Intellectual Disabilities - Learning Outcomes","Introduction to Intellectual Disabilities","Teaching Students with Intellectual Disabilities","Intellectual Disabilities - Lesson Summary"]},{"name":"Module","details":"Behavioural Disorders","description":"You will learn about potential types of triggers of inappropriate behaviour. You will be introduced to examples of problematic behaviour that a student with a behavioural disorder might display and strategies for teaching students with behavioural disorders.","topics":["Behavioural Disorders - Learning Outcomes","Introduction to Behavioural Disorders","Teaching Students with Behavioural Disorders","Behavioural Disorders - Lesson Summary"]},{"name":"Module","details":"Physical Disabilities and Sensory Impairments","description":"You will learn to recognise the signs of hearing loss and visual impairment and strategies for teaching students with hearing loss and visual impairment.","topics":["Physical Disabilities and Sensory Impairments - Learning Outcomes","Introduction to Physical Disabilities and Sensory Impairments","Teaching Students with Hearing Loss","Teaching Students with Visual Impairment","Physical Disabilities and Sensory Impairments - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Working with Students with Special Educational Needs Assessment"]}]}