{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1762","title":"World History - World War 1 and Its Aftermath","totalEnrolled":"7,614","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn why Britain, France, and Russia fought against Germany and Austro-Hungary in World War 1, with this free course.","description":"This free online course on world history will teach you about World War 1 and its aftermath. World War 1 resulted not only in the death of millions of soldiers and civilians but also in the political collapse of European empires and the beginning of the rise of America as a world power. In this course you will learn about the political alliances between countries in Europe and how they were pitted against Germany and Austro-Hungary.","courseOutcomes":["Identify the political alliances tha...","Describe the events such as the assa...","Discuss the great battles on the Wes...","Describe the post-war settlements at...","Identify the political alliances that formed before the war","Describe the events such as the assassination of Archduke Franz Ferdinand that led to the outbreak of the war","Discuss the great battles on the Western and Eastern fronts that decided the outcome of the war","Describe the post-war settlements at Versailles that shaped world politics for the rest of the 20th century","Identify the political alliances tha...","Describe the events such as the assa...","Discuss the great battles on the Wes...","Describe the post-war settlements at...","Identify the political alliances that formed before the war","Describe the events such as the assassination of Archduke Franz Ferdinand that led to the outbreak of the war","Discuss the great battles on the Western and Eastern fronts that decided the outcome of the war","Describe the post-war settlements at Versailles that shaped world politics for the rest of the 20th century"],"courseDescription":"<p>This course will begin by discussing the political alliances that formed before World War 1. You will learn that Australia, Canada, and India were all part of the British Empire before the war began. You will look into important events such as the assassination of Archduke Franz Ferdinand that led to the outbreak of the war. You will also learn that Libya was part of the Italian empire at the start of World War 1 and that Italy fought on the side of Britain and France.</p><p>You will then look into the battles on the Western and Eastern fronts that decided the outcome of the war. This course will also discuss the post-war settlements at Versailles that shaped world politics for decades to come. You will study the different treaties such as the Treaty of London in 1839, the Dual Alliance Treaty in 1879, the Franco-Russian Military Convention in 1892, and the Entente Cordial of 1904.</p><p>The battles of the First World War on the Western and Eastern fronts were devastating. By the end of this course you will have a much better understanding of how WW1 started and how the Treaty of Versailles concluded it. You will also have learned about some really interesting events of the post-war negotiations between the Allied Powers and Germany, and how Germany was punished for initiating the war. This is important world history, which you can learn today.</p><a href=\"https://alison.com/resume/courses/1762\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1762\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"World War 1 And Its Aftermath","description":"Learn more about World War 1 and its aftermath. This module outlines the political alliances between countries in Europe and how they pitted Britain, France and Russia against Germany and Austro-Hungary. This module also details the decisive battles of the First World War on the Western and Eastern front ends and what eventually led to Germany's defeat. Finally, this module also outlines the post-war negotiations and the Treaty of Versailles.","topics":["World War 1 and Its Aftermath - Learning Outcomes","Empires before World War 1","German and Italian Empires in 1914","Alliances Leading to World War 1","Language and Religion of the Former Yugoslavia","Assassination of Franz Ferdinand by Gavrilo Princip","The Great War Begins","Schlieffen Plan and the First Battle of the Marne","Comparing the Eastern and Western Fronts","World War 1 - Eastern Front","Battles of Verdun, Somme and the Hindenburg Line","Closing stages of World War 1","Technology in World War 1","Deaths in World War 1","Woodrow Wilson's Fourteen Points","Paris Peace Conference and Treaty of Versailles","The Treaty of Versailles and Germany","World War 1 and Its Aftermath - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 2: World War 1 and Its Aftermath - Course Assessment"]}]}