{"subjectName":"Teaching & Academics","subjectDescription":"Our free online teaching and education courses will give you the means to inspire the next generation. Education is the key to unlocking potential for a better future. With our classes, you can learn about educational psychology, which is key for improving teaching methods and fulfilling ins... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/education.jpg","resumeLink":"https://alison.com/resume/courses/1763","title":"World History - The Rise of Fascism","totalEnrolled":"5,381","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the rise of fascism in the middle of the 20th century and the division of Europe as part of the Cold War.","description":"This free online world history course will discuss the rise of fascism as a political movement in mid-20th century Europe. Fascism is a political ideology characterized by authoritarianism and nationalism. This course will teach you about the Nazi party, Adolf Hitler, and how economic chaos in Germany helped propel the party into power. It will also teach you about the build up to the second world war and the division of Europe.","courseOutcomes":["Describe the rise of the Nazi party ...","Discuss how the Nazi party turned Ge...","Describe the aggression and violence...","Identify how Mussolini turned Italy ...","Describe the rise of the Nazi party in Germany during the 1920s and 1930s","Discuss how the Nazi party turned Germany into a one-party dictatorship","Describe the aggression and violence shown by the Nazi party to neighboring countries","Identify how Mussolini turned Italy into the first fascist dictatorship","Describe the rise of the Nazi party ...","Discuss how the Nazi party turned Ge...","Describe the aggression and violence...","Identify how Mussolini turned Italy ...","Describe the rise of the Nazi party in Germany during the 1920s and 1930s","Discuss how the Nazi party turned Germany into a one-party dictatorship","Describe the aggression and violence shown by the Nazi party to neighboring countries","Identify how Mussolini turned Italy into the first fascist dictatorship"],"courseDescription":"<p>Adolf Hitler was the leader of Germany’s Nazi Party and one of the most powerful and notorious dictators of the 20th century. This course will discuss how Hitler led the rise of the Nazi party in Germany during the 1920s and 1930s. You will learn how the Nazi party turned Germany into a one-party dictatorship, and you will examine the aggression and violence shown by the Nazi party to its neighboring countries.</p><p>The Nazis were not only aggressive towards neighboring countries, but to the ethnic minorities in Germany as well. This course will look into the aggression and violence shown by the Nazi party to these ethnic minorities. You will also study the rise of Benito Mussolini in Italian politics during the 1920s and learn how Mussolini turned Italy into the first fascist dictatorship.You will then study the relationship between Hitler and Mussolini during the 1930s.</p><p>The rise of fascism unleashed an unprecedented attack on minority populations and communities, in particular, the Jewish population of Europe. This course will show you how it resulted in millions of deaths in concentration camps. By the end of this course, you will also understand how the fascist political movement in Europe during the 1920s and 1930s led to a world war and the Holocaust. So, check this course out today, and start learning some really important facts of world history.</p><a href=\"https://alison.com/resume/courses/1763\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1763\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"World History - The Rise Of Fascism","description":"Learn more about the rise of fascism as a political movement during the middle of the 20th century in Europe after World War I. This module will outline how the Adolf Hitler led the Nazi party into a position of power and turned Germany into a one-party dictatorship which they called the Third Reich. You will also learn about how Mussolini turned Italy into the fascist dictatorship and the relationship that formed between Hitler and Mussolini as the leaders of the two main fascist powers.","topics":["The Rise of Fascism - Learning Outcomes","Initial rise of Hitler and the Nazis","Hitler's Beer Hall Putsch","Hitler and the Nazis Come to Power","Night of the Long Knives","Nazi Aggression and Appeasement","Fascism and Mussolini","Mussolini becomes Prime Minister","Mussolini becomes Absolute Dictator - Il Duce","Mussolini aligns with Hitler","The Rise of Fascism - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Rise of Fascism - Revised: Course Assessment"]}]}