{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5034","title":"Basics of Compliance Management","totalEnrolled":"5,117","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to establish an effective compliance management and risk detection system.","description":"All organisations must comply with laws, rules and regulations and set standards for smooth functioning. This course will give you everything you need to ensure your business adheres to the relevant regulatory framework. You will look at the responsibilities and challenges facing the compliance department. Discover the different elements of the compliance management system and the body that sets the requirements for compliance auditing.","courseOutcomes":["Discuss the responsibility and chall...","Explain the elements of an effective...","Describe the different aspects of th...","Outline the roles and responsibiliti...","Discuss the responsibility and challenges facing a compliance department","Explain the elements of an effective compliance programme","Describe the different aspects of the compliance management system","Outline the roles and responsibilities of a compliance officer","Indicate the process of conducting a compliance audit","State the differences between ethics and compliance","List the principles and objectives of risk management","Summarise the risk management process","Discuss the responsibility and chall...","Explain the elements of an effective...","Describe the different aspects of th...","Outline the roles and responsibiliti...","Discuss the responsibility and challenges facing a compliance department","Explain the elements of an effective compliance programme","Describe the different aspects of the compliance management system","Outline the roles and responsibilities of a compliance officer","Indicate the process of conducting a compliance audit","State the differences between ethics and compliance","List the principles and objectives of risk management","Summarise the risk management process"],"courseDescription":"<p>Compliance management is the continuing process of monitoring and evaluating systems in an organisation to ensure they abide by legal requirements and accepted standards. You will start by looking at compliance, compliance management programmes and the benefits they provide to institutions. Learn about the functions of an effective board and management and dive into the five fundamental components of compliance. Familiarise yourself with the foundations of the ‘compliance house’ concept and how to create the structure of a company.</p><p>Next, learn how to conduct a compliance audit with its elements and principles. We will discuss the functions of the International Standards of Supreme Audit Institution (ISSAI) to help guide your company and employees. Find out the various responsibilities of ethics and compliance practitioners and look at the different types of values and rules. Gain a deeper understanding of risk management and the forms of risk in order to analyse, assess and identify them quickly.</p><p>After completing this course, you will have the knowledge and skills to design and implement risk and compliance strategies, policies, procedures and risk assessments. Whether you are a professional in corporate governance, compliance management or a student, you will find this exciting course beneficial. Studying compliance management will enable you to apply the principles in your organisations to build trust and avoid legal issues. Why wait? Start learning today and improve your professional skills.</p><a href=\"https://alison.com/resume/courses/5034\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5034\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Compliance Management","description":"In this module, you will learn about the different elements of the compliance management system and the advantages of compliance for a business. Study the aims and guiding principles of risk management as well as the duties and responsibilities of the compliance officer.","topics":["Compliance Management - Learning Outcomes","Introduction to Compliance Management","Compliance Auditing and Ethics","Risk Management","Compliance Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Compliance Management - Course Assessment"]}]}