{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5530","title":"Basics of Engineering Management","totalEnrolled":"1,154","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master engineering management in this free online course that explains how to use strategic planning to make decisions.","description":"This course goes through the characteristics and elements of engineering management. We provide the training, skills and knowledge required to become a successful engineering manager. The course explores the role of strategic planning in decision-making to provide you with financial and entrepreneurial skills. Sign up to learn how to move up the ladder in any organisation as an engineering manager capable of planning projects of all sizes.","courseOutcomes":["Define ‘engineering management’ and ...","Define ‘decision analysis’ and expla...","Identify the various components of t...","Discuss  the different elements of c...","Define ‘engineering management’ and describe the skills required to become an engineering manager","Define ‘decision analysis’ and explain how it can be used to reach more informed conclusions","Identify the various components of the strategic planning process","Discuss  the different elements of cost accounting and risk management","Summarise the role of supply chain management in streamlining business operations","List the principles and fundamentals of financial management accounting","State the functions and principles of marketing management","Outline the role of innovation and technology in product management","Describe the concept and components of an entrepreneurial mindset","Identify the various types of contract and business law","Summarise the concepts that define ‘systems engineering’","Define ‘engineering management’ and ...","Define ‘decision analysis’ and expla...","Identify the various components of t...","Discuss  the different elements of c...","Define ‘engineering management’ and describe the skills required to become an engineering manager","Define ‘decision analysis’ and explain how it can be used to reach more informed conclusions","Identify the various components of the strategic planning process","Discuss  the different elements of cost accounting and risk management","Summarise the role of supply chain management in streamlining business operations","List the principles and fundamentals of financial management accounting","State the functions and principles of marketing management","Outline the role of innovation and technology in product management","Describe the concept and components of an entrepreneurial mindset","Identify the various types of contract and business law","Summarise the concepts that define ‘systems engineering’"],"courseDescription":"<p>Do you want to start a career in engineering management? This course covers the basics of engineering management and takes you through the role, function and qualities needed to become an engineering manager. We start off with a definition of the term ‘engineering management’ and what it encapsulates. We then lay out their career prospects and identify the qualities and skills needed to succeed as an engineering manager.</p><p>Are you curious about the role of an engineering manager in an organisation? An engineering manager combines the technical skills of an engineer with the organisational and leadership expertise of a manager on the line. We explain several decision-making and strategic planning techniques that can help you make better and more informed decisions. We show you how evaluation of risks and streamlining operations are crucial components of the engineering manager’s work. The course also examines the financial, marketing and technological aspects of this career that keep engineering managers ahead of their market competition.</p><p>The concept of entrepreneurship is creating a lot of buzz in today’s business world. We discuss the skills required to feed the spirit of entrepreneurship and make the difference between success or failure as a small business owner. We go over some key legal and technical aspects of engineering management and link them to entrepreneurship. Engineering management is an important concept as it enhances an engineer's technical expertise by adding depth in four areas: ethical decision-making, diverse team management, economic viability in technological ideas and enhanced problem-solving skills. In an ever-changing world that demands evolving expertise, this engineering management course can add a much needed boost to your professional portfolio. Sign up to learn how to take your engineering career to its next level by mastering leadership principles and management skills.</p><a href=\"https://alison.com/resume/courses/5530\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5530\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Engineering Management","description":"In this module, we will go through the rudimentary concepts of engineering management. We will examine the leadership skills and ethics required at the workplace in engineering management. An analysis of how to make successful long-term decisions, streamline processes, and manage the supply chain will be provided.","topics":["Fundamentals of Engineering Management - Learning Outcomes","Introduction to Engineering Management","Engineering Management Career","Decision Analysis","Strategic Planning","Cost Accounting and Risk Management","Operations and Supply Chain Management","Fundamentals of Engineering Management - Lesson Summary"]},{"name":"Module","details":"Components of Engineering Management","description":"In this module, we will be going through some of the building blocks and functions of engineering management. The role of finance, marketing and technology will be discussed in detail when it comes to management theory. We will also be discussing the spirit of entrepreneurship along with the legal aspects when it comes to management.","topics":["Components of Engineering Management - Learning Outcomes","Financial Accounting and Management","Marketing Management","Management and  Technology","The Spirit of Entrepreneurship","Business Law","Systems Engineering","Components of Engineering Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Engineering Management - Course assessment"]}]}