{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5366","title":"Becoming a Social Inclusion Officer","totalEnrolled":"701","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Join the fight for equality and learn how to become a social inclusion officer in this free online DEI training course.","description":"Do you want to make a positive impact on your community by becoming a social inclusion officer (SIO). SIOs work to identify and eliminate barriers to full participation in society faced by marginalised groups or disadvantaged groups such as the disabled or the poor. This course provides the training you need to bring diversity, equity and inclusion (DEI) to workplaces and classrooms. Sign up to learn how to make life more fair for everyone.","courseOutcomes":["Define ‘social inclusion’...","Explain how social exclusion can aff...","Outline the role and responsibilitie...","Analyse the impact of unemployment o...","Define ‘social inclusion’","Explain how social exclusion can affect various groups, including young people, the unemployed, people with disabilities and migrants","Outline the role and responsibilities of an SIO in promoting social inclusion and equality for marginalised groups","Analyse the impact of unemployment on financial hardship, mental health and behaviour","Evaluate the various strategies for reducing service exclusion, including addressing the ‘main drivers’ of exclusion such as access to technology and transport","Explain the importance of community engagement in promoting social inclusion for people with mental health problems","Describe the barriers that can lead to service exclusion","Identify the various factors that contribute to social exclusion","Outline the different forms of service exclusion","Define ‘social inclusion’...","Explain how social exclusion can aff...","Outline the role and responsibilitie...","Analyse the impact of unemployment o...","Define ‘social inclusion’","Explain how social exclusion can affect various groups, including young people, the unemployed, people with disabilities and migrants","Outline the role and responsibilities of an SIO in promoting social inclusion and equality for marginalised groups","Analyse the impact of unemployment on financial hardship, mental health and behaviour","Evaluate the various strategies for reducing service exclusion, including addressing the ‘main drivers’ of exclusion such as access to technology and transport","Explain the importance of community engagement in promoting social inclusion for people with mental health problems","Describe the barriers that can lead to service exclusion","Identify the various factors that contribute to social exclusion","Outline the different forms of service exclusion"],"courseDescription":"<p>If you've ever stood up for someone facing discrimination, you might make a good social inclusion officer (SIO). Professional social inclusion officers work to identify and remove discrimination that creates barriers to full social participation for the marginalised members of society. It is important for all individuals to feel connected and valued within society because people who feel included are better able to contribute to their society without fear of being snubbed or pushed aside. This course is designed to equip you with the knowledge and skills you need to effectively advocate for and support marginalised groups in your workplace and community. We begin the course by providing an overview of the concept of social inclusion to establish its contemporary importance and purpose. SIOs work hard to ensure that diversity, equity and inclusion (DEI) are respected in organisations and wider society. We then explore the dimensions of social exclusion and examine its causes and possible remedies.</p><p>People who are socially excluded are deprived of the opportunities they need to escape poverty and the chance to use their voices to assert their rights. We describe the impact that social exclusion can have on individuals and communities to help you develop strategies to address issues like discrimination and injustice. We explain the social, economic and political factors that shape our world and trace their impact on issues of inclusion and equality. This course not only covers theoretical concepts but also provides you with the practical skills and knowledge required to pursue a rewarding career in this field. We lay out the various roles and responsibilities of a social inclusion officer and identify the various challenges that SIOs may face on the job. We guide you through the steps taken to overcome challenges, starting with the research and analysis required to locate social exclusion and inclusion issues before addressing them.</p><p>The course then traces the relationship between social inclusion and social mobility to help you understand how DEI principles can help people overcome the barriers raised by social exclusion. We then demonstrate the important link between social inclusion and mental health as social exclusion can compromise the latter as it leads to alienation and ennui. We wrap up the course by exploring the various communication strategies and techniques that can be used to promote social inclusion in the workplace, classroom or wider community. This course explains the issues facing marginalised groups in our society and provides the opportunity to learn how to address them and make a difference in your community. We draw on the principles that drive efforts to promote diversity, equity and inclusion to help you boost your personal and professional development as a manager, SOI or DEI expert. Sign up to ‘be the change you want to see in the world’.</p><a href=\"https://alison.com/resume/courses/5366\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5366\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Promoting Social Inclusion","description":"This module introduces you to the concept of social inclusion, its importance, and the factors that contribute to it. You'll learn about the role and responsibilities of a social inclusion officer and the relationship between social inclusion and social mobility, including its connection to mental health.","topics":["Promoting Social Inclusion - Learning Outcomes","Social Inclusion Concepts","Social Inclusion, Social Mobility and Mental Health","How to Promote Inclusion","Promoting Social Inclusion - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Becoming a Social Inclusion Officer"]}]}