{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3278","title":"Bridge Navigational Watch and Record-Keeping","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the maritime principles used to make deck logbook entries during navigational watches in this free course.","description":"This course on performing a navigational watch and record-keeping emphasises the importance of understanding a ship's handling characteristics and bridge equipment. You will gain insights into the basic obligations of the Officer of the Watch for the Bridge and the use of electronic navigation aids during watchkeeping. By the end of this course, you will be better informed about recordkeeping and making correct logbook entries.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The Master of the Watch is responsible for the correct execution of the navigation watch and the officer in charge must comply at all times with the requirements of the International Convention for the Safety of Life at Sea (SOLAS) 1974 and the International Regulations for Preventing Collisions at Sea 1972 (COLREG72). It is not sufficient to provide instruction, standing orders, night orders and other directions. The officer must monitor the officers aboard to ensure all regulations, procedures and Bridge resource management techniques are being carried out correctly. This essential navigation and record-keeping course explains the basic knowledge required for ship handling, while emphasising how essential skills are gained from study, observation and experience. You will also get to study the responsibilities of the Master of the Watch and chief officers on board in understanding the ship handling characteristics of the assigned vessel.</p><p>Moving on, the course dives into the basic obligations of the officer in charge of the navigational watch in line with the SOLAS 1974. You will learn about the need for the watchkeeper to station a person to steer the ship as well as having to put the steering into manual control in order to handle any potentially hazardous situation safely. You will understand the importance of detailed knowledge of COLREG72 for all watch officers at various levels as you will be taken through the implementation of its provisions. You will study the structure of the Collision Regulations designed to ensure that decisions are taken promptly when there is a risk of collision and explore the divisions of COLREG 72 into the respective parts and annexes.</p><p>There has been a rapid development of sophisticated navigational equipment including advances in RADAR capabilities. The accuracy and functionality of this equipment have increased considerably. This course illustrates the need for Officers of the Watch to have the proper certification for using such equipment. You will explore good navigation practices such as making regular checks,and instances when the Officer of the Watch must notify the Master when in doubt of the suitable course of action for the safety of the ship. You will learn about the procedures for turning over and taking over the Watch, along with how relieving duties should be carried out professionally. Finally, the course takes you through the process of record-keeping in navigational watches. You will explore the variety of records that are kept, especially the deck logbook and the types of entries made at sea. This in-depth course is ideal for kickstarting your career in Bridge navigational watches or if you simply have an interest in such maritime activities. So go ahead and register for this course today to begin your next learning journey!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}