{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/2253","title":"Chemical Safety; Fires and Explosions","totalEnrolled":"5,652","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the classification of fires and explosions, as well as the uses of various types of fire extinguishers.","description":"This free online Chemical Safety; fires and explosions course will teach you about the various classifications of fires and explosions, as well as the flammability characteristics of fires, and the types of fire extinguishers.You will also learn about the anatomy of fire extinguishers, appropriate fire extinguishers for different types of fires, electrostatic ignition and the general design methodology to prevent electrostatic ignition.","courseOutcomes":["Discuss the definitions and differen...","Identify the different modes of heat...","Explain the concept of explosions an...","Discuss flammability characteristics...","Discuss the definitions and differences between fires and explosions.","Identify the different modes of heat transfer through which fire or heat generated can be transmitted","Explain the concept of explosions and their classifications.","Discuss flammability characteristics and parameters involved in fire explosions","Identify the different types of fire extinguishers","Identify the appropriate method for the use of fire extinguishers","Discuss some problems related to the fire and explosions.","Explain the various designs to prevent fire and explosions","Discuss the impact of streaming current and controlling static electricity.","Identify the general design methodologies to prevent electrostatic ignition","Discuss the definitions and differen...","Identify the different modes of heat...","Explain the concept of explosions an...","Discuss flammability characteristics...","Discuss the definitions and differences between fires and explosions.","Identify the different modes of heat transfer through which fire or heat generated can be transmitted","Explain the concept of explosions and their classifications.","Discuss flammability characteristics and parameters involved in fire explosions","Identify the different types of fire extinguishers","Identify the appropriate method for the use of fire extinguishers","Discuss some problems related to the fire and explosions.","Explain the various designs to prevent fire and explosions","Discuss the impact of streaming current and controlling static electricity.","Identify the general design methodologies to prevent electrostatic ignition"],"courseDescription":"<p>In this course, you will learn about fires and explosions, as well as a look at the various modes of heat transfer. The characteristics of flammability, as well as the different classifications of explosions will also be covered in this course. Then, the course will teach you about the classifications of fires, and also look at the different types of fire extinguishers.</p><p>Then, this course will teach you about the anatomy of the fire extinguishers, and look at what type of fire extinguisher is appropriate for different types of fire. You will also learn about the process of vacuum and pressure purging with impure nitrogen. Lastly, this course will teach you about electrostatic discharge, and the general design methodology to prevent electrostatic ignition.</p><p>This course is helpful for learners who want to understand saftey for fires and explosions, as well as the various modes of heat transfer. You will also learn about how fires and explosions can be classified, and also learn about the flammability characteristics of fire. Begin this course now to understand the anatomy of fire extinghuishers, and how they are used in extinguishing fires.</p><a href=\"https://alison.com/resume/courses/2253\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2253\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Fire and Explosions","description":"In this module, you will be introduced to fires and explosion, as well as modes of heat transfer, and also, the characteristics of flammability. You will also be introduced to the various classifications of explosions, the classifications of fire, and the types of fire extinguishers.","topics":["Introduction to Fire and Explosions - Learning Outcomes","Fire and Explosions: Introduction","Fire and Explosions: Flammability Characterisitics","Explosion and its Classification I","Explosion and its Classification II","Fire Extinguishers I","Introduction to Fire and Explosions - Lesson Summary"]},{"name":"Module","details":"Prevention of Fire and Explosions","description":"In this module, you will be introduced to the anatomy of the fire extinguisher, as well as vacuum and pressure purging with impure nitrogen. You will also be introduced to electrostatic discharge, and general design methodology to prevent the electrostatic ignition.","topics":["Prevention of Fire and Explosions - Learning Outcomes","Fire Extinguishers II","Problems Related to Fire and Explosion","Designs to Prevent Fire and Explosion: Inerting and Purging","Designs to Prevent Fire and Explosion: Static Electricity","General Design Methods to Prevent Fire","Prevention of Fire and Explosions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Chemical Safety; Fires and Explosions  - Course Assessment"]}]}