{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/2254","title":"Chemical Safety; Relief and Risk Assessment","totalEnrolled":"675","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the development of sprinkler systems, as well as the classification of hazards, and risk assessment.","description":"This free online relief and risk assessment course will teach you about the design and development of sprinkler systems, as well as how sprinkler systems are installed and the various types. You will also learn about relief sizing, and also look at the definition of hazards, and the classifications of hazards. The course will also teach you identifying hazards, and the health and safety at work act, and various tools for risk assessment.","courseOutcomes":["Discuss the various designs of sprin...","Explain the summary of the various t...","Discuss an introduction and the impo...","Identify the various sources of over...","Discuss the various designs of sprinkler systems.","Explain the summary of the various types of sprinkler systems.","Discuss an introduction and the importance of relief system devices.","Identify the various sources of overpressure","Discuss the introduction to various scenarios involving relief systems","Discuss the importance of relief sizing.","Explain the concept of hazards and how hazards are identified.","Identify hazard identification methods and hazard analysis","Explain the concepts of risks and risk assessment.","Identify the various tools used in risk assessment","Discuss the various designs of sprin...","Explain the summary of the various t...","Discuss an introduction and the impo...","Identify the various sources of over...","Discuss the various designs of sprinkler systems.","Explain the summary of the various types of sprinkler systems.","Discuss an introduction and the importance of relief system devices.","Identify the various sources of overpressure","Discuss the introduction to various scenarios involving relief systems","Discuss the importance of relief sizing.","Explain the concept of hazards and how hazards are identified.","Identify hazard identification methods and hazard analysis","Explain the concepts of risks and risk assessment.","Identify the various tools used in risk assessment"],"courseDescription":"<p>In this course, you will learn about the design and development of sprinkler systems, as well as the various types of sprinkler systems. The process of installation of sprinkler systems and an introduction to relief system will also be covered in this course. Then, the course will teach you about the various types of relief systems, and then introduce you to relief scenarios.</p><p>Then, this course will teach you about the concept of relief sizing, and the definition of hazards and how hazards are classified. You will also learn about the various methods which are used to identify hazards. Lastly, this course will teach you about the health and safety at work act, and various tools available for risk assessment in the workplace.</p><p>This course is helpful for learners who want to understand how sprinkler systems are designed and installed, as well as the development process of sprinkler systems. The learner will also be able to understand the importance of relief systems and look at some relief scenarios. Begin this course now to understand the various classifications and methods of identifying hazards.</p><a href=\"https://alison.com/resume/courses/2254\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2254\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Reliefs","description":"In this module, you will be introduced to the design of sprinkler systems, as well as the types and installation of sprinkler systems. The topic also examines an introduction to relief systems, the various types of relief systems, and an introduction to relief scenarios.","topics":["Introduction to Reliefs - Learning Outcomes","Sprinklers I","Sprinklers II","Introduction to Reliefs","Type of Reliefs","Relief Scenario","Introduction to Reliefs - Lesson Summary"]},{"name":"Module","details":"Hazards and Risk Assessment","description":"In this module, you will be introduced to relief sizing, the definition of hazards, and its classifications, as well as the methods of identifying hazards. You will also be introduced to the health and safety at work act, and various tools available for risk assessment.","topics":["Hazards and Risk Assessment - Learning Outcomes","Relief Sizing","Hazard and Hazard Identification: Introduction","Hazard Identification Methods and HAZOP","Safety Reviews and Risk Assessment I","Safety Reviews and Risk Assessment II","Hazards and Risk Assessment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Chemical Safety; Relief and Risk Assessment - Course Assessment"]}]}