{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3868","title":"Classical Leadership and Decision-Making","totalEnrolled":"1,371","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course reveals the secrets to good leadership development, good decision-making techniques.","description":"If you have always wanted to learn the crucial fundamentals of great, effective leadership, then this free online leadership course is the perfect start. Explore what good management and leadership entails, and how to apply practical methods from this course to better your decision-making skills and take your leadership from good to great by inspiring others to constantly do better and aim higher for the sake of themselves and the team.","courseOutcomes":["Define and discuss different types o...","Discuss methods used in making great...","List Plato's Four Cardinal Virtues...","Describe several cultural approaches...","Define and discuss different types of decisions","Discuss methods used in making great decisions","List Plato's Four Cardinal Virtues","Describe several cultural approaches to ethical leadership","Identify models and their inclusion in what followers want","Explain developing compassionate leadership","Analyze the challenges of leadership","Define and discuss different types o...","Discuss methods used in making great...","List Plato's Four Cardinal Virtues...","Describe several cultural approaches...","Define and discuss different types of decisions","Discuss methods used in making great decisions","List Plato's Four Cardinal Virtues","Describe several cultural approaches to ethical leadership","Identify models and their inclusion in what followers want","Explain developing compassionate leadership","Analyze the challenges of leadership"],"courseDescription":"<p>In our personal lives, decision-making can involve determining many things, such as where we live, what foods we eat, and who our friends are. In business, decision-making can revolve around the products and services that a company offers, the markets it serves, the people it hires, and so on. In this leadership certification, we will look at the decision-making process, paying close attention to the basic decision types, tools, methods, and insights to help you quickly learn how it involves both logic and emotion. The content included teaches you practical tools to quickly determine the type of decision you are trying to make, methods of approach and the ways to effectively engage your teams in the process. Decision-making is often characterized as both an art and a science. You will want to trust your instincts, but also approach your decisions more methodically when you can - all including taking a balanced approach and considering multiple factors.</p><p><br>What does it mean to be an ethical leader? In this section, we study how our culture influences how we&nbsp; view and value the individuals who represent the ideas, qualities, and ideals of ethical leadership. We begin by exploring the classical Greek philosophical tradition of virtuous leadership in accordance with Plato's Four Cardinal Virtues and Aristotle's views on leadership and virtue. These virtue-based approaches to moral leadership provide a framework that we can use to identify the characteristics or qualities of a virtuous and ethical leader: someone who lives a virtuous and ethical life based on leadership and service. The following part of the course investigates the ways we have applied and interpreted classical Greek virtues across time and culture. We explore how cultures conceptualize the virtuous leader and the impact culture has on leadership as a concept.</p><p><br>In the last part of this leadership training, we consider the traits or essential qualities for good leadership: honesty, moral courage and -vision, compassion, fairness, intellectual excellence, willingness to listen to others, creative thinking, aesthetic sensitivity, good timing, and selflessness. While these leadership elements frequently overlap with the classical ideals of virtuous leadership, the correlation is not always direct or complete. This section is of extreme importance because it makes distinct links between the virtues described by Plato and Aristotle. If you are in a leadership position, keen on understanding the psychology of good leadership, or progressing in your career and wanting to refine your leadership skills, then this leadership course will allow you to explore the theory behind great virtuous leadership and how to put it into practice on a daily basis.</p><a href=\"https://alison.com/resume/courses/3868\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3868\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"A Framework for Decision-Making","description":"In this module, you'll understand why the central part of managing an organization, process, or project is decision-making. We'll introduce you to the basics of decision-making, including an overview of various approaches, considerations, and challenges.","topics":["Learning Outcomes","Understanding Decision Making","Faulty Decision Making","Decision Making in Groups","Lesson Summary"]},{"name":"Module","details":"Making Great Decisions","description":"There are many aspects to decision-making and multiple factors to consider when weighing choices. In this module, you will dive deeper into the decision-making process, and learn techniques to help you make the best choices to reach your goals.","topics":["Learning Outcomes","Making Great Decisions","How to Make Better Decisions","Decision Making","Lesson Summary"]},{"name":"Module","details":"The Classical Virtues of Leadership","description":"In this module, we take you through the classical virtues and ideals of leadership. What makes a true leader? What makes the ideals they espouse appealing? Consider how the virtues discussed might look today, and whether we still value them as qualities good leaders possess.","topics":["Learning Outcomes","Plato and the Four Cardinal Virtues","The Concept of Justice in Greek Philosophy","Practical Wisdom (Prudence)","Courage (Fortitude)","Moderation (Self-Control and Temperance)","Aristotle on Leadership and Virtue","Lesson Summary"]},{"name":"Module","details":"Perspectives on Leadership","description":"In this module, we considered the ethics and virtues of leadership from a classical perspective. However, the ancient Greeks were not the only ones to consider what it means to be a great leader, in terms of virtue and competence. We'll examine elements of leadership theory from the perspective of other cultures and times.","topics":["Learning Outcomes","Definitions of Leadership","Alternative Perspectives on Leadership","Leadership, Personal Values, and Cultural Context","Developing Values-Based Leadership Skills","Lesson Summary"]},{"name":"Module","details":"Honesty, Moral Courage and Moral Vision","description":"In this module, we understand why employees consider honesty the most important attribute of the leaders they follow. Leaders face a variety of moral and ethical dilemmas, and honesty in leaders is defined as \"truthfulness, fairness in dealing with others, and refusal to engage in fraud, deceit, or dissembling\".","topics":["Learning Outcomes","What Followers Want from Their Leaders","Courageous Leadership for the 21st Century","Lesson Summary"]},{"name":"Module","details":"Compassion, Listening Skills and Aesthetic Sensitivity","description":"In this module, we understand why compassionate leadership is essential in the healthcare field. But this approach is important regardless of the field you work in. Think about the barriers to compassion it describes. How can a good leader help mitigate these negative factors in themselves and others? What did the leaders do to foster compassion?","topics":["Learning Outcomes","Developing Compassionate Leadership","The Value of Listening","What Makes A Great Leader?","Lesson Summary"]},{"name":"Module","details":"Good Timing and Selflessness","description":"In this module, we describe how leaders often need to respond to various external and internal challenges that often present themselves unexpectedly to take advantage of opportunities when they arise. We'll also look at how philosophy, servant-leadership, and selflessness are linked. In what ways does a selfless leader benefit? etc.","topics":["Learning Outcomes","Recognizing the Challenges of Leadership","Servant Leadership","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Classical Leadership and Decision-Making - Course assessment"]}]}