{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5337","title":"Crew Management in Multi-Pilot Aircraft","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the highs and lows of a career as a pilot, and the skills required to qualify.","description":"This course helps aspiring pilots map a career path from multiple avenues within the industry. You will gain insight into becoming a safe and effective airline pilot and learn how to perform in a complex, fast moving, sedentary-yet-stressful working environment. You will discover how to interact within a multi-crew, multi-faceted working environment. Crucially, you will also learn to recognise and trap errors, manage threats, and recover safely.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course is essential for any aspiring airline pilot. We begin by discussing the benefits of becoming a pilot, the pathways, how to get started, and how to find work. Human Factors in aviation are concerned with applying what we know about humans to an airline pilot's career. Did you know that a pilot’s personal traits are just as important as their skills? We explore pilots’ abilities, characteristics, and limitations, as well as how these affect the design of the equipment they use and the environments in which they function and perform jobs.&nbsp;</p><p>Next, you will dive into Crew Resource Management (CRM). CRM is the effective use of all available resources, including crew members, aircraft systems, support facilities, and people, to achieve safe and efficient operation. To be a safe and effective airline pilot, you must understand CRM and be able to apply its concepts in day-to-day flight operations. This course will help you hone skills such as leadership, teamwork and situational awareness.</p><p>Threat and Error Management is another critical concept in modern aviation. Flight crews, regardless of rank or experience, must recognise that threats exist and can manifest at any time and in a variety of ways. Pilots must actively manage each flight, attempting to prepare for potential threats and errors and, if they occur, repairing any degraded safety margin and returning to safe operations. When combined with CRM and Standard Operating Procedures, this philosophy will help to avoid unwanted aircraft states and improve safety. So are you ready to reach new heights? Enrol now and take the first step towards an exciting career in the airline industry, today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}