{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5647","title":"Dealing with Difficult People and Situations","totalEnrolled":"486","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to communicate with hostile people and handle tough situations in this free online conflict resolution course.","description":"Difficult people and stressful situations can be detrimental to both your personal and professional life. This conflict resolution course explains how to identify these difficulties and provides methods used to effectively communicate when tensions rise. We also study body language and other communication skills used to overcome emotional barriers. This course shows you how to handle almost any type of conflict or troublesome social interaction.","courseOutcomes":["Define the universal needs that driv...","Explain how to use transactional ana...","Discuss the importance of employee m...","Describe the behaviours that make pe...","Define the universal needs that drive human behaviour","Explain how to use transactional analysis during workplace communications","Discuss the importance of employee motivation","Describe the behaviours that make people difficult","Outline how to avoid unnecessary conflict when confronting difficult people","Identify the types of difficult people and explain how to most effectively approach each type","Describe the types of questions you ask to gather information","Outline communication techniques that make for more effective conversations","Identify the various types of managers, customers and coworkers","Explain how to approach difficult people in the workplace","Recall the communication steps you should take to resolve a problem","List practices that you can adopt into your life to develop a positive attitude","Define the universal needs that driv...","Explain how to use transactional ana...","Discuss the importance of employee m...","Describe the behaviours that make pe...","Define the universal needs that drive human behaviour","Explain how to use transactional analysis during workplace communications","Discuss the importance of employee motivation","Describe the behaviours that make people difficult","Outline how to avoid unnecessary conflict when confronting difficult people","Identify the types of difficult people and explain how to most effectively approach each type","Describe the types of questions you ask to gather information","Outline communication techniques that make for more effective conversations","Identify the various types of managers, customers and coworkers","Explain how to approach difficult people in the workplace","Recall the communication steps you should take to resolve a problem","List practices that you can adopt into your life to develop a positive attitude"],"courseDescription":"<p>Difficult people and situations regularly appear in the workplace and can cost companies revenue and cause workers stress and anxiety. Conflict can make an entire workplace unpleasant for both employees and customers alike by ruining company culture. This conflict management explains how to resolve these scenarios. Have you ever been dissatisfied with your job and wanted to retaliate in a petty manner? This course discusses how common this phenomenon is and shows you how to remove and overcome the temptation to let your colleagues down by comparing constructive workplace habits and behaviours to their toxic and unhelpful alternatives.</p><p>This social skills course describes the qualities of a ‘difficult person’ before delving into the ‘behavioural continuum’. We examine the root causes of difficult behaviour and the reasoning behind people’s decisions to make things difficult. We then outline the types of uncooperative people and provide methods you should use to confront them to achieve the best possible outcome. The course shows you how to approach difficult managers, employees, colleagues and customers. We provide detailed tips that you should use to defuse tense situations, which can vary wildly.</p><p>How do you plan on incorporating the lessons from this course into your personal and professional life? We provide the opportunity to examine your personal development to help you apply the conflict management techniques covered in this social skills course into your life. We explain how to push yourself out of your comfort zone as we study emotional intelligence and establish the importance of self-analysis after a confrontation or conversation. We discuss what shapes a difficult person or creates frustrating scenarios and outline the various methods you should use to handle them. Sign up to improve your social skills and learn how to manage conflicts in your personal and professional life.</p><a href=\"https://alison.com/resume/courses/5647\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5647\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Understanding Difficult People","description":"In this module, you will learn the basics of human behaviour while also studying how to identify difficult people in your life. This includes the six universal needs of every human, the root causes of the behavioural continuum and the various types of difficult people. You will also cover how behaviour differs while in the workplace.","topics":["Understanding Difficult People - Learning Outcomes","Developing an Understanding of Human Behaviour","Handling Difficult People","Understanding Difficult People - Lesson Summary"]},{"name":"Module","details":"Developing Interpersonal Skills","description":"In this module, you will learn how to develop your communication skills to effectively approach difficult people and situations. This includes identifying methods to handle coworkers and customers and interpreting non-verbal communication actions. You will also learn how to incorporate the lessons from this course into your personal life.","topics":["Developing Interpersonal Skills - Learning Outcomes","Dealing With Difficult Situations","Interpersonal Skills for Handling Difficult People","Personal Development","Developing Interpersonal Skills - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Dealing with Difficult People and Situations - Course assessment"]}]}