{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/1917","title":"Diploma in Environmental Management","totalEnrolled":"29,336","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the environment and different energy management systems with this free online diploma program course.","description":"This free online certificate course on Environmental Management will introduce you to climate change, sustainability, and the IPAT equation. You will study climate processes, biogeochemical cycles, water pollution, the different types of pollutants, sources of pollution, environmental regulations, and waste management strategies.","courseOutcomes":["Discuss the definition of sustainabi...","Identify the basic facility before t...","Define both \"climate\" and \"weather\" ...","Discuss the role and mechanisms of t...","Discuss the definition of sustainability","Identify the basic facility before the IPAT equation can be used","Define both \"climate\" and \"weather\" and explain how they relate","Discuss the role and mechanisms of the major controls on Earth's climate using the concepts of insolation, albedo and greenhouse gases","Explain the enhanced greenhouse effect","Describe the natural cycles of carbon, water, and nitrogen","Discuss biodiversity and current trends in biodiversity loss","Discuss soil sustainability and soil-forming factors","Discuss what sewage treatment does and its importance","Discuss cost-benefit analysis","Discuss how to identify/evaluate uncertainties in risk assessment","Identify the ultimate sources of renewable energy","Discuss the basic thermodynamic principles of heat","Discuss the definition of sustainabi...","Identify the basic facility before t...","Define both \"climate\" and \"weather\" ...","Discuss the role and mechanisms of t...","Discuss the definition of sustainability","Identify the basic facility before the IPAT equation can be used","Define both \"climate\" and \"weather\" and explain how they relate","Discuss the role and mechanisms of the major controls on Earth's climate using the concepts of insolation, albedo and greenhouse gases","Explain the enhanced greenhouse effect","Describe the natural cycles of carbon, water, and nitrogen","Discuss biodiversity and current trends in biodiversity loss","Discuss soil sustainability and soil-forming factors","Discuss what sewage treatment does and its importance","Discuss cost-benefit analysis","Discuss how to identify/evaluate uncertainties in risk assessment","Identify the ultimate sources of renewable energy","Discuss the basic thermodynamic principles of heat"],"courseDescription":"<p>This free online Environmental Management diploma program will teach you the definition of sustainability and how the IPAT equation can be applied with various patterns for human consumption. Next you will learn about various climate processes and how they work, as well as about altering the physical properties of the atmosphere by producing greenhouse gases.</p><p>Furthermore, in this free distance learning certificate course, you will be learning about biogeochemical cycles like the water, nitrogen and carbon cycles and their interactions with the ecosystem. You will also be introduced to water pollution, types of pollutants and the sources of pollution. Then, you will study the environmental regulations governing waste management, waste management strategies and the history of human energy use. Finally, in this free online diploma program course you will be learning about carbon emissions, combined heat and power and how to build a sustainable energy economy.</p><p>This free online course will be of great interest to students, individuals and professionals with an interest in learning about or working in the area of environmental management. Upon successful completion of this online certificate course, you will gain valuable skills and knowledge on waste management, climate change, sustainability as well as pollution. Enroll in this course today and start learning about environmental management.</p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/1917\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1917\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Sustainability: Humanity and the Environment","description":"In this module, you will be introduced to the definition of sustainability and how it applies in the modern context, the basic facility before the IPAT equation can be used, the various patterns of human consumption and the major factors which play roles in the understanding of unsustainable impacts.","topics":["Introduction to Sustainability - Learning Outcomes","What is Sustainability?","Human Consumption Patterns and the Rebound Effect","Introduction to Sustainability - Lesson Summary"]},{"name":"Module","details":"Climate and Global Change","description":"In this module, you will be introduced to how climate processes and principles work, how they are observed by scientists and how these principles by producing greenhouse gases humans are altering the physical properties of the atmosphere in such a way as to increase its ability to retain heat, theoretical prediction of a warming world, measuring temperature, and how to attempt to predict the climate of the future.","topics":["Climate Processes and Global Change - Learning Outcomes","Climate Processes: External and Internal Controls","Modern Climate Change","Climate Projections","Climate Processes and Global Change - Lesson Summary"]},{"name":"Module","details":"Biosphere","description":"In this module, you will be introduced to the biogeochemical cycles, the nature carbon cycle, the nature water cycle, the nature nitrogen cycle and how humans interact with them, biodiversity, ecosystem functions, soil health, soil erosion and soil sustainability.","topics":["Biosphere - Learning Outcomes","Biogeochemical Cycles and the Flow of Energy in the Earth System","Biodiversity, Species Loss, and Ecosystem Function","Soil Profiles and Processes","Biosphere - Lesson Summary"]},{"name":"Module","details":"Physical Resources: Water, Pollution, and Minerals","description":"In this module, you will be introduced to the composition of water on the Earth, forms of water, the water cycle, sources of water, chemistry of water, water pollution, water pollutants, point and non-point sources of pollution, importance of minerals, formation of ore deposits, mining and processing ore and sustainability issues.","topics":["Physical Resources: Water, Pollution, and Minerals - Learning Outcomes","Water Cycle and Fresh Water Supply","Water Pollution","Mineral Resources: Formation, Mining, Environmental Impact","Physical Resources: Water, Pollution, and Minerals - Lesson Summary"]},{"name":"Module","details":"Diploma in Environmental Management - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Environmental Management - First Assessment"]},{"name":"Module","details":"Environmental and Resource Economics","description":"In this module, you will be introduced to how economists define environmental outcomes, positive and negative externalities, public goods and common-property resources, the measures of value, willingness to pay, willingness to accept, the three parts of the environmental evaluation toolkit; direct, revealed preference and stated preference, important features of costs, cost-benefit analysis, criteria for evaluating a project and incentive policies.","topics":["Environmental and Resource Economics - Learning Outcomes","Tragedy of the Commons","Environmental Valuation","Evaluating Projects and Policies","Environmental and Resource Economics - Lesson Summary"]},{"name":"Module","details":"Modern Environmental Management","description":"In this module, you will be introduced to environmental regulations governing waste management, waste management strategies, government regulations set for the protection of human health and the environment, four steps of risk assessment, estimating the dose received and exposure pathway, cumulative cancer and non-cancer risks, evaluating uncertainties in risk assessment.","topics":["Modern Environmental Management - Learning Outcomes","Systems of Waste Management","Government and Laws on the Environment","Risk Assessment Methodology for Conventional and Alternative Sustainability Options","Modern Environmental Management - Lesson Summary"]},{"name":"Module","details":"Sustainability and Environmental Challenges","description":"In this module, you will be introduced to the history of human energy use, challenges of continued reliance on fossil energy, the time scale for transition in energy use, environmental impacts of energy use, different energy sources based on environmental impact, and global capacity for non-renewable energy sources.","topics":["Sustainability and Environmental Challenges - Learning Outcomes","Sustainability Challenges","Environmental Challenges in Energy, Carbon Dioxide, Air, Water and Land Use 1","Environmental Challenges in Energy, Carbon Dioxide, Air, Water and Land Use 2","Sustainability and Environmental Challenges - Lesson Summary"]},{"name":"Module","details":"Energy Sources, Carriers and Energy Uses","description":"In this module, you will be introduced to the components of electricity, link between electricity generation and carbon emissions, sequestering carbon in geologic formations, sources of renewable energy, motivations for biofuels production, types of catalytic and biocatalytic routes to produce biofuels and biochemical, thermodynamic principles of a heat, types of geothermal systems, combined heat and power (CHP) as an alternative energy source, Phase Change Materials (PCM) and its applications.","topics":["Energy Sources, Carriers and Energy Uses - Learning Outcomes","Energy Sources and Carriers 1","Energy Sources and Carriers 2","Energy Sources and Carriers 3","Energy Uses","Applications of Phase Change Materials for Sustainable Energy","Energy Sources, Carriers and Energy Uses - Lesson Summary"]},{"name":"Module","details":"Sustainable Infrastructure","description":"In this module, you will be introduced to living in a sustainable city and how technology influences the form and pattern of a sustainable city, connections between the design of cities and resource use, ways buildings affect the environment and characteristics of sustainable buildings.","topics":["Sustainable Infrastructure - Learning Outcomes","The Sustainable City","Sustainability and Buildings","Sustainable Infrastructure - Lesson Summary"]},{"name":"Module","details":"Sustainable Energy Practices","description":"In this module, you will be introduced to moving to a sustainable energy economy, the path to a sustainable energy economy, an automobile-based system of transportation, why transportation is a derived demand, accessibility and mobility, storm water runoff, managing storm water runoff and conventional and innovative techniques to address water pollution.","topics":["Sustainable Energy Practices - Learning Outcomes","Climate Action Planning","Sustainable Transportation","Sustainable Storm Water Management","Sustainable Energy Practices - Lesson Summary"]},{"name":"Module","details":"Diploma in Environmental Management - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Environmental Management - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Environmental Management - Course Assessment"]}]}