{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3131","title":"Diploma in Cargo Handling and Stowage","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the key skills of safe handling and secure cargo stowage on board ships in this free online course.","description":"This ‘Diploma in Cargo Handling and Stowage’ course offers an in-depth understanding of concepts surrounding the handling and stowage of cargoes on board different types of sea carriers. These include activities involved before, during and after the loading of cargoes at their ports of origin, transit ports and ports of destination. Ship safety is also examined in this specialised shipping course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Cargo handling has come a long way since industrialisation and the increase in export activities and this development has caused the important need for cargo operations on seaways. The world of cargo operations has evolved considerably from the days of the open stowage of merchandise to the current form of containers and other relevant packaging. Unitised cargoes in the form of ‘containers’ or ‘Roll-on, Roll-off’ cargoes and palletisation have generated a need for alternative handling methods and changing procedures. Shipping personnel must therefore be well aware of the various considerations necessary to perform cargo handling operations on ships with the utmost safety given the change in operations today. Cargo handling and stowage involve the cargo types transported at sea including dangerous cargoes and the hazards associated with their carriage. In this course you will learn about the methods used to secure cargoes at sea and how to ensure that cargo compartments are well prepared to receive various cargo types.</p><p>Gain a greater understanding of the business of cargo carriage and sea cargo transport processes, together with the different methods involved in safely securing cargoes. Explore recent trends observed in the global cargo shipping industry, including the damages recorded by major shipping companies leading to the development of precautionary measures as the establishment of standards for the preparedness of shipping globally. Major systems required for the perfect operation of cargo handling and stowage are well related to important crew members for the sake of shared responsibility among crews. An instance of such shared responsibility involves the Officer of the Watch knowing methods used on board ships to look after cargo such as the operation of cargo ventilation systems.</p><p>Furthermore, this course will help you identify the different types of cargoes alongside their different stowage and handling processes. These include container cargoes, timber cargoes, deck cargoes and general cargoes used by all the major shipping companies. Important elements standardised for the safety of stakeholders in and around cargo shipping are also described. All property stowed on board vessels is made safe from any destruction all through their voyages by important elements discussed in this course under cargo handling safety methods. The course will take learners through the preparatory inspections held for both cargoes and the vessels carrying them to their destinations. The course will be of significant interest to students, logistic entrepreneurs, researchers, marine operations managers, marine engineers and anyone seeking to learn about the safe stowage and secure handling of different cargo types on board ships. Register for this free online course from Alison today to improve your understanding of cargo handling and stowage of ship cargoes.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}