{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5136","title":"DSEAR Awareness and Training","totalEnrolled":"384","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains DSEAR regulations and their importance in ensuring workplace safety.","description":"Working with or near any dangerous substance or explosive atmosphere carries its own risks as a single act of carelessness in such an environment can be disastrous. In this light, what can we do to make the workplace safe? This course will introduce you to a vital piece of UK and EU legislation called ‘Dangerous Substances and Explosive Atmospheres Regulations’ (DSEAR). Learn how to use it to keep employees safe in their working environment.","courseOutcomes":["Describe the scope of the DSEAR for ...","Define ‘dangerous substances’...","Discuss applications of different he...","Outline procedures for eliminating o...","Describe the scope of the DSEAR for working with various hazardous substances","Define ‘dangerous substances’","Discuss applications of different health and safety legislation in the UK for ensuring a safe workplace","Outline procedures for eliminating or reducing hazards at work","Select the correct safety equipment for high-risk work activities","Classify workplaces based on the risks they pose","Distinguish between flammable and non-flammable substances","Identify various sources of ignition in a workplace","Evaluate risks associated with specific job activities","Describe the scope of the DSEAR for ...","Define ‘dangerous substances’...","Discuss applications of different he...","Outline procedures for eliminating o...","Describe the scope of the DSEAR for working with various hazardous substances","Define ‘dangerous substances’","Discuss applications of different health and safety legislation in the UK for ensuring a safe workplace","Outline procedures for eliminating or reducing hazards at work","Select the correct safety equipment for high-risk work activities","Classify workplaces based on the risks they pose","Distinguish between flammable and non-flammable substances","Identify various sources of ignition in a workplace","Evaluate risks associated with specific job activities"],"courseDescription":"<p>The United Kingdom’s Dangerous Substances and Explosive Atmospheres Regulations (DSEAR) 2021 deal with the safe usage of dangerous substances that can cause fires, explosions and injuries to workers. We will introduce you to the health and safety requirements of the DSEAR to ensure the safety of those working in potentially explosive work conditions. You will learn how to identify dangerous substances and classify them according to their hazards. We also explore employers' duties to establish protective systems under the European Union regulations. ‘General safety’ is a comprehensive approach to developing and ensuring health and safety regulations compliance. We demonstrate how to safely handle dangerous substances and outline procedures used to perform tasks based on the risk level involved and the substances used.</p><p>Everyday items in the workplace include liquefied petroleum gas (LPG), alcohol, paints and others that pose low to high levels of risk to the employees and equipment. We teach you how to select and apply different safety principles to ensure safe working with flammable substances. In addition, you'll study the role of personal protective equipment (PPE) to minimise or eliminate exposure to hazardous substances and avoid injuries on the job floor. Before handling dangerous substances, you must perform a risk assessment to assess the hazards and put control measures in place. We show you when to carry out a risk assessment and identify factors that you need to consider during the risk assessment.</p><p>We designed this course for those who must comply with the DSEAR in their organisations. It is also helpful for those who want to pursue a career in health and safety (HSE). This course covers the necessary and relevant rules and regulations on dangerous substances in the UK and the EU. The scope of DSEAR is extensive because almost every organisation has to deal with some harmful substance or equipment. To comply with the safety regulations, organisations require professionals trained to deal with hazardous substances and comply with the DSEAR. This need has created job opportunities for those skilled in making the workplace safe. Join the course today and learn for free!</p><a href=\"https://alison.com/resume/courses/5136\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5136\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Workplace and Personal Safety","description":"This module will introduce you to various substances that can cause fires and explosions in the workplace. We'll teach you about general safety principles, protection systems and procedures to safely handle dangerous substances. You'll learn how to identify hazardous equipment and perform risk assessments to eliminate or reduce risks.","topics":["Workplace and Personal Safety - Learning Outcomes","Basic of DSEAR","Workplace Safety","Protection and Risk Assessment","Workplace and Personal Safety - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["DSEAR Awareness and Training - Course assessment"]}]}