{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5382","title":"EHS Guidelines - Environment, Health and Safety","totalEnrolled":"1,623","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to deal with industrial hazards associated with the environment, health and safety in this free online course","description":"Global industrialization poses significant risks to the health and wellbeing of humanity. This threat calls for improvement to the management of industrial pollutants, their impact and their emission sources. This course is designed for aspiring industrial health and safety experts and also refreshes your skills if you already work in the sector. Enroll today to learn how to craft a comprehensive plan to mitigate health hazards and contamination.","courseOutcomes":["Define the role of EHS in preserving...","Identify the sources of the air poll...","Summarize the role of volatile organ...","Recognize the parameters for the qua...","Define the role of EHS in preserving the environment and ensuring health and safety at the industrial premises","Identify the sources of the air pollutants and their types","Summarize the role of volatile organic compounds, particulate matter and sulfur dioxide (SO2) in causing air pollution and explain how to control their emissions","Recognize the parameters for the quality of liquid industrial effluents","Outline different occupational problems encountered in treating wastewater","Evaluate the values of noise limits and their dangers to workers and employees","Analyze OHS monitoring parameters and the role of PPE in occupational safety","Evaluate the role of educating employees about traffic safety, transport of hazardous materials and communicable diseases","Indicate hazards associated with industrial deconstruction and decommissioning activities","Recall the management plan to counter general industrial hazards","Define the role of EHS in preserving...","Identify the sources of the air poll...","Summarize the role of volatile organ...","Recognize the parameters for the qua...","Define the role of EHS in preserving the environment and ensuring health and safety at the industrial premises","Identify the sources of the air pollutants and their types","Summarize the role of volatile organic compounds, particulate matter and sulfur dioxide (SO2) in causing air pollution and explain how to control their emissions","Recognize the parameters for the quality of liquid industrial effluents","Outline different occupational problems encountered in treating wastewater","Evaluate the values of noise limits and their dangers to workers and employees","Analyze OHS monitoring parameters and the role of PPE in occupational safety","Evaluate the role of educating employees about traffic safety, transport of hazardous materials and communicable diseases","Indicate hazards associated with industrial deconstruction and decommissioning activities","Recall the management plan to counter general industrial hazards"],"courseDescription":"<p>Industries are essential for the economic stability and security of any country. However, rapid industrialization on a mass scale also poses significant dangers and hazards to human health, the environment and safety. Such a situation calls for a comprehensive and standardized management plan to eliminate or minimize rapid industrialization's harmful effects. Luckily, the Environmental, Health and Safety (EHS) Guidelines provide a road map for industries and organizations worldwide to mitigate the hazardous effects of industrial activities.</p><p>Considering the importance of the EHS Guidelines, industrial experts at Exoexcellence Consultants have developed this bi-modular course specifically for industrial health and safety professionals. In addition, each module includes three primary topics dedicated to a particular yet prevalent industrial hazard. The first module introduces you to EHS and its fundamental framework while the following two topics discuss management strategies regarding air pollution, water contamination and water conservation.</p><p>The second module explains how you can develop comprehensive mitigation plans to counter industrial hazards that pose a significant threat to employees and public health and safety. We also show you how to design a management plan concerning noise pollution, fires, explosives and industrial vehicle accidents. The course then highlights how the EHS guidelines pertain to the safety of new and existing industrial infrastructure, the prevention of infectious diseases and managing the harmful impacts of industrial decommissioning activities. Legal frameworks like the EHS play a key role in protecting the natural world so sign up for this course to pick up the sustainable development skills you need to protect the environment and the health and safety of those who live in it.</p><a href=\"https://alison.com/resume/courses/5382\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5382\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"EHS Guide to Air and Water Treatment","description":"This module introduces you to the EHS, and similar frameworks followed globally to protect the environment, health, and safety from unhealthy industrial practices. It also explains EHS guidelines to control industrial air pollution and enact a management system to treat wastewater. It also states ways of using which industries can conserve water.","topics":["EHS Guide to Air and Water Treatment - Learning Outcomes","Introduction to the EHS Framework","EHS Environmental Guidelines: Air Pollution","Industrial Wastewater Treatment and Water Conservation","EHS Guide to Air and Water Treatment - Lesson Summary"]},{"name":"Module","details":"Management of General Industrial Hazards","description":"This module will teach you about industrial hazards that impact employees and the general public. In this regard, you will learn about occupational safety concerning noise pollution, fires, explosions, and industrial vehicles. It also discusses preparing management plans to mitigate public exposure to noise hazards and industrial decommissioning.","topics":["Management of General Industrial Hazards - Learning Outcomes","EHS Guidelines for Occupational Safety","Reducing Public Exposure to Industrial Hazards","EHS Guidelines for Deconstruction Activities","Management of General Industrial Hazards - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["EHS Guidelines - Environment, Health and Safety - Course Assessment"]}]}