{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5255","title":"Emergency Protocol for an Active Shooter","totalEnrolled":"1,505","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online health and safety course explains what to do and how to prepare for an active shooter in the workplace.","description":"Mass shootings have become more common in recent years, particularly in the United States. It is important that you know how to react if an active shooter enters your place of work or education. This health and safety course lays out the basic steps you should take if an active shooting occurs and gives you some guidelines to follow if your life is in imminent danger. We explain how a sound emergency action plan (EAP) can save lives.","courseOutcomes":["Define ‘active shooter’...","Outline the three steps to take if a...","Explain how to prepare for an active...","Describe possible actions to take if...","Define ‘active shooter’","Outline the three steps to take if an active shooter enters your working environment","Explain how to prepare for an active shooting","Describe possible actions to take if the suspect is nearby or if you are outside","Recall the questions you must answer when you call law enforcement during an active shooter situation","Discuss the goals of the primary and secondary waves of law enforcement","Outline the potential symptoms of employee violence","Identify the three main classes of workplace violence","Define an ‘EAP’ and establish its importance","Explain how managers can prepare their personnel for an active shooter scenario","Define ‘active shooter’...","Outline the three steps to take if a...","Explain how to prepare for an active...","Describe possible actions to take if...","Define ‘active shooter’","Outline the three steps to take if an active shooter enters your working environment","Explain how to prepare for an active shooting","Describe possible actions to take if the suspect is nearby or if you are outside","Recall the questions you must answer when you call law enforcement during an active shooter situation","Discuss the goals of the primary and secondary waves of law enforcement","Outline the potential symptoms of employee violence","Identify the three main classes of workplace violence","Define an ‘EAP’ and establish its importance","Explain how managers can prepare their personnel for an active shooter scenario"],"courseDescription":"<p>This course on active shooting prepares you for the possibility of encountering an active shooter at work or educational environment. We begin by defining ‘active shooter’ and provide some statistics on the rise of mass shootings over the last few years. We then provide survival techniques by explaining the three essential actions (run, hide or fight) and other vital guidelines.</p><p>The second section of the course focuses on specific scenarios relevant to places likely to be targeted, including colleges and healthcare facilities. We analyse some basic preparation techniques and outline when or if you should assist others in escaping. We show you how to answer the questions law enforcement officers will ask when you call them during an active shooting scenario and explain their primary and secondary goals.&nbsp;&nbsp;</p><p>The course's final section touches on possible indications and habits that may alert you if someone is on the verge of committing widespread violence. We establish the importance of an emergency action plan (EAP) in equipping your personnel with the skills required to react appropriately and lessen the chance of fatalities. Finally, we study the role of managers during active shooter situations and demonstrate how to conduct a post-incident assessment once the situation is under control. Sign up for this health and safety training course to pick up valuable skills that might prevent mass shootings and save lives.</p><a href=\"https://alison.com/resume/courses/5255\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5255\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Emergency Procedures for an Active Shooter","description":"This module explores what you can do if an active shooter enters the building where you are working or studying and the steps to take if you find yourself in this situation. In addition, it discusses the signs to watch out for in a person's potential for violence to prevent it from transpiring.","topics":["Emergency Procedures for an Active Shooter - Learning Outcomes","Introduction to Active Shooting","Specific Scenarios","Identify Workplace and Employee Violence","Emergency Procedure for an Active Shooter - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Emergency Protocol for an Active Shooter - Course Assessment"]}]}