{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4780","title":"Enterprise Risk Management and Analysis","totalEnrolled":"1,426","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to analyze given data to mitigate risk and make better decisions in business with this free online course.","description":"How can risks be identified, measured and managed? When should risk be accepted or rejected? Enterprise risk management is an integral technique that empowers a business with the necessary tools to adequately identify, analyze and mitigate potential risks. In this course, you will learn strategies and approaches to risk management as well as how to undertake sound decisions and obtain a competitive advantage.","courseOutcomes":["Define ‘enterprise risk management’...","List the components of enterprise ri...","Analyze the causes and consequences ...","Explain the significance of the ‘ARC...","Define ‘enterprise risk management’","List the components of enterprise risk management","Analyze the causes and consequences of financial volatility","Explain the significance of the ‘ARCH model’ in financial markets","Describe risk and volatility and contrast them","List the usefulness of credit rating and identify key users","Explain the concepts of the volatility, uncertainly, complexity, and ambiguity (VUCA) method","Describe how VUCA has helped leaders to create leadership development plans","Discuss the theoretical framework for using sensitivity analysis for decision-making","Relate solvency testing and financial condition reporting","State the principle of superposition for a linear system","Define ‘enterprise risk management’...","List the components of enterprise ri...","Analyze the causes and consequences ...","Explain the significance of the ‘ARC...","Define ‘enterprise risk management’","List the components of enterprise risk management","Analyze the causes and consequences of financial volatility","Explain the significance of the ‘ARCH model’ in financial markets","Describe risk and volatility and contrast them","List the usefulness of credit rating and identify key users","Explain the concepts of the volatility, uncertainly, complexity, and ambiguity (VUCA) method","Describe how VUCA has helped leaders to create leadership development plans","Discuss the theoretical framework for using sensitivity analysis for decision-making","Relate solvency testing and financial condition reporting","State the principle of superposition for a linear system"],"courseDescription":"<p>With the advent of technology and the impacts it has made on businesses, companies are taking on increased levels of risk. This creates a need for companies to employ appropriate enterprise risk management strategies to monitor and mitigate these at suitable levels. This course has been designed to introduce external and internal drivers, resulting in a range of operational, financial and strategic risks manifesting in organizations. Firstly, we will examine the concepts and types of risk. But do you know that there are also positive sides to risk? Discover these and learn the theoretical foundation of enterprise risk and the concept of risk and volatility, uncertainty, complexity and chaos. In addition, we will explore the 'nonlinear dynamics systems theory’, system theory application and how to apply the ‘ARCH model’ in financial markets.</p><p>If you ask investors what risk they assume when buying stocks, their likely response would be ‘losing money’. However, modern portfolio theorists do not define it as a ‘likelihood of loss’ but as ‘volatility’, which is determined using statistical variance measures such as standard deviation and beta. In a surging market, however, high volatility can foster the return potential of an investment. In other words, volatility is essentially a double-edged sword and does not measure what an investor innately perceives as a threat. Here is your chance to analyze and evaluate the measurement of enterprise risk management by utilizing different approaches such as value at risk, coefficient of variance, correlation and regression and many more.</p><p>Enterprise risk management and analysis are affected by an entity's board of directors, administration and other personnel. It is applied in strategy settings and across the enterprise, designed to identify likely events that may influence the entity and manage risk within its risk palate to provide reasonable assurance regarding the achievement of entity objectives. By taking this course, we equip you with top-level technical skills, strategies and the ability to make sound decisions that will keep your organization away from financial troubles and unhealthy choices that may spell doom for your organization. Gain all the skills needed to identify risks, assess what should be eliminated or mitigated and effectively harmonize regulatory and compliance matters. This course is for anyone interested in risk management, finance or internal audit. There are no prerequisites for taking this course. Just click on the ‘Start’ button and enroll!</p><a href=\"https://alison.com/resume/courses/4780\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4780\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Enterprise Risk Management","description":"In this module, you will be introduced to enterprise risk management, the theory of enterprise risk management, measurements of enterprise risk, and the international ratings & Basel.","topics":["Enterprise Risk Management - Leaning Outcomes","Introduction to Enterprise Risk Management","Theory of Enterprise Risk Management","Measurements of Enterprise Risk","International Ratings & Basel","Enterprise Risk Management - Lesson Summary"]},{"name":"Module","details":"Risk Management and Enterprise Risk Analysis","description":"The purpose of risk management is to recognize possible problems before they occur, or try to leverage opportunities. In this module, you will learn about the purpose of risk management, enterprise risk analysis and scenario analysis - stress testing.","topics":["Risk Management and Enterprise Risk Analysis - Learning Outcomes","Purpose of Risk Management","Enterprise Risk Analysis","Scenario Analysis – Stress Testing","Risk Management and Enterprise Risk Analysis - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Enterprise Risk Management and Analysis - Course Assessment"]}]}