{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3776","title":"Ethical Leadership","totalEnrolled":"1,431","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Lead like a Pro by Learning the Core Fundamentals of Great, Ethical Leadership in this Free Online Course.","description":"In this free online course, you'll study the tried and tested traits of good leadership, ranging from honesty, moral courage and vision to creative thinking and selflessness. We'll also explore why these leadership elements frequently overlap with the classical ideals of virtuous leadership. If you'd like to be more methodical in your leadership practices or better understand successful leadership, look no further than this course.","courseOutcomes":["Discuss models and their inclusion o...","Describe courageous leadership for t...","Analyze the concept of courage, cour...","Discuss the science of compassion...","Discuss models and their inclusion of what followers want","Describe courageous leadership for the 21st century","Analyze the concept of courage, courage characteristics, and strategic leadership practices","Discuss the science of compassion","Define the value of listening","Describe what makes a great leader","List the qualities of leaders","Discuss the challenges of leadership","Recall how to cope with external and internal challenges","Explain servant leadership","Discuss models and their inclusion o...","Describe courageous leadership for t...","Analyze the concept of courage, cour...","Discuss the science of compassion...","Discuss models and their inclusion of what followers want","Describe courageous leadership for the 21st century","Analyze the concept of courage, courage characteristics, and strategic leadership practices","Discuss the science of compassion","Define the value of listening","Describe what makes a great leader","List the qualities of leaders","Discuss the challenges of leadership","Recall how to cope with external and internal challenges","Explain servant leadership"],"courseDescription":"<p>In this free online course, we will explore nine traits that some might describe as essential qualities for good leadership: (1) honesty, (2) moral courage and vision, (3) compassion, (4) fairness, (5) intellectual excellence and willingness to listen to others, (6) creative thinking, (7) aesthetic sensitivity, (8) good timing and (9) selflessness. While the attributes mentioned above frequently overlap with the classical ideals of virtuous leadership, the correlation is not always that clear. Working through each of these traits, we will identify links of each of these virtues with the most appropriate classical virtues described by Plato and Aristotle.</p><p>We will cover all the ethical leadership principles mentioned above in three modules. In the first module, titled \"What Followers Want from Their Leaders\", we explore how employees consider honesty an essential attribute of the leaders they follow. Leaders face various moral and ethical dilemmas, and in the course material, honesty in leaders is defined as \"truthfulness, fairness in dealing with others, and a refusal to engage in fraud, deceit, or dissembling\". Followers respect leaders who are honest with them and express honesty in every action. As we dig deeper into the principles of ethical leadership, we'll look at the four main character traits followers desire from their leaders. Do you think partnership is more integral than productivity? How does honesty promote partnership? The course material returns to partnership and elements of fostering human flourishing. How do the concepts of partnership and promoting the wellbeing of others advance human flourishing for everyone involved? The second module of this course, titled \"Developing Compassionate Leadership in Health Care: An Integrative Review\", will enable you to explain why compassionate leadership. In this module, look at why it's essential in the healthcare field. But this approach of compassionate leadership is vital regardless of your line of work, and we'll get to the bottom of effective and universal leadership skills. Another highlight in this module is the author's discussion of servant-leadership and the paradigm shifts required to succeed in this regard.</p><p>In the third module, \"The Value of Listening\", we study how good and virtuous leaders are open-minded, intellectually curious, and have a desire to learn. We will discover how and why they are willing and able to listen to others. These leaders value their co-workers and associates' opinions and are concerned about their happiness. The course material will highlight how and why these leaders do not dismiss or disregard others' ideas and values or exclusively favour their own expertise or opinions. This model will highlight why considering alternative views and perspectives helps us recognize the biases and stereotypes that may cloud our judgment or lead to faulty conclusions and decisions. Plato and Aristotle believed pride poses a significant danger to ourselves and those around us. Virtuous leaders should show humility. We can link our concept of fairness most closely with the classical ideals of justice, wisdom, and moderation. Whether you're a leader or a follower, this course will equip you with essential theory and insights to better understand leadership. Sign up now to improve your leadership knowledge and skills!</p><a href=\"https://alison.com/resume/courses/3776\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3776\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Honesty, Moral Courage and Moral Vision","description":"In this module, we understand why employees consider honesty the most important attribute of the leaders they follow. Leaders face a variety of moral and ethical dilemmas, and honesty in leaders is defined as \"truthfulness, fairness in dealing with others, and refusal to engage in fraud, deceit, or dissembling\".","topics":["Learning Outcomes","What Followers Want from Their Leaders","Courageous Leadership for the 21st Century","Lesson Summary"]},{"name":"Module","details":"Compassion, Listening Skills and Aesthetic Sensitivity","description":"In this module, we understand why compassionate leadership is essential in the healthcare field. But this approach is important regardless of the field you work in. Think about the barriers to compassion it describes. How can a good leader help mitigate these negative factors in themselves and others? What did the leaders do to foster compassion?","topics":["Learning Outcomes","Developing Compassionate Leadership","The Value of Listening","What Makes A Great Leader?","Lesson Summary"]},{"name":"Module","details":"Good Timing and Selflessness","description":"In this module, we describe how leaders often need to respond to various external and internal challenges that often present themselves unexpectedly to take advantage of opportunities when they arise. We'll also look at how philosophy, servant-leadership, and selflessness are linked. In what ways does a selfless leader benefit? etc.","topics":["Learning Outcomes","Recognizing the Challenges of Leadership","Servant Leadership","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ethical Leadership - Course assessment"]}]}