{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4387","title":"Facility Management - Maintenance and Repairs","totalEnrolled":"8,056","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore facility management to ensure the efficiency of any organisation with this free online course.","description":"In this course, we will introduce you to the basic concepts of facilities management and the various roles of a facilities manager. You will learn about the ins and outs of the numerous duties of this profession like lease purchase, vendor management, health and safety, maintenance and repair. We will show you the importance of having a well-managed workplace and how it can affect employees' productivity and behaviour.","courseOutcomes":["State the characteristics of the fac...","Explain the importance of strategic ...","Discuss the impact of a well-managed...","Recognise the symptoms of workplace ...","State the characteristics of the facilities manager","Explain the importance of strategic and annual planning","Discuss the impact of a well-managed workplace on employees","Recognise the symptoms of workplace anxiety","Categorise the information a facilities manager needs for lease purchase and vendor management","Describe the importance of having maintenance schedules and turnkey services in an organisation","Outline different health and wellness programs that boost company performance and morale","Evaluate the responsibilities of a facilities manager in maintaining and promoting sustainability","State the characteristics of the fac...","Explain the importance of strategic ...","Discuss the impact of a well-managed...","Recognise the symptoms of workplace ...","State the characteristics of the facilities manager","Explain the importance of strategic and annual planning","Discuss the impact of a well-managed workplace on employees","Recognise the symptoms of workplace anxiety","Categorise the information a facilities manager needs for lease purchase and vendor management","Describe the importance of having maintenance schedules and turnkey services in an organisation","Outline different health and wellness programs that boost company performance and morale","Evaluate the responsibilities of a facilities manager in maintaining and promoting sustainability"],"courseDescription":"<p>Facilities management (FM) is the organisational function of integrating people, places and processes within a built environment to improve their quality of life and the efficiency of the core business. It is all about looking after the buildings and people working therein. Many disciplines and services, from building maintenance, human resource management and vendor relations to safety and security, fall under the umbrella of FM. Its employees operate in various settings, including offices, hotels and hospitals, sports and recreational areas, logistical centres, care homes and educational institutions. The FM sector is rapidly growing, and its roles are expanding to include more responsibilities and broader skills. This course will take an in-depth look at facilities management and what it requires. Find the right career for you within the wide range of roles available in the FM sphere.</p><p>There are qualities that one must possess to be a facility manager. Become familiar with a facilities manager's characteristics and the philosophy an FM should have to succeed in this profession. Explore the dos and don'ts and the techniques of managing various facilities such as schools, health centres, offices and more. We will show you the need for facilities managers to look after the workspaces to benefit the employees working within them. Identify the symptoms of workplace anxiety and devise programmes that will help the employees improve workplace culture and increase their general morale, resulting in higher productivity. Discover the legal obligations attached to the management of different departments in a facility as well as how you could make a massive difference in the productivity of a company.</p><p>Facilities management is everything that is not core business. Are you wondering what that implies? This complex and demanding field with high responsibility is also fulfilling and financially rewarding. Since the FM sector is global, some roles in the industry offer excellent opportunities for travelling and working in other countries. With more buildings and companies springing up in cities around the world and relatively low entry requirements for ‘in-the-field’ roles, knowledge in facilities management will be of great importance. Property consultants, developers and builders and anyone can take this course. With an increase in demand for talented facilities management personnel worldwide, this is the best time to build the skills, knowledge and confidence to pursue a rewarding career in this field. Enrol today!</p><a href=\"https://alison.com/resume/courses/4387\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4387\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Concept of Facilities Management","description":"In this module, you will learn about the various aspects of facilities management and will be apprised of all the necessary information a facilities manager should know to be able to carry out several duties successfully. Upon that, you will also learn about the legal considerations attached to various departments in a facility.","topics":["Basic Concept of Facilities Management - Learning Outcomes","Introduction to Facilities Management","Duties of a Facility Manager","Basic Concept of Facilities Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Facility Management - Maintenance and Repairs - Course Assessment"]}]}