{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4603","title":"Food and Beverage Restaurant Service: Basic Waiter's Training","totalEnrolled":"4,609","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, we will introduce you to the roles and responsibilities of a waiter in a restaurant.","description":"The role of a waiter carries many responsibilities that are crucial to the successful operation of a restaurant. From the initial welcome of guests to the in-depth knowledge of glassware, crockery, cutlery and the details of silver service, each aspect plays a part in customer satisfaction. Gain a thorough understanding of the basic training required for waiters in this introductory-level hospitality course.","courseOutcomes":["Recognise the different styles of se...","State the equipment required for a s...","Distinguish between the various type...","Discuss the usage and handling of gl...","Recognise the different styles of service","State the equipment required for a successful service","Distinguish between the various types of crockery and cutlery used in a restaurant","Discuss the usage and handling of glassware, chinaware and crockery","Recall how to use service cutlery","Describe the process of clearing the table","Explain the method for preparing the table before serving guests at a restaurant","Recognise the different styles of se...","State the equipment required for a s...","Distinguish between the various type...","Discuss the usage and handling of gl...","Recognise the different styles of service","State the equipment required for a successful service","Distinguish between the various types of crockery and cutlery used in a restaurant","Discuss the usage and handling of glassware, chinaware and crockery","Recall how to use service cutlery","Describe the process of clearing the table","Explain the method for preparing the table before serving guests at a restaurant"],"courseDescription":"<p>What does it take to become a world-class waiter? The world of hospitality is complex and detail-oriented - with care and attention paid to every aspect of service. This course delves into the types of equipment used to the kinds of service and responsibilities of a waiter. Expand your knowledge of the restaurant business with this insightful hospitality course. We will discuss service categories, looking at techniques specific to each type. We will also explore silver service in detail.</p><p>Next, we will introduce you to specialised restaurant equipment and its uses. You will learn to use and maintain the different kinds of glassware, standard bar equipment, crockery and cutlery used in a high-end restaurant. Once we have studied each category in detail, we will explore the procedure for preparing the table before service and setting it with appropriate cutlery and crockery. Other facets of a waiter’s responsibilities are examined, from greeting guests on arrival to escorting them to the table. This course will also showcase the approach for upselling and suggestive selling in premier restaurants and how this helps create trust and goodwill with the guest.</p><p>The essential function of the hospitality industry is to serve food and drink to people to satisfy their various tastes and demands. The main aim is to achieve customer satisfaction. You can accomplish this through effective restaurant service, delivered efficiently with good presentation, selling and handling skills. Aspiring waiters, managers or anyone interested in the restaurant industry will find this course particularly useful. So upgrade your hospitality skills and start this basic waiter’s training course today.</p><a href=\"https://alison.com/resume/courses/4603\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4603\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Food and Beverage - Waiter's Training","description":"In this module, you will learn about restaurant waiters' essential role in satisfying their customers. This includes the core capabilities and etiquettes a restaurant waiter must possess to set up the table effectively and serve the foods, water, and beverages with precision and style.","topics":["Learning Outcomes- Food and Beverage - Waiter's Training","Types of Service in Restaurant","Crockery, Cutlery and Their Usage in Restaurants","Common Glassware and Their Usage in Restaurants and Bars","Common Bar Equipment","Handling Restaurant Equipment","Delivering Silver Service in Restaurant","Food and Beverage Service: Basic Waiter's Training - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Food and Beverage Restaurant Service: Basic Waiter's Training - Course Assessment"]}]}