{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5392","title":"Fundamentals of Conflict Resolution","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the five managerial styles used to resolve workplace disputes in this free online conflict resolution course.","description":"Minor professional disagreements can escalate into major conflicts that compromise organisational productivity. This course lays out the basics of conflict resolution. We provide simple and effective strategies designed to find the root of a conflict, analyse tense situations and provide lasting resolutions to disagreements. Anyone who works in Human Resources or as a manager can use these useful techniques to defuse tension in the workplace.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Workplace conflicts cost organisations a lot of money. According to some research, employees in the United States spent about 2.8 hours per week dealing with professional disputes. Some disagreements can lead to both organisational and personal losses. This conflict resolution course lays out the various disadvantages of conflict, the major causes of workplace disputes and the managerial processes used to resolve them.</p><p>We first describe the various forms of conflict and identify the fundamental purpose of conflict resolution and its role in business development. The course then breaks down each of the six steps of conflict resolution. Conflict does not always bring about negative results and can sometimes improve organisations. We discuss both the positive and negative potential outcomes of such disputes. This part of the course focuses on the role of human behavioural styles and emphasises the importance of emotional intelligence in dealing with conflict.</p><p>The course guides you through the steps taken to understand a problem and provides techniques you can employ to find solutions to them. We go over several insider tips and expert techniques used to establish a friendly and approachable work environment that encourages cooperation. Finally, the course explains the significance of effective communication and ethical conduct in the workplace. This course is suitable for managers and human resource professionals who deal with groups of people every day. Sign up to learn how to build a better work environment and add an important new skill to your management toolbox.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}