{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5032","title":"Fundamentals of Food Security Management","totalEnrolled":"848","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the methodologies for implementing food defense and mitigating food fraud in this free online course on Alison.","description":"Equip yourself with this ‘Food Security Management’ course that provides various food defense and security management concepts. Discover why food defense is critical in food organizations. In addition, you will learn the tools, regulatory requirements and strategies for implementing food defense within food organizations. By the end of the course, you will understand how to develop and effectively implement food defense plans.","courseOutcomes":["Define important concepts in food de...","Identify the types of people that ca...","List important food defense guidelin...","Outline the various tools and strate...","Define important concepts in food defense and food security management","Identify the types of people that can potentially cause food sabotage and the risks from attackers within the food sector","List important food defense guidelines and legal requirements alongside the GFSI standard expectations","Outline the various tools and strategies to effectively mitigate food fraud","State the steps to develop and effectively implement working food fraud mitigation and defense plans","Explain how an effective food defence strategy is essential to comply with regulations and promote trust in your brand","Describe how to implement food defense control measures within a food organization","Define important concepts in food de...","Identify the types of people that ca...","List important food defense guidelin...","Outline the various tools and strate...","Define important concepts in food defense and food security management","Identify the types of people that can potentially cause food sabotage and the risks from attackers within the food sector","List important food defense guidelines and legal requirements alongside the GFSI standard expectations","Outline the various tools and strategies to effectively mitigate food fraud","State the steps to develop and effectively implement working food fraud mitigation and defense plans","Explain how an effective food defence strategy is essential to comply with regulations and promote trust in your brand","Describe how to implement food defense control measures within a food organization"],"courseDescription":"<p>Food defense and food fraud mitigation play an integral part in food safety. The requirements are written into various food safety standards such as IFS, BRC and FSSC 22000. Both terms, also called ‘food crime’, involve adulterating products by people who want to gain financially or cause intentional harm to consumers. This course will teach you the various concepts in food defense and fraud mitigation.</p><p>Become acquainted with the costs of food sabotage and areas of focus in food defense. Recognize the types of people that can potentially cause food sabotage and the risks from attackers within the food sector. This course will provide the latest information on food defense guidelines and legal requirements alongside the Global Food Safety Initiative (GFSI) standard expectations. You will understand how and why an effective food defense strategy is essential to comply with regulations and promote trust in your brand.</p><p>By the end of the course, you will become better equipped with various tools and strategies to mitigate food fraud effectively. You will also develop and implement working food fraud mitigation and defense plans. As a result, this course will benefit food handlers, QA/QC personnel, production personnel, HACCP team members, food business owners and people in charge of food premises. In addition, it helps anyone who wishes to learn or improve their food defense knowledge can gain a practical understanding of this area. So wait no more to enroll in this course and improve your skills in food security management.</p><a href=\"https://alison.com/resume/courses/5032\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5032\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Food Defense and Fraud Mitigation","description":"In this module, you will be introduced to food defense and fraud mitigation. Next, you will understand the concept of food sabotage, including its types and associated costs. Then, you will learn the various tools for assessing and managing food fraud. Finally, you will learn how to monitor food fraud control measures.","topics":["Introduction to Food Defense and Fraud Mitigation - Learning Outcomes","Introduction to Food Fraud and Sabotage","Food Defense Control Measures","Food Fraud Assessment Tools","Introduction to Food Defense and Fraud Mitigation - Lesson Summary"]},{"name":"Module","details":"Food Defense Implementation","description":"In this module, you will learn how to implement food defense activities within your food organizations effectively. Next, you will understand the various guidelines in food fraud mitigation and food defense. Then, you will learn how to conduct food recalls effectively. Finally, you will comprehend how crisis management can be effectively conducted.","topics":["Food Defense Implementation - Learning Outcomes","Food Defense Guidelines I","Food Defense Guidelines II","Food Recalls Management","Incidence and Crisis Management","Food Defense Implementation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Food Security Management – Course Assessment"]}]}