{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4860","title":"Basics of Disaster Recovery","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to effectively implement disaster recovery planning against business threats in this free online course.","description":"Does your business need a disaster recovery plan? Can you sustain your business processes during and after a disruption? Natural disasters and those caused by humankind pose threats you must prepare for to ensure business continuity. This course will discuss project scope and plan, business impact analysis, testing and IT recovery strategies and business continuity planning. Implement these lessons to make your organisation disaster-proof.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Why do we need business continuity planning (BCP)? Why must we concern ourselves with disaster recovery? In today's world, all it takes is one cyber attack or a natural disaster to cripple many businesses, including government agencies, preventing them from carrying on their operations. Adams Academy has developed this specialised course for anyone interested in building organisational capability to avoid and overcome disastrous threats and events affecting their business processes.</p><p>To begin, we analyse the concept of BCP in depth. It ensures that an organisation remains functional in the case of a disaster. We will consider the most common threats and differentiate between natural and human disasters. Next, you will learn about business impact analysis (BIA) and study how to identify resources that are critical to the organisation. You will investigate how to assess the likelihood that a potential threat will occur and the impact it can have on a business. We will review BCP design and development, the policy draft cycle, continuity planning and implementation.</p><p>Furthermore, we will assess how to test and validate recovery plans. Testing the disaster recovery plan (DRP) ensures that an effective response system is in place. We will summarise test types, testing frequency and documentation of the testing plan. Finally,&nbsp; we will examine IT recovery strategies for areas such as operations, hardware, software, alternate sites and the cloud. This course aims to help you plan and prepare for uncertainties that can affect your business to minimise risks and expenses, keep your business functional and even save lives. Enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}