{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4641","title":"Fundamentals of Transportation Management","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to plan and coordinate the movement of people or goods with this free online transportation course.","description":"Have you ever had a flight rescheduled or a parcel arriving late? There could be some valid reason why this occurred but you can also blame poor transportation management. This course covers the roles and responsibilities of a transport manager and the processes involved in the efficient planning and coordination of the movement of people or goods. We’ll explore some safety measures to take when establishing any transport system.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Transportation is the movement of people, goods and animals from one place to another through air, land or sea. Transport management is essential because it enables trade between people, an essential part of civilisation advancement. In supply chains, transportation management solutions are vital. A good transportation management system gives you information to efficiently plan and execute your logistics. In this course, we introduce you to the transportation management system (TMS), its challenges and its benefits, including how to handle the important operations of transport management. We will cover the skills and training required to become a transport manager, highlight some of the challenges of transport industries in the UK and show you the terms used in road freight transport.</p><p>Transport managers play an integral role in any transport operation. They do not only provide a practical operational backbone to a company but also the critical link between the various elements that ensure compliance with many relevant pieces of legislation. Besides learning the roles and responsibilities of a transport manager, we discuss the authorisations and permits you may require to operate vehicles. We demonstrate how to apply for a standard international operator's licence and a bilateral permit. Explore the types of transport services offered in Great Britain and the importance of quality contract schemes to transport management. Licensing ensures the safe and proper use of public service vehicles (PSVs). Discover the purpose of PSVs, the different types of licensing and how to apply for a PSV operator’s licence.&nbsp;</p><p>The rail industry is a vital public service. We delve into some of the train-operating companies in the UK. Learn about rail franchising and the role of the transport manager in passenger rail. Finally, we will focus on transport management, health safety and the various safety measures to put in place as a manager when assessing the workplace and planning traffic routes. Transport management systems can be integrated with a business's existing enterprise resource planning (ERP) software to help plan, execute and optimise the movement of goods. Transportation management systems can also help enterprises select the best mode of shipment and carrier based on cost, efficiency and distance. This course is open to anyone who wants to know more about logistics and transport in the UK. By the end of this course, you will gain invaluable knowledge in transport management. So why wait? Enrol now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}