{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5068","title":"Introduction to Lean Management","totalEnrolled":"727","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to improve performance, reduce waste and increase the productivity of a process in this free online course.","description":"Do you strive to improve the efficiency of a process but don't know how? This course explains how to use Lean management techniques to improve process performance and the quality of products. We'll teach you various process diagrams and charts to identify, analyse and resolve issues in a process. You'll explore different types of waste commonly encountered in a workspace and acquire ways to reduce them and make the workspace clean and safe.","courseOutcomes":["Discuss the importance of Lean manag...","Recall seven tools for applying qual...","Explain different process analysis t...","Describe waste reduction techniques ...","Discuss the importance of Lean management in an organisation","Recall seven tools for applying quality in a process","Explain different process analysis terms pertaining to production","Describe waste reduction techniques within a process","Identify different time-saving and cost-saving opportunities in an organisation","Indicate the main steps of a process and the flow of information in a process using a flowchart","Label the flow of work, information and materials in a process","Separate value-adding steps from non-value-adding steps in a process","Analyse wastes and inefficiencies in a process using diagrams and charts","Discuss the importance of Lean manag...","Recall seven tools for applying qual...","Explain different process analysis t...","Describe waste reduction techniques ...","Discuss the importance of Lean management in an organisation","Recall seven tools for applying quality in a process","Explain different process analysis terms pertaining to production","Describe waste reduction techniques within a process","Identify different time-saving and cost-saving opportunities in an organisation","Indicate the main steps of a process and the flow of information in a process using a flowchart","Label the flow of work, information and materials in a process","Separate value-adding steps from non-value-adding steps in a process","Analyse wastes and inefficiencies in a process using diagrams and charts"],"courseDescription":"<p>The pursuit of quality can significantly improve the products and services offered by an organisation. We'll introduce you to the seven quality tools that help identify, analyse and fix issues to make a process economical and more efficient. Lean management allows you to perform better, more streamlined and efficient procedures while minimising disruption to day-to-day operations. On the other hand, Six Sigma is a structured problem-solving methodology used to improve the performance of a process. You'll learn how to use Six Sigma principles to identify variations and reduce them to achieve Lean management in a process. You'll explore the different cost and time-saving opportunities involving workers, materials and procedures. In addition, we'll show you how to separate value-adding from non-value-adding steps and find ways to add maximum value.</p><p>Process maps are visual representations that you want to analyse and improve. You'll discover the benefits of mapping waste, removing it and maximising opportunities. You'll explore different process mapping tools that you can use to characterise the operation, indicate the balance of time and represent the overall cycle time. Physical waste needs to be handled as part of the Lean management approach to maximise the output of a process and reduce cost. You will learn about commonly occurring waste in a workspace and diagrams to identify and remove it. The instructor, Robert Chapman, will present a case study from his work experience to help you reduce waste and inefficiencies and improve the process's overall performance.</p><p>We designed this course for people who want to improve the performance of a process and save time and resources. This course will benefit managers who want to deliver maximum value and optimise organisational workflows. There are no prerequisites and anyone interested in or working in Lean management can benefit from the course. It contains visual demonstrations of the critical ideas of Lean management to help you effortlessly understand and remember the content. Every professional organisation aims to reduce waste and create a safe and productive work environment. There are therefore numerous career opportunities in the job market for people with skills and expertise in Lean management. Join this course today and learn for free.</p><a href=\"https://alison.com/resume/courses/5068\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5068\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Quality and Identification of Waste","description":"This module will introduce you to deploying quality in a process and different types of waste. You'll study the process of production and process analysis terms used in lean management involving time. You'll learn how to identify waste and non-value-adding steps in a process to avoid time delays and loss of your organisation's resources.","topics":["Quality and Identification of Waste - Learning Outcomes","Quality and Lean Management","Process of Production","Types of Waste","Identifying Waste and Opportunity","Quality and Identification of Waste - Lesson Summary"]},{"name":"Module","details":"Process Maps and Physical Waste","description":"This module will introduce you to various process mapping tools and physical waste. You'll learn how to create flowcharts to identify issues in a process and find ways to fix those issues. We'll show you how to apply the 5S methodology to keep a workspace clean and safe and create workflow diagrams to indicate the flow of information in a process.","topics":["Process Maps and Physical Waste - Learning Outcomes","Ways to Map Waste and Opportunity","Tangible Waste","Case Study and Close Out","Process Maps and Physical Waste - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Lean Management - Course assessment"]}]}