{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3775","title":"Beginner in Classical Leadership","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to lead with ease by mastering the core fundamentals of classical leadership covered in this free online course","description":"This free online course reveals the secret formula to becoming a true ethical leader. We will provide you with life-changing techniques to help you become a great leader in every area of your life. We'll cover leadership from A to Z, learning the core fundamentals from great leaders themselves. You'll explore the classical Greek philosophical tradition of virtuous leadership and more. This course will help you lead with confidence - enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>What does it mean to be an ethical leader? To answer this question, we'll start by exploring the classical Greek philosophical tradition of virtuous leadership under Plato's Four Cardinal Virtues and Aristotle's views on leadership and virtue. These virtue-based approaches to moral leadership provide a framework to identify the characteristics or qualities of a virtuous and ethical leader. In this case, a leader who lives a virtuous and ethical life based on leadership and service. Next, we investigate ways we have applied and interpreted classical Greek virtues across time and culture. We explore how cultures conceptualize the virtuous leader. How does culture change and preserve the concept? Finally, we consider the traits or essential qualities for good leadership: honesty, moral courage, moral vision, compassion, fairness, intellectual excellence and willingness to listen to others. We'll also explore creative thinking, aesthetic sensitivity, good timing and selflessness. The course delves into leadership ideals by analyzing classical definitions of the concept of virtue. Doing so will provide background to discuss how our understanding of virtue influences how we strive to live within our community.</p><p>Plato's Republic, which the Greek philosopher wrote around 380 BCE, provides the basis for much of our modern understanding of leadership ideals. It also addresses how people should live and work morally and ethically within a community. Plato originally wrote the Republic as a series of conversations with his mentor Socrates, a great Greek philosopher and orator. These conversations also included a group of interlocutors or debaters in the Greek city of Athens. The talks concerned various ethical questions and dilemmas.</p><p>Plato outlines how virtue is present when individuals work in harmony within their community or city-state. He describes four fundamental or cardinal virtues: justice, prudence, temperance, and courage. In the classical sense, a virtue is a trait a moral or good person possesses, which leads to moral excellence in life. Next, we will explore how these virtues inform our moral actions, decisions, and beliefs about ethical leadership. Plato and Aristotle considered justice to be the \"mother\" of the virtues. Justice relates to fairness or equality as a guiding principle for your actions and decisions. It also moderates selfishness and selflessness – a balance or harmony society prefers for personal actions.</p><p>The classical conception argues that justice in the individual results in justice for the state. While justice, Plato's first cardinal virtue, offers a foundation for moral action, we consider practical wisdom (prudence) the virtue of the intellect. The virtue of practical wisdom describes someone's ability to apply reason and practical sense to situations, issues, and responsibilities, with an eye toward the moral implications. To many, courage, Plato's third cardinal virtue, is the lynchpin of the virtues because it describes a person's ability to act on virtuous commitments. They do this despite negative personal costs that could result – for the sake of the well-being of others. We often use courage synonymously with bravery or valour. It describes a leader's willingness to act justly, rightly, or morally. A leader takes these actions even if they may be unpopular, discouraged, or bring personal loss or societal shame. Moderation, Plato's fourth cardinal virtue, describes the ability to regulate your affections, emotions, and dispositions. Leaders practice moderation to keep the other virtues in harmony. Many believe moderation is the voluntary choice virtuous leaders make to favour internal self-control and avoid excessiveness. Traits of moderation include non-violence, humility, modesty, or self-restraint against excessive retaliation, violence, pride, and impropriety. If you'd like to learn the origins of how our culture views and values individuals who represent the ideas, qualities, and ideals of ethical leadership, look no further than this course. Take one step closer to leading with confidence by signing up today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}