{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5265","title":"Introduction to Advanced Scrum – A Scrum Master Training Course","totalEnrolled":"1,144","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Familiarize yourself with the skills required to become an advanced Scrum master in this free online course.","description":"This course teaches you how to effectively guide your team using Scrum techniques and why Scrum values are so important. In addition, we will discuss how to improve communication between the product owner, Scrum team members, customers, stakeholders, and executives. Based on the most recent techniques and best practices, this course is an excellent opportunity to make one of your best career moves ever. Optional certification is available.","courseOutcomes":["Explain the theory and principles be...","Identify the meaning and importance ...","Recognise the importance of self-man...","Explain the skills, traits and behav...","Explain the theory and principles behind Scrum and empiricism","Identify the meaning and importance of Scrum values","Recognise the importance of self-managing teams, interpersonal skills, and the Scrum master role","Explain the skills, traits and behavior shifts required to be a Scrum master","Recognize what practices, tools, skills and stances make an effective Scrum master","Discuss the tips and techniques that a Scrum master uses in the organization to support the Scrum teams","Explain the theory and principles be...","Identify the meaning and importance ...","Recognise the importance of self-man...","Explain the skills, traits and behav...","Explain the theory and principles behind Scrum and empiricism","Identify the meaning and importance of Scrum values","Recognise the importance of self-managing teams, interpersonal skills, and the Scrum master role","Explain the skills, traits and behavior shifts required to be a Scrum master","Recognize what practices, tools, skills and stances make an effective Scrum master","Discuss the tips and techniques that a Scrum master uses in the organization to support the Scrum teams"],"courseDescription":"<p>This course is an excellent place to start if you want to be a Scrum master, are adopting Scrum in your workplace, or simply want to be a more agile team. It is built on the best learning objectives of the Scrum Alliance and Scrum.org to provide you with current, market-relevant content. Additionally, once you finish this course, you will be able to increase your knowledge with part two of this series: Mastering Advanced Scrum – A Scrum Master Training Course.</p><p>A Scrum master is a Scrum team member responsible for fostering an effective and productive working environment and guiding others in understanding Scrum values, principles, and practices. Scrum masters are people-oriented, have high emotional intelligence, and enjoy assisting team members in growing. The material in this course shows you how to effectively guide your team in using Scrum and will consider why Scrum values are so important. Learn how to improve communication between the product owner, Scrum Team members, customers, stakeholders, and executives.</p><p>This course is an excellent opportunity to improve your implementation skills, distinguish yourself in the global marketplace, and demonstrate advanced value to your employer or potential employer as a highly trained Agile professional. Since it is based on the most recent techniques and best practices, it would be a wise choice to enrol in this course now and start your journey to mastering Scrum today. Updated 15/12/22.</p><a href=\"https://alison.com/resume/courses/5265\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5265\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Lean, Agile, and Scrum","description":"In this module, you will gain knowledge about how Scrum is aligned with Lean thinking and the values and principles of the Manifesto for Agile Software Development. You will also learn about the historical development of Scrum and agile.","topics":["Lean, Agile, and Scrum - Learning Outcomes","Introduction to Scrum","Foundations of Scrum","Kanban and XP Development Frameworks","Lean, Agile, and Scrum - Lesson Summary"]},{"name":"Module","details":"Scrum Fundamentals","description":"In this module, you will understand how Scrum works by gaining some familiarity with the Scrum framework and its business value to organizations. You will learn how the three roles, the five events, and the three artifacts (the 3-5-3 structure) are tied together.","topics":["Scrum Fundamentals - Learning Outcomes","The 3-5-3 Structure of Scrum","Plan and Estimate","Sprint Execution","Review and Retrospect","Scrum Fundamentals - Lesson Summary"]},{"name":"Module","details":"Scrum Master Core Competencies","description":"In this module, you will understand why a Scrum Master should be a 'master' or expert in Scrum and should develop the ability to coach the team in the values, principles, and processes of the Scrum framework.","topics":["Scrum Master Core Competencies - Learning Outcomes","The Scrum Master and the Scrum Guide","Attributes of a Good Scrum Master","A Scrum Master’s Responsibilities","What Is a Scrum Master’s Day Like?","Scrum Master Core Competencies - Lesson Summary"]},{"name":"Module","details":"Understanding and Applying the Scrum Framework - Formative Assessment","description":"Test your knowledge of Scrum, its concepts, framework, and its application as you have learned in this chapter by answering a few questions. Also, test your knowledge of the role of a Scrum master in the implementation of scrum.","topics":["Formative Assessment"]},{"name":"Module","details":"Service to the Scrum Team","description":"In this module, you will understand how the Scrum Master serves the Scrum team, particularly by coaching them in self-management and cross-functionality.","topics":["Service to the Scrum Team - Learning Outcomes","Service to the Scrum Team According to the Scrum Guide","Self-Management","Team Dynamics","Facilitating the Creation of a Team’s Definition of Done","Development Practices","Service to the Scrum Team - Learning Outcomes"]},{"name":"Module","details":"Service to the Product Owner","description":"In this module, you will understand how Scrum Masters serve Product Owners, particularly by coaching them in Scrum, product management, and how to collaborate with the team.","topics":["Service to the Product Owner - Learning Outcomes","Service to the Product Owner According to the Scrum Guide","Collaboration with Product Owner","Scrum Events and the Product Owner","Defining Scrum Product","Refining Product Backlog","Service to the Product Owner - Lesson Summary"]},{"name":"Module","details":"Service to the Organization","description":"In this module, you will understand how Scrum Masters serve their organizations, including bringing forth an agile environment outside of their teams and helping their organizations grow.","topics":["Service to the Organization - Learning Outcomes","Service to the Organization According to the Scrum Guide","Impediment Root Cause Analysis","Scaling Scrum","Dependency Management Techniques","Feature and Component Teams","Catalyzing Organizational Change","Service to the Organization - Lesson Summary"]},{"name":"Module","details":"Serving the People, Teams and Organizations - Formative Assessment","description":"Review the key concepts you have learned in the Serving the People, Teams, and Organizations module in the Introduction to Advanced Scrum – A Scrum Master Training Course by taking this short assessment.","topics":["Formative Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Advanced Scrum – A Scrum Master Training Course - Course Assessment"]}]}