{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3914","title":"Learn to Create a Micro-Budget Feature Film in Just Four Months","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers everything you need to know to produce a fantastic micro-budget feature film.","description":"Did you know that feature film is the king of the media industry? It is propelled by individuals passionate about an idea portrayed on screen for a global audience. This course is designed to show you how to make a low-cost feature film. Discover the process of directing a film from concept to implementation, including planning, budgeting, scheduling, equipment, and working with your cast in rehearsal and onset.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A film has the power to captivate an audience and leave them speechless. Most films elicit strong emotions while also providing intellectual stimulation that promotes personal development. If you've already got a concept, it can be realised through producing a low-budget feature film. Although many people are familiar with feature films, only a few are aware of how they bring a vision to life in the most cost-effective way feasible. We'll start by describing how to come up with ideas and inspiration for a feature film. You will learn how to produce ideas and inspiration for a movie using the tools available to you and your personal experiences. In addition, the factors that go into making a feature film and the importance of improvisation to micro-budget filmmakers are addressed, with examples of character development and composing a narrative.</p><p>The following section explains the benefits of a character breakdown. We will explore the key components and the scene and location breakdown for a feature film. Additionally, you will learn about the structure and preparation of a film schedule, including the position and responsibilities of an assistant director. Once we've done this, we'll discuss the numerous props and costumes used in machination. We'll guide you through selecting colours for set design and location and the elements of creating a call sheet. We'll also explain methods of payouts for cast and crew and the process of recognising the distinction between a low-budget and a high-budget picture. The course will explain the importance of character knowledge, networking, and key roles in film casting and also explore the implications of rehearsals on the pre-production process and other activities that might help an actor prepare for a role.</p><p>In the final segment, we'll explore the consequences of rehearsals on the pre-production process. You will learn about different exercises that help an actor prepare for a part and how to stay flexible when using improvisational approaches. In addition, we'll take you through the advantages and disadvantages of making a film using improvisational techniques. Following that, we will explain the various components of a film contract and the differences between crew and cast agreements. We'll highlight the procedures filmmakers should take while preparing a schedule and the vital things to perform in final preparation before a shoot. The various roles on set and how to maintain a healthy work-life balance are then discussed. Next, you will explore the numerous shot setups for the Machination film and the uses of static and Dutch tilt shots in video production. Finally, we'll explore the technology utilised in the film's creation and the pros and cons of sound recording. This free online course will help you nail the art of direction. You will learn how to get the most out of your cast, along with post-production coverage and cutaways. Enrol now to take your cinematography skills to the next level!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}