{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3129","title":"Maritime Principles of a Navigational Watch","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about maritime principles, personnel and the varying conditions of navigational watches in this free course.","description":"The shipmaster has unlimited responsibility for the safety and security of the ship, its passengers, crew and cargo. ‘Maritime Principles of a Navigational Watch’ is a free online course that explains the factors determining the level of watch-keeping along with the basic duties of the officers. Learn about the content of a bridge procedure guide and its use for navigation. Register for this course today and begin your next learning journey!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The Officer of the Watch (OOW) describes the shipmaster who is responsible for the safe navigation of the vessel. They must follow the relevant rules and regulations for avoiding collision at sea. This course, ‘Maritime Principles of a Navigational Watch’, is a guide through these regulations and explains the importance of maintaining a proper look-out on the bridge and how it must be ensured. You will be taken through previous investigations into maritime casualties to illustrate how they frequently reveal the main contributing factor. This course describes how the bridge watchstanding aboard a ship demands certain attributes from the bridge team. Such attributes include paying close attention to traffic, environmental conditions, ship equipment, the ship’s position/course as well as maintaining a high degree of situational awareness at all times.</p><p>You will then dive into the rules as the course explains the functions of a proper look-out in compliance with Rule 5 of the International Regulations for Preventing Collisions at Sea, 1972. You will explore the functions of a proper lookout and how the job is to be performed by a member of the navigational watch. Move on to analyse the specifications of minimum standards of competence for keeping a proper lookout by sight and hearing as found in Section A-II/4 of the STCW Code. The course then discusses the differences between the duties of the helmsman and that of the look-out. You will understand some of the duties of a helmsman when on the wheel including steering the ship and contributing to information that may be valuable for navigation. You will also learn about the idea behind ‘closed-loop’ communications, which is practised when giving helm orders, and examine the attributes of such orders, which must be clear, concise and loud enough for everyone on the bridge to hear.</p><p>The master of every ship is bound to ensure that watchstanding arrangements are adequate for maintaining a safe navigation watch. Learn how the shipmaster is responsible for establishing proper watch levels on the bridge and engine room and the importance of utilising all the staff efficiently without getting anyone overworked. Watchkeeping is very important for the safety of the ship and as such, the persons involved should not get affected by fatigue. You will therefore learn about the provisions for rest hours for personnel involved in these exercises. This course goes on to explore the importance of good management of the available resources including how it ensures the safety of life, property and the environment at sea. Delve into the duties of a Chief Engineer to the Master for setting an engine watch sufficient for the safe operation of all machinery affecting the operation of the ship. Find out how the officer in charge of the navigational watch makes frequent and accurate compass bearings of approaching ships as a means of early detection to avoid or lower the risk of collisions at sea. If you are interested in expanding your knowledge of the navigation and safety rules at sea, then sign up for this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}