{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5229","title":"OSHA Fundamentals - Managing Risk of Fire Emergencies","totalEnrolled":"2,000","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online health and safety course explains how to comply with OSHA guidelines to manage workplace fire risks.","description":"This course on occupational fire protection suits anyone who wants to pursue occupational safety as a career and managers who need to keep their workplace safe while they bolster their professional portfolio. We show you how to protect your workplace from fire hazards. We lay out OSHA's workplace safety requirements and explain how plans for emergency egress, employee protection and burn management can preserve employee health and safety.","courseOutcomes":["Classify fires according to their so...","Demonstrate your organization's prep...","Outline the OSHA requirements regard...","Explain how to developing a basic or...","Classify fires according to their sources","Demonstrate your organization's preparedness regarding fire safety","Outline the OSHA requirements regarding protective clothing worn by fire brigade teams","Explain how to developing a basic organizational fire safety plan","Classify burn injuries according to the damage they cause to human skin","Outline first aid management techniques used to treat minor and major burns in occupational settings","Describe how to plan emergency egress in case of an emergency according to OSHA's requirements","Highlight OSHA’s requirements regarding your organization’s emergency action plan","Identify the essential elements of an emergency egress plan","Recall different ways to alert employees during an emergency","Classify fires according to their so...","Demonstrate your organization's prep...","Outline the OSHA requirements regard...","Explain how to developing a basic or...","Classify fires according to their sources","Demonstrate your organization's preparedness regarding fire safety","Outline the OSHA requirements regarding protective clothing worn by fire brigade teams","Explain how to developing a basic organizational fire safety plan","Classify burn injuries according to the damage they cause to human skin","Outline first aid management techniques used to treat minor and major burns in occupational settings","Describe how to plan emergency egress in case of an emergency according to OSHA's requirements","Highlight OSHA’s requirements regarding your organization’s emergency action plan","Identify the essential elements of an emergency egress plan","Recall different ways to alert employees during an emergency"],"courseDescription":"<p>Fires present a hazard in nearly all workplaces. They normally occur due to poor implementation of safety regulations and standards - which is in turn often caused by a lack of understanding of occupational health and safety practices. With this in mind, Exoexcellence Consultants have prepared this detailed course on fire protection in occupational settings to help current and aspiring fire safety professionals and managers to protect employees from danger and comply with federal health and safety regulations.</p><p>The course is divided into two modules, each made up of three base topics. We go through the fire safety requirements laid out by the Occupational Safety and Health Administration (OSHA) and explain how to legally implement them to protect workplaces from fire. We show you how to form capable organizational fire brigade teams to protect your workplace in an emergency. We also examine the classification of fires and the equipment used to fight them before demonstrating the first aid methods used to treat burns.&nbsp;</p><p>This course also establishes the importance of developing and implementing a comprehensive emergency egress plan that guides employees out of the building in the event of fire. We present graphics, pictures, statistical information and two case studies based to help you understand the role of OSHA in protecting employees and equipment. Whether you are already a safety officer or want to add this skill to your portfolio, this occupational health and safety&nbsp; course provides the training required to protect your workplace from fire hazards and comply with federal OSHA regulations.</p><a href=\"https://alison.com/resume/courses/5229\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5229\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fire Emergencies and Organizational Preparedness","description":"This module teaches you how to prepare your workplace against fires under OSHA guidelines. It also explains the OSHA requirements regarding designing suits for the fire brigade personnel of an organization. Lastly, the classification of fires, extinguishers, and first aid measures are also explained for major and minor burn injuries.","topics":["Fire Emergencies and Organizational Preparedness  - Learning Outcomes","Organizational Fire Protection and OSHA","Employee Training and Education","First Aid for Occupational Fires","Fire Emergencies and Organizational Preparedness  - Lesson Summary"]},{"name":"Module","details":"Fundamentals of Fire Emergency Evacuation","description":"In this module, you will learn to enact the emergency egress plan for your organization. In addition, we will study how organizations train and prepare their employees for a fire emergency. Finally, the module also contains detailed illustrations that teach you to prepare a proper emergency egress plan for your workplace.","topics":["Fundamentals of Emergency Evacuation - Learning Outcomes","OSHA and Emergency Egress","Developing an Organizational Emergency Action Plan","Preparing for the Evacuation","Fundamentals of Emergency Evacuation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["OSHA Fundamentals - Managing Risk of Fire Emergencies - Course Assessment"]}]}