{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5182","title":"OSHA Fundamentals - Ladder Safety & Prevention of Injuries","totalEnrolled":"946","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how OSHA regulations prevent ladder falls and workplace injuries in this free online health and safety course.","description":"The federal Occupational Health and Safety (OSHA) agency ensures safe working conditions in the US. Its regulations are designated to prevent occupational accidents and injuries. This health and safety course is designed by occupational safety experts to provide the training you need to comply with OSHA and protect your workers. We focus on the OSHA requirements that prevent injuries caused by falls off ladders and other slips and trips.","courseOutcomes":["Define ‘OSHA’ and describe its role ...","Analyze the steps taken to implement...","Describe how OSHA penalizes those gu...","Indicate how organizations can compl...","Define ‘OSHA’ and describe its role in preventing occupational injuries","Analyze the steps taken to implement OSHA safety regulations","Describe how OSHA penalizes those guilty of violating its standards","Indicate how organizations can comply with OSHA regulations","Recognize different types of ladders as defined by OSHA standards","Outline OSHA's rules regarding protection from ladder injuries in workplaces","Compare different ways through which slips, trips and fall injuries can happen in the workplace","Break down the OSHA regulations regarding protection from workplace slips, trips and fall","Define ‘OSHA’ and describe its role ...","Analyze the steps taken to implement...","Describe how OSHA penalizes those gu...","Indicate how organizations can compl...","Define ‘OSHA’ and describe its role in preventing occupational injuries","Analyze the steps taken to implement OSHA safety regulations","Describe how OSHA penalizes those guilty of violating its standards","Indicate how organizations can comply with OSHA regulations","Recognize different types of ladders as defined by OSHA standards","Outline OSHA's rules regarding protection from ladder injuries in workplaces","Compare different ways through which slips, trips and fall injuries can happen in the workplace","Break down the OSHA regulations regarding protection from workplace slips, trips and fall"],"courseDescription":"<p>Today’s proper inspection rules and implementation of safety regulations and standards has led to a worldwide decrease in occupation-related injuries and deaths. However, numerous risks still exist and it is crucial that health and safety managers recognize and understand them to protect workers and equipment from harm.</p><p>This course identifies the various regulatory agencies and organizations responsible for developing occupational safety standards and regulations and focuses on the U.S. federal agency Occupational Safety and Health Administration (OSHA. OSHA’s purpose is to protect workers and employees from various occupational hazards and this course lays out its basics. We explain how OSHA works and how you can legally implement its rules to protect workplace health and safety. This training enables you to comply with important regulations applicable to your specific professional setting.</p><p>Apart from explaining OSHA's framework, this course also explains some of the most important OSHA occupational safety requirements for preventing occupational injuries caused by slips, trips and falls off ladders. We define important terms related to these hazards and compare them to each other. We also provide some important statistics to help you understand the gravity of these hazards. Each topic includes assessment questions to help you test and revise your newfound knowledge. This OSHA course provides the compliance training you need to meet your legal obligations as manager and protect the health and safety of those around you in the workplace.</p><a href=\"https://alison.com/resume/courses/5182\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5182\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Preventing Occupational Injuries with OSHA","description":"This module introduces you to OSHA, its objectives, and how it develops its standards. In addition, you will study how OSHA penalizes violators of its regulations and standards. Moreover, we will also view some of the important OSHA regulations and standards concerning ladder injuries and injuries due to slips, trips, and falls in a workplace.","topics":["Preventing Occupational Injuries with OSHA - Learning Outcomes","Making Workplaces Safe with OSHA","Workplace Injuries Due to Ladders","Slips, Trips, and Falls in Workplace","Preventing Occupational Injuries with OSHA - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["OSHA Fundamentals - Ladder Safety & Prevention of Injuries - Course Assessment"]}]}