{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4347","title":"PMP Project Management - Fundamental Concepts for Beginners","totalEnrolled":"10,619","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This is a free course for newcomers to project management who want to learn what sitting the official PMP exam entails.","description":"Immerse yourself in this beginner’s project management course that covers all the fundamental topics to achieve PMP certification. You will learn the five dimensions of project management, organizational goals, PMP lifecycle, and the steps to complete a project successfully. As a result, you will master the ability to write a project plan, learn the roles of a project manager, and discover the essentials of the PMP certification examination.","courseOutcomes":["Define the concept of project manage...","Describe different dimensions of var...","Explain the different phases of proj...","List the 11 steps of the project's s...","Define the concept of project management","Describe different dimensions of various projects","Explain the different phases of project management","List the 11 steps of the project's success","Evaluate the 10 knowledge areas of project management","Recognize different types of projects","Categorize the eight essential steps for writing a project plan","Describe the roles and responsibilities of a project manager","Distinguish the necessary technical and strategic skills a project manager should have","Discuss the importance of PMP certification","Compare the pros and cons of PMP certification","Relate the overall process of appearing in the PMP exam","Define the concept of project manage...","Describe different dimensions of var...","Explain the different phases of proj...","List the 11 steps of the project's s...","Define the concept of project management","Describe different dimensions of various projects","Explain the different phases of project management","List the 11 steps of the project's success","Evaluate the 10 knowledge areas of project management","Recognize different types of projects","Categorize the eight essential steps for writing a project plan","Describe the roles and responsibilities of a project manager","Distinguish the necessary technical and strategic skills a project manager should have","Discuss the importance of PMP certification","Compare the pros and cons of PMP certification","Relate the overall process of appearing in the PMP exam"],"courseDescription":"<p>Project management is an essential skill for leading and managing projects, with professionals in this area in great demand. Project management is a highly sought-after skill that will help you in advancing your professional career. Different projects have extensive scopes and ranges, which can go from launching a fresh product or organizing a seminar to designing a new brand. Without experience in project management, successfully managing and completing any project can be difficult and time consuming. Globally, specialized institutions help PMP aspirants to prepare for the PMP certification exam. These candidates pass through rigorous training and prepare themselves to become certified PMP professionals. However, training and acquiring knowledge in this field is a lengthy process. This course enables you to gain a basic understanding of the Project Management Professional world, before sitting the PMP certification exam in the future.</p><p>Immersing yourself in this short and comprehensive project management course gives you insight into the PMP certification exam. Its structure encircles the five most essential dimensions of project management and its various aspects, such as the lifecycle of PMP and the critical steps to make a project successful. This program includes the roles of a project manager, the necessary skills required for the project, and the essential prerequisites to appear in the PMP certification exam. This course also introduces the candidates to the eight crucial steps that can help the Project Management Professional in writing the perfect project plan. Future PMP aspirants can also benefit from this knowledge to become qualified to understand the project knowledge areas.</p><p>Once you complete the curriculum, you will be able to demonstrate all necessary fundamental aspects of project management. Although you cannot become an expert simply after considering this information, this course gives you foundational knowledge to prepare you for your future PMP certification. By covering certain aspects, including the importance of project management, organizational goals concerning project management, essential steps for completing a project, and all the vital considerations before appearing in the PMP certification, you will have a basic, yet well-rounded understanding of PMP, and what to expect in the certification.</p><a href=\"https://alison.com/resume/courses/4347\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4347\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Project Management Fundamentals & Essentials","description":"This module will present the basics of project management, its different phases, and its dimensions. It includes the areas for project management, their examples, and the steps for writing a project plan. Additionally, it explains the project planning matrix, the project manager's role, the PMP exam certification, and the steps to apply for it.","topics":["Project Management Fundamentals & Essentials - Learning Outcomes","Introduction to Project Management & Its Phases","11 Considerations for Project Success","Essential Steps for Writing a Project Management Plan","Role of the Project Manager and PMP Certfication","Steps of PMP Certificate Application and Its Importance","Project Management Fundamentals & Essentials - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["PMP Project Management - Fundamental Concepts for Beginners - Course Assessment"]}]}