{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5176","title":"Productivity in the Workplace","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online management training course explains how improved communication and organisation boosts productivity.","description":"This management training course offers tips and techniques you can use to improve professional skills like communication and organisation. We explain how to configure a productive workplace and use effective communication to complete projects on time. We provide handy tips and techniques for managing time, conflict, health and wellness in your organisation to add value to your management skills and bring out the best in those around you.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Workers are considered ‘productive’ when they efficiently complete their tasks and reach their organisational goals on time. Inefficient organisational structures and office problems can compromise such productivity and slow down processes. This management training course identifies the factors that affect office efficiency and explains how to improve your team’s capabilities.</p><p>We show you how to set up a favourable workspace and demonstrate the importance of effective communication in the workplace. We then provide time management strategies to give you the confidence required to plan and implement project timelines and monitor your team’s progress. The course then examines conflict resolution techniques to upgrade your expertise in people management as you learn how to reduce office tension. Your newfound ability to manage time and human resources will help you to create a healthy and productive workplace.</p><p>The final sections of the course focus on the workforce's health, safety and wellness. Much time can be saved if your colleagues are healthy and meantally well. With this in mind, we delve into the important topic of stress management as we provide coping strategies for anxiety and a different perspective to creating a capable and dynamic workplace. The management skills provided in this course are always in demand across various industries and organisational levels. Sign up to add value to your professional expertise and enrich your professional portfolio.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}