{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4636","title":"Remote Team Management and Leadership","totalEnrolled":"2,342","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the best practices for working from home and leading a team as a remote manager with this free online course.","description":"Have you transitioned to a 'work from home' culture and would like to improve your skills as a remote team manager? This free online course will teach you the best practices for working remotely from home and managing teams. You will learn how to hold meaningful virtual meetings and manage the personal differences of a remote team. Explore how to deal with inclusivity, employee productivity and mental health challenges from afar. Enrol today!","courseOutcomes":["Discuss the potential benefits of wo...","Outline some practical tips about wo...","Distinguish between remote team lead...","Explain ways to deal with mental hea...","Discuss the potential benefits of working from home","Outline some practical tips about working remotely","Distinguish between remote team leadership and management","Explain ways to deal with mental health issues related to working from home","List the various technical options or platforms for holding a virtual meeting","Describe how people respond to working from home","Identify the essentials of a meeting that applies to both virtual and physical meetings","Discuss the potential benefits of wo...","Outline some practical tips about wo...","Distinguish between remote team lead...","Explain ways to deal with mental hea...","Discuss the potential benefits of working from home","Outline some practical tips about working remotely","Distinguish between remote team leadership and management","Explain ways to deal with mental health issues related to working from home","List the various technical options or platforms for holding a virtual meeting","Describe how people respond to working from home","Identify the essentials of a meeting that applies to both virtual and physical meetings"],"courseDescription":"<p>With advancements in technology and the impact of other factors such as the Covid-19 pandemic, working from home has become a standard practice for many businesses and organisations to run their operations. Managing remote teams is a skill that every manager needs to learn to thrive in this current work culture. This course provides you with practical tips on efficiently managing a remote team. In the first section, you will learn what it means to become a manager who 'CARES' and explore the challenges you will have to tackle as you supervise your remote teams.</p><p>Next, we examine the effects of working from home on productivity and efficiency both for managers and regular employees. Analyse the technical options for holding virtual meetings and study some basic guidelines to follow to make your virtual meetings as productive as possible. Working from home is often seen in a positive light by workforce members, but this is not always the case. Investigate the mental health risks of working from home and the actions a manager can take to reduce these risks.</p><p>Furthermore, you will discuss the differences between leadership and management when working remotely. Kurt Lewin's ‘leadership styles’ theory will be employed to exemplify the levels of freedom in leading a team as a remote manager. You will also scour Lewis Goldberg's ‘big five’ individual traits to understand why individual differences affect how people respond to remote working conditions. The publisher, Stone River eLearning, provides the corporate, government and the educational sector with proven on-demand training for employees. They have more than 1.3 million students enrolled in their courses. If you are a new or existing manager who wants to learn the best practices for working from home and managing a remote team, this course is for you. Sign up today and start learning.</p><a href=\"https://alison.com/resume/courses/4636\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4636\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Working and Managing Remotely","description":"This module will teach you about working from home as a manager. You will explore practical tips on working from home and understand how to be a manager who CARES. The basic principles of holding a virtual meeting, differences between virtual and physical meetings, and some mental health challenges in remote working, will also be outlined.","topics":["Working and Managing Remotely - Learning Outcomes","Introduction","Working From Home as a Remote Manager","Remote Working as a Remote Manager Who CARES","Virtual Meetings for the Remote Manager","Mental Health and Work Life Balance for the Remote Manager","Leading a Team as a Remote Manager","Managing Individuals Remotely","Working and Managing Remotely - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Remote Team Management and Leadership - Course Assessment"]}]}