{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/3197","title":"Ship Stowage Handling - General and Deck Cargo","totalEnrolled":"569","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about effective methods for stowage handling of general and deck cargo on board ships in this free online course.","description":"This course on ship ‘Stowage Handling - General and Deck Cargo’ offers an in-depth guide to understand the regulations and the strategies for proper handling and stowage of general and deck cargoes. In addition, you will explore multipurpose ships, Ro-Ro operations and the International Maritime Organization’s (IMO’s) Code of Safe Practice for Ships Carrying Timber Deck Cargoes. Register for this course from Alison today.","courseOutcomes":["Relate stability issues to cargo sto...","List the precautions to be taken dur...","Explain the cargo carriage capacity ...","State the precautions to be taken du...","Relate stability issues to cargo stowage","List the precautions to be taken during carriage and stowage of general cargo","Explain the cargo carriage capacity of ships","State the precautions to be taken during carriage and stowage of general cargo","Recall the categorization of cargoes based on their nature","Explain the procedures of efficient securing of deck cargoes","Describe the procedures of battening down hatch covers before loading deck cargo","Recall the importance of providing safe access to essential equipment and spaces","Discuss the procedures used in ensuring unobstructed view from navigating bridge","List the safety precautions to be followed for the maximum permissible load on ships","Explain the basics of a timber carrier vessel","Relate stability issues to cargo sto...","List the precautions to be taken dur...","Explain the cargo carriage capacity ...","State the precautions to be taken du...","Relate stability issues to cargo stowage","List the precautions to be taken during carriage and stowage of general cargo","Explain the cargo carriage capacity of ships","State the precautions to be taken during carriage and stowage of general cargo","Recall the categorization of cargoes based on their nature","Explain the procedures of efficient securing of deck cargoes","Describe the procedures of battening down hatch covers before loading deck cargo","Recall the importance of providing safe access to essential equipment and spaces","Discuss the procedures used in ensuring unobstructed view from navigating bridge","List the safety precautions to be followed for the maximum permissible load on ships","Explain the basics of a timber carrier vessel"],"courseDescription":"<p>Proper stowage is of immense importance for the safety of life at sea. You use different stowage methods to transport different types of cargo. Ship cargoes have continuously witnessed an increase in variety due to the acceptance of these methods. This increase in variety resulted in the advent of codes and different techniques for the proper ship handling storage of different types of cargoes. They are set up to prevent cargo damage occurring before, during and after departures from ports of origin, through transit and to their ports of destination. The packaging of random household items like clothes, furniture and machinery of different kinds necessitated general cargo ships to transport them. Such a variety of items require adaptable functions in carrying them because of their peculiarities of being unusual cargo types for maritime shippers. They also need special features, equipment and onboard gears for loading/unloading, only seen on versatile general cargo ships that carry cargo from both big and small ports. This could prove to be impossible for most types of vessels. This course analyzes the need for this specialized cargo ship by explaining general cargo carriage methods and modes for different cargo types alongside deck cargoes.</p><p>This course offers an understanding of the procedures, strategies and regulations of stowing general cargoes. You will explore deck cargoes alongside their distinct elements relevant to ship stowage. It also offers a basic understanding of handling general and deck onboard cargo ships for effective sea transport. Study the aspects of general cargoes relevant to their unique characteristics of storage and handling of different onboard cargo types, including available cargo loading, multipurpose ships, Ro-Ro operations and carriage procedures. You will learn all aspects of deck cargo, including the battening down of hatch covers and unobstructed view from navigating the bridge. Investigate the International Maritime Organization (IMO) Code of Safe Practice that regulates the proper carriage, stowage and handling of deck cargoes on board ships. We describe the many measures to be observed in undertaking procedures for ensuring safe maximum possible load carriage on ship decks. We also discuss the importance of providing secure access to essential equipment and spaces on cargo ships.</p><p>This course aims to equip you with helpful knowledge of stowage handling of deck cargoes and various types of cargoes onboard general cargo ships. This includes details on the constructional features and the different multipurpose cargo vessels. You will become familiar with available cargo loading, including aspects of carriage and stowage necessary for transporting cargo onboard. You will examine deck cargo’s essential aspects and precautions for achieving the maximum permissible cargo load onboard ships. Aspects of general cargo covered in the course will help professionals maintain ships’ overall stability throughout a voyage by stowing cargo properly. The course will be of significant interest to students, logistic entrepreneurs, researchers, marine operations managers, marine engineers and anyone seeking to learn about the stowage and handling of general and deck cargoes onboard ships. So enrol today!</p><a href=\"https://alison.com/resume/courses/3197\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3197\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"General Cargo","description":"In this module, you will learn about the constructional features of general cargo vessels alongside features of various types of multipurpose ships. You will relate stability issues to cargo stowage while learning about the precautions to be taken during the carriage and stowage of general cargo.","topics":["General Cargo - Learning Outcomes","General Cargo and Loading","Multipurpose Ships","Ro-Ro Operations","Carriage and Stowage","General Cargo - Lesson Summary"]},{"name":"Module","details":"Deck Cargo","description":"In this module, you will learn about the procedures of efficiently securing deck cargoes on board ships alongside the precautions followed in undertaking these procedures in ensuring safe maximum possible load carriage. You will also learn about the importance of providing safe access to essential equipment and spaces on cargo ships.","topics":["Deck Cargo - Learning Outcomes","Introduction to Deck Cargo","Battening Down Hatch Covers","Unobstructed View From Navigating Bridge","IMO Code of Safe Practice","Deck Cargo - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ship Stowage Handling - General and Deck Cargo - Course Assessment"]}]}