{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4998","title":"Social Housing Management","totalEnrolled":"852","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the management and professional scope of running social housing in the UK.","description":"What does a tenant manager do? In this practical course, you will learn about the management of social housing, which describes how to control tenants, rentals and security. You will also learn about the responsibilities of residents and dealing with anti-social behaviour in social housing before understanding its future and career prospects. It will be of use to those aspiring to become housing officers. Enrol today!","courseOutcomes":["Discuss the purpose and allocation o...","Explain the roles and responsibiliti...","Discuss the strategic approaches of ...","Outline the organisational structure...","Discuss the purpose and allocation of social housing","Explain the roles and responsibilities of a tenant manager","Discuss the strategic approaches of Housing Associations","Outline the organisational structures of Housing Associations","Describe the maintenance guidelines in social housing","Recognise the general safety procedures in social housing","Describe the benefits of tenant participation","Outline the different types of tenant involvement","Identify the various forms of anti-social behaviour","Explain the ways to manage anti-social behaviour in social housing","Indicate the skills to help succeed as a social housing manager","Recognise the challenges and opportunities in the social housing sector","Discuss the purpose and allocation o...","Explain the roles and responsibiliti...","Discuss the strategic approaches of ...","Outline the organisational structure...","Discuss the purpose and allocation of social housing","Explain the roles and responsibilities of a tenant manager","Discuss the strategic approaches of Housing Associations","Outline the organisational structures of Housing Associations","Describe the maintenance guidelines in social housing","Recognise the general safety procedures in social housing","Describe the benefits of tenant participation","Outline the different types of tenant involvement","Identify the various forms of anti-social behaviour","Explain the ways to manage anti-social behaviour in social housing","Indicate the skills to help succeed as a social housing manager","Recognise the challenges and opportunities in the social housing sector"],"courseDescription":"<p>Not only does social housing offer affordable rentals but it can also offer a promising career option to those interested in administration and management. What are the different types and benefits of social housing? This course explores the purpose and allocation of social housing. You will learn about the roles and responsibilities of a tenant manager as you dive into the strategic approaches of housing associations.</p><p>As you progress through the general management of social housing, you will become acquainted with the organisation structure of the housing association before learning maintenance guidelines and available safety procedures. The section on roles and responsibilities of tenants, their participation and involvement will equip you with people management skills. In addition, studying anti-social behaviour and how to deal with it will be helpful to your learning experience.</p><p>Finally, you will glimpse the challenges and opportunities in the social housing sector. What is the future of social housing? How can you succeed as a housing officer? While advanced management skills develop on the job, you need some basic knowledge to get started. This course will help you to do just that with its step-by-step explanation. It will teach you the essentials of this sector, and you must grab this opportunity to learn. Register today.</p><a href=\"https://alison.com/resume/courses/4998\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4998\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"General Management of Social Housing","description":"Social housing provides affordable homes to people in the low-income group. This module will teach you the basics of managing social housing. It will cover allocation, housing tenures, managing tenants, rentals, arrears, safety, maintenance and security. You will understand the purpose of social housing and what its management entails.","topics":["Learning Outcomes: General Management of Social Housing","Introduction to Social Housing","Tenant Selection and Tenant Management","Managing Rental Income and Arrears","Maintenance, Safety and Security of Social Housing","Lesson Summary: General Management of Social Housing"]},{"name":"Module","details":"Managing People and Profession","description":"What is tenant participation? This module will cover the resident involvement in social housing. It will highlight the benefits of participation by tenants before explaining the different types of tenant involvement. You will also learn about preventing anti-social behaviour. Finally, you will understand the professional scope of social housing.","topics":["Learning Outcomes: Managing People and Profession","Resident Involvement in Social Housing","Dealing With Anti-Social Behaviours","Career Prospects of a Social Housing Manager","Lesson Summary: Managing People and Profession"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}