{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4264","title":"Strategic Human Resource Management and Development","totalEnrolled":"5,143","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to effectively manage human resources to improve productivity and encourage success with this free online course.","description":"An employee is the most important resource of any organization. Hiring, managing, and effectively using a diverse workforce requires elaborate skills and processes. Learn how to manage human resources more efficiently and become a successful HR manager with this free online course. Get to know about different phases or types of activities, processes, and skills required to manage staff more efficiently even as a non-HR manager.","courseOutcomes":["Describe the skills, techniques, and...","Identify best strategies and skills ...","Describe how to perform a job analys...","Describe steps and best techniques f...","Describe the skills, techniques, and processes required to effectively and efficiently manage Human Resources","Identify best strategies and skills needed for conducting a fair recruitment process and performance evaluation","Describe how to perform a job analysis and create a perfect job description","Describe steps and best techniques for conducting interviews and selecting the right candidates","Explain performance evaluation and its key components and competencies","Define major HR functions like employee onboarding, training, and career progression","Explain the importance of rewards and recognition in people management","Explain the process of handling discipline and termination issues","Define key HR processes, procedures, and strategies like performance management, recruiting, hiring, employee relations, and HR strategy","Describe the skills, techniques, and...","Identify best strategies and skills ...","Describe how to perform a job analys...","Describe steps and best techniques f...","Describe the skills, techniques, and processes required to effectively and efficiently manage Human Resources","Identify best strategies and skills needed for conducting a fair recruitment process and performance evaluation","Describe how to perform a job analysis and create a perfect job description","Describe steps and best techniques for conducting interviews and selecting the right candidates","Explain performance evaluation and its key components and competencies","Define major HR functions like employee onboarding, training, and career progression","Explain the importance of rewards and recognition in people management","Explain the process of handling discipline and termination issues","Define key HR processes, procedures, and strategies like performance management, recruiting, hiring, employee relations, and HR strategy"],"courseDescription":"<p>Do you want to be an effective manager and improve the overall performance of your organization? Or you are a non-HR manager who wants to increase your HR knowledge and skills for effective and efficient people management in your team? If yes, then this free online course is best suited to you. It introduces you to all the advanced techniques and processes of human resource management. Understand key principles of HR like resource management, people management, and organizational development. By the end of this free HR course, you will be better equipped and more confident to manage people and increase overall organizational performance.</p><p>This free online training focuses on the best practices for finding, interviewing, onboarding, and managing human resources. It is divided into different modules to help facilitate your learning. Step by step, learn all the levels and processes required for initiating and conducting effective and successful recruitment and hiring drives. You will be guided on various techniques of interviews, selections, and other required HR metrics like performance management, training, and development. Learn HR functions like discipline and documentation, managing career progression, performance management, training, and developing competencies. As a bonus, you also receive all the professionally produced templates and formats as downloadable resources.</p><p>This course is perfect for non-HR managers who want to improve their leadership and people management skills to become more effective and efficient. It is also well designed for those HR professionals who want to improve and better their abilities and get comfortable with all the latest HR techniques and trends. Join now and be ready to create an impact by methodically managing resources, people, and company performance. Enroll to this free course now, and gain all the skills and knowledge to develop you and your team as an effective, professional, and successful entity.</p><a href=\"https://alison.com/resume/courses/4264\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4264\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Recruitment Process and Performance Evaluation","description":"From writing a job description to executing the process of recruitment, from interviewing, and hiring to evaluating the performance of your team, get familiar with all the main steps, types, and procedures required for these key and fundamental HR functions. Learn all the tricks and techniques needed for carrying out these major HR tasks.","topics":["Recruitment Process and Performance Evaluation– Learning Outcomes","Recruitment and Hiring","Screening and Interviewing","Performance Evaluation","Recruitment Process and Performance Evaluation- Lesson Summary"]},{"name":"Module","details":"Employee Onboarding, Training and Career Progression","description":"In this module, learn about Onboarding, Orientation, and training programs. Understand the difference between orientation and Onboarding, their key metrics, and implementation procedure. Learn HR functions like Reward and Recognition, Work Schedule Management, Succession Planning, and disciplinary actions are also covered in the module.","topics":["Employee On boarding ,Training & Career Progression- Learning Outcomes","Employee Onboarding and Training","Work Schedule Management and Career Projection","Employee Reward and Recognition","Employee Onboarding, Training and Career Progression- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strategic Human Resource Management and Development - Course Assessment"]}]}