{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/5303","title":"Understanding Key Account Management","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the concepts, roles and responsibilities involved in key account management with this free online course.","description":"Key accounts refer to a company's most valuable customers. They are essential to an organization's long-term growth and often necessitate a significant investment of time and resources. However, there is a need for more qualified key account managers. Therefore, we have designed this course to assist you in mastering the concept of key account management and help you develop a clear strategy and program structure to serve and grow key accounts.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Key account management (KAM) is crucial to any organisation for maximising the potential of their sales efforts. Key account managers are expected to use their interpersonal skills to respond to existing customers' requests and ensure their satisfaction and happiness. We have created this course to help you understand KAM concepts and responsibilities better. We begin by defining what it is, its dimensions, the stages of the relationship with key accounts, and how it differs from sales.</p><p>A successful KAM consists of four components, the first of which is identifying key accounts. This course discusses the components of each KAM element in detail. Learn about the characteristics and needs of a potential key account manager and how to build and deliver value to key accounts. Learn about account plan metrics, portfolio analysis, marketing differentiation and planning processes, as well as how to ensure that all actions result in desirable, quantifiable outcomes through ongoing monitoring and attack plan status updates.</p><p>Developing and growing key accounts necessitates critical technical and soft skills. We explore the significance of creating and managing relationships with influential clients. Finally, you will learn the importance of record-keeping for KAM and internal KAM activities. Learn about value propositions and the customer activity cycle. This course is for anyone who wants to become a competent key account manager and develop a strategy and program structure to serve and grow key accounts within an organisation. So why postpone your decision? Register today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}