{"subjectName":"Management","subjectDescription":"These free online management courses will give you the very best in leadership and management training. ‘Management’ is a huge subject that covers many aspects of different jobs across multiple industries. You can ‘manage’ staff, projects, supply chains, war... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/management.jpg","resumeLink":"https://alison.com/resume/courses/4725","title":"Workplace Leadership and Management Skills","totalEnrolled":"3,254","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to manage and lead a company productively by maintaining a healthy workplace in this free online course.","description":"This course aims to help you master the skills needed to manage your organisation successfully and increase your management and leadership abilities. You will learn the process of creating a succession plan and the strategies essential to motivate your employees. Start learning about corporate responsibility and risk management, including dealing with office politics and managing conflicts, time and stress. Enrol today!","courseOutcomes":["Explain the concepts of leadership a...","Discuss the characteristics of a wor...","Recall the functions of various work...","Identify the procedures involved in ...","Explain the concepts of leadership and the roles of leaders","Discuss the characteristics of a workgroup","Recall the functions of various workgroup teams","Identify the procedures involved in resource planning","State the core objective of talent management","List the stages of the performance management cycle","Summarise the goals of succession planning","Distinguish between hearing and listening","Discuss the importance of negotiations","Recall the steps towards effective planning","Identify the tools required to help prioritise workload","Explain the principles of stress management","State the importance of core values in an organisation","Explain the various types of office personalities","Explain the concepts of leadership a...","Discuss the characteristics of a wor...","Recall the functions of various work...","Identify the procedures involved in ...","Explain the concepts of leadership and the roles of leaders","Discuss the characteristics of a workgroup","Recall the functions of various workgroup teams","Identify the procedures involved in resource planning","State the core objective of talent management","List the stages of the performance management cycle","Summarise the goals of succession planning","Distinguish between hearing and listening","Discuss the importance of negotiations","Recall the steps towards effective planning","Identify the tools required to help prioritise workload","Explain the principles of stress management","State the importance of core values in an organisation","Explain the various types of office personalities"],"courseDescription":"<p>Every organisation and workplace's performance and growth are dependent on the managers' direction and leadership qualities. The ability to manage a workplace is therefore a critical component of an organisation's and workplace's motivation. This course gives you the skills you'll need to raise employee morale and motivate them to perform more efficiently. We'll start by helping you grasp management and leadership principles and the process of building a high-performing team in the workplace. After that, you'll discover various employee-motivating strategies and ways of managing talents and constructing a successful succession plan.</p><p>Time management is an important ability to help you operate efficiently under pressure and fulfil deadlines. This course will show you how to plan assignments and avoid procrastination. You will study the ‘Pareto Principle‘ concept of time management and explore other techniques to deal with job stress. You'll then understand how to cope with workplace issues and promote peaceful coexistence among coworkers. Subsequently, we will explain the different types of personalities in the workplace and various risk management tactics.</p><p>Identifying essential disciplines within your organisation and making action plans for people to fill those jobs is what succession planning entails. It identifies weaknesses and skill gaps in the workplace, promotes training and development and protects your brand's integrity and reputation. This course will teach you how to construct high-performing teams and develop effective succession plans. Learn how to manage time, stress and dangers in the office, encourage people and increase overall workplace efficiency!</p><a href=\"https://alison.com/resume/courses/4725\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4725\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Understanding Leadership and Talent Management","description":"This module discusses leadership and its different ideas, including strategies to acquire personal mastery and form effective teams. You'll also discover how to keep people motivated and develop organisational habits. We'll also go through methods to create a succession plan and how to manage talent and performance in the workplace.","topics":["Understanding Leadership and Talent Management - Learning Outcomes","Improving Management and Leadership","Employee Motivation and Organizational Skills","Talent Management and Succession Planning","Understanding Leadership and Talent Management - Lesson Summary"]},{"name":"Module","details":"Negotiation Techniques, Time and Stress Management","description":"This module explains how to effectively listen and communicate by making reasonable concessions, managing time and stress, and overcoming procrastination. You'll learn about corporate ethics, ethical leadership conflicts and different techniques for resolving them.","topics":["Negotiation Techniques, Time and Stress Management - Learning Outcomes","Communication and Negotiation Techniques","Time and Stress Management","Conflict and Risk Management","Negotiation Techniques, Time and Stress Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Workplace Leadership and Management Skills - Course Assessment"]}]}