{
    "subjectName": "Business",
    "subjectDescription": "Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...",
    "subjectBg": "https://cdn01.alison-static.net/search/header-img/business.jpg",
    "resumeLink": "https://alison.com/resume/courses/1935",
    "title": "Administrative Support",
    "totalEnrolled": "-",
    "courseIncludes": [
        "Hours of Learning",
        "CPD Accreditation",
        "Final Assessment"
    ],
    "headline": "Master the fundamentals of administrative support with this free online course to become indispensable in the office.",
    "description": "This course teaches you the basics of organization, resource and time management and communication. We explain how to manage office resources and time more effectively to improve everyone’s performance. We then show you how to improve your verbal and non-verbal communication skills to influence others and empower yourself. This course offers training that can make you a successful and effective administrative assistant or office manager.",
    "courseOutcomes": [
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-",
        "-"
    ],
    "courseDescription": "<p>Would you like to manage your time productively? Do you strive to be organized and want more responsibility in the workplace? This course helps you to reach these goals and teaches you everything you need to know to become a more efficient administrative assistant. We begin with an overview of practical skills to help you refine your organizational skills. We show you how to get the most out of voicemail, emails and interoffice mail before explaining how to optimize your office space and work environment. The course demonstrates how to create a workflow pattern diagram to become more efficient in the workplace.&nbsp;</p><p>Time management is crucial to becoming great at your job and we provide proven techniques to help you to squeeze more productivity out of each hour. We examine the ‘work breakdown structure’ (WBS) document, a key tool to help you open communication between your colleagues and keep it flowing. Learning to prioritize your work will help you focus and keep you on track to meet your deadlines. We then explain how to handle particular tasks that require more precise organization and execution and outline the basics of handling any special tasks that you may encounter. The course delves into verbal and non-verbal communication skills to illustrate their importance in different situations.&nbsp;&nbsp;</p><p>The course then lays out steps you can take to empower yourself. Administrative support professionals are often expected to act independently, make decisions and resolve issues with little or no direction. Learning to operate without oversight is thus necessary but knowing when to be assertive or when to work as part of a team is equally important as it keeps the lines of communication flowing. Working well with your manager and having a positive relationship will lead to more responsibility and therefore more independence. This course is valuable to almost all working people but particularly suits those in administration. Every office needs organized administrators to maintain productivity and this course trains you to become an effective support professional on your way to becoming office manager.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>",
    "certificateDetail": "<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>",
    "modules": [
        {
            "name": "-",
            "details": "-",
            "description": "",
            "topics": []
        },
        {
            "name": "-",
            "details": "-",
            "description": "",
            "topics": []
        }
    ],
    "slides": [
        "\n<ul class=\"maintree ng-pristine ng-untouched ng-valid ng-isolate-scope ui-sortable ng-not-empty\">\n<li id=\"3suSl\" data-space=\"video\" full-editor=\"\" class=\"component list listed selected-class video-box   border active,\">\n<div class=\"asset-header ng-binding\"></div>\n<div class=\"video-edit editable ng-pristine ng-untouched ng-valid ng-scope None ng-not-empty\">\n<div class=\"video-content active\">\n<p>Select your Video URL in the Edit Panel</p>\n<span class=\"icon-video\"></span>\n</div>\n<div class=\"js-video [vimeo, widescreen] active\">\n<iframe frameborder=\"0\" allowfullscreen=\"\" src=\"https://player.vimeo.com/video/377893286\"></iframe>\n</div>\n</div>\n<div class=\"caption ng-binding\"></div></li>\n</ul>\n"
    ]
}