{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1948","title":"Diploma in Social Media Strategy","totalEnrolled":"106,653","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how an effective marketing strategy can make the most out of social media in this free online diploma course.","description":"This diploma course provides the skills you need to become an accomplished social media strategist. We study the rise of social media and explain how to conduct and audit market analysis to help you set goals and select content, channels and platforms. We investigate how to create a social media policy and integrate marketing strategies to improve your client’s brand profile. This diploma course teaches you how to use social media to get ahead.","courseOutcomes":["Discuss how to conduct market analys...","Explain how to align social media go...","Outline different types of social me...","Describe how to formulate and implem...","Discuss how to conduct market analysis to set social media goals","Explain how to align social media goals with your client’s overall organizational goals","Outline different types of social media platform","Describe how to formulate and implement marketing strategies","Recognize how to develop and select effective content","Discuss how to conduct market analys...","Explain how to align social media go...","Outline different types of social me...","Describe how to formulate and implem...","Discuss how to conduct market analysis to set social media goals","Explain how to align social media goals with your client’s overall organizational goals","Outline different types of social media platform","Describe how to formulate and implement marketing strategies","Recognize how to develop and select effective content"],"courseDescription":"<p>This course traces the rise of social media over the last two decades. We show you how to conduct market analysis to better understand your customer base. We then explain how to audit social networks to identify where to spend resources with maximum return. We use practical demonstrations to illustrate the use of social listening and grading tools.</p><p>The course then discusses how to set goals and select platforms that suit your social media content strategy. We examine the role of corporate culture in defining social media marketing plans as we place social media goals in the context of organizational objectives across various platforms. We lay out the process of crafting content that meets your client’s needs step by step.</p><p>The course demonstrates how to provide feedback using social media success platforms. We explain how marketing personas work and break down how to organize customer service with examples of target audience feedback. Finally, we show you how to launch successful social media campaigns while composing the relevant documentation and schedules. This diploma course teaches you how to leverage social media into professional success. With its massive audience reach and dynamic marketing capabilities, social media offers organizations the opportunity to reach more people than ever before so sign up to make the most of this exciting new way to communicate.</p><a href=\"https://alison.com/resume/courses/1948\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1948\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Rise of Social Media","description":"In this module, The Rise of Social Media, students will learn about what social media is and how it has grown. Students will start by learning what social media is and what types of social media platforms exist, from blogs to image sharing, social networks, social book-marketing, video sharing, podcasts, and social news. By completing this module, students will have an understanding of where social media came from and what it is.","topics":["Topic A - What is Social Media?","Topic B - The Growth of Social Media","Review Quiz"]},{"name":"Module","details":"Conducting Market Analysis","description":"In this module, Conducting Market Analysis, students will learn to conduct market analysis. Students will begin by learning about the readiness assessment, which will allow them to gauge how ready the organization is to adopt social media. We will then look at segmentation, targeting, and positioning, or STP analysis. By completing this module, students will understand how to conduct a market analysis.","topics":["Topic A - Conducting Market Analysis","Review Quiz"]},{"name":"Module","details":"Auditing Social Media","description":"In this module, Auditing Social Media, students will learn about auditing social media, social listening tools, and get an example of grading tools. This module will discuss the importance of social media auditing to provide a snapshot of where your organization stands in its current social media capacity and performance. By completing this module, students will understand the process of auditing social media.","topics":["Topic A - Auditing Social Media","Topic A - Demo 1 - Social Listening Tools","Topic A - Demo 2 - Example of Grading Tools","Review Quiz"]},{"name":"Module","details":"Setting Goals and Selecting Platforms","description":"In this module, Setting Goals and Selecting Platforms, students will learn about how corporate culture relates to social media, how the goals of social media can be used to further the goals of the business, and the various types of social media platforms that you will work with as a social media strategist. By completing this module, students will understand how to set goals and select platforms for social media campaigns.","topics":["Topic A - Corporate Culture and Social Media","Topic B - Social Media Goals vs. Business Goals","Topic C - Types of Social Media Platforms","Review Quiz"]},{"name":"Module","details":"Wide-Area Networks","description":"In this module, Wide-Area Networks, students will learn about the social media policy, context for social media policy, and utilizing content. Students will also learn about the Creative Commons, a nonprofit organization that facilitates free and easy-to-use copyright licenses that provide the public with a way to share and use protected content. By completing this module, students will be able to understand what wide-area networks are and how to use them.","topics":["Topic A - The Social Media Policy","Topic A - Demo - Context for Social Media Policy","Topic A - Demo - SocialMedia.org","Topic A - Demo - Utilizing Content","Topic B - Creative Commons","Topic B - Demo - Creative Commons","Review Quiz"]},{"name":"Module","details":"Integrating Marketing Strategies","description":"In this module, Integrating Marketing Strategies, students will learn about brand marketing, including, contests, promotions, Google keyword planner, keyword selection, and where to use keywords. Brands encompass the identity of a company and its products and services as well as reflecting the personality of the company. Students will learn how this personality ties in with social media marketing strategies.","topics":["Topic A - Brand Marketing","Topic A - Demo 1 - Brand Marketing","Topic A - Demo 2 - Contests and Promotions","Topic A - Demo 3 - Google Keyword Planner","Topic B - Keyword Selection","Topic B - Demo 1 - Where to use Keywords","Review Quiz"]},{"name":"Module","details":"Developing Effective Content","description":"In this module, Developing Effective Content, students will learn about content marketing on social media, branded vs general content, content development, and trending content. Knowing how to best leverage content on social media means you'll understand how to make the most of your content to reach your goals. By completing this module, students will understand how to develop effective content.","topics":["Topic A - Content Marketing on Social Media","Topic A - Demo 1 - Branded vs. General Content","Topic B - Content Development","Topic B -  Demo 1 - Trending Content","Review Quiz"]},{"name":"Module","details":"Understanding the Popular Platforms","description":"In this module, Understanding the Popular Platforms, students will learn about understanding the popular platforms, WordPress blogs, using Facebook, YouTube, creating a YouTube channel, uploading a video, Google+, advertising on Google+, LinkedIn, the business side of LinkedIn, Twitter, and advertising on Twitter. By completing this module, students will understand the popular social media platforms that are used.","topics":["Topic A - Understanding the Popular Platforms","Topic A - Demo 1 - Sample Blogs","Topic A - Demo 2 - Wordpress Blogs","Topic A - Demo 3 - Using Facebook","Topic A - Demo 4 - YouTube","Topic A - Demo 5 - Creating a Channel","Topic A - Demo 6 - Uploading Video","Topic A - Demo 7 - Google+","Topic A - Demo 8 - Advertising in Google+","Topic A - Demo 9 - LinkedIn","Topic A - Demo 10 - Business Side of LinkedIn","Topic A - Demo 11 - Twitter","Topic A - Demo 12 - Advertising in Twitter","Review Quiz"]},{"name":"Module","details":"Launching Successful Campaigns","description":"In this module, Launching Successful Campaigns, students will learn about traditional website advertising, social media contests, online contests, social media documentation and schedules, editorial calendar tool, project management software, the performance dashboard tool, and the social media management tool. By completing this module, students will understand how to launch successful campaigns on social media.","topics":["Topic A - Traditional Website Advertising","Topic A - Demo 1 - SocialMedia Contests","Topic A - Demo 2 - Online Contests","Topic B - Social Media Documentation and Schedules","Topic B - Demo 1 - Editorial Calendar Tool","Topic C - Project Management Software","Topic C - Demo 1 - Performance Dashboard Tool","Topic C - Demo 2 - Social Media Management Tool","Review Quiz"]},{"name":"Module","details":"Managing the Community","description":"In this module, Managing the Community, students will learn about the community manager role, creating a response community, importance of voice consistency, three personality musts, social media to build community, and Pinterest. Building and managing a community successfully isn't easy, but if done right it can provide a brand with a loyal customer base.","topics":["Topic A - The Community Manager Role","Topic A - Demo 1 - Creating a Response Community","Topic B - Importance of Voice Consistency","Topic B - Demo 1 - Three Personality Musts","Topic B - Demo 2 - Social Media to Build Community","Topic B - Demo 3 - Pinterest","Review Quiz"]},{"name":"Module","details":"Providing Customer Service","description":"In this module, Providing Customer Service, students will learn about organizational customer service, examples of feedback, and marketing personas that are used to help companies better understand their target market. Students will also learn about social media triage and online versus personal interactions. By completing this module, students will understand the process of using social media to provide customer service.","topics":["Topic A - Organizational Customer Service","Topic A - Demo 1 - Examples of Feedback","Topic A - Demo 2 - Marketing Personas","Topic B - Social Media Triage","Topic C - Online versus Personal Interactions","Review Quiz"]},{"name":"Module","details":"Measuring, Analyzing and Reporting","description":"In this module, students will learn about checking and understanding social media analytics. This module also covers gathering and analyzing statistics related to social media to better understand your audience engagement, goal value, and Google analytics. By completing this module students will have a better understanding of the how and why of social media analytics.","topics":["Topic A - Social Media Analytics","Topic A - Demo 1 - Gathering and Analyzing Statistics Related to Social Media","Topic B - Goal Value","Topic B - Demo 1 - Google Analytics","Review Quiz"]},{"name":"Module","details":"The Social Media Strategist Career","description":"In this module, The Social Media Strategist Career, students will learn in more depth about what a career as a social media strategist entails. With social media on the rise, understanding how to navigate the new, digital frontier with purpose will provide students with an edge in this new job market. By completing this module, students will understand the social media strategist career path.","topics":["Topic A - The Social Media Strategist Career","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Social Media Strategist - Course Assessment"]}],"slides":["\n<ul class=\"maintree ng-pristine ng-untouched ng-valid ng-isolate-scope ui-sortable ng-not-empty\">\n<li id=\"3suSl\" data-space=\"video\" full-editor=\"\" class=\"component list listed selected-class video-box   border active,\">\n<div class=\"asset-header ng-binding\"></div>\n<div class=\"video-edit editable ng-pristine ng-untouched ng-valid ng-scope None ng-not-empty\">\n<div class=\"video-content active\">\n<p>Select your Video URL in the Edit Panel</p>\n<span class=\"icon-video\"></span>\n</div>\n<div class=\"js-video [vimeo, widescreen] active\">\n<iframe frameborder=\"0\" allowfullscreen=\"\" src=\"https://player.vimeo.com/video/168263895\"></iframe>\n</div>\n</div>\n<div class=\"caption ng-binding\"></div></li>\n</ul>\n","\n<ul class=\"maintree ng-pristine ng-untouched ng-valid ng-isolate-scope ui-sortable ng-not-empty\">\n<li id=\"3suSl\" data-space=\"video\" full-editor=\"\" class=\"component list listed selected-class video-box   border active,\">\n<div class=\"asset-header ng-binding\"></div>\n<div class=\"video-edit editable ng-pristine ng-untouched ng-valid ng-scope None ng-not-empty\">\n<div class=\"video-content active\">\n<p>Select your Video URL in the Edit Panel</p>\n<span class=\"icon-video\"></span>\n</div>\n<div class=\"js-video [vimeo, widescreen] active\">\n<iframe frameborder=\"0\" allowfullscreen=\"\" src=\"https://player.vimeo.com/video/168263896\"></iframe>\n</div>\n</div>\n<div class=\"caption ng-binding\"></div></li>\n</ul>\n"]}