{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1951","title":"Introduction to Business Accounting","totalEnrolled":"12,616","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of business accounting with this free online business accounting course.","description":"This free online business accounting course teaches you the basics of professional bookkeeping. In this course you will be introduced to accounting and business, the account equation, and the preparation of a worksheet. You will learn how to analyze transactions, enter information, and adjust entries and summaries. You will also study financial statements, the fiscal year, the process of completing the accounting cycle, and more.","courseOutcomes":["Discuss the process of analyzing tra...","Summarise the adjusting process...","Explain the process for adjusting en...","Outline the process for preparing a ...","Discuss the process of analyzing transactions","Summarise the adjusting process","Explain the process for adjusting entries","Outline the process for preparing a worksheet","Recognize the steps in the accounting cycle","Discuss the process of analyzing tra...","Summarise the adjusting process...","Explain the process for adjusting en...","Outline the process for preparing a ...","Discuss the process of analyzing transactions","Summarise the adjusting process","Explain the process for adjusting entries","Outline the process for preparing a worksheet","Recognize the steps in the accounting cycle"],"courseDescription":"<p>This course, Introduction to Business Accounting, will provide you with an understanding of the basics of business accounting. You will begin with an introduction to professional bookkeeping, covering the basics of bookkeeping professionally. You will be able to define a business, understand ethics in accounting, and discuss generally accepted accounting principles. You will also learn about the accounting equation, transactions, and financial statements.</p><p>This course then explains the process for analyzing transactions. You will learn about the double-entry system and journalizing transactions. You will also learn about entering information, including posting entries, the trial balance, and finding errors using horizontal analysis.</p><p>This course then wraps up explaining the adjustment process, adjusting entries, and the adjustment summary. You will learn how to prepare a worksheet and build financial statements. By taking this course you will learn the ins and outs of the accounting cycle with illustrated examples, the fiscal year, and finally, wrap up with a spreadsheet exercise where you will learn to create a worksheet. So why wait? Start the Introduction to Business Accounting course and learn the skills to become a successful business accountant today.</p><a href=\"https://alison.com/resume/courses/1951\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1951\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Professional Bookkeeper Introduction","description":"In this module, Professional Bookkeeper Introduction, students will learn the basics of bookkeeping in the professional environment.","topics":["Topic A - Professional Bookkeeper","Review Quiz"]},{"name":"Module","details":"Introduction to Accounting and Business","description":"In this module, Introduction to Accounting and Business, students will get an introduction to accounting and business. We will start by defining a business. Students will then learn about ethics in accounting, making sure that all bookkeeping is kept up to date and above board. The module then wraps up by covering GAAP; the generally accepted accounting principles.","topics":["Topic A - Defining a Business","Topic B - Ethics in Accounting","Topic C - Generally Accepted Accounting Principles (GAAP)","Review Quiz"]},{"name":"Module","details":"The Accounting Equation","description":"In this module, The Accounting Equation, students will take a look at the accounting equation. Students will learn about conducting business transactions as a business accountant. Finally, this module will wrap up teaching students about financial statements. By the end of this module, students will have a basic understanding of the accounting equation.","topics":["Topic A - The Accounting Equation","Topic B - Transactions","Topic C - Financial Statements","Review Quiz"]},{"name":"Module","details":"Analyzing Transactions","description":"In this module, Analyzing Transactions, students will learn about the process of analyzing transactions. Students will begin by learning about the accounting equation and transactions. Next, this module takes a look at the double-entry system and journalizing transactions. Finally, we wrap up with a demo that takes a deeper look at journal entries.","topics":["Topic A - The Accounting Equation and Transactions","Topic B - Double-Entry System","Topic C - Transactions - Journalizing","Topic C - Demo 1 - Journal Entries","Review Quiz"]},{"name":"Module","details":"Entering Information - Posting Entries","description":"In this module, Entering Information - Posting Entries, students will learn about entering information and posting entries. This module begins with posting entries, the trial balance, and finding errors using horizontal analysis. It then wraps up with two demos to take a deeper look at the horizontal trend, one for the balance sheet and one for the income statement.","topics":["Topic A - Posting Entries","Topic B - The Trial Balance","Topic C - Finding Errors Using Horizontal Analysis","Topic C -  Demo 1 - Horizontal Trend: Balance Sheet","Topic C -  Demo 2 - Horizontal Trend: Income Statement","Review Quiz"]},{"name":"Module","details":"Adjusting Process","description":"In this module, the Adjusting Process, students will learn about the adjusting process. The adjustment process allows bookkeepers to make adjustments to the accounts to ensure all revenue and the applicable expenses are recorded in the period. By the end of this module, students will have a better understanding of the purpose of the adjusting process.","topics":["Topic A - The Purpose of the Adjusting Process","Review Quiz"]},{"name":"Module","details":"Adjusting Entries","description":"In this module, Adjusting Entries, students will learn about the process of adjusting entries. We will start by taking a look at the prepaid expenses of a business. Then students will learn about the accrued revenues of businesses. The module then wraps up discussing depreciation expense in business.","topics":["Topic A - Adjusting Entries - Prepaid Expenses","Topic B - Adjusting Entries - Accrued Revenues","Topic C - Adjusting Entries - Depreciation Expense","Review Quiz"]},{"name":"Module","details":"Adjustment Summary","description":"In this module, Adjustment Summary, students will learn about the adjustment summary. This module will give a review of the adjustment summary. We will then take a look at the process of vertical analysis. Finally, this module wraps up with a demo where students will take a deeper look at the vertical analysis.","topics":["Topic A - Adjustment Summary - Review","Topic B - Vertical Analysis","Topic B - Demo 1 - Vertical Analysis","Review Quiz"]},{"name":"Module","details":"Preparing a Worksheet","description":"In this module, Preparing a Worksheet, students will learn about the process of preparing a worksheet.","topics":["Topic A - Preparing a Worksheet","Review Quiz"]},{"name":"Module","details":"Financial Statements","description":"In this module, Financial Statements, students will learn about types of financial statements. In the first topic, we will take a look at the income statement. Next, students will take a look at definitions of financial statements. Upon completing this module, students will have an understanding of financial statements.","topics":["Topic A - The Income Statement","Topic B - Financial Statements - Definitions","Review Quiz"]},{"name":"Module","details":"Completing the Accounting Cycle","description":"In this module, Completing the Accounting Cycle, students will learn about completing the accounting cycle. Students will take a look at temporary accounts and learn how they compare with permanent accounts. By the end of this module, students will be able to understand completing the accounting cycle.","topics":["Topic A - Temporary vs. Permanent Accounts","Review Quiz"]},{"name":"Module","details":"The Accounting Cycle Illustrated","description":"In this module, The Accounting Cycle Illustrated, students will look at an illustration of the accounting cycle. The accounting cycle consists of ten steps, of which the first five will be introduced in the first topic. Students will then learn about steps six through ten in the second topic, covering all ten steps in the accounting cycle.","topics":["Topic A - Accounting Cycle Illustrated – Steps 1-5","Topic B - Accounting Cycle Illustrated – Steps 6-10","Review Quiz"]},{"name":"Module","details":"Fiscal Year","description":"In this module, Fiscal Year, students will learn about the fiscal year. A fiscal year breaks into quarters and in this module, students will take a look at what those quarters of a fiscal year are and how they are used to plan for business finances and expenses. Understanding the fiscal year is key to business accounting.","topics":["Topic A - Fiscal Year","Review Quiz"]},{"name":"Module","details":"Spreadsheet Exercise","description":"In this module, Spreadsheet Exercise, students will learn to create a worksheet to help in staying organized with business accounting. In a seven-step exercise, students will learn to create a worksheet to organize the information needed in a helpful manner in regard to business accounting.","topics":["Topic A - Spreadsheet Exercise – Steps 1-4","Topic B - Spreadsheet Exercise – Steps 5-7","Topic B - Demo 1 - Creating a Worksheet","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Business Accounting - Course assessment"]}],"slides":["\n<ul class=\"maintree ng-pristine ng-untouched ng-valid ng-isolate-scope ui-sortable ng-not-empty\">\n<li id=\"3suSl\" data-space=\"video\" full-editor=\"\" class=\"component list active, listed selected-class video-box\">\n<div class=\"asset-header ng-binding\"></div>\n<div class=\"video-edit editable ng-pristine ng-untouched ng-valid ng-scope ng-not-empty None\">\n<div class=\"video-content\" style=\"display: none;\">\n<p>Select your Video URL in the Edit Panel</p>\n<span class=\"icon-video\"></span>\n</div>\n<div class=\"js-video [vimeo, widescreen] active\">\n<iframe frameborder=\"0\" allowfullscreen=\"\" src=\"https://player.vimeo.com/video/175385564\"></iframe>\n</div>\n</div>\n<div class=\"caption ng-binding\"></div>\n</li>\n</ul>\n"]}