{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1934","title":"Middle Manager","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the skills it takes to be a Middle Manager with this free online middle management training course.","description":"This free online middle management course will teach you about management, ethics, and social responsibility. In this course you will learn about managing information, making decisions, managing teams, and becoming a good leader. You will also look into organizational strategy, innovation, change, organizational structures, and motivation. This will help you acquire and develop the skills needed to become an effective middle manager.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course, Middle Manager, will provide you with an understanding of the skills needed to manage others. You will learn about ethics and social responsibility in the field of middle management. You will be able to explain how to act ethically and what that means, as well as what your social responsibilities are as a manager. You will also learn about the process for managing information.</p><p>This course then explains in more detail the process for decision making. You will learn about what goes into making big decisions that will affect those that work under you as well as yourself. You will also learn about keeping and maintaining control.</p><p>This course then wraps up by discussing organizational strategy, innovation, change, organizational structures, managing teams, motivation, and leadership. You will learn strategies for getting and staying organized as well as ways to adapt to innovation and change. By taking this course you will learn fundamental skills to support your success in a middle management position, from managing teams to motivating and leading those teams to success. So why wait? Start learning today.&nbsp;</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}],"slides":["\n<ul class=\"maintree ng-pristine ng-untouched ng-valid ng-isolate-scope ui-sortable ng-not-empty\">\n<li id=\"3suSl\" data-space=\"video\" full-editor=\"\" class=\"component list listed selected-class video-box   border active,\">\n<div class=\"asset-header ng-binding\"></div>\n<div class=\"video-edit editable ng-pristine ng-untouched ng-valid ng-scope None ng-not-empty\">\n<div class=\"video-content active\">\n<p>Select your Video URL in the Edit Panel</p>\n<span class=\"icon-video\"></span>\n</div>\n<div class=\"js-video [vimeo, widescreen] active\">\n<iframe frameborder=\"0\" allowfullscreen=\"\" src=\"https://player.vimeo.com/video/377895894\"></iframe>\n</div>\n</div>\n<div class=\"caption ng-binding\"></div>\n</li>\n</ul>\n"]}