{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5214","title":"Office Procedures in the Modern Workplace","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the inner workings of the modern workplace and pick up office administration skills in this free online course.","description":"As businesses grow and technology evolves, the administration practices used in modern offices change. Highly skilled and motivated office professionals create productive workplaces and are in high demand. This short course covers the basics of office operations and explains how to communicate effectively in the modern workplace to help you reach your full potential. Sign up to polish your CV and take the first step towards white collar success.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you want to work in an office and need to enhance your professional business skills? Office personnel hold their organisation together and ensure that things run smoothly. This administration course is taught by Sherique Dill, an office management expert with over twenty years’ experience, and is designed to be engaging and straightforward to help you learn the best office skills in a few hours.</p><p>The course begins with a simple definition of ‘office’ as we lay out their various types. We then discuss the basic functions of a modern office and explain how to become an outstanding receptionist who respects confidentiality and keeps the reception area safe. We then delve into office support, office terminology, filing systems and equipment used for data processing.</p><p>We conclude with the all-important topic of workplace communication. We examine the various ways we can communicate effectively to provide the communication skills you need to succeed in a white collar environment. We trace the impact of emotions on communication and establish the importance of receiving feedback. You can download study notes from our ‘Resources’ section to help you master these skills and provide useful information for later reference. Sign up for this office administration course to learn the basic skills you need to prosper in the corporate workplace.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}