{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2617","title":"Organizational Behaviour - Understanding Attitude, Emotions and Motivation","totalEnrolled":"2,651","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course learn how attitudes, emotions, and motives drive human behaviour.","description":"This free online course on Attitude, Emotions and Motivation will explain how these concepts are at the core of human behaviour and drive our decision-making process. Organizational Behaviour is a field of the academic study of how people act within groups. Its principles are applied primarily in an attempt to make businesses operate more effectively. Learn how these three Principles help organizations become more efficient.","courseOutcomes":["Define Attitudes, Emotions and Motiv...","Recognize the relationship between V...","Discuss Cognitive Dissonance...","Describe the Characteristics of Need...","Define Attitudes, Emotions and Motives","Recognize the relationship between Values and Attitudes","Discuss Cognitive Dissonance","Describe the Characteristics of Needs","Explain Motivational Theories","Identify what motivates and how to motivate others","Define Attitudes, Emotions and Motiv...","Recognize the relationship between V...","Discuss Cognitive Dissonance...","Describe the Characteristics of Need...","Define Attitudes, Emotions and Motives","Recognize the relationship between Values and Attitudes","Discuss Cognitive Dissonance","Describe the Characteristics of Needs","Explain Motivational Theories","Identify what motivates and how to motivate others"],"courseDescription":"<p>This free online course on Attitude, Emotions and Motivation will explain how attitudes are formed, how emotions are managed and how our needs drive our behaviour. Most adults spend at least thirty percent of their lifetime in their workplace and/or in work-related activities. Like in any other context, human behaviour in the organizational and work context is a complex phenomenon. This course will teach you how individuals and groups behave at work and will discuss how to improve their effectiveness and nurture their quality of work-life.</p><p>First, you will learn about Attitudes. An attitude can either have a positive or negative effect in the workplace. This course will teach you what factors contribute to the development of attitudes, and what those in management positions can do to change negative attitudes and promote positive ones. Next, you will learn about emotions in the workplace. Negative emotions such as stress can at times be an unavoidable work hazard, but knowing how to manage emotions can improve the quality of work-life for employees.</p><p>Finally, you will learn about Motivation, the underlying drive of individuals to accomplish tasks and goals and one of the most important aspects of Organizational Behaviour. You will analyze Motivational Theories, understand what motivates employees and how to motivate them to meet their full potential. Most organizations require their managers to take courses on Organizational Behaviour, so why wait? Start learning today and be one step ahead of your colleagues in understanding Attitudes, Emotions and Motivation in the area of Organizational Behaviour.</p><a href=\"https://alison.com/resume/courses/2617\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2617\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Attitude","description":"Attitudes are often the result of experience or upbringing, and they can have a powerful influence over behaviour. This Module will explain what factors influence our attitude, how we can change an individual's attitude and the implications of attitudes in an organizational setting.","topics":["Attitude - Learning Outcomes","Defining Attitude","Attitudes and Other Related Concepts","Characteristics of Attitude","How Our Attitudes  Are Formed and Measured","Cognitive Dissonance","Attitudes in The Work Place","Attitude - Lesson Summary"]},{"name":"Module","details":"Emotions","description":"We all experience emotions and they have a powerful influence on our thoughts and behaviour. This Module will explain how our emotions impact our performance in the workplace. It will also discuss the impact stress has on employees and how we can manage stress.","topics":["Emotions - Learning Outcomes","Understanding Emotions","Crucial Emotions, Anger and Aggression","Stress","Emotions - Lesson Summary"]},{"name":"Module","details":"Motivation","description":"Motivation is the process that initiates, guides, and maintains goal-oriented behaviours. This Topic will analyze what motivates individuals and how to motivate employees to perform in the workplace.","topics":["Motivation - Learning Outcomes","Defining Motivation","Types of Motives","Content Theories of Motivation","Process Theories of Motivation","Motivation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}