{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2616","title":"Organizational Behaviour - Personality and Learning Theories","totalEnrolled":"2,090","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn how personality influences behaviour, and how the environment influences learning.","description":"This free online course on Learning and Personality will explain how an individual's personality is formed and how people learn as they interact with their environment. Organizational Behaviour is a field of the academic study of how people act within groups. Its principles are applied primarily in an attempt to make businesses operate more effectively. Learn how these two principles help organizations become more efficient.","courseOutcomes":["Define the concept of Learning and P...","Discuss Personality Theories...","Describe the process of Conditioning...","Explain Learning Principles...","Define the concept of Learning and Personality","Discuss Personality Theories","Describe the process of Conditioning of Behaviour","Explain Learning Principles","Recognize the impact of Personality in organizational leadership and motivation","Analyze how people learn as they interact with their surroundings","Define the concept of Learning and P...","Discuss Personality Theories...","Describe the process of Conditioning...","Explain Learning Principles...","Define the concept of Learning and Personality","Discuss Personality Theories","Describe the process of Conditioning of Behaviour","Explain Learning Principles","Recognize the impact of Personality in organizational leadership and motivation","Analyze how people learn as they interact with their surroundings"],"courseDescription":"<p>This free online course on Learning and Personality will explain how personality is formed, how an individual’s personality type can have either a negative or positive impact in their behaviour and how people learn as they interact with their environment. Work is an inherent part of human behaviour. Most adults spend at least thirty per cent of their lifetime in their workplace and/or in work-related activities. Like in any other context, human behaviour in the organizational and work context is a complex phenomenon. This course will teach you how individuals and groups behave at work and will discuss how to improve their effectiveness and nurture their quality of work-life.</p><p>This course will help those who have management responsibilities in any organization to learn about Organizational Behaviour, it’s applications and benefits. First, you will learn about one of its key principles, that of Personality. Personality plays a key role in Organizational Behaviour because of the way people think, feel, and behave, which affects many aspects of the workplace. You will learn about Personality Theories and what factors determine an individual’s personality. You will also learn how to test for personality types and how personality affects such things as motivation, leadership and performance.</p><p>By the end of this course, you will understand another important principle in Organizational Behaviour, that of Learning, and how we can use Learning Principles to train, educate, and shape behaviour in the workplace. If the behaviour is learned and not just an inherent part of our genetic makeup, then it can be taught. Most organizations require their managers to take courses on Organizational Behaviour, so why wait? Start learning today and be one step ahead of your colleagues in understanding Personality and Learning in the area of Organizational Behaviour.</p><a href=\"https://alison.com/resume/courses/2616\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2616\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Personality","description":"Every Individual is different and it is our personality that makes each one of us different. This Module will discuss how psychologist define personality and what factors contribute to the development of our unique personality. You will also be introduced to different Personality Theories that try to explain how our personality develops from early childhood onward. Understanding an individual's personality is important in order to understand their behaviour.","topics":["Personality Learning Outcomes","Introduction to Personality","Intrapsychic Theory","Social Learning Theory","Self Theory","Self Awareness","Other Personality Attributes","Personality - Lesson Summary"]},{"name":"Module","details":"Learning","description":"Psychologists often define learning as a relatively permanent change in behaviour as a result of experience. The psychology of learning focuses on a range of topics related to how people learn and interact with their environments. This module will discuss a few of these Learning Theories and their application in an organizational setting.","topics":["Learning - Learning Outcomes","Defining Learning","Behaviourist Theories","Cognitive Learning Theory","Observational Learning Theory","Learning - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}