{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3829","title":"Persuasion and Personal Branding","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the techniques to deliver more effective ‘elevator pitches’ and persuasive speeches with this free online course.","description":"'Elevator pitches' and persuasive speeches are commonplace in any workplace, whether you are just starting your career or looking for that long-awaited promotion. How effective these talks are, comes down to preparation. In this free online course, you will learn how to brainstorm the best ideas to include, how to rehearse to the best of your ability, and talk your way to success by developing your people persuasion skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Persuading someone to continue a conversation in an office environment is the singular goal of an 'elevator pitch'. The odds of securing a second meeting improve greatly if you take the time to develop your people persuasion skills. In this free online course, you will learn to brainstorm, write and rehearse this pitch, or any kind of persuasive speech, using techniques developed by personal development expert TJ Walker. Your studies begin with the previously mentioned elevator pitch. Initially, you will learn the benefits of writing out the goals of your elevator pitch and the possible repercussions of giving it with no goals in mind. You will take the time to determine how long your pitch should be by judging different areas of your surroundings when giving your elevator pitch. You will also be encouraged to research good and bad pitches found online or even on popular TV shows, like Shark Tank.</p><p>You will take a deep-dive into TJ's personally developed technique of rehearsing your pitch, speech or any talk you need to give, using only a camera. As pointed out in the personal branding course, the equipment required for this technique has become easier to obtain as technology has improved over time. You will cover methods that you should avoid when rehearsing and how they can hinder your improvement, and how memorising your entire speech or pitch and practising in front of a mirror is more distracting than beneficial. How much experience do you have with talking on camera? This persuasive speech training covers how you can fix the problems you have with your recording while also pushing you to look for the good points in your recording. You will have ample opportunity to become comfortable with the idea of watching yourself on camera, with self-improvement as the reason behind your actions.</p><p>This course finishes with a focus on persuasive speeches and what should be included in them. Included in this section is brainstorming ideas for your speech, how many ideas should be included in a brainstorm and what type of emotion each idea should encapsulate. Including stories in your speech will be discussed in detail as they could be the reason your speech is labelled good or bad by your audience. Visual tools, such as PowerPoint slides are covered and why you should use them sparingly are taught within the topics as well. Some of the main reasons why speeches fail to persuade their audiences will also be covered and throughout this course, you will form a solid understanding of what persuasion is and how to pitch your ideas to others successfully. Start this top persuasion course today to learn how you can write, practice and give elevator pitches and persuasive speeches that will help lead you to success in all areas of your life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}