{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2336","title":"Presentation and Speaking Skills for Webinars","totalEnrolled":"7,413","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn presentation skills, tips for public speaking, and how to create a great webinar with this free online course.","description":"This free online course, Presentation and Speaking Skills for Webinars, will teach students about presentation skills, public speaking, and the process for creating great webinars. When it comes to communication, being clear and concise with your audience is key. So, why wait? Start this course today and learn about what it takes to give a great presentation.","courseOutcomes":["Outline Overcoming the nervousness o...","Describe what to do leading up to yo...","Explain taking and answering questio...","Evaluate how to decide on the best f...","Outline Overcoming the nervousness of public speaking","Describe what to do leading up to your webinar","Explain taking and answering questions after your presentation","Evaluate how to decide on the best format for your presentation","Indicate what a webinar can do to benefit a presentation","Outline Overcoming the nervousness o...","Describe what to do leading up to yo...","Explain taking and answering questio...","Evaluate how to decide on the best f...","Outline Overcoming the nervousness of public speaking","Describe what to do leading up to your webinar","Explain taking and answering questions after your presentation","Evaluate how to decide on the best format for your presentation","Indicate what a webinar can do to benefit a presentation"],"courseDescription":"<p>This course, Presentation and Speaking Skills for Webinars, will provide you with an understanding of Presentation Skills. You will learn about creating the program, choosing your delivery methods, verbal communication skills, and non--verbal communication skills. You will be able to explain how to overcome nervousness associated with your presentation. You will also learn about creating fantastic flip charts, compelling PowerPoint presentations, how to wow 'em with the white board, and how to pump it up a notch.</p><p>This course then explains tips and tactics for public speaking. You will learn about identifying your audience, creating a basic outline, organizing the program, fleshing it out, and putting it all together. You will also learn about being prepared, overcoming nervousness, developing your speech, and how to handle questions and answers.</p><p>This course then wraps up by diving into creating a great webinar. You will learn what a webinar can do, successful webinar criteria, how to find the right format, using social media for marketing, and what to do in the days and weeks leading up to your webinar. By taking this course you will learn about DriveUp registration, tips for your presentation, how to interact with your audience, and mistakes to avoid. So why wait? Start learning today.</p><a href=\"https://alison.com/resume/courses/2336\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2336\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Presentation Skills","description":"This Module will introduce students to presentation skills, including creating the program and choosing your delivery methods. Learn about verbal communication skills along with non-verbal communication skills and overcoming nervousness. Discover how to create fantastic flip charts, compelling PPT presentations, and how to wow ‘em with the whiteboard. Lastly, learn about creating vibrant videos and amazing audio.","topics":["Getting Started","Creating the Program","Choosing Your Delivery Methods","Verbal Communication Skills","Non-Verbal Communication Skills","Overcoming Nervousness","Creating Fantastic Flip Charts","Creating Compelling PPT Presentations","Wow 'em with the Whiteboard","Vibrant Videos and Amazing Audio","Pumping it up a Notch"]},{"name":"Module","details":"Public Speaking","description":"This Module will introduce students to public speaking, including identifying your audience and creating a basic outline. Learn how to organize the program, flesh it out, and put it all together. Lastly learn how to be prepared, overcome nervousness, and deliver your speech.","topics":["Getting Started","Identifying Your Audience","Creating a Basic Outline","Organizing the Program","Fleshing it Out","Putting it All Together","Being Prepared","Overcoming Nervousness","Delivering Your Speech I","Delivering Your Speech II","Questions and Answers"]},{"name":"Module","details":"Creating a Great Webinar","description":"This Module will introduce students to creating a great webinar, including what a webinar can do, successful webinar criteria, and finding the right format. Learn about marketing and social media as well as what to do leading up to your webinar. This module will cover DriveUp registration, presentation tips, and interacting with your audience. Lastly learn about mistakes to avoid, and what to do post event.","topics":["Getting Started with PowerPoint","What can a Webinar do?","Successful Webinar Criteria","Find the Right Format","Marketing and Social Media","Leading Up to Your Webinar","DriveUp Registration","Presentation Tips","Interacting with Your Audience","Mistakes to Avoid","Post Event"]},{"name":"Module","details":"Course assessment","description":"","topics":["Presentation and Speaking Skills for Webinars - Course assessment"]}]}