{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1900","title":"Principles of Accounting","totalEnrolled":"17,222","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the principles of accounting and learn how to use unique visualization software in this free online course.","description":"This course takes you through the fundamentals of accounting and explains concepts like revenue, costs, assets, liabilities and equity through a series of groundbreaking business simulations. We introduce you to the ‘fundamental accounting equation’, double-entry bookkeeping, financial statements, managing cash flow, the operating cycle, fixed assets, company funding and more. Sign up to explore a career in finance and bookkeeping.","courseOutcomes":["Understand how accounting works...","Evaluate accounting transactions and...","Explain how the ‘accrual principle’ ...","Describe how profit, cashflow and th...","Understand how accounting works","Evaluate accounting transactions and balances and track their interaction through debits and credits","Explain how the ‘accrual principle’ creates a fundamental difference between profit and cashflow","Describe how profit, cashflow and the balance sheet are connected","Interpret key financial statements","Analyze the ‘fundamental accounting equation’ and explain its consequences","Calculate profitability ratios and appreciate their implications","Manage cashflow and working capital through the operating cycle","Account for fixed assets and depreciation","Explain the issues with intangible asset accounting","Evaluate the funding options available to companies","Understand how accounting works...","Evaluate accounting transactions and...","Explain how the ‘accrual principle’ ...","Describe how profit, cashflow and th...","Understand how accounting works","Evaluate accounting transactions and balances and track their interaction through debits and credits","Explain how the ‘accrual principle’ creates a fundamental difference between profit and cashflow","Describe how profit, cashflow and the balance sheet are connected","Interpret key financial statements","Analyze the ‘fundamental accounting equation’ and explain its consequences","Calculate profitability ratios and appreciate their implications","Manage cashflow and working capital through the operating cycle","Account for fixed assets and depreciation","Explain the issues with intangible asset accounting","Evaluate the funding options available to companies"],"courseDescription":"<p>This course is created by Accounting Intuition and accredited by the Chartered Institute of Management Accountants (CIMA). We believe that the best way to learn is through experience so we have developed a set of groundbreaking visualization models. These lessons use the analogy of water pipes and tanks to explain accounting methods to provide an intuitive understanding of how money moves around a simple, connected system.</p><p>The course assumes no prior accounting knowledge and lays out the building blocks of bookkeeping step by step. We employ a series of case studies and simulations to describe revenue, costs, assets, liabilities and equity. We also simulate the running of a small business to break down the ‘fundamental accounting equation’ (or ‘balance sheet equation’) and explain the workings of double-entry bookkeeping, financial statements, managing cashflow, the operating cycle, fixed assets and company funding.</p><p>Such models are used by leading universities to help their students understand financial concepts and drive this course. Whether you are completely new to finance or simply want an engaging refresher to update your skills, sign up for this course to develop a lifelong, intuitive understanding of accounting. This course suits aspiring bookkeepers and can help small business owners to take control of their finances.</p><a href=\"https://alison.com/resume/courses/1900\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1900\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Accrual Principle","description":"In this module you will start at the very beginning and learn how the accrual principle creates a fundamental difference between revenue and cash receipts. The accrual principle is the reason that accounting requires estimation and judgement rather than just the process of recording transactions.","topics":["Course Introduction","The Accrual Principle","The Accrual Principle - Pros and Cons","Summary","Quiz - The Accrual Principle"]},{"name":"Module","details":"Revenue and Cash","description":"In this module you will learn the concepts of accounting transactions and balances. You will use the first interactive model to explore the relationship between revenue, the receivables balance and cashflow.","topics":["Revenue and Cash","The Receivables Balance","Summary","Quiz - Revenue and Cash"]},{"name":"Module","details":"Assets and Liabilities","description":"In this module you will use another interactive model to explore how the timing difference between incurring costs and paying for them creates a payables balance. You will learn that assets and liabilities are different types of accounting balances and understand how they are created.","topics":["Assets & Liabilities","Cashflow","Summary","Quiz - Assets and Liabilities"]},{"name":"Module","details":"Equity","description":"In this module you will use another interactive model to explore what the profit and loss account is. You will learn about the concept of equity. You will understand why the balance sheet always balances due to double-entry bookkeeping.","topics":["The Profit and Loss Account","Equity","The Fundamental Accounting Equation","Debits and Credits","Summary","Quiz - Equity"]},{"name":"Module","details":"Financial Statements","description":"This topic introduces the format of the 3 main financial statements: the profit and loss statement, balance sheet and cashflow statement. You will learn what information is contained in each statement and how the different financial statements are connected. You will learn techniques such as simple trend and profitability analysis in order to interpret the financial information.","topics":["The Profit and Loss Statement","The Balance Sheet","The Cashflow Statement","Financial Analysis","Summary","Quiz - Financial Statements"]},{"name":"Module","details":"Working Capital","description":"Learn about working capital and how to manage cashflow.","topics":["Direct and Indirect Costs","Current Assets","Working Capital","Cash Conversion","Summary","Quiz - Working Capital"]},{"name":"Module","details":"The Operating Cycle","description":"Learn about cash conversion and how money flows through a company by examining the operating cycle.","topics":["Inventory Days","The Operating Cycle","Summary","Quiz - Operating Cycle"]},{"name":"Module","details":"Profit, Assets and Cashflow","description":"Learn the simple equation that connects profit and loss, the balance sheet and cashflow and explore how this equation made the global financial crisis possible.","topics":["The Profit Equation","Assumed Assets","The Financial Crisis","Summary","Quiz - Profit, Assets & Cashflow"]},{"name":"Module","details":"Fixed and Intangible Assets","description":"Learn about fixed assets and depreciation techniques as well as intangible assets and amortisation.","topics":["Fixed Assets","Depreciation","Depreciation Techniques","Intangible Assets","Goodwill","Summary","Quiz - Fixed and Intangible Assets"]},{"name":"Module","details":"Business Funding","description":"Learn about the different types of funding available for companies.","topics":["Equity and Debt","Share Capital","Debt Funding","Business Funding","Quiz - Business Funding"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}