{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3975","title":"Principles of Marketing Strategy","totalEnrolled":"2,374","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a comprehensive understanding of the principles and practices of marketing strategy in this free online course.","description":"Many general marketing practitioners today lack a fundamental understanding of marketing strategy and its importance. This free online course is designed to help you refine your knowledge of the core principles of marketing strategy, research, and models. You will study some modern-day marketing personalities to learn from, along with a strong focus on practicality, digital online application, theories, and real-life experiences.","courseOutcomes":["Explain the first principles of mark...","Identify the six powers of persuasio...","Discuss customer profiles from the p...","List the various marketing tools tha...","Explain the first principles of marketing","Identify the six powers of persuasion, what each one means, and how marketers can use them efficiently","Discuss customer profiles from the point of view of customer demographics and psychographics","List the various marketing tools that you can use to conduct market research","Distinguish between marketing-driven and market-driven","Outline the process of conducting needs-based segmentation","Discuss marketing models, why they are important and how they fit into marketing strategy","Describe the anatomy and framework of growth loops","Explain the first principles of mark...","Identify the six powers of persuasio...","Discuss customer profiles from the p...","List the various marketing tools tha...","Explain the first principles of marketing","Identify the six powers of persuasion, what each one means, and how marketers can use them efficiently","Discuss customer profiles from the point of view of customer demographics and psychographics","List the various marketing tools that you can use to conduct market research","Distinguish between marketing-driven and market-driven","Outline the process of conducting needs-based segmentation","Discuss marketing models, why they are important and how they fit into marketing strategy","Describe the anatomy and framework of growth loops"],"courseDescription":"<p>This free online marketing certification is designed by Mark Meyerson and his time in the marketing industry has revealed that many seasoned marketing practitioners do not have a thorough understanding of marketing strategy and what it is. Even if you have been working for a long time in this industry, there is a lot to learn from this course. You will begin your journey to understanding marketing strategy with an explanation of the concept of first principles. This is a concept most deep thinkers and famous people have used and proposed. Elon Musk’s explanation of the first principle on YouTube will be highlighted. You will come to understand strategy, what it is, what it isn’t, and how to implement it to set you apart from 80% to 90% of marketers out there today. An analogy of planning a military campaign will be used to explain more concepts of marketing strategy. The differences between strategy and tactics will also be examined in this marketing strategy course. Thereafter you will learn about price, place, product, and promotions; the core principles of marketing which are also known as the 4P’s of marketing. The six powers of persuasion or techniques proposed by Robert Cialdini in his book \"Influence\" will be critically analyzed in this section as well.</p><p>The next part of the course content will introduce you to the factors and benefits of market research in the context of marketing. This section is divided into two subsections and in the first part, you will learn about customer profiles. These customer profiles will be examined from the point of view of customer demographics as well as psychographics. With a hypothetical example of a travel insurance company to help you understand the importance of defining customer profiles, you will be trained on how to create a customer profile using three distinct people. In the second section of the market research components, you will study all the best tools that you can use to conduct market research. This in itself is divided into three categories of marketing tools. The first is industry tools and these are all third-party tools that contain data that you can only get outside your own profile. Six types of these third-party tools will be discussed. The second involves competitor research tools. These are also third-party tools but related to competitor research and include sites like Facebook and LinkedIn page transparency, keyword data sites, and email marketing. The third category of the marketing research tool deals with owned profiles or properties. The process of leveraging an existing tool to find information or data around your existing customers and how you can use that data to get a better understanding of who your target audience should be will be the main focus for this section.</p><p>Technical marketing model frameworks and their importance form the next part of the course. You will learn about the AIDA, A.R.E, A.A.R.R.R models as well as their respective stages. Each of these marketing models will be compared with the 4 Ps of marketing. Then, you will study the experimentation model, also known as the test and learn strategy. The measurability of online campaigns and why testing is important in modern-day marketing strategy will be examined. As you work towards the end of this marketing training, you will be taught about testing and loops which covers very important marketing components such as building feedback loops, growth loops, testing the 4 Ps, and advertising platform testing. Lastly, you will see some key modern-day marketing personalities or gurus, how they interact and the relationship that their tools have with the marketing frameworks. This marketing course is designed for people beginning their careers in digital marketing and also seasoned practitioners who want to move from the execution part of marketing to marketing strategy.</p><a href=\"https://alison.com/resume/courses/3975\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3975\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Marketing Strategies and Models","description":"In this module, you will be introduced to marketing and learn why it is different from sales. An analogy of a military campaign will be used to explain marketing strategy. You will also study marketing research and tools, marketing models, and some key modern-day marketing personalities who focus their marketing on branding.","topics":["Marketing Strategies and Models - Learning Outcomes","Introduction","Marketing Fundamentals","Market Research","Marketing Models","Marketing Gurus Today","Marketing Strategies and Models - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Principles of Marketing Strategy - Course Assessment"]}]}