{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1952","title":"Print Production","totalEnrolled":"7,632","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about colour profiling, pre-press, imaging, and web2print in printing processes with this free online course.","description":"This free online print production course will teach you how to process different colours using objects and light. You will learn how colour is assessed for display and printing documents, use a measurement file to define the relationship between device-dependent values and independent numbers, and employ total ink limit and black generation to produce the output profile. You will also study types of colour profile generation, and more.","courseOutcomes":["Describe the procedure for measureme...","Discuss the primary four imaging and...","Discuss on-screen and imaging compat...","Trace the issues involved in prepari...","Describe the procedure for measurement and colour profile generation in the manufacturing process","Discuss the primary four imaging and six pre-imaging processes","Discuss on-screen and imaging compatibility issues with different types of fonts","Trace the issues involved in preparing transparent graphic elements for output","Outline Preflight procedures for checking a computer graphic document in preparation for the manufacturing process","Compare digital and traditional printing methods, including different types of inkjet printing","Discuss how paper size, weight and quality can effec output","Trace the development of page description languages and digital front ends","Explain how Variable data printing uses data to personalize documents","Discuss the advantages to companies and customers of using online print services","Describe the procedure for measureme...","Discuss the primary four imaging and...","Discuss on-screen and imaging compat...","Trace the issues involved in prepari...","Describe the procedure for measurement and colour profile generation in the manufacturing process","Discuss the primary four imaging and six pre-imaging processes","Discuss on-screen and imaging compatibility issues with different types of fonts","Trace the issues involved in preparing transparent graphic elements for output","Outline Preflight procedures for checking a computer graphic document in preparation for the manufacturing process","Compare digital and traditional printing methods, including different types of inkjet printing","Discuss how paper size, weight and quality can effec output","Trace the development of page description languages and digital front ends","Explain how Variable data printing uses data to personalize documents","Discuss the advantages to companies and customers of using online print services"],"courseDescription":"<p>In this free course Print Production, you will learn that the primary goal in colour management, is to provide a consistent perceptual experience. Effective use of colour is achieved using internationally recognized standards and technologies. In this course, you will be introduced to colour processing, device link profiles, pre-press, imaging, and web2print.</p><p>The course teaches you about what the six pre-imaging processes are: Raster image processing (RIP); Colour management; Trapping; Transparency; Imposition and Preflight analysis. Font problems are still the most common cause of error in processing client documents for all imaging technologies. Whereas traditional printing transfers an image permanently onto a fixed image plate, digital printing transfers the image temporarily onto a photoconductive cylinder, called a drum, or directly onto the substrate. With digital printing, there is virtually no set-up or make-ready; finishing tasks can be accomplished inline and each sheet can have unique content - ideal for publication printing, short print runs, or highly dynamic content.</p><p>This course is suitable for students studying print production or graphic design. It is also suitable for those wishing to enter the printing trade or for those looking to learn more about the industry. This course goes into some detail and references are provided for further study. So, why wait? Start the course today and learn how you can improve your print production skills in no time!</p><a href=\"https://alison.com/resume/courses/1952\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1952\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Colour Processing","description":"In this module, learn how we process different colours using objects and light and how colour is assessed and measured for display and print.","topics":["Colour Processing - Learning Outcomes","Perception of Colour","Measuring Colour","Colour Differences","Colour Processing - Lesson Summary"]},{"name":"Module","details":"Output Profile","description":"In this module, you will understand the procedure for measurement and colour profile generation, use a measurement file to define the relationship between device dependent values and independent numbers and employ total ink limit and black generation to produce the output profile.","topics":["Output Profile - Learning Outcomes","Measuring Process","Measurement File","Ink Limit and Black Generation","Output Profile - Lesson Summary"]},{"name":"Module","details":"Display, Input and Device Link Profiles","description":"In this module you will learn about display, input and device link profiles; how they are configured with different devices and successfully process colour output.","topics":["Display, Input and Device Link Profiles - Learning Outcomes","Display Profile","Input Profile","Device Link Profile","Profiles Summary","Display, Input and Device Link Profiles - Lesson Summary"]},{"name":"Module","details":"Colour Management Workflow","description":"In this module you will learn about the profile connection space (PCS), the colour management module (CMM) and rendering intents. You will apply colour management settings in Adobe Photoshop and produce predictable and accurate colour reproduction results using the file processing and output tools in different print production software programs.","topics":["Colour Management Workflow - Learning Outcomes","PCS, CMM and Rendering Intents","Colour Management in Photoshop","Colour Management in Acrobat and Pinergy","Colour Management Workflow - Lesson Summary"]},{"name":"Module","details":"Pre-press","description":"In this module you will learn about the four primary imaging and six primary pre-imaging processes that are used in the graphic communications industry. You will understand how the raster image processor (RIP) converts computer graphics into a printable format. You will analyse on-screen and imaging compatibility issues with different types of fonts and more.","topics":["Pre-press - Learning Outcomes","Pre-Imaging and Imaging Processes","Raster Image Processing","Font Management","Colour Systems","Trapping","Transparency","Imposition","Preflight","Pre-press - Lesson Summary"]},{"name":"Module","details":"Imaging","description":"In this module you will compare digital and traditional printing methods, analyse Electrophotography, discuss how paper quality effects output, trace the development of page description languages and learn how variable data printing uses data.","topics":["Imaging - Learning Outcomes","Print and Ink Types","Electrophotography","Paper Basics","Page Description Languages","Variable Data Printing","Imaging - Lesson Summary"]},{"name":"Module","details":"Web2Print","description":"In this module, you will learn the advantages to companies and customers of using online print services and how Web2print processes are evaluated for efficiency, fulfillment and value for money.","topics":["Web2Print - Learning Outcomes","Print Online","E-commerce Systems","Strategies and Goals","Implementation","Web2Print - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Print Production - Course Assessment"]}]}