{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1888","title":"Professional Bookkeeping and Accounting 2: Bank and Petty Cash","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to account for bank and petty cash transactions in this free online Petty Cash Accounting course.","description":"This free online Professional Bookkeeping and Accounting course will teach you how to to record and account for Petty Cash and Bank transactions comprehensively. This course teaches you about each of the processes underlying petty cash and bank transactions, and about all of their relevant reconciliations. Start this free online course today to learn this basic and essential bookkeeping and accounting knowledge.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The free online course Professional Bookkeeping and Accounting 2: Bank and Petty Cash introduces you to both the prime books of entry and cross totting (you will need a working understanding of these throughout this course). You will also be presented with the case study that will be used in the activities in sections 2 and 3 of this course.</p><p>In section 2 the course teaches about Petty Cash. The course will walk you through each step of the petty cash process from raising petty cash vouchers, entering data to the daybook and reconciling and replenishing the petty cash. Throughout this section you will have a number of activities to complete using the case study presented in Section 1 and these activities will give you the opportunity to: Raise petty cash vouchers; Enter petty cash transactions to the petty cash daybook; Close the daybook and calculate the balance carried down;&nbsp; Reconcile the petty cash; and Replenish the petty cash.</p><p>Section 3 of this course is about Banking Transactions. Throughout this section you will have a number of activities using the case study presented in section 1 and these activities will give you the opportunity to: Check remittance advice; Enter payments and receipts to the 3 column and analysis cash book; Close the cash book and calculate the balance carried down; and Reconcile the bank. This course will&nbsp; be of great interest to all learners who are interested in a career in bookkeeping or accounting. The course contains a case study that you will use throughout this course, workbooks to download, and activities to complete. So start this course today and learn valuable skills in basic bookkeeping and accounting.</p><a href=\"https://alison.com/resume/courses/1888\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1888\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}