{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1742","title":"Professional Bookkeeping and Accounting 1 - Sales and Purchases","totalEnrolled":"43,605","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to record your sales and purchase transactions in your daybooks with this free online bookkeeping course.","description":"This course teaches you how to record and account for sales and purchase transactions. We show you how to read and prepare sales and purchase invoices, with or without discounts and sales taxes. Handling sales and purchase invoices is an essential skill for any accountant or businessperson working in the retail sector. Sign up to enter the lucrative field of accounting and bookkeeping and take your career to the next level.","courseOutcomes":["Outline the importance of bookkeepin...","Define ‘assets’, ‘liabilities’, ‘rev...","Explain the principles of the sales ...","Establish the importance of an invoi...","Outline the importance of bookkeeping and its links to accounting","Define ‘assets’, ‘liabilities’, ‘revenue and ‘expenditure’","Explain the principles of the sales tax","Establish the importance of an invoice and identify its important details","Describe the purpose and primary data information offered by a financial statement","Highlight the role of the Accounts Receivable (AR) department","Outline the purpose of ‘cross totting’ and ‘creditor reconciliation’","Break down the process of recording sales, credits, purchases and returns in daybooks","Describe the purchasing process and the documents involved","Discuss the process for approving a purchase invoice","Outline the importance of bookkeepin...","Define ‘assets’, ‘liabilities’, ‘rev...","Explain the principles of the sales ...","Establish the importance of an invoi...","Outline the importance of bookkeeping and its links to accounting","Define ‘assets’, ‘liabilities’, ‘revenue and ‘expenditure’","Explain the principles of the sales tax","Establish the importance of an invoice and identify its important details","Describe the purpose and primary data information offered by a financial statement","Highlight the role of the Accounts Receivable (AR) department","Outline the purpose of ‘cross totting’ and ‘creditor reconciliation’","Break down the process of recording sales, credits, purchases and returns in daybooks","Describe the purchasing process and the documents involved","Discuss the process for approving a purchase invoice"],"courseDescription":"<p>This comprehensive course suits those that need to record and account for Sales and Purchase transactions. We begin with an introduction to bookkeeping and accounting that introduces you to assets and liabilities on the balance sheet, common business records and the Accounting Equation. We then examine sales tax and coding for sales invoices and credits and show you how to prepare customer statements and make entries into daybooks.</p><p>The course then covers the purchasing process and the documents involved. We explain how to check purchase invoices for approval and code them for analytical purposes before transferring the transactions into the ‘purchase’ and ‘purchase returns’ daybooks while you perform creditor reconciliations.</p><p>If you are interested in accounting as a career or work in retail and want to learn new abilities, this is the training course for you. Sign up to gain new skills such as recording sales transactions in daybooks and reading and preparing invoices. This course can open doors for you if you feel stifled in your job so sign up to find new opportunities.</p><a href=\"https://alison.com/resume/courses/1742\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1742\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"An Introduction to Bookkeeping and Accounting","description":"An introduction course to both Bookkeeping and Professional Accounting. In this module, you will be introduced to the role of a Bookkeeper and Accountant. You will also be introduced to record-keeping and the accounting equation.","topics":["Bookkeeping and Accounting"]},{"name":"Module","details":"Sales Tax","description":"This module introduces you to both Sales Tax and Coding for sales invoices and credits, preparing customer statements and making entries into the day books.","topics":["Sales tax"]},{"name":"Module","details":"Sales and Sales Invoices","description":"This module introduces you to sales invoices and credits, preparing customer statements and making entries into the day books.","topics":["Sales"]},{"name":"Module","details":"Purchases","description":"Learn about the purchase ledger, how invoices and credits are coded and recorded. Learn how to reconcile a creditors statement and more","topics":["Purchases"]},{"name":"Module","details":"Course assessment","description":"","topics":["Professional Bookkeeping and Accounting 1 - Sales and Purchases - Course Assessment"]}]}