{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1954","title":"Professional Bookkeeping and Accounting 3 - Double Entry Accounting","totalEnrolled":"10,645","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online double entry bookkeeping course for those that want to learn about Double Entry Bookkeeping and Accounting","description":"This free online bookkeeping and accounting course teaches you about double entry accounting. It will give you an introduction to double-entry accounting and teach you how to carry out double-entry accounting and bookkeeping for transactions on the receivables ledger, on the payables ledger, and for bank and cash transactions. This course will get your accounting career started, or help you to ace your professional accounting exams!","courseOutcomes":["Explain how double-entry transaction...","Describe the process for preparing a...","Identify the steps involved in trans...","List the steps used to transfer purc...","Explain how double-entry transactions work","Describe the process for preparing and recording transactions in T-accounts","Identify the steps involved in transferring sales and sales return transactions from the daybooks to the general ledger, memorandum accounts, and receivables control account","List the steps used to transfer purchase and purchase returns transactions from the daybooks to the general ledger, memorandum accounts, and payable's control account","Discuss the reason for transferring the left and the right side of the cash books to the general ledgers","Explain what happened when you close the control accounts;","Explain how double-entry transaction...","Describe the process for preparing a...","Identify the steps involved in trans...","List the steps used to transfer purc...","Explain how double-entry transactions work","Describe the process for preparing and recording transactions in T-accounts","Identify the steps involved in transferring sales and sales return transactions from the daybooks to the general ledger, memorandum accounts, and receivables control account","List the steps used to transfer purchase and purchase returns transactions from the daybooks to the general ledger, memorandum accounts, and payable's control account","Discuss the reason for transferring the left and the right side of the cash books to the general ledgers","Explain what happened when you close the control accounts;"],"courseDescription":"<p><span style=\"font-size: 11.0pt; font-family: Roboto;\">You will learn about the accounting equation and double entry and the prepare for T-accounts. From the activities, you will get the opportunity to <strong>a)</strong> Prepare double-entry transactions and <strong>b)</strong> Prepare and record transactions in T-accounts. After this, we will then move on to recording transactions from the sales day book and the sales returns day book to the Receivables control account, the general ledger, and the memorandum ledgers.&nbsp; From the activities, you can practice<strong> c)</strong>Transfer sales and sales return transactions from the daybooks to the general ledger, memorandum accounts, and receivables control account.</span></p><p><span style=\"font-size: 11.0pt; font-family: Roboto;\">Next we will look at record transactions from the purchase and purchase returns prime books to the Payable's control accounts, as well as the the general ledger and the memorandum accounts.&nbsp; Then you can practice the following, <strong>d)</strong>Transfer purchase and purchase returns transactions from the daybooks to the general ledger, memorandum accounts and payable's control account.</span></p><p><span style=\"font-size: 11.0pt; font-family: Roboto;\">Finally, we will record transactions from the bank and cash.&nbsp; This will complete the receivables and payable's control account. After this we will look at<strong> e) </strong>closing the control accounts and transfer the left and the right side of the cash books to the general ledgers. <u>Get started with the downloadable Workbook containing the activities are used throughout this course and the answer from one activity leads into a later activity.</u></span></p><a href=\"https://alison.com/resume/courses/1954\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1954\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction - Double Entry Accounting","description":"In this module, you will meet your instructor and find out more about the course Professional Bookkeeping and Accounting 3 - Double Entry Accounting","topics":["Orientation to Professional Bookkeeping and Accounting 3 - Double Entry Bookkeeping and Accounting"]},{"name":"Module","details":"Double Entry Accounting","description":"Find out what is double-entry accounting and how to carry out double-entry accounting and bookkeeping","topics":["Double Entry Accounting and Bookkeeping"]},{"name":"Module","details":"The Receivables Ledger","description":"Learn how to carry out double-entry accounting for transactions on the receivables ledger","topics":["Double Entry Accounting and Bookkeeping for the receivables ledger"]},{"name":"Module","details":"The Payables Ledger","description":"Learn how to carry out double-entry accounting for transactions on the payables ledger","topics":["The Payables Ledger"]},{"name":"Module","details":"Bank and cash transactions","description":"Learn how to carry out double-entry accounting for bank and cash transactions","topics":["Bank and cash transactions"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}