{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2625","title":"Professional Business Writing Skills","totalEnrolled":"16,903","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn professional business writing skills with this free online course.","description":"This free online course Professional Business Writing Skills, will teach students the various skills they will need to write important documents in the workplace, both as an individual or as a group. You will learn how to prepare documents like e-mails, proposals, agendas, letters and reports, structure them properly and proofread. So, why wait? Start this course today and learn about Professional Business Writing Skills.","courseOutcomes":["Describe how to format sentences and...","Summarize what you are writing about...","Evaluate what you've written for pro...","Explain how to overcoming collaborat...","Describe how to format sentences and paragraphs","Summarize what you are writing about in an outline","Evaluate what you've written for proper proofreading","Explain how to overcoming collaborative writing barriers","State how to begin the proposal writing process","Describe how to format sentences and...","Summarize what you are writing about...","Evaluate what you've written for pro...","Explain how to overcoming collaborat...","Describe how to format sentences and paragraphs","Summarize what you are writing about in an outline","Evaluate what you've written for proper proofreading","Explain how to overcoming collaborative writing barriers","State how to begin the proposal writing process"],"courseDescription":"<p>This course, Professional Business Writing Skills, will provide you with an understanding of the business writing. You will learn working with words to construct proper sentences and craft paragraphs. You will be able to explain how to write meeting agendas, write e-mails, write business letters, write proposals, and write reports. You will also learn about other types of documents as well as proofreading and finishing.</p><p>&nbsp;</p><p>This course then explains Collaborative business writing. You will learn about types of collaborative business writing as well as collaborative team members and collaborative tools and processes. You will also learn about setting style guidelines and barriers to successful collaborative writing. The course will cover styles of dealing with conflicts and tips for successful business writing collaboration.</p><p>&nbsp;</p><p>This course then wraps up with a lesson on proposal writing. You will learn how to understand a proposal how to begin the proposal writing process by preparing an outline and finding facts. By taking this course you will learn How to prepare a business proposal, write it, and proofread it. So why wait? Start learning today.</p><a href=\"https://alison.com/resume/courses/2625\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2625\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Business Writing","description":"In this module, Business Writing, students will learn about writing in a professional setting. Students will learn about constructing sentences and creating paragraphs. The module will cover writing meeting agendas and e-mails. Students will then learn about writing business letters, proposals, and reports. The module finishes up with other types","topics":["Getting Started","Working with Words","Constructing Sentences","Creating Paragraphs","Writing Meeting Agendas","Writing E-mails","Writing Business Letters","Writing Proposals","Writing Reports","Other Types of Documents","Proofreading and Finishing"]},{"name":"Module","details":"Collaborative Business Writing","description":"In this module, Collaborative Business Writing, students will learn about working with a team during writing. Students will learn about types of collaborative business writing and collaborative team members. The module will then talk about setting style guidelines and barriers to successful collaborative writing.","topics":["Getting Started","What is Collaborative Business Writing","Types of Collaborative Business Writing","Collaborative Team Members","Collaborative Tools and Processes","Setting Style Guidelines","Barriers to Successful Collaborative Writing","Overcoming Collaborative Writing Barriers","Styles of Dealing with Conflicts","Tips for Successful Business Writing Collaboration","Examples of Collaborative Writing","Wrapping up"]},{"name":"Module","details":"Proposal Writing","description":"In this module, Proposal Writing, students will learn about writing proposals. The module will go over understanding proposals and beginning the proposal writing process. Students will learn about preparing an outline and finding facts. Students will then learn about writing skills and writing proposals. The module wraps up with proofreading","topics":["Getting Started","Understanding Proposals","Beginning the Proposal Writing Process","Preparing an Outline","Finding Facts","Writing Skills I","Writing Skills II","Writing Proposals","Checking for Readability","Proofreading and Editing","Adding and Final Touches"]},{"name":"Module","details":"Course assessment","description":"","topics":["End of Course assessment"]}]}