{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4105","title":"Profitable Marketing for Small Businesses","totalEnrolled":"2,530","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the essential marketing tips, tricks and strategies to promote your small business in this free online course.","description":"Marketing is an essential function and at a very basic level, simply connects customers to your business. It is however a specialized function and knowing how to do it properly and cost-effectively takes a particular set of skills. This free online marketing course focuses on how to find your customers' wants and desires, customer service, competitor analysis, and technical functions such as visual branding and automated marketing systems.","courseOutcomes":["Define the core principles of develo...","Analyze your customers' wants, needs...","Define products and services that so...","Analyze your competition and find ma...","Define the core principles of developing a robust marketing strategy for your small business","Analyze your customers' wants, needs, desires, challenges, and limitations","Define products and services that solve your customers' pain points","Analyze your competition and find market gaps to gain a competitive advantage","Define your product selling point proposition and craft a marketing pitch that sells your product to a customer","Define your brand's visual elements, including social media and product images, logo, and packaging attractively","Explain marketing systems that generate profit","Define the core principles of develo...","Analyze your customers' wants, needs...","Define products and services that so...","Analyze your competition and find ma...","Define the core principles of developing a robust marketing strategy for your small business","Analyze your customers' wants, needs, desires, challenges, and limitations","Define products and services that solve your customers' pain points","Analyze your competition and find market gaps to gain a competitive advantage","Define your product selling point proposition and craft a marketing pitch that sells your product to a customer","Define your brand's visual elements, including social media and product images, logo, and packaging attractively","Explain marketing systems that generate profit"],"courseDescription":"<p>If you are passionate about marketing and want to refine these skills to take small businesses to the next level, then keep reading. In this free online marketing certification, you will learn how to become a powerful small business marketer and not only will it make you a more strategic marketer, but will also arm you with all the tools and knowledge that will springboard your technical expertise. The start of this online marketing certificate focuses on how to set the right goals and objectives to marketing your small business brand and making it profitable. Without customers, your business cannot exist, and this part of the course delves into customers' wants, needs, and desires. Learn how to develop a unique selling proposition that attracts your customers' attention and satisfies their wants as well as the concept of differentiation and competitive advantage over your competition.</p><p>The next section of this marketing training covers the steps and process of how to communicate, pitch, and sell your product to a premium customer and make a profitable sale including how to create marketable products and experiences that drives free word-of-mouth marketing - which has proven to be the most credible form of marketing. Your creativity will be put to the test in this part of the course because you will be taught how to present your visual brand elements and graphics including your logo, colour pallet, products and packaging, social media photography, and website design. Product distribution and digital marketing training is next in the course where the content discusses the ins and outs of distributing your products both online and offline, how to sell on Amazon, build your e-commerce website and an offline retail store.</p><p>The ultimate aim of this in-depth free marketing course is to teach you a range of fundamental principles of marketing, the analysis of marketing systems and funnels, referral generation, advertising and branding, and how to combine these to enable profitability. Enrolling in this course will set you on the right path to becoming a successful entrepreneur, marketer, and brand strategist with lots of real-life examples, case studies, and supporting materials included in the course that will simplify and enhance your learning experience.</p><a href=\"https://alison.com/resume/courses/4105\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4105\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pre-Marketing","description":"In this module, you will learn how to set up your business for successful marketing. This module will include researching your target customers, researching your competition, and crafting a pitch to market and sell your product.","topics":["Pre-Marketing - Learning Outcomes","Welcome to the Course","Intro to Marketing for Small Businesses","Customer Research and Developing USP","Market, Niche Research and Product Differentiation","Developing Your Marketing Pitch","Pre-Marketing - Lesson Summary"]},{"name":"Module","details":"Post Marketing","description":"In this module, you will learn how to present and market your business to your customers. This module will teach you how to present your product and social media images, besides your brand logo and packaging design. You will also learn how to build marketing systems and funnels and how to create value around your brand on social media.","topics":["Post Marketing - Learning Outcome","Developing Your Marketing and Brand Visuals","Developing Your Marketing Distribution and Funnels","Building Value Around Your Brand","Making Your Brand Solid","Post Marketing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment -  Profitable Marketing for Small Businesses"]}]}