{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2143","title":"Professionalism in the Office","totalEnrolled":"20,878","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to improve your reputation and standards in the workplace with this free online course.","description":"This free online course teaches the basics of professional behavior in the work environment. You will learn about positioning yourself as a professional and enhancing your image as well as about expanding your skills, communicating for results and building relationships and networks. Start this course today and learn how to exude professionalism in the workplace.","courseOutcomes":["Evaluate your own professional image...","Explain your ideas and perspective w...","Arrange your schedule for effective ...","Distinguish yourself as a more marke...","Evaluate your own professional image and improve yourself","Explain your ideas and perspective with effective communication skills","Arrange your schedule for effective time management","Distinguish yourself as a more marketable employee","Recall networking methods when meeting new people in your industry","Evaluate your own professional image...","Explain your ideas and perspective w...","Arrange your schedule for effective ...","Distinguish yourself as a more marke...","Evaluate your own professional image and improve yourself","Explain your ideas and perspective with effective communication skills","Arrange your schedule for effective time management","Distinguish yourself as a more marketable employee","Recall networking methods when meeting new people in your industry"],"courseDescription":"<p>This free online Office Professionalism training course will provide you with an understanding of positioning yourself as a professional. You will learn about professional behavior and attitudes in the workplace as well as learn to explain how to make changes through personal accountability. Next, you will learn about assessing your image, understanding your position and then enhancing your professional image to become more marketable.</p><p>Furthermore, this online course then explains time and project management techniques by helping you identify stressors that can impact work and teach you better long-term planning techniques. Next, you will learn how to enhance your role in the office and how to communicate for improved results. You will also learn about the keys to effective communication, including listening and expression of thoughts. The course will also go over more effective presentations and meetings.</p><p>This course then wraps up with building relationships and networks, where you will learn about networking and roles within the office. Studying this free online course will be of great benefit to any person who wants to improve his or her professional qualities, work ethic, and work experience in order to become a desirable employee for any company. Enroll in this course today and start learning about professionalism in the workplace.</p><a href=\"https://alison.com/resume/courses/2143\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2143\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Positioning Yourself as a Professional","description":"In this module, Positioning Yourself as a Professional, students will learn about how their attitude affects them in the workplace. This module will cover the attitude projected by professionals and how to behave professionally as well as how to make changes in attitude through personal accountability.","topics":["Topic A - Attitude in the Workplace","Topic B - Professionalism","Topic C - Making Changes through Personal Accountability","Review Quiz"]},{"name":"Module","details":"Enhancing Your Professional Image","description":"In this module, Enhancing Your Professional Image, students will learn about ways in which they can enhance their professional image. This module will take a look at enhancing your image as a whole, how to become more marketable as an individual, and the best processes for communication in regards to your image.","topics":["Topic A - Your Image as a Whole","Topic B - Becoming More Marketable","Topic C - Communicating and Image","Review Quiz"]},{"name":"Module","details":"Expanding Your Skills","description":"In this module, Expanding Your Skills, students will learn about methods with which they can expand upon their skills. This module will begin by discussing time management and how important time management is in a professional environment. Students will then learn about project management techniques as well as the process for making decisions.","topics":["Topic A - Time Management","Topic B - Project Management Techniques","Topic C - Making Decisions","Review Quiz"]},{"name":"Module","details":"Communicating for Results","description":"In this module, Communicating for Results, students will learn about communicating for the best results. We will start by discussing keys to effective communication in a professional setting, then we will take a look at giving presentations to communicate ideas and plans. This module will then wrap up by discussing meetings.","topics":["Topic A - Keys to Effective Communication","Topic B - Presentations","Topic C - Meetings","Review Quiz"]},{"name":"Module","details":"Building Relationships and Networks","description":"In this module, Building Relationships and Networks, students will learn about the process for building relationships and networks. This module will start by taking a look at work and your personality and how the two work together. Students will then learn about networking effectively as well as roles in the office environment.","topics":["Topic A - Work and Your Personality","Topic B - Networking","Topic C - Roles in the Office","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}