{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5524","title":"Professional Barista - Coffee Presentation & Serving Skills","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides the customer service training and resources you need to become a professional barista.","description":"Working as a barista has become popular as coffee takes on greater social and cultural relevance. This diploma course provides the training you need to become a barista. We describe the essential aspects of the job and cover details like the proper way to use espresso machines and other coffee-making equipment. We also cover espresso extraction and preparation, career opportunities for baristas, how to roast coffee, latte art and much more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Being a barista appears straightforward but the job requires specific training and skills. Baristas cater to hundreds of customers every day and work hard to meet their demands, often while dealing with difficult customers who are in a rush. This profession has gained popularity as many coffee places and parlours serve a public that is thirsty for caffeine that tastes good. This creates many job opportunities and employers seeking professional and qualified baristas to staff their businesses. With this in mind, Element Recipe has developed this detailed diploma course to help future baristas acquire these skills and launch this phase of their careers.</p><p>This barista training course presents five detailed modules that break down particular aspects of this profession. The first module identifies what it takes to be a barista and lays out the steps taken to become a professional barista. We then compare various brewing techniques, popular types of coffee beans and coffee drinks and the different ways to receive barista training before explaining in detail how to use various pieces of barista equipment like coffee-making machines and grinders.</p><p>We also include a module that explores espresso extraction, brewing temperature and preparation of different espresso drinks. The last section discusses barista duties that go beyond preparing and serving hot drinks. This hospitality training course equips you with all the fundamental skills and concepts required to establish yourself as a professional barista. We help you to improve customer service skills that carry over into many fields and can even be used to launch your own small business. Sign up to earn a diploma that demonstrates your advanced barista skills and stay one step ahead of the competition.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}