{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5295","title":"Project Management: The Basics","totalEnrolled":"2,941","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, you'll learn the fundamentals of sound project management like scheduling and reporting.","description":"Master the basic concepts of project management to handle projects effectively. Project management plays a significant role in achieving outcomes no matter what field you work in. New projects demand effective project management, from engineering and construction to software development and marketing. This course includes how to timetable activities, communicate schedules and deadlines effectively, and report on the status of projects.","courseOutcomes":["Analyze status reports containing va...","Compute a realistic budget that take...","Define project management and state ...","Describe deliverables and why these ...","Analyze status reports containing valuable information about a project’s progress and performance","Compute a realistic budget that takes all costs of a project into account","Define project management and state its three constraints","Describe deliverables and why these are important in scheduling","Estimate a schedule during the planning phase","Evaluate the most appropriate communication tool and methods for your project","Identify techniques for estimating time accurately to prevent you from running over budget and reducing your profit","Indicate closure when goals are achieved, agreements are fulfilled, and the end-user accepts the project as finished","List steps for organizing an effective PM meeting","Outline the requirements that help you decide what work needs to be done and how you might approach critical decisions","Select a matching framework that suits your project","Create a plan that details how a project will be executed and controlled","Analyze status reports containing va...","Compute a realistic budget that take...","Define project management and state ...","Describe deliverables and why these ...","Analyze status reports containing valuable information about a project’s progress and performance","Compute a realistic budget that takes all costs of a project into account","Define project management and state its three constraints","Describe deliverables and why these are important in scheduling","Estimate a schedule during the planning phase","Evaluate the most appropriate communication tool and methods for your project","Identify techniques for estimating time accurately to prevent you from running over budget and reducing your profit","Indicate closure when goals are achieved, agreements are fulfilled, and the end-user accepts the project as finished","List steps for organizing an effective PM meeting","Outline the requirements that help you decide what work needs to be done and how you might approach critical decisions","Select a matching framework that suits your project","Create a plan that details how a project will be executed and controlled"],"courseDescription":"<p>Whether you are brand new to project management or have considerable experience already, managing and completing a project within the deadline and budget is not an easy task. Yet, each new project demands effective project management (PM). This course is designed to guide you through the fundamental concepts of PM. We begin by exploring the building blocks of project management like the project framework, requirements, and plans.</p><p>Next, the material explains the process of developing an effective project schedule. You will learn about communication tools and methods, project deliverables, and the importance of project activities. If a project takes more time than you predict, you might miss deadlines or use more resources than expected, so we will also discuss the different techniques for estimating the timetable accurately.</p><p>Finally, you will learn how to write an effective status report and discuss controlling costs through budgeting, tracking, and reporting. You will also see why, before putting a project behind you, you must review the closure checklist, ensure that your work is truly finished, and acknowledge your team. Upgrade your knowledge and start this exciting PM online course today.</p><a href=\"https://alison.com/resume/courses/5295\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5295\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Project Management","description":"Learn the fundamentals of Project Management and how to estimate project schedules in this module. You will gain insights into the concepts of communication tools used in project management. Continue your journey to understand project deliverables and project reporting.","topics":["Project Management - Learning Outcomes","Fundamentals of Project Management","Project Scheduling","Communications in Project Management","Reporting and Tracking of a Project","Project Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Project Management: The Basics - Course Assessment"]}]}