{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4296","title":"Project Management Fundamentals","totalEnrolled":"8,220","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to effectively carry out the different processes of project management with this free online course.","description":"This free online course on project management is designed to help you build foundational and advanced-level knowledge in managing projects of any kind. You will learn how to successfully initiate, plan, execute and close a project. The course is tailored to also help you build your proficiency in using project management information systems as you will be shown how to undertake the aforementioned processes using Microsoft Teams.","courseOutcomes":["Describe a project accurately using ...","Outline the attributes of a project...","Define ‘project management’ as stipu...","Differentiate between the types of o...","Describe a project accurately using provisions from the PMBOK guide","Outline the attributes of a project","Define ‘project management’ as stipulated in the PMBOK guide","Differentiate between the types of organisations","Distinguish predictive type projects from Agile type projects","Describe a starting setup for a project","Identify how to create a project leveraging the Microsoft Teams tool effectively","Outline the benefits of building a schedule","Identify the types of costs when undertaking projects","Describe a project management plan as provided by the PMIS","Discuss planning risk management effectively during projects","Define the processes of monitoring and control as it pertains to projects","Explain in definitive terms earned value management (EVM)","Describe a project accurately using ...","Outline the attributes of a project...","Define ‘project management’ as stipu...","Differentiate between the types of o...","Describe a project accurately using provisions from the PMBOK guide","Outline the attributes of a project","Define ‘project management’ as stipulated in the PMBOK guide","Differentiate between the types of organisations","Distinguish predictive type projects from Agile type projects","Describe a starting setup for a project","Identify how to create a project leveraging the Microsoft Teams tool effectively","Outline the benefits of building a schedule","Identify the types of costs when undertaking projects","Describe a project management plan as provided by the PMIS","Discuss planning risk management effectively during projects","Define the processes of monitoring and control as it pertains to projects","Explain in definitive terms earned value management (EVM)"],"courseDescription":"<p>This free online course on project management is designed to provide a detailed understanding of project management practices, the tools available and a demonstration of how they are deployed for projects. The course begins with modules on the fundamentals of project management. As with many professions and professional disciplines, there are often tools that are used for effectively carrying out the job functions provided by the discipline. The same applies to the specific terms used to describe the different aspects or processes of a field. With this course, you will learn about the different types of tools used at the different stages of managing a project. You will also learn about some very important terminologies in the practice as defined within the Project Management Body of Knowledge (PMBOK) guide. It is one thing to say you can manage a project to completion theoretically, but the big question is can you successfully deploy the resources of a project management information system (PMIS) into project action? Leveraging Microsoft Teams as the primary PMIS, this course will show you how to create team and project charters as well as other rudimentary processes in managing a project.</p><p>Furthermore, using the Microsoft Teams tool, you will learn how to create project schedules and create budgets for the different parts of a project. Detailed lessons on how to perform a proper analysis, as well as the process and sub-processes in risk management, will also be provided. Project management is more than just terminologies and field-specific jargon. There are analytical and mathematical concepts performed within this process that help evaluate progress and exert control during or after project execution. Care to find out what these concepts are or how they are calculated? This course is packed full of lessons on some of the formula-based evaluations that need to be made with regard to your project when performing project analyses. You will learn about the monitoring and control process for project management and the phases it covers. The lessons here will also touch on the process of earned value management (EVM). Finally, you will receive lessons on controlling changes when managing a project and how to effectively close the project.</p><p>Project management is a professional field that has been gaining weight in the business sector for a while now. Organisations, regardless of their field, regularly engage in projects and consequently require the expertise of a project manager. In this video-based course, the instructor takes you through a comprehensive journey into the world of project management, from the fundamentals to its very advanced stages. Using a hands-on approach, you will be shown how to ‘plan the work and work the plan’, which basically means efficiently carrying a project from planning to closure. Video tutorials on the use of Microsoft Teams in carrying out the different processes within project management have been infused in the course, accompanied by extra learning materials intended to help create a smooth and comprehensive learning experience for you. Enrol now and join the moving train in building the right competencies for your project management career.</p><a href=\"https://alison.com/resume/courses/4296\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4296\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of PM","description":"In this module, the instructor will take you through introductory lessons on project management. You will learn about project management tools, its benefits, and some key terms and concepts as defined within the PMBOK guide.","topics":["Fundamentals of PM - Learning Outcomes","Course Overview","Project Management Body of Knowledge Guide","Fundamental Project Management Tool","Fundamentals of PM - Lesson Summary","Fundamentals of PM - Assessment"]},{"name":"Module","details":"Where Do Projects Come from?","description":"In this module, you will learn about the types of organizations and projects. You will be provided with basic-level lessons on project management using the PMBOK guide and also a brief about the scrum framework.","topics":["Where Do Project Come from? - Learning Outcomes","Types of Organizations","Project Management 101","Why Great ROI","Starting the Project","The Scrum Framework - Modified","Where Do Project Come from? - Lesson Summary","Where Do Projects Come From? - Assessment"]},{"name":"Module","details":"Project Management Information System","description":"In this module, you will learn about the project management information systems offered by Microsoft. You will be shown the Microsoft Teams along with how it can be leveraged in building team charters and planning the project work.","topics":["PMIS - Learning Outcomes","Project Management Information System","Leveraging Microsoft Teams","Planning the Work","Team Charter","PMIS - Lesson Summary","Project Management Information System - Assessment"]},{"name":"Module","details":"Project Schedule","description":"In this module, you will learn how to build and manage schedules using some of the available Microsoft PMIS. You will also learn how to create budgets and assign resources using these tools during a project.","topics":["Project Schedule - Learning Outcomes","Building the Schedule","Project Schedule","Microsoft Scheduling Tool Capability Model","Creating the Budget","The Microsoft Project Tool","Project Schedule - Lesson summary","Project Schedule - Assessment"]},{"name":"Module","details":"Managing for Risks","description":"In this module, you will learn about risk management and how it can be documented for projects. You will be shown how to log issues, plan, implement and monitor risks.","topics":["Managing For Risks - Learning Outcomes","Final Planning Process","Managing Projects","Risk Management Processes","Plan, Implement and Monitor Risks","Managing for Risks - Lesson  Summary","Managing for Risks - Assessment"]},{"name":"Module","details":"Monitoring and Control","description":"In this module, you will learn how to monitor and control changes in your project. You will also learn about earned value management, as well as the necessary steps to take when closing out a project.","topics":["Monitoring and Control - Learning Outcomes","Monitor and Control","Earned Value Management","Project Monitoring and Control","Controlling Changes","Closing the Project","Course Wrap Up","Monitoring and Control - Lesson Summary","Monitoring and Control - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Project Management Fundamentals - End of Course Assessment"]}]}