{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1559","title":"Public Relations: Best Practices and Ethics","totalEnrolled":"7,632","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the best practices and ethics in PR management with this free online public relations course.","description":"This free online PR management course will introduce you to the best practices and ethical codes necessary for excellence in public relations. You will learn about conducting research, strategic action planning, communication implementation, and results evaluation. The course will also guide you through the RACE process in public relations, along with how to apply these best practices in the real world by looking at related case studies.","courseOutcomes":["Discuss the importance of achieving ...","Differentiate between strategic obje...","Define the RACE acronym...","Compare and contrast the four primar...","Discuss the importance of achieving goals and objectives","Differentiate between strategic objectives and ineffective objectives","Define the RACE acronym","Compare and contrast the four primary areas of functional responsibility","Differentiate between each of the PR functions","Discuss the importance of strategic management within each PR function","Examine the role of ethics in relation to PR","Identify how to morally analyze a business plan","Define the terms excellence and effectiveness in regards to PR management","Discuss the variables identified in Grunig’s Excellence Study","Discuss the importance of achieving ...","Differentiate between strategic obje...","Define the RACE acronym...","Compare and contrast the four primar...","Discuss the importance of achieving goals and objectives","Differentiate between strategic objectives and ineffective objectives","Define the RACE acronym","Compare and contrast the four primary areas of functional responsibility","Differentiate between each of the PR functions","Discuss the importance of strategic management within each PR function","Examine the role of ethics in relation to PR","Identify how to morally analyze a business plan","Define the terms excellence and effectiveness in regards to PR management","Discuss the variables identified in Grunig’s Excellence Study"],"courseDescription":"<p>An organization's communication efforts should be connected with its goals, objectives, and strategies. This course will begin by teaching you about strategic objectives and ineffective objectives. You will study what RACE stands for and how to use research to analyze a situation facing an organization. You will then look into corporate PR, agency PR, government relations and public affairs, along with nonprofit, NGO, and activist PR. The course will also discuss the importance of strategic management within each PR function.<br><br>Next, the course will discuss ethics in relation to PR. You will learn about consequentialism and deontology, which are two very helpful two perspectives for the analysis of common PR moral dilemmas. You will then learn how to morally analyze a business plan, as well as study excellence and effectiveness in PR management. The course will also discuss the variables defined in Grunig’s Excellence Study and present you with a case study that highlights the benefits of organizational excellence.<br><br>The importance of ethics, moral analysis, and leadership in public relations, as well as their potential effects for a PR strategy, are the main focus of this online course. You will explore the theories behind each area and look at the benefits that a company can have once these practices are implemented properly. So, enrol in this free PR course today, and start learning to build better business relationships through ethical communication, listening, and strategic alliances.</p><a href=\"https://alison.com/resume/courses/1559\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1559\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"RACE - The Public Relations Process","description":"In this module you will learn about the RACE process which acts as a guideline for creating and running a public relations campaign. In particular, you will learn how to implement each of the four steps in the process; research, action planning, communication, and evaluation.","topics":["RACE - The Public Relations Process - Learning Outcomes","Step 1: Formative Research to Analyze the Situation","Step 2: Strategic Action Planning","Steps 3 & 4: Communication Implementation & Evaluation","RACE - The Public Relations Process - Lesson Summary"]},{"name":"Module","details":"Public Relations - Four Main Categories","description":"In this module you will examine the best practices in public relations. In order to achieve this, you will learn about the four main categories within the profession; Corporate PR, Agency PR, Government/public affairs, and nonprofit/NGO/activist PR.","topics":["Public Relations - Four Main Categories - Learning Outcomes","Corporate Public Relations","Agency Public Relations","Government Relations and Public Affairs","Nonprofit, NGO, and Activist  Public Relations","Public Relations - Four Main Categories - Lesson Summary"]},{"name":"Module","details":"Ethics, Moral Analysis and Leadership","description":"In this module you will look at ethical concerns within the PR profession. You will also learn how to conduct a moral analysis, and examine the importance of good leadership through a real-life case study.","topics":["Ethics, Moral Analysis and Leadership - Learning Outcomes","Ethics in Public Relations","Public Relations: Ethical Conscience  Advisor","Conducting Moral Analysis","Case Study: Home Depot’s  Leadership Crisis","Ethics, Moral Analysis and Leadership - Lesson Summary"]},{"name":"Module","details":"Best Practices for Excellence in Public Relations","description":"In this module you will discover how to achieve excellent public relations through the use of best practices. This is further explored through an examination of the the Entergy case study, which highlights the importance of best practice in achieving excellence.","topics":["Best Practices for Excellence in Public Relations - Learning Outcomes","Effectiveness and Excellence","Case Study: Entergy Responds to Hurricane Katrina","Best Practices for Excellence in Public Relations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Public Relations - Best Practices and Ethics - Course Assessment"]}]}