{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1933","title":"Public Speaking","totalEnrolled":"54,729","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to become confident and effective at public speaking with this free online course.","description":"This free online public speaking course will help you become a more confident public speaker. In this course you will get in-depth information on developing an engaging program and delivering your presentation with power. You will learn how to identify your audience, create a basic outline of your speech, and organize your program in a way that makes the most sense. You will also learn how to overcome your nervousness, and a whole lot more!","courseOutcomes":["Describe how to identify your audien...","Explain how to outline your program...","Discuss techniques for fleshing out ...","Explain what it means to be prepared...","Describe how to identify your audience","Explain how to outline your program","Discuss techniques for fleshing out the main points in your speech","Explain what it means to be prepared for your speech","Discuss ways to overcome nervousness","Summarize the process of delivering your speech","Describe how to take and handle questions and answers","Describe how to identify your audien...","Explain how to outline your program...","Discuss techniques for fleshing out ...","Explain what it means to be prepared...","Describe how to identify your audience","Explain how to outline your program","Discuss techniques for fleshing out the main points in your speech","Explain what it means to be prepared for your speech","Discuss ways to overcome nervousness","Summarize the process of delivering your speech","Describe how to take and handle questions and answers"],"courseDescription":"<p>This free online course Public Speaking will provide you with the principals and techniques for speaking with confidence in a public forum. You will learn to identify your audience to better understand how to deliver your speech. You will be able to explain how to create a basic outline to organize your speech, as well as techniques for fleshing out your speech to better express the main points.</p><p>This course then explains how to put it all together. You will learn about preparing your speech for delivery to an audience. You will also learn about being prepared. This course is perfect for anyone looking to prepare themselves for public presentations and speeches.</p><p>This course then wraps up delivering your speech. It covers how to handle stragglers returning late from breaks and how to engage your audience. Students will learn how to deal with taking questions from audience members in regards to their speech. You will learn how to take and handle questions and answers, from how to answer questions without sounding dismissive to how to deal with questions that may sound like attacks. By taking this course you will learn about public speaking. So why wait? Start learning today, and by taking this course you will become more confident about public speaking.&nbsp;</p><a href=\"https://alison.com/resume/courses/1933\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1933\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started","description":"In this module, Getting Started, students will learn about getting started with public speaking. This module will give you some valuable public speaking skills, including in-depth information on developing an engaging program and delivering your presentation with power. Students will cover how to identify their audience, organize ideas, and overcome nervousness.","topics":["Getting Started","Review Quiz"]},{"name":"Module","details":"Identifying Your Audience","description":"In this module, Identifying Your Audience, students will learn how to identify who their audience is and how to best prepare their speech for them. You wouldn't want to give a speech full of technical jargon to a non-tech-savvy crowd, and that's where being able to identify your audience becomes incredibly important. Knowing how to best relay your topic and point will help you plan your speech.","topics":["Identifying Your Audience","Demo 1","Review Quiz"]},{"name":"Module","details":"Creating a Basic Outline","description":"In this module, Creating a Basic Outline, students will learn to create a basic outline for their speech. A good outline for your speech will help ensure that you cover all of the topics that you want to cover as well as give you an idea of how to structure the speech overall for the best flow. Every great speech starts with a solid outline.","topics":["Creating a Basic Outline","Demo 1","Review Quiz"]},{"name":"Module","details":"Organizing the Program","description":"In this module, Organizing the Program, students will learn about how to organize the program. The essential thing to remember is that you are giving your presentation for the benefit of your audience. That means you need to organize it in a way that will make sense to them. This module will guide students through the process of organizing their program in a way that makes the most sense.","topics":["Organizing the Program","Demo 1","Review Quiz"]},{"name":"Module","details":"Fleshing It Out","description":"In this module, Fleshing It Out, students will learn about fleshing out their speech. Once the outline and organization of topics are complete, then comes time to start building out the speech. Audiences are often a little skeptical about a speaker's message. You can build credibility with an audience by using reliable sources of information and backing up your statements with citations to trusted authorities.","topics":["Fleshing It Out","Demo 1","Review Quiz"]},{"name":"Module","details":"Putting It All Together","description":"In this module, Putting It All Together, students will learn to put it all together. Once you've outlined your speech and lined up some solid evidence to back up your ideas, it's time to put all the pieces together. This module will take a look at using what we've learned so far to put our speech together. Upon completing this module, students will understand how to put it all together.","topics":["Putting It All Together","Demo 1","Review Quiz"]},{"name":"Module","details":"Being Prepared","description":"In this module, Being Prepared, students will learn to be prepared when giving their speech. Being prepared will boost your self-confidence and reduce the chances of something going wrong. It also creates an impression of you as a competent, diligent person and makes it easier for you to give a polished, professional presentation.","topics":["Being Prepared","Demo 1","Review Quiz"]},{"name":"Module","details":"Overcoming Nervousness","description":"In this module, Overcoming Nervousness, students will learn tips and tricks for overcoming nervousness. This module will cover the steps for preparing mentally for your speech; stay positive, accept that you will be nervous, nerves will dissipate quickly once you start. By the end of this module, students will be prepared to deal with overcoming nervousness.","topics":["Overcoming Nervousness","Demo 1","Review Quiz"]},{"name":"Module","details":"Delivering Your Speech (I)","description":"In this module, Delivering Your Speech (I), students will start learning about delivering their speech. This module covers starting off on the right foot, from capturing the audience's attention to introducing the subject of the presentation. It also covers the use of visual aids to clarify data, highlight areas, and signal transitions.","topics":["Delivering Your Speech (I)","Demo 1","Review Quiz"]},{"name":"Module","details":"Delivering Your Speech (II)","description":"In this module, Delivering Your Speech (II), students take a deeper look at how to deliver their speech. Students will learn to adjust on the fly, ask questions, conduct an informal poll, and use a brief anecdote to help enhance their speech. Students will also learn how to gauge whether or not breaks are required during their speech.","topics":["Delivering Your Speech (II)","Demo 1","Review Quiz"]},{"name":"Module","details":"Questions and Answers","description":"In this module, Questions and Answers, students will learn to prepare for and deal with questions and answers after their speech. The way you respond to questions will have a major effect on what kind of rapport you are able to build with the audience. After completing this module, students will have the skills to address questions after their speech.","topics":["Questions and Answers","Demo 1","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Public Speaking - Course Assessment"]}]}