{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1925","title":"Quality Control Circles - Lean Participation Model for Teams","totalEnrolled":"1,865","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to invoke cultural change and improve team participation with this free online Quality Control Circles course.","description":"This free online quality control circles training course will teach you about the lean participation model for teams. You will learn how quality control circles (QCC) are considered revolutionary tools for the involvement of the workforce to voluntarily meet various business objectives. You will study quality improvement, cost minimization, and productivity improvement of the workplace which will greatly enhance your quality control skills.","courseOutcomes":["Compare the Lean Quality Circle (LQC...","Discuss the history of the QCC in Ja...","List the different attributes of a s...","Discuss the International Convention...","Compare the Lean Quality Circle (LQC) to Quality Control Circle (QCC)","Discuss the history of the QCC in Japan","List the different attributes of a successful Quality Control Circle","Discuss the International Convention On Quality Control Circle","Describe what the organogram for QCC will look like","Explain various roles and positions for a QCC along with different committees for effective implementation","Describe the workflow process for a QCC in different phases","Explain the particular rules for a brainstorming session","List the evaluation criteria for a QCC theme","Explain the benefits and advantages of the QCC program","List the mandatory items for the QCC","Compare the Lean Quality Circle (LQC...","Discuss the history of the QCC in Ja...","List the different attributes of a s...","Discuss the International Convention...","Compare the Lean Quality Circle (LQC) to Quality Control Circle (QCC)","Discuss the history of the QCC in Japan","List the different attributes of a successful Quality Control Circle","Discuss the International Convention On Quality Control Circle","Describe what the organogram for QCC will look like","Explain various roles and positions for a QCC along with different committees for effective implementation","Describe the workflow process for a QCC in different phases","Explain the particular rules for a brainstorming session","List the evaluation criteria for a QCC theme","Explain the benefits and advantages of the QCC program","List the mandatory items for the QCC"],"courseDescription":"<p>In the free online course Quality Control Circles - Lean Participation Model for Teams you will learn that Quality Control Circle (QCC) is a program which creates a culture in an organization for workers and mid-level employees to come forward, form a cohesive team and play their role in solving workplace problems. Business challenges are broken down into modular themes, and thus improves the workplace performance in different areas of Lean, Quality, Productivity, Cost Minimization, Safety, Ergonomics etc.</p><p>This course will help facilitators, coordinators and top management in any organization to understand the QCC Program. The program was developed first in Japan and has transformed the industrial landscape there with tremendous improvements in quality control. The term Quality Control Circle is often used interchangeably with other terms such as Lean Quality Circle, Kaizen Circle and others.</p><p>In this course, learners will study: the attributes of the successful Quality Control Circle program; the basic QCC working framework; variations between lean circle and quality circle; different roles and responsibilities of a QCC program; workflow phases of a QCC program; and other different implementation aspects. So, why wait? Start the course today and learn how you can successfully implement a QCC program!</p><a href=\"https://alison.com/resume/courses/1925\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1925\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Quality Control Circles (QCC)","description":"This module explains the introduction to Quality Control Circles (QCC). It also presents some important concepts with it. It also covers the comparison of Lean Quality Circles and Quality Control Circles. It also includes discussions on the history of QCC in Japan, basic working framework, the existence of the ICQCC, QCC theme, and then covers various different positions and roles for the QCC to be managed in an organization. Moreover, it also covers different committees for implementing QCC.","topics":["Introduction to Quality Control Circles (QCC) - Learning Outcomes","Introductory Elements of Lean Quality Control Circles (LQCC)","Roles and Responsibilities in a Quality Circle","Introduction to Quality Control Circles (QCC) - Lesson Summary"]},{"name":"Module","details":"Incorporation of the Quality Control Circles in an Organization","description":"This module explains the workflow and implementation aspects of the QCC program. Within the workflow, it covers various different elements of phases and the implementation parts which includes the planning, approval, launching, training, follow-up and validation, implementation, completion, event, signing off and the reward system. Moreover, the module also covers rules for circles' brainstorming, milestones for QCC program, advantages of QCC, launch list, and evaluation criterion.","topics":["Incorporation of the Quality Control Circles in an Organization - Learning Outcomes","Workflow for a Quality Circle","Implementations Aspects of a Quality Circle","Incorporation of the Quality Control Circles in an Organization - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Quality Control Circles - Lean Participation Model for Teams - Course Assessment"]}]}