{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3015","title":"Recruitment Consultant","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the techniques needed to be an effective recruiter with this free online recruitment consultant course.","description":"This free online course teaches you the processes and laws that govern a recruitment consultant's practices and also how to be effective in their role. Attracting and finding the right talent is an important responsibility and you will learn how to employ various sourcing methods to find the ideal candidate. Analyze and discuss the principles of writing an engaging job post, reviewing applicants and various interviewing techniques.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Human Resources (HR) includes many specialist disciplines and recruitment is one of the most important. Organizations hire recruitment consultants to find suitable candidates for their job vacancies and some are agency-based and others work in an in-house team. These consultants use knowledge of their client companies, the company's structure, the personalities in senior positions and what the working conditions are like to match a potential candidate. It is possible to get into the recruitment industry without experience in recruitment and this is where this recruitment consultant course can play a pivotal role.</p><p>This course will introduce you to specific sourcing methods to ensure the job advertisement reaches the right audience, the documentation required to ensure a fair and honest job posting as well as the potential pitfalls in attracting the right candidate. Once a job advertisement has been written and posted, there are some principles and techniques of interviewing to master before you begin interviewing - the content covers all you need to know with many practical examples as well. You will also learn the important recruitment competencies such as matching candidates with the essential skills required, applicant screening and the shortlisting process.</p><p>Anyone with an interest in the recruitment industry will gain a lot from this HR course. From an experienced recruitment consultant to one just starting out that would like to expand their recruitment knowledge or learn new recruitment methods - enrolling in this course will allow you to refine your specialist skills so you can elevate your HR career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}