{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3026","title":"Regulations and Requirements of Oil Tankers","totalEnrolled":"717","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the regulations and practices that prevent oil pollution from ships and tankers in this free online course.","description":"This free online course guides you through the rules governing oil tankers and highlights the protocols and pollution prevention equipment that check the activities of oil tankers at sea. These regulations and practices combine to keep oil tankers sailing safely and prevent the kind of spill that can devastate our oceans. This course suits those interested in the legal and technical measures that protect our fragile marine environments.","courseOutcomes":["Discuss the Port State Control (PSC ...","List the equipment involved for disc...","Analyze the shipboard oil pollution ...","Explain the importance of the SOPEP ...","Discuss the Port State Control (PSC ) inspections of machinery space as laid out in MARPOL Annex I","List the equipment involved for discharge monitoring during cargo operations","Analyze the shipboard oil pollution emergency plan (SOPEP)","Explain the importance of the SOPEP for pollution prevention","Outline the arrangements required for the reception of sludge on shore","Identify the spill/pollution combating equipment that is available onboard","Discuss the Port State Control (PSC ...","List the equipment involved for disc...","Analyze the shipboard oil pollution ...","Explain the importance of the SOPEP ...","Discuss the Port State Control (PSC ) inspections of machinery space as laid out in MARPOL Annex I","List the equipment involved for discharge monitoring during cargo operations","Analyze the shipboard oil pollution emergency plan (SOPEP)","Explain the importance of the SOPEP for pollution prevention","Outline the arrangements required for the reception of sludge on shore","Identify the spill/pollution combating equipment that is available onboard"],"courseDescription":"<p>This course explains the 1983 ‘International Convention for the Prevention of Pollution from Ships’ (also known as ‘MARPOL’). MARPOL’s Annex I covers the prevention of pollution by oil from operational measures and accidental discharges. We investigate how amendments to Annex I made it mandatory for new oil tankers to have double hulls and identify which annexes are mandatory for all MARPOL signatories and which are optional. We examine some exceptions that allow discharges before addressing the United States’ Oil Pollution Act (OPA) of 1990 to establish how the different tonnage cut-offs make it difficult to compare directly with MARPOL. We study how the sinking of the Erika off the coast of France in 1999 led to the strengthening of MARPOL requirements with respect to double hulling and inspections.</p><p>The course outlines applications, regulations and conditions for exemptions for segregated ballast tanks (SBT). We describe the double-hull and double-bottom requirements for oil tankers that prevent pollution from tankers carrying heavy-grade oil as cargo. We consider the accidental oil-outflow performance for tankers required after 2009 and their ‘damage assumptions’ and maximum tank-length. The course examines the damage resulting from the hypothetical outflow of oil and explains the formula for calculating its level established by assumed side and bottom damage. We analyze the conditions, applications and exemptions to the size and arrangement of cargo tanks. This course breaks down the permeability of allowed space and stability concerns. We help you understand the application and importance of ‘slop tanks’ and the discharge arrangement for tankers, including segregated or clean ballast, the ‘ballast water management convention’ (BWM), oil/water separation, interface detector, draining pipelines and pumps.</p><p>We take a close look at oil tanker regulations and requirements that curb marine oil pollution. We also establish the important role of the dedicated clean ballast tank system regulations, crude oil washing system, slop tank arrangement and oil residue (sludge) tank arrangement in preventing oil pollution from ships. The course analyzes the oil discharge monitoring and control system (ODME), tanker requirements, International Maritime Organization (IMO) guidelines, clean ballast tanks (CBT), ballast discharge, oil-filtering equipment and flag state duties. We lay out the functions and regulations of oil/water interface detectors, IMO resolutions, interface detectors, in-tank interface detection, water discharge valves and the oil record book (ORB). Finally, we address reception facilities, ship certifications and environmental awareness. This course combines marine engineering, marine environmental studies and maritime law to help anyone interested in learning how technology and the law can combine to keep our oceans safe from the kind of environmental disaster that can wreak devastating natural and economic damage.</p><a href=\"https://alison.com/resume/courses/3026\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3026\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cargo Area Requirement of Oil Tankers","description":"This module discusses the applications of the Segregated Ballast Tanks as well as the double hull and double bottom requirements for oil tanks. This module also highlights the regulation to oil tankers of 5,000 tonnes deadweight and the damages resulting from the hypothetical outflow of oil from a tanker. The arrangement of cargo tanks, as well as stability conditions and slop tanks, will also be covered in this module.","topics":["Cargo Area Requirement of Oil Tankers - Learning Outcomes","Segregated Ballast Tanks","Double Hull and Double Bottom Requirements for Oil Tankers","Prevention of Oil Pollution from Oil Tankers","Accidental Oil Outflow Performance","Hypothetical Outflow of Oil From Tanker Due to Damage","Limitations of Size and Arrangement of Cargo Tanks","Intact Stability, Subdivisions, and Damaged Stability","Slop Tanks","Cargo Area Requirement of Oil Tankers - Lesson Summary"]},{"name":"Module","details":"Pumping, Piping, and Discharge Arrangement","description":"This module discusses the preventing oil pollution by ships from the discharge arrangement for tankers, segregated or clean ballast, Ballast Water Management Convention. This module also analyses the regulations and system requirements of the oil pollution prevention convention. Oil filtering equipment and the cargo operations of the oil record books will also be covered in this topic.","topics":["Pumping, Piping, and Discharge Arrangement - Learning Outcomes","Discharge Arrangement for Tankers","Systems and Arrangements","Crude Oil Washing Requirements","Oil Discharge Monitoring and Control System (ODMCS)","Oil/Water Interface Detector","Pumping, Piping, and Discharge Arrangement - Lesson Summary"]},{"name":"Module","details":"Pollution Prevention Equipment and Regulations","description":"This module discusses various equipment for preventing oil pollution by ships operating in polar waters as well as different regulations guiding the ship to ship operations. You will learn about the Antarctic treaty and the Polar Code which regulate ship operations to prevent pollution.","topics":["Pollution Prevention Equipment and Regulations - Learning Outcomes","MARPOL Equipment List","Shipboard Oil Pollution Emergency Plan (SOPEP)","Reception Facilities","Pollution Prevention - STS Operations","Requirements for the Antarctic","Pollution Prevention Equipment and Regulations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Regulations and Requirements of Oil Tankers - Course Assessment"]}]}