{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1593","title":"Risk Management: Managing Property and Liability Risk","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about property and liability risks, including coverage, classification, valuation, and global risk exposure.","description":"This free online risk management course teaches you about all of the most important elements of property and liability risk. Property risk corresponds to a property being damaged by fire or natural calamities and liability risk means a person becoming vulnerable to a lawsuit. Risks are inevitable in life, and come in a variety of different forms. By the end of the course, you will know how to identify, assess, and manage these risks effectively.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course begins by identifying the general features of property coverage for real and personal property. It then explains these properties' classification and effect on risk exposure and valuation. You will also examine the increasing frequency and severity of e-commerce property risks, and become familiar with the five main categories of risks. You will then look into common strategies of loss-control and explore the availability of different forms of insurance as a means of transferring risks.<br><br>Global exposure is rapidly growing for many companies. This course will discuss global risk exposures in the international competitive landscape. You will look into risk control measures and insurance options, and then study the meaning of liability and its legal ramifications. This course will also discuss special, general, and punitive damages. You will learn how negligent actions can result in liabilities, as well as look into the duties property owners have to others.<br><br>Whether we like it or not, we are all exposed to risks. Learning how to manage this risk and having the right insurance measures in place will make it easier for you if and when things go wrong. By the end of this course, you will how how to identify, control, prevent, and reduce potential risks when managing properties. This is really useful information, so don't wait until it's too late. Start learning something valuable, today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}