{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4356","title":"RSBA1 - Kickstart Your Vision","totalEnrolled":"277","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides 4 sustainable steps to help you get back on your feet (RSBA1).","description":"This course will teach you how to activate the concept of 'Response, Sustain, Build, Achieve'. Also, fulfil any vision/idea that helps to impact the community. It's all about kickstarting what you always desired to do. Here is a step by step guide to get there with peace of mind and access to free resources whilst you build your vision. The course covers financial management, career search and sustainability in your personal and professional life","courseOutcomes":["Define ‘RSBA’ and its functions...","Identify basic services that people ...","List charitable and community organi...","Evaluate your financial circumstance...","Define ‘RSBA’ and its functions","Identify basic services that people in a crisis need","List charitable and community organisations that provide free food supportive services","Evaluate your financial circumstances to prevent homelessness","Describe the common causes behind debt challenges and their effects on your financial life","Outline steps to writing a CV and finding a career","Discuss the use and effectiveness of Eloc Vision Starter to help build people up to start a vision/business","Indicate the impact of your good story to positively influence people in crisis","Define ‘RSBA’ and its functions...","Identify basic services that people ...","List charitable and community organi...","Evaluate your financial circumstance...","Define ‘RSBA’ and its functions","Identify basic services that people in a crisis need","List charitable and community organisations that provide free food supportive services","Evaluate your financial circumstances to prevent homelessness","Describe the common causes behind debt challenges and their effects on your financial life","Outline steps to writing a CV and finding a career","Discuss the use and effectiveness of Eloc Vision Starter to help build people up to start a vision/business","Indicate the impact of your good story to positively influence people in crisis"],"courseDescription":"<p>During a financial challenge, your initial point of contact can either bring you relief or add to your stress. Are you in a situation or know someone around you who is in a crisis? Have you got a vision/idea? Help is here to help you kickstart it today. RSBA is a four step program to help people get back on their feet and complete what they always desired to do. Here is a step by step guide to get there with peace of mind and access to free resources whilst you build your vision. Learn to access a listing directory of charitable and community organisations providing free food and other supportive services. Explore how to obtain response services for food, toiletries, clothing, perishables and non-perishables. We will then discuss the topic of debt. Debt challenges are usually due to a lack of budgeting, mismanagement of money and overspending. Even people with savings in the bank can benefit from budgeting. Discover how to use a budget planner to manage your monthly expenses, be in a position to sustain financial commitments and prepare for life's unexpected events.</p><p>Are you looking to build on your current skills and experience? Developing a career path requires a substantial amount of time. We will teach you to select areas of interest and explore courses related to those fields. The career search process starts with writing a good CV with all the details of your qualification and work experience. Then, you will learn how to find the most suitable templates for writing CVs and cover letters, access online career portals and be prepared for your interview. Discover the Eloc Vision Starter 21 Day Acceleration program that can help kickstart a vision or business venture. Learn about the benefits of the Business Resource centre offering a diverse range of essential support. When you have reached a position of achievement that is personal to your circumstances then by sharing your success story it can have a positive influence on other people. They may be going through a similar situation and your story can inspire them to follow your path and change their lives for the better. We will demonstrate how to use an international story-sharing platform to ensure your good news helps inspire and motivate other people.</p><p>Overall this course is for anyone wanting to improve their quality of life and contribute to society. It is divided into four parts containing small and simple practical tasks to make it engaging. It also supplies links to the relevant RSBA1 online resources, forms and templates to guide you every step throughout the course. RSBA1 has engaged supermarkets, online stores, businesses and charities to work together to dimise poverty and educate people on financial sustainability and emergency management. Nearly every community is susceptible to some form of crisis which necessitates an increasing number of people to step forward and assist in crisis management to establish long-term sustainability for those affected. Learn about the web portal-based multipurpose RSBA1 platform to help yourself and others in times of difficulties. Join the course now!</p><a href=\"https://alison.com/resume/courses/4356\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4356\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Kickstart Your Vision","description":"This module will introduce you to accessing essential sources and services in times of crisis. Learners will be taught the importance of budgeting and the use of a budget planner to manage their expenses. You will gain knowledge of writing CVs and covering letters, searching for careers online and the impact of your good news on other people.","topics":["Kickstart Your Vision - Learning Outcomes","Response Services","Sustain - Budget and Plan","Build Over Time","Registering a Business and Achieving Goals","Kickstart Your Vision - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["RSBA1 - Kickstart Your Vision - Course assessment"]}]}