{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2726","title":"SA 8000 - Corporate Social Responsibility (CSR) & Accountability for Organizations","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course learn the basics of the SA8000 Standard including its criteria and evaluation areas.","description":"This free online course on SA 8000 explains the basic principles of the Standard. You will also be introduced to its management system and the purpose and scope of SA 8000. You will learn the different requirements, explanations, and applications of SA 8000. You will learn about the role of SA 8000 as a Social Audit Framework and also gain knowledge regarding the Social Performance Team (SPT) and documentation. So start learning today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course regarding SA 8000, you will learn the fundamentals of the Social Accountability Standard. You will learn its applications, purpose, and scope. You will also be introduced to terms and definitions related to Social Responsibility. Then you will learn all the requirements of the SA 8000 Compliance Audit through a detailed discussion of its nine requirements. You will learn the importance of SA 8000 as a Social Audit Framework.</p><p>Moreover, the requirements are explained. You will learn the types of injustices employees can go through and how the organization can counter these acts. The course discusses child labor, defines it as well as shows how to identify and prevent it from occurring. The course also discusses reasonable working hours and discrimination in the workplace to verify what the Standard is and what to avoid.</p><p>If you are seeking to understand the concept, principles and requirements of SA 8000 then look no further, this course will guide you through these areas of the<span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;\"> Social Accountability Standard. In a world where the focus is placed on turning a profit no matter the cost, it's important to remember how crucial it is for organizations to be socially responsible and accountable. So why wait? Enrol now and start learning these invaluable skills today.</span></p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}