{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5449","title":"Safe Handling of Large Goods Vehicles","totalEnrolled":"774","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to handle a large goods vehicle (LGV) and prepare to qualify as an LGV driver with this free online course.","description":"Manufacturers, large retail chains and haulage firms frequently use large goods vehicles (LGVs) to transport items on a regional, national and international scale. But did you know that special training and qualifications are required to become an LGV driver? This course prepares you for the UK’s driver ‘Certificate of Professional Competence’ (CPC) test and explains how to meet the requirements to become a qualified LGV operator.","courseOutcomes":["Outline the steps to follow when you...","Recognise all the driving licence ca...","Recall the scoring system of all the...","Explain how to apply for a Driver Di...","Outline the steps to follow when you return to work as a bus or truck driver","Recognise all the driving licence categories and compare codes","Recall the scoring system of all the Driver CPC examinations","Explain how to apply for a Driver Digital Tachograph Card","Distinguish between wheel-based vehicles and box vans","Discuss the weight and height restrictions for LGVs","Compare analogue and digital tachographs","Outline the steps to follow when you...","Recognise all the driving licence ca...","Recall the scoring system of all the...","Explain how to apply for a Driver Di...","Outline the steps to follow when you return to work as a bus or truck driver","Recognise all the driving licence categories and compare codes","Recall the scoring system of all the Driver CPC examinations","Explain how to apply for a Driver Digital Tachograph Card","Distinguish between wheel-based vehicles and box vans","Discuss the weight and height restrictions for LGVs","Compare analogue and digital tachographs"],"courseDescription":"<p>Earning a licence to operate large goods vehicles (LGVs) can completely alter your career and lifestyle. However, it requires specialised training and regular mandatory inspections and maintenance measures to keep these vehicles roadworthy and reduce the risk of breaking down. This course helps you to understand the basics of driving LGVs, the various relevant conventions and regulations and how to acquire LVG certifications.</p><p>We begin by explaining the differences between small and large goods vehicles and then guide you through the main characteristics of LGVs. The transport industry is subject to many regulations and legal requirements. We outline the rules concerning vehicle limits, load restraints and how to record driving hours and breaks with a tachograph. We then discuss the European Union rules, the International Carriage of Goods by Road (CMR) convention and other international laws relating to LGVs. We also examine LGV drivers’ health conditions and explain how to conduct daily checks on defects via walk-round and roadside checks.</p><p>The course addresses load-related speed limits and measures designed to keep loads safe on the road. You need a ‘Driver Certificate of Professional Competence’ (CPC) to drive an LGV or a bus in the UK. We discuss the requirements you must meet when applying for the first time or returning to work as a truck or bus driver. We then show you how to obtain your LGV provisional licence before applying for the Driver CPC test. Have you ever wanted to drive large vehicles like tankers, semi-trucks or buses? This course is the right place to learn how. Enrol now to learn how to drive a LGV and earn the necessary qualification.</p><a href=\"https://alison.com/resume/courses/5449\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5449\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Large Goods Vehicles","description":"In this module, you will get an understanding of the differences between small and large goods vehicles. You will also learn about the importance of roadworthiness and explore the main characteristics of LGVs, their limits, loads and load restraints. Then, we will examine the EC rules, uses of tachographs as well as LGV drivers' health conditions.","topics":["Introduction to Large Goods Vehicles - Learning Outcomes","Knowing Your LGV","Characteristics of Vehicle","Vehicle Limit","Loads and Load Restraint","Drivers’ Hours and Records","Vehicles and Driving","Health and Conduct","Introduction to Large Goods Vehicles - Lesson Summary"]},{"name":"Module","details":"Qualifications and CPC Tests","description":"In this module, you will learn about the importance of daily vehicle checks and the laws relating to long goods vehicles (LGVs). You will also learn how to qualify to be an LGV driver, as well as the processes of acquiring a professional LGV driving licence. Then, we will break down the five Driver CPC examinations and what you need to pass them.","topics":["Qualifications and CPC Tests - Learning Outcomes","LGV Safety Inspection","Qualified LGV Driver","Provisional LGV Licence","CPC Test Part 01 and 02","CPC Test Part 03 and 04","After Getting Qualification","Qualifications and CPC Tests - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Safe Handling of Large Goods Vehicles - Course Assessment"]}]}