{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5649","title":"Sage 50 Accounting for Beginners","totalEnrolled":"214","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to manage your personal and professional finances using Sage 50 software with this free online course.","description":"Accounting and bookkeeping have adapted to the modern world, making handwritten ledgers a thing of the past. In this course, you will be introduced to Sage 50, a computerised accounting software. You will learn how to manage your companies' finances quickly and effectively from the comfort of your computer. By the end of this course, you will be ready to incorporate Sage 50 into your business to help modernise your financial accounts.","courseOutcomes":["Define accounting and its impact on...","Summarise the history of Sage 50 ac...","Compare and contrast manual account...","List the shortcut keys and how thei...","Define accounting and its impact on financial management","Summarise the history of Sage 50 accounting software","Compare and contrast manual accounting systems and computerised software","List the shortcut keys and how their functions in Sage 50","Define what a chart of accounts is and the benefits it provides for your business","Identify the common errors you can make when creating charts in Sage 50","Define what a bank reconciliation is and how to perform one using Sage 50 accounting software","List the nominal account ranges Sage 50 provides to its users","Identify the various types of recurring transactions","Describe how to create and manage sales invoices while using Sage 50","Define accounting and its impact on...","Summarise the history of Sage 50 ac...","Compare and contrast manual account...","List the shortcut keys and how thei...","Define accounting and its impact on financial management","Summarise the history of Sage 50 accounting software","Compare and contrast manual accounting systems and computerised software","List the shortcut keys and how their functions in Sage 50","Define what a chart of accounts is and the benefits it provides for your business","Identify the common errors you can make when creating charts in Sage 50","Define what a bank reconciliation is and how to perform one using Sage 50 accounting software","List the nominal account ranges Sage 50 provides to its users","Identify the various types of recurring transactions","Describe how to create and manage sales invoices while using Sage 50"],"courseDescription":"<p>Accounting is one of the most daunting responsibilities for any business owner, as well as one of the most important. Nowadays, with everything moving online accounting has followed suit, with computerised versions of your paper ledger. In this course, you will learn how to run your companies' accounts using one such software, Sage 50. Your studies begin with a quick overview of accounting as a whole and how it differs from bookkeeping. You will then cover how to install Sage onto your machine through a step by step guide, downloading Sage from a CD-ROM is covered in this section too. This will also include a quick look into the history of sage and the different versions that are available for purchase. What are the other installation requirements that Sage needs to properly run? Aside from the technical specifications that your computer needs to meet, you will also be provided with a detailed guide on creating an account with Sage and linking it to your software and machine.</p><p>After the installation guide, you will learn how to access the Sage from your desktop. As you continue with the course you will be introduced to a variety of features and abilities of Sage, many of which are supported by video tutorials. This section begins with a description of the two types of layouts Sage has available, Classic and Enhanced View. Next, you will cover the various windows that you will use to upload your business' information, from business type to what type of currency will be used. After these details, you will learn how to create reports and charts using financial data. You will cover preview reports, charts of accounts and other bank records. Are you familiar with common shortcut keys, such as copy and paste? Along with standard shortcuts, you will learn how to use keys that can only be used in Sage.</p><p>Included in these Sage specific lessons will be a broader range of terms, procedures and reports that every accountant should be familiar with. How to perform a bank reconciliation is one of these broader subjects that will be taught. You will then take a deep dive into nominal ledgers and recurring transactions. Both play a significant role in your business' finances and are simple to record, manage and delete is Sage. Do you know the difference between everyday commercial documents, such as receipts and invoices? This course finishes with a look into creating, managing and duplicating sales invoices. Throughout this course, you will form a solid understanding of what accounting is and how easy it can be to use accounting software. Start this course today to learn how to modernise your business' finances and records using Sage 50 accounting software.</p><a href=\"https://alison.com/resume/courses/5649\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5649\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Fundamentals of Computerised Accounting","description":"In this module, you will be introduced to Sage 50 accounting software. This includes a brief history of accounting and Sage, the differences between accounting and bookkeeping and the functions provided by the classic and enhanced views of Sage. You will also be provided with a step-by-step guide for installing the software.","topics":["The Fundamentals of Computerised Accounting - Learning Outcomes","The Fundamentals of Accounting and Financial Management","Introduction to Computerised Accounting","Classic and Enhanced Views","The Fundamentals of Computerised Accounting - Lesson Summary"]},{"name":"Module","details":"Navigating Sage 50 Features","description":"In this module, you will be introduced to the features and functions of Sage 50 Accounting software. This includes creating charts of accounts, identifying the eight windows of company information and practising with demo data for illustrative purposes. You will also study vital accounting terms and the common errors Sage users experience.","topics":["Navigating Sage 50 Features - Learning Outcomes","Navigating Practice and Demo Data","Shortcut Keys and Navigation","Create, Modify and Review Chart of Accounts","Navigating Sage 50 Features - Lesson Summary"]},{"name":"Module","details":"Creating and Managing Financial Reports","description":"In this topic, you will learn how to create a variety of different financial reports. This includes managing bank records, using a nominal ledger, providing information for stock records and changing the layout of sales invoices. Duplicating invoices and recording petty cash are covered too. You will also study how to perform a bank reconciliation.","topics":["Creating and Managing Financial Reports - Learning Outcomes","Performing a Bank Reconciliation","Nominal Ledger, Petty Cash and Other Records","Recurring Transactions and Stock Records","Managing Sales Invoices","Creating and Managing Financial Reports - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Sage 50 Accounting for Beginners - Course assessment"]}]}