{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3603","title":"Sage One - Bookkeeping and Accounting","totalEnrolled":"12,771","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use the Sage One accounting tool to enter invoices, record payments, and more in this free online course.","description":"Bookkeeping is extremely important to the success of a business and modern accounting involves heavy use of tools like Sage One, which makes bookkeeping and accounting very convenient. This free online basic accounting course will teach you how to use the Sage One accounting tool to do common bookkeeping and accounting tasks like entering invoices, credit notes, recording various transaction types, generating and sharing reports and much more.","courseOutcomes":["Explain the process of setting up Sa...","Describe how customers and suppliers...","Explain how invoices and credit note...","Discuss the process involved in maki...","Explain the process of setting up Sage One","Describe how customers and suppliers are added in Sage One","Explain how invoices and credit notes are entered in Sage One","Discuss the process involved in making corrections to previously entered invoices","List the steps involved in printing out or mailing invoices in Sage One","Explain the process of entering a sales/customer receipt in Sage One","Describe how payments to suppliers are recorded in Sage One","Discuss the process of reporting non-invoiced sums that are sent or received","Outline the types of payment that can be entered in Sage One","Explain the process of reporting cash transactions and transfers between accounts","Describe the process of bank reconciliation as carried out in Sage One","Explain how reports could be created, printed, and mailed in Sage One","Explain the process of setting up Sa...","Describe how customers and suppliers...","Explain how invoices and credit note...","Discuss the process involved in maki...","Explain the process of setting up Sage One","Describe how customers and suppliers are added in Sage One","Explain how invoices and credit notes are entered in Sage One","Discuss the process involved in making corrections to previously entered invoices","List the steps involved in printing out or mailing invoices in Sage One","Explain the process of entering a sales/customer receipt in Sage One","Describe how payments to suppliers are recorded in Sage One","Discuss the process of reporting non-invoiced sums that are sent or received","Outline the types of payment that can be entered in Sage One","Explain the process of reporting cash transactions and transfers between accounts","Describe the process of bank reconciliation as carried out in Sage One","Explain how reports could be created, printed, and mailed in Sage One"],"courseDescription":"<p>This free online course will show you how to use Sage One for common bookkeeping and accounting activities. This Sage One accounting course begins by showing you how to download Sage One and sign up to use the service. It then goes on to demonstrate the process of adding customers and suppliers, making changes to the chart of accounts, entering invoices and credit notes, correcting previous invoice entries and wiping data, if necessary. This part of the course then concludes by demonstrating how to print out or mail invoices and credit notes.</p><p>This online accounting course proceeds to show the process of entering a sales receipt in Sage One, as well as the steps involved in reporting payments made to customers. This part of the course also explains how to enter non-invoiced transactions and lists situations where that might occur. It then goes on to explain the process of reconciling accounting and reporting transactions between different accounts. Reporting is the final section of this Sage one course and you will learn the process of generating reports such as the profit and loss report and the remittance advice.</p><p>The use of the Sage One application improves the accounting and bookkeeping process and its popularity and wide use in both large and small businesses is due to the user-friendly nature of the software and its efficiency. Proficiency in using Sage is highly relevant in modern accounting and if you are a businessperson looking to improve your accounting skills and output or an accounting student or professional wanting to refine your skills with Sage One, then you should enrol in this bookkeeping course which will take you no more than three short hours to complete.</p><a href=\"https://alison.com/resume/courses/3603\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3603\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting Up, Invoices and Credit Notes","description":"In this module, you will learn how to download, install and sign up to use Sage one. You will also learn how to add customers and suppliers, make changes to the chart of accounts, enter invoices and credit notes, and how to print or mail invoices and credit notes.","topics":["Setting-up, Invoices and Credit Notes - Learning Outcomes","Setting-up Sage One","Customer, Supplier Invoices and Credit Notes","Setting Up, Invoices and Credit Notes - Lesson Summary"]},{"name":"Module","details":"Paying Suppliers, Bank Reconciliation and Reporting","description":"In this module, you'll learn how how to record payments made to suppliers, payments from customers, and non-invoiced payments made or received. You will also learn how to reconcile a bank account, as well as how to generate reports like the Profit & Loss Report and the Remittance Report.","topics":["Paying Suppliers, Bank Reconciliation & Reporting - Learning Outcomes","Paying Suppliers and Customer Receipts","Bank Reconciliation and Producing Reports","Paying Suppliers, Bank Reconciliation and Reporting - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Sage One: Bookkeeping and Accounting - Course assessment"]}]}