{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1612","title":"Sales Techniques - Interacting with Customers","totalEnrolled":"22,146","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your sales skills to help you succeed with new customers.","description":"This free online Sales Techniques course from Alison will show you the professional way of interacting with customers. Selling is the process of exchanging monetary value for goods and/or services. With this course, you will learn about fundamental customer questions, the importance of body language, and the human interface. You will also study communication and presentation skills for selling. Learn to sell more by selling better, today!","courseOutcomes":["Explain why selling is a business di...","Describe what makes up the Human Int...","List the five general signs of peopl...","Discuss how to improve your communic...","Explain why selling is a business discussion","Describe what makes up the Human Interface","List the five general signs of people lying","Discuss how to improve your communication","Describe how to give a winning presentation","Discuss how people will and won’t accept change and new technologies","Explain why selling is a business di...","Describe what makes up the Human Int...","List the five general signs of peopl...","Discuss how to improve your communic...","Explain why selling is a business discussion","Describe what makes up the Human Interface","List the five general signs of people lying","Discuss how to improve your communication","Describe how to give a winning presentation","Discuss how people will and won’t accept change and new technologies"],"courseDescription":"<p>Study this online course Sales Techniques - Interacting with Customers to gain the vital knowledge and understanding of 'the human interface' when meeting, greeting and interacting with customers.</p><p>The course starts off with introducing you to sales and selling as a career. You will learn about the fundamental question’s customers will ask and why people should buy from you. The next topic discusses is the human interface, you will learn about body language and how important it is when interacting with customers. You will be taught about the five general signs to look out for when people are lying, the different selling approaches to take when someone is resistant to change.</p><p>In the second module, you will be introduced to sales communication skills. You will learn how to approach a potential customer and question them in the right way. You will be taught about active listening and how to be clear and precise with your speech and writing.</p><p>Finally the course describes the different phases that makeup any presentation, what you should do while you are presenting and how you can give a winning presentation.</p><p>This course will be of great interest to sales people, entrepreneurs, business owners and anyone looking to improve their sales skills and techniques.</p><a href=\"https://alison.com/resume/courses/1612\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1612\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Anyone Can Sell","description":"In this module you will learn about the fundamental questions customers will ask you. You will learn about the human interface and what to be aware of when interacting with people. You will learn about body language and about the five general signs of people lying.","topics":["Anyone Can Sell Learning Outcomes","Anyone Can Sell","The Human interface","The Power of Body Language","Anyone Can Sell Lesson Summary"]},{"name":"Module","details":"Communications and Presentations for Sales","description":"In this module you will learn about approaching a potential customer. You will learn about active listening and how to give winning presentations. You will learn about different selling approaches you can take when someone is resistant to change.","topics":["Communications and Presentations for Sales Learning Outcomes","Improving Your Communication","Giving Winning Presentations","Understanding Tolerance To Change","Communications and Presentations for Sales Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Sales Techniques - Interacting with Customers assessment"]}]}