{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2852","title":"SAP ERP Logistics Overview","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the process of managing business operations using the SAP ERP system.","description":"This free online course introduces you to the flow of business processes in an organization and the methods of managing the business operations using the SAP system. You will be taught about the process of integrating the material data in a single database and the sequence of actions that a business follows to fulfil a customer purchase. Further, the process of creating billing documents and the methods of reporting using SAP is also discussed.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course introduces you to the process of managing business operations and customer relationships using the SAP ERP system. Firstly, it provides the core concepts of the SAP ERP systems and its various organizational levels. You will discover the process of integrating all the material data in a single materials database for eliminating data redundancy. Following this, the process of creating and editing the SAP material master using the built-in transactional codes, is explained. The course highlights the process of customer transactions in SAP and also how the master records in the customer hierarchy are controlled by their account groups. You will discover the sequence of actions that a business follows to fulfil a customer purchase. Alongside this, the basic steps in performing a streamlined sales process using SAP are explained, including the process of determining ‘available to promise’ (ATP) checks from the warehouse stock, the planned inward movements of stock, and the planned outward movements of stock.</p><p>Next, the material on to explain the process of guaranteeing material availability using the function of material requirement planning (MRP). This will include the monitoring of stocks and, in particular, the automatic creation of procurement proposals for purchasing and production. You will discover how the plant is being picked up at sales order from the customer master and then from the material master for the determination of the plant. The course highlights how the purchasing units in SAP allow separating spend activities by entities such as departments, business units, purchasing organizations, cost centres and divisions. You will also discover the sequential steps involved in the procurement lifecycle of SAP. Following this, the process of efficiently monitoring the flow of products into and out of an existing inventory in the warehouse are explained, including planning, entry and keeping records of all the movements of goods. You will be taught about the transactional codes of the SAP inventory management that control the movement of materials into, through, and out of the SAP system. The course emphasizes the process of aligning demand with manufacturing capacity to create production and procurement schedules for finished products and component material.</p><p>Finally, you will learn about the different types of master data to be maintained in the SAP production planning (PP) module. You will discover how the SAP PP tracks and makes a record of the manufacturing process flow of the planned and actual costs. In addition, the process of creating delivery and the determination of shipping points at the time of placing the order. This will include the important checklist points to be carried out when a delivery is created. You will analyze the process of creating billing documents in SAP from items in the billing due list. Further, the process of ascertaining the consistency of information structure through the analysis of sales information system (SIS) reports in SAP are explained. You will study the various libraries provided by SAP S/4HANA platform for predictive, planning, text processing, spatial and business analytics. SAP ERP Logistics Overview is an informative course which will interest students studying commerce, financial accounting, computer science, production planning and materials management.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}