{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3537","title":"Small Business: The Business Plan","totalEnrolled":"7,522","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Get your business off the ground and secure funding by learning how to write a comprehensive business plan.","description":"This free online course will familiarize you with the process of developing business plans. For new businesses, funding is a key factor and this course will help you decide what funding options will be best for your venture. Finally, you will learn about franchising, management models and how to effectively manage costs as a start-up. This course will equip fledgling entrepreneurs with pertinent business skills needed for success in the future.","courseOutcomes":["Outline the do's and don'ts of writi...","Describe what a business plan is and...","Explain the process of a business pr...","Identify potential investors...","Outline the do's and don'ts of writing a business plan","Describe what a business plan is and how to develop one","Explain the process of a business presentation and how to effectively carry out one","Identify potential investors","Develop contingency and risk plans for the business","Outline the eight information sections of a typical business plan","Define business operations","Describe how to write an executive summary","Explain what a mission statement is and how to draft one","Define a business management plan","Outline the benefits of a good management plan","Describe the concepts of franchise, franchising, franchiser and franchisee, identifying their pros and cons","Outline the do's and don'ts of writi...","Describe what a business plan is and...","Explain the process of a business pr...","Identify potential investors...","Outline the do's and don'ts of writing a business plan","Describe what a business plan is and how to develop one","Explain the process of a business presentation and how to effectively carry out one","Identify potential investors","Develop contingency and risk plans for the business","Outline the eight information sections of a typical business plan","Define business operations","Describe how to write an executive summary","Explain what a mission statement is and how to draft one","Define a business management plan","Outline the benefits of a good management plan","Describe the concepts of franchise, franchising, franchiser and franchisee, identifying their pros and cons"],"courseDescription":"<p>This free online course will introduce you to business and management plan development, as well as other relevant aspects of business management for start-ups. It begins with a module on the concept of business plans; the recommended things to do when writing, organizing and formatting one, as well as what not to do. You will learn how to present it to an audience as one of the first steps of materializing a business plan is the process of attracting investors. This course will break down some types of investors, such as ‘angel investors’ and venture capitalists.</p><p>The course goes on to discuss contingency and due diligence in developing a proper business plan. Because nothing is given in the business world, it is only proper that a margin of error is provided when planning your business. This allowance in business planning is explained in the lesson on contingency planning. Next, you will learn about due diligence for professional investors and the legal aspects to consider. Study business operations and the types of legal business entities that exist. You will be taught the importance of the executive summary and the mission statement sections of your business plan, and how to write them as persuasively as possible. The last section takes you through lessons on management model types. You will learn about set-up costs for new start-ups and how to manage the financial requirements when starting a business venture. Lastly, you will be introduced to the concept of franchising, and its many aspects, as well as how to invest wisely in a franchise.</p><p>Like many endeavours in life, a business idea is nothing but wishful thinking if it has no plan to back it. The business plan is the framework upon which a business is built. It serves the purpose of guiding the entrepreneur in their decision making and also in selling the business idea to potential investors, partners or other stakeholders. As an entrepreneur looking to enter the business space, you must understand how to articulate your business plan succinctly, clearly and carefully, and this free online course will help you do just that.</p><a href=\"https://alison.com/resume/courses/3537\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3537\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Business Planning","description":"In this module, you will be introduced to the idea of business planning as the first stage for any business venture looking to succeed. You will learn the importance of writing a business plan, as well as, get tips on how to write and appropriately format one. You will also learn about business investors and venture capitalists in particular.","topics":["Business Planning - Learning Outcomes","Do's and Don'ts of Writing a Business Plan","Developing a Business Plan","Writing, Organization, and Formatting","Identifying Potential Investors","Contingency Planning and Risk","Business Planning - Lesson Summary"]},{"name":"Module","details":"Business Plan Outline","description":"In this module, you will learn more about writing business plans. Building on the introductory texts in the previous module, you will be provided with an outline of the sections of content in a business plan. You will also learn about the relevance of mission statements.","topics":["Business Plan Outline - Learning Outcomes","Small Business Plan Outline","Business Operations","Business Plan Outline - Lesson Summary"]},{"name":"Module","details":"Management and Costs","description":"In this module, you will learn about Management models and how to write management plans. You will also learn how to manage start-up costs and the concept of franchising.","topics":["Management and Costs - Learning Outcomes","Developing a Management Plan","Calculating Start-up Costs","The Franchise Route","Management and Costs - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Small Business: The Business Plan - Course assessment"]}]}