{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3531","title":"Small Business: Building the Right Team","totalEnrolled":"663","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"See what it takes to assemble and manage a strong team of people to achieve compatibility and success in the workplace.","description":"In this free online course, you will be introduced to different types of teams and groups, and how to build and manage them. You will learn about managers and leaders as well as the different approaches used to define leadership styles. You will also study the process of recruitment and succession planning in an organization. A business is often as strong as its smaller units - teams - so enroll today to strengthen yours.","courseOutcomes":["Define a manager...","Describe the types of managers...","Explain the nature of managerial wor...","Explain the traits that are associat...","Define a manager","Describe the types of managers","Explain the nature of managerial work","Explain the traits that are associated with leadership","Explain the behaviours that are associated with leadership","Discuss the main premises of the path-goal theory of leadership","Discuss what emotional labour is and how it affects individuals","Define a high-performance work system","Describe succession planning and its value","Identify the principal ways of recruiting workers","Describe training","Explain the stages of group development","Define a manager...","Describe the types of managers...","Explain the nature of managerial wor...","Explain the traits that are associat...","Define a manager","Describe the types of managers","Explain the nature of managerial work","Explain the traits that are associated with leadership","Explain the behaviours that are associated with leadership","Discuss the main premises of the path-goal theory of leadership","Discuss what emotional labour is and how it affects individuals","Define a high-performance work system","Describe succession planning and its value","Identify the principal ways of recruiting workers","Describe training","Explain the stages of group development"],"courseDescription":"<p>‘Small Business: Building the Right Team’ provides well-structured and researched lessons on team building and management, group dynamics, workforce recruitment, succession planning, and emotional response in the workplace. It begins with an introduction to the nature of managerial work. You will learn about leadership, entrepreneurship and strategy as the three principal fields on which the principles of effective management are built. The material then highlights the different defining approaches to leadership. Over time and with dedicated research, leadership styles have been identified by researchers based on certain presumptions and categorizations. In this course, you will learn about these approaches and their limitations. Ever heard about the ‘Big Five’ personality traits in psychology? You will unpack these and how they relate to leadership, as well as the importance of self-esteem and integrity.</p><p><br>This course provides lessons on emotions in the workplace and the topic of succession planning. For some, the rule of thumb is to clarify that emotion and business don’t mix but is this really so? Is there a genuine connection between emotions, attitudes and behaviours at work? This course will provide tips and detailed analysis of the affective events theory (AET) proposed by Howard Weiss and Russell Cropanzano. There are many facets to emotional engagement or management at the workplace and your attention will be drawn to these. You will then proceed to succession planning. At some point, you may have wondered how leadership and top management in companies are sourced. What does the entire process of management recruitment entail? Discover key details about the important process of succession planning and staff recruitment, as well as business training and its benefits in this course. You will also learn about the types of teams, groups, and psychologist Bruce Tuckman’s stages of group development, as well as the theory of punctuated equilibrium.</p><p><br>Building an effective management team is one of the primary steps in launching a venture. Entrepreneurs must explore their strengths and weaknesses and then determine the resources needed to fill the gaps. Successful businesses require not only stellar executives and advisors but also employees who are a good fit. A manager must be able to delegate responsibility and make decisions for the team but a leader must be able to influence team behaviour. For this reason, motivation is one of the most powerful tools that a leader can use. A motivated team will be able to go above and beyond the call of duty. Thus, anyone tasked with managing a group of people needs to know how to be an effective leader. Relative to successful leadership, management is easier. This free online course, with its scientifically researched content, will help you distinguish between management and leadership, and will also explore human resource aspects, such as recruitment and staff selection. The course will also discuss employee assessments and emotional intelligence. Whether you are an entrepreneur or a small business manager looking to upskill, this course provides you with the right content for your development.</p><a href=\"https://alison.com/resume/courses/3531\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3531\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Managers vs. Leaders","description":"In this module: Managers vs Leaders, you will learn about managers and leaders. You will learn about the nature of managerial work and also about entrepreneurship.","topics":["Managers vs. Leaders - Learning Outcomes","Who Are Managers?","Leadership, Entrepreneurship, and Strategy","Managers vs. Leaders - Lesson Summary"]},{"name":"Module","details":"Leading People and Organizations","description":"In this module, you will learn about the trait, behavioural, contemporary and contingency approaches to leadership. You will also learn how to develop your leadership skills.","topics":["Leading People and Organizations - Learning Outcomes","Trait Approaches to Leadership","Behavioral Approaches to Leadership","Contingency Approaches to Leadership","Contemporary Approaches to Leadership","Developing Your Leadership Skills","Leading People and Organizations - Lesson Summary"]},{"name":"Module","details":"Emotions and Succession Planning","description":"In this module: Emotions and Succession planning, you will learn about how to manage emotions in the workplace. You will learn also about the value of and how to design High-performance Work Systems.","topics":["Emotions and Succession Planning - Learning Outcomes","Emotions at the Workplace","Emotional Labor","Designing a High-Performance Work System","Improving Organizational Performance","Emotions and Succession Planning - Lesson Summary"]},{"name":"Module","details":"Recruitment and Training","description":"In this module, you will learn how to conduct recruitment and training for your employees. The module will highlight key points to note and steps to take before conducting recruitment exercises, particularly as a small business.","topics":["Recruitment and Training - Learning Outcomes","Hiring Your First Employee","Selecting and Managing Your Team","Recruitment and Training  - Lesson Summary"]},{"name":"Module","details":"Managing Groups and Teams","description":"In this module, you will learn about the types of groups and the stages of group development. You will also be introduced to the concept of punctuated equilibrium and cohesion in groups. Lastly, you will learn how to manage teams and conduct team meetings effectively.","topics":["Managing Groups and Teams - Learning Outcomes","Type of Teams","Group Dynamics","Understanding Team Design Characteristics","Management of Teams","Managing Groups and Teams - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Small Business: Building the Right Team - Course assessment"]}]}