{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3538","title":"Small Business: Marketing Strategy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Need a marketing plan to kickstart your business? This free online course unpacks research, strategy and forecasts.","description":"This free online course for small businesses provides lessons on the process of developing marketing plans and different ways of doing market research. It also touches on strategic planning and takes a look at the process of making market forecasts for your business. The course includes examples of successful campaigns by multinational companies. Enroll today to find out more about the crucial aspects of effective marketing.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course is designed to deliver informative lessons on essential topics in marketing strategy. Two common questions often asked about marketing are, ‘Why do we study marketing?’ and ‘Who does marketing?’. Both are answered in the first part of this course. You will then learn about the process of doing market research. Find out why and how to define the particulars of the research before designing and undertaking the study itself. Have you ever been presented with a questionnaire requesting personal information? Or perhaps you have had to give a review on the Internet after shopping with a company? Were the questions on these surveys able to get you to divulge genuine or false information? And what do you think the effects of your response will be on the market research that is being conducted? All these questions and many more are answered in this free online course. You will be taught how to properly phrase questions for surveys to get the required results, and learn how to analyze and present your findings afterwards.</p><p>The course goes on to discuss the influence of the external environment on a business and its market demands. You will learn how political, cultural, technological, legal and demographic factors affect the market. Afterwards, you will be introduced to the concept of forecasting new trends and how to effectively select target markets. Companies do not just decide to throw money into marketing to show off. Most organizations make careful analyses that result in calculated guesses (‘forecasts’) as to what returns they would get from marketing a product. Care to find out how these forecasts are made? Or are you interested in finding out what metrics these forecasts are decided on? You will learn about the time series analysis technique and other related topics. Every new product goes through a systematic development over time, known as its lifecycle. Study the four stages of a product’s life cycle and what to do at each stage. Lastly, delve into strategic portfolio planning, where you will learn about the BCG matrix (Boston Consulting Group) and General Electric’s (GE) approach to strategic portfolio planning.</p><p>Marketing processes, if properly executed, can lead to massive gains for any organization. The entire processes of marketing research design, planning, data collection, as well as analysis and presentation forms a very important contribution to any business, and one that requires expertise from the marketing arm. With several real-life scenarios from famous companies like Procter &amp; Gamble, Coca-Cola and PepsiCo, this free online marketing strategy course will teach you how to develop strategies designed to help you achieve your business objectives and build a competitive advantage.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}