{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4537","title":"Social Intelligence and Stakeholder Engagement: Fortune 500","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master Fortune 500-based social intelligence and stakeholder engagement skills in this free online course on Alison.com.","description":"Are you attempting to improve your social skills as a business owner or employee? Do you feel overwhelmed when it comes to negotiating in the workplace? If you answer ‘yes’ to these questions, you have come to the right place. This course on using social intelligence to engage with stakeholders will help you feel genuinely confident when negotiating. So don't waste time and discover the best engagement practices of Fortune 500 companies today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you a business owner but struggle to communicate your ideas and thoughts clearly to those interested in your venture? Or are you part of the senior management of a firm that is constantly in a skirmish with its key stakeholders? This course on social intelligence and stakeholder engagement is here to fulfil all your communicational needs. Effectively engaging with stakeholders is a crucial part of the success of any organisation, whether it is a Fortune 500 company or a startup just finding its feet. Dr Gleb Tsipusrky is a cognitive neuroscientist who has years of experience assisting some of the largest firms in the world to engage more efficiently with stakeholders. The course will help you gain from his vast experience. It starts with an outline of a pre-engagement plan to use when negotiating with stakeholders. Dr Gleb’s eight-question pack ensures that you identify the key stakeholders before engaging with them productively. Are the stakeholders you are working with holding preconceived notions that hinder any constructive communication? Don’t worry, Dr Gleb will equip you with just the right tools to address these biases and make communication easier.</p><p>Finding it difficult to connect with stakeholders on an emotional level? Empathy is a key component of social intelligence. Discovering how to read body language and developing a solid connection with the stakeholders are just some of the methods that can play a huge role in forming strong working relationships. Ever heard of the ‘MUM Effect’ at the workplace? More often than not, people tend to stay confined within their comfort zones and stay away from negative information. This course is here to help you change that behavioural pattern. Learn the techniques you can use to ensure that you receive positive news, react rationally to negative information and convert both into positive outcomes. Using socially intelligent methods to build stronger relationships is key for growth. Stakeholder engagement is a two-way relationship and ensures that negotiations are a win-win for both parties. Dr Gleb will be providing important methods and techniques that you can use to negotiate effectively and develop stronger ties with stakeholders.</p><p>Are you an optimist who is tired of dealing with the negativity among the people around you or vice versa? An organisation will always have its share of positive- and negative-minded individuals and dealing with both is a skill you should develop. Creating the right mix of both mindsets is vital as both can bring something new to the project. This course will teach you methods on how to address this issue. The ‘ostrich effect’ is a common cognitive bias that causes individuals to stay away from risk and uncertainty because it is too uncomfortable. Do those around you miss crucial opportunities because they are uneasy?&nbsp; Dr Gleb’s five-step method to address denialism among stakeholders will go deeper into this very issue among organisations. Dealing with stakeholders is a skill that you acquire over time. You can go from a struggling individual to a confident negotiator with the right tools. This online course addresses these common problems that leaders and individuals face every day. So do not waste any more time. Enrol and become a confident negotiator and communicator with stakeholders today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}