{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3977","title":"Start Your Own Profitable Video Marketing Agency","totalEnrolled":"1,483","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become a master at digital marketing and start your own profitable video marketing company in this free online course.","description":"Digital marketing is a very popular method of marketing, however, whilst numerous companies engage in this type of advertising, many small businesses are still unsure of how it works and have yet to try it. These are the businesses that digital marketers can target and encourage while making a profitable income at the same time and this free online entrepreneurship course will teach you how to do exactly that with little-to-no startup cost.","courseOutcomes":["List the different types of marketin...","Recall the most common video creatio...","Identify the various payment options...","List the best places to find clients...","List the different types of marketing videos","Recall the most common video creation tools","Identify the various payment options available","List the best places to find clients for your video marketing agency","Explain the purpose of each marketing video type","State the two main types of video projects","Outline the requirements needed to start a video marketing agency","Explain how to get clients through Facebook groups","List the different types of marketin...","Recall the most common video creatio...","Identify the various payment options...","List the best places to find clients...","List the different types of marketing videos","Recall the most common video creation tools","Identify the various payment options available","List the best places to find clients for your video marketing agency","Explain the purpose of each marketing video type","State the two main types of video projects","Outline the requirements needed to start a video marketing agency","Explain how to get clients through Facebook groups"],"courseDescription":"<p>Start Your Own Profitable Video Marketing Agency is a free online entrepreneurship certificate that highlights how successful a digital marketer can be in today’s technology-driven world. You will discover what digital marketing is, how it is used to market various products and how profitable it can be even to a person with limited to no video marketing expertise. In addition, you will learn how to outsource any aspect of the business that you have limited proficiency in whilst still earning a profit and producing high-quality videos for your clients. This course not only provides you with the tools to maintain, bill and communicate with your clients and the benefits of entrepreneurship in digital marketing, but also enlists detailed information for outsourcing companies and freelancers that can assist with your business becoming profitable without the hassle of learning how to do particular tasks.</p><p>In this course, we will educate you on how to start a business, the cost of startup apps, and the features of the basic non-paid versions of these apps. Are you interested in turning your hobby into a profitable business? Offering digital marketing to clients is ideal, but did you know that you can also provide additional services? The exciting aspect of this digital marketing course will demonstrate that there are companies and individuals willing to complete additional tasks for you at a minimal cost. So not only do you make a profit, but you are also fulfilling your responsibility as an entrepreneur by providing gainful employment.</p><p>Digital marketing is the future. We can expect to see a sustained increase in the diversity of wearable devices available to consumers - a technology that did not exist a few short years ago. Digital technology is at the centre of everything in marketing nowadays and to optimize your marketing approach, you must explore digital technology and marketing. Today, any business that has not opted for digital marketing will lose out on business opportunities and may lose some of its customers. There are many promotion techniques available, so why not take advantage of the video marketing trend that can make you a profitable, successful entrepreneur overnight. If you want to combine your passion for entrepreneurship and digital marketing, then enrolling in this comprehensive entrepreneurship education course will show you exactly what you need to do and how to become your own boss.</p><a href=\"https://alison.com/resume/courses/3977\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3977\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"An Introduction to the Marketing Agency Business","description":"This module will introduce you to video marketing, the different tools available to ensure your success, and the many services you can offer to your client once you've started.","topics":["An Introduction to the Marketing Agency Business - Learning Outcomes","Video Marketing Agency Business Introduction","Video Marketing Agency Business Foundations","Video Creator and Creation Tools","Logos and Websites","An Introduction to the Marketing Agency Business - Lesson Summary"]},{"name":"Module","details":"Video Marketing Essentials","description":"In this module, you will learn how and where to find clients for your business, and you will discover how to compose business emails to arrive at competitive pricing.","topics":["Video Marketing Essentials - Learning Outcomes","How To Get Video Agency Clients","Keeping Track of Clients and Payments","Video Marketing Agency Business Deliverables","Video Marketing Essentials - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Start your Own Profitable Video Marketing Agency - Course Assessment"]}]}