{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3674","title":"Stata Level 1: Fundamentals of Data Analysis","totalEnrolled":"6,107","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online Stata Level 1: Fundamentals of Data Analysis course teaches how to use Stata for data analysis.","description":"This free online Stata Level 1: Fundamentals of Data Analysis course will equip you with the skills required to perform and carry out data analysis at complex and straightforward levels like a professional. Stata is a powerful software used to carry out data analysis. By taking this free online course, you will gain the knowledge and skills required to use the Stata software to create and manipulate variables and keep track of your work.","courseOutcomes":["Describe how to Create, and load any...","Recall how to create and modify simp...","Differentiate between the main types...","Explain the procedures to create or ...","Describe how to Create, and load any data format in Stata","Recall how to create and modify simple quantitative analysis with any database in Stata","Differentiate between the main types of windows in Stata","Explain the procedures to create or establish a working directory in Stata","List and explain the two resources used in keeping track of work in Stata","Explain how to import and load various types of data formats in Stata for analysis","Recall some basic commands used in Stata and their shortened forms","Distinguish between a do file and log files and state when they are used in Stata","Explain how to generate and calculate variables using the command egen","Identify some of the commands used in combining databases in Stata","Describe how to Create, and load any...","Recall how to create and modify simp...","Differentiate between the main types...","Explain the procedures to create or ...","Describe how to Create, and load any data format in Stata","Recall how to create and modify simple quantitative analysis with any database in Stata","Differentiate between the main types of windows in Stata","Explain the procedures to create or establish a working directory in Stata","List and explain the two resources used in keeping track of work in Stata","Explain how to import and load various types of data formats in Stata for analysis","Recall some basic commands used in Stata and their shortened forms","Distinguish between a do file and log files and state when they are used in Stata","Explain how to generate and calculate variables using the command egen","Identify some of the commands used in combining databases in Stata"],"courseDescription":"<p>This free online Stata Level 1: Fundamentals of Data Analysis on Alison.com has been designed specially to help people at all levels carry out data analysis with ease. Stata is an application software used for carrying out data analysis. The course kicks off with an introduction to the Stata application, after which you will be introduced to the course methodologies and taken through sections of the Stata application interface. You will also learn how to navigate within the Stata environment. Next, we will introduce you to some of the tools used in Stata. This includes the data editor, the data browser and the help and search tool. You will be shown how to create a working directory for your work. You will then learn how to import various types of data formats in Stata for analysis. These data formats will include text files, excel and CSV files, and we also cover how to import Stata databases. You will also be taught how to clear the Stata workspace and how to save your work or analysis.</p><p>We will also introduce you to some basic ways and methods of keeping track of your work. Some of these methods include using the do-files. You will be shown how to comment do-files using the asterisk, the double forward-slash, and combined methods. Next, you will learn some key commands used to create and manipulate variables. This will include the generate command, which is typed as “gen” in the command window. You will be taught how to rename variables, label and delete variables. This free online course further introduces you to various commands that aid in data analysis. They include the tabulate command, and you will learn how to recode variables using the egen command. Finally, we will show you the various methods and commands used in joining or combining databases in Stata. This includes the merge command, the append, collapse and reshape commands.</p><p>Data analysis is a process of refining raw and unfiltered data with the simple goal of gathering helpful information and data that will aid or support better decision-making. It’s a valuable way to analyze and improve our daily activities, from understanding problems at a business level to providing statistical health reports in the medical field. This free online course has been built to teach beginners and intermediates how to make simple and complex data analytics with the Stata software. By signing up for this course, you will gain the first-hand knowledge and skills necessary to perform data analysis at any level. If you’d like to advance your career and skills as a data analyst, what are you waiting for? Try out this course today and take your skills to the next level.</p><a href=\"https://alison.com/resume/courses/3674\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3674\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting-up And Loading New Data","description":"In this module you will be introduced to Stata, you will learn how to create, load, and manipulate any type of data using the Stata software as well as how to create a working directory, you will also learn how to import various types of data for analysis and also how to save your work after the analysis is completed.","topics":["Setting-up And Loading New Data - Learning Outcomes","Introduction and Setting Up Stata","Loading new data","Setting-up And Loading New Data - Summary"]},{"name":"Module","details":"Tracking Calculations And Data Analysis","description":"In this module, you will be introduced to some ways of keeping track of your work, you will learn some basic commands used to create and manipulate variables and also how to edit variables, you will also learn how to join or combine variables in Stata.","topics":["Tracking Calculations And Data Analysis - Learning Outcomes","Keeping Track Of Calculations","Working With Datasets","Solving Data Analysis Questions","Tracking Calculations And Data Analysis - Lesson Summary"]},{"name":"Module","details":"Joining Databases And Course Wrap-up","description":"In this module, you will learn how to join databases, this will include learning the basic commands used in joining databases, you will be presented with a recap and summary of the course and wrap up.","topics":["Joining Databases And Course Wrap-up - Learning Outcomes","Creating And Joining Databases","Course Wrap-up","Joining Databases And Course Wrap-up - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Stata Level 1: Fundamentals of Data Analysis - Course assessment"]}]}