{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3777","title":"Strategic Planning and Market Research","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about marketing research, strategic planning, customer satisfaction and loyalty with this free online course.","description":"This free online course covers everything you need to know about strategic planning, market research, customer satisfaction and loyalty management. We'll show you how to conduct effective market research and explain the relevance and strategies of allocating resources effectively across business portfolios. We will also help you understand the connection between customer satisfaction, loyalty, communities and patronage. Let's get started!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course is designed to improve your skills and knowledge in strategic planning, market research, and customer satisfaction. The course begins with lessons on strategic planning. Here, you will learn about the components of strategic planning, which covers lessons on how to draft a SWOT and situational analysis. You will learn why it's important to assess the internal and external environment and how to do it. Afterwards, you will learn how to develop organizational objectives and strategies. \"Why should I buy from you or why should I hire you?\" are typical questions that pop up when one wishes to sell a business idea or their personal value (in the case of a job pitch) to a customer or employer. The answer to that question lies in the value proposition of that business or individual. You will learn about the importance of business value propositions and how to formulate one effectively. An essential aspect of managing a firm, particularly one with multiple strategic business units, is how to allocate resources effectively. This problem is checked by a process known as strategic portfolio planning. You will learn a great deal about this process, citing the BCG Matrix and General Electric approach.</p><p>The course then goes further to describe the process of gathering and using market information. We will introduce you to market information systems, where you will learn about internally generated reports and other sources like search engines and analytics software. Afterwards, we will guide you through the steps in the marketing research process. You will learn how to define a research problem, design the research and specify a target sample. In addition to this, you will learn to design a form, collect data, make adequate analyses, and report/present findings. This course also provides lessons on customer communities, loyalty and satisfaction. Businesses know the importance of having online and offline customer communities, as well as influencer panels. We will teach you how to identify influencers and get the most out of them. The course will also teach you about some of the laws and ethics in marketing.</p><p>The strategic allocation of resources to units in a business or company is a very pertinent aspect of running the business efficiently. So is the research that has to be done on the business's market. These are integral processes in acquiring customers. Another area of focus for businesses is that of customer satisfaction. And this area, along with customer loyalty, are essential to a business's ability to keep its customers. But achieving customer loyalty takes a lot of effort and structured work from the business or company. This free three-part online course will examine the strategic planning process companies go through to develop, price, promote, and sell their products and services. It will explain value proposition and help you understand why a company may establish different value propositions for different target markets. The course will also discuss marketing research and intelligence and the information systems used to manage the vast amount of resultant data. Lastly, the course will provide lessons on customer communities, loyalty management, customer satisfaction and how they all relate to the marketing process. As an entrepreneur, marketing professional or business enthusiast, this free online course promises to help you gain insight and upskill in the areas mentioned above. Why not start right away!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}