{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1496","title":"Strategic Management - Corporate Strategy - Revised","totalEnrolled":"5,538","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a competitive edge in the market with the corporate strategy techniques taught in this corporate strategy course.","description":"This free online corporate strategy course will introduce you to the concept of corporate strategy. It will teach you how corporate strategy defines the markets and businesses in which an organisation chooses to operate. This approach is essential for a company's long term success and for persuading investors. Organizations that continuously improve their corporate strategy are much more likely to deliver real customer value.","courseOutcomes":["Describe the important issues involv...","Explain Relative Cost advantage and ...","Describe Display Matrices with examp...","Describe the Boston Consulting Group...","Describe the important issues involved in Corporate Strategy","Explain Relative Cost advantage and Competitive Strategy","Describe Display Matrices with examples","Describe the Boston Consulting Group's Growth-Share Matrix","Explain size of competitive advantage vs. no. of approaches to competitive advantage","Explain the elements: Fragmented, Specialization, Stalemate and Volume","Explain factors underlying market attractiveness and business strength","Describe the McKinsey Matrix with examples","Describe Shell's Directional Policy Matrix with examples","Describe the important issues involv...","Explain Relative Cost advantage and ...","Describe Display Matrices with examp...","Describe the Boston Consulting Group...","Describe the important issues involved in Corporate Strategy","Explain Relative Cost advantage and Competitive Strategy","Describe Display Matrices with examples","Describe the Boston Consulting Group's Growth-Share Matrix","Explain size of competitive advantage vs. no. of approaches to competitive advantage","Explain the elements: Fragmented, Specialization, Stalemate and Volume","Explain factors underlying market attractiveness and business strength","Describe the McKinsey Matrix with examples","Describe Shell's Directional Policy Matrix with examples"],"courseDescription":"<p>This course will first introduce you to corporate strategy. It will first cover directional strategy, which refers to a company’s orientation towards growth, stability or retrenchment. It will then guide you through the portfolio strategy, which refers to the markets in which the company competes through its products or business units. You will then examine parenting strategy, which refers to the activity, coordination and transfer of resources for boosting capabilities among product lines and business units. You will then look into strategic planning, key investment portfolios, and future profit potential.</p><p>The course will then cover the GE Matrix, the McKinsey Matrix, and the Shell Matrix. You will look into the fragmented, specialization, stalemate, and volume industries. Here, you will learn that a fragmented industry is small and regionalized, with profitability that is not related to size. You will then learn how a specialization industry has focused segments and steep learning curves, and a stalemate industry has difficulty gaining an advantage. You will then look at volume industries, which are constrained by market segmentation and differentiation.</p><p>An effective corporate strategy enables business units to work together to meet the expectations of its shareholders and achieve business goals. This Strategic Management - Corporate Strategy online course will help you learn the most important tools and techniques used in modern corporate strategy. This knowledge will be a great boost for your CV, and make you an even more valuable member of your current, or future company. So why wait? Check out the course today, and start enhancing your corporate strategy skills in no time.</p><a href=\"https://alison.com/resume/courses/1496\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1496\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Corporate Strategy","description":"Strategies are of great importance in a corporate environment and this module will discuss the various types of strategies that can be introduced in the corporate world and how these strategies are implemented.","topics":["Introduction to Corporate Strategy - Learning Outcomes","Introduction to Corporate Strategy","Different Types of Strategy","Relative Cost Advantage and Competitive Strategy","Introduction to Corporate Strategy - Lesson Summary"]},{"name":"Module","details":"Businesses Matrices - BCG Matrix and GE Matrix","description":"The study of business matrices such as the BCG Matrix and the GE Matrix will allow you to become more aware of the importance of appropriate planning in strategic management.","topics":["Businesses Matrices - BCG Matrix and GE Matrix - Learning Outcomes","Introduction to the Boston Consulting Group's Growth-Share Matrix","Using the BCG Growth-Share Matrix","Modified BCG Growth-Share Matrix","Businesses Matrices - BCG Matrix and GE Matrix - Lesson Summary"]},{"name":"Module","details":"Businesses Matrices - McKinsey Matrix and Shell Matrix","description":"By studying the business matrices such as the McKinsey Matrix and the Shell Matrix you will gain a greater understanding of Strategic Management and how it is applied directly to real-life situations.","topics":["Businesses Matrices - McKinsey Matrix and Shell Matrix - Learning Outcomes","Introduction to the GE Matrix","Other Matrices: McKinsey and Shell - Part 2","Businesses Matrices - McKinsey Matrix and Shell Matrix - Lesson Summary","Other Matrices: McKinsey and Shell - Part 1"]},{"name":"Module","details":"Course assessment","description":"","topics":["Strategic Management - Corporate Strategy - Final Assessment"]}]}