{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4952","title":"Successful Project Management Planning and Team Effectiveness","totalEnrolled":"1,815","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course enables you to learn project management planning and project management frameworks.","description":"Project management is essential to nearly every field and requires expert organisational, relationship-building and strategic-thinking skills. Waterfall, Lean, Scrum and Critical Path have something in common: they are frameworks project managers can use to improve their team’s workflow. In this course, you’ll learn project frameworks and how these benefit project managers. You’ll also explore specific types of frameworks.","courseOutcomes":["Explain the fundamentals of project ...","Identify the roles and responsibilit...","Recognise the strategies for increas...","List the four phases of project mana...","Explain the fundamentals of project management","Identify the roles and responsibilities of a project manager","Recognise the strategies for increasing team effectiveness","List the four phases of project management","Discuss the project plan","Describe the business case","Select project management framework","Categorise the Agile framework","Select the right project management framework","Explain the fundamentals of project ...","Identify the roles and responsibilit...","Recognise the strategies for increas...","List the four phases of project mana...","Explain the fundamentals of project management","Identify the roles and responsibilities of a project manager","Recognise the strategies for increasing team effectiveness","List the four phases of project management","Discuss the project plan","Describe the business case","Select project management framework","Categorise the Agile framework","Select the right project management framework"],"courseDescription":"<p>No matter what field you work in, project management plays a significant role. New projects demand effective project management, from engineering and construction to marketing and software development. For effective team management, the team leader must actively pursue mentoring their team members rather than being an uncompromising boss. We will start the course by discussing project management and the role of a project manager, providing techniques you can use to improve your team's performance.</p><p>Next, the course demonstrates how you can start untangling the messy web of competing priorities, schedules and resources to create order, predictability and direction for your project team. Projects require resources, including time, talent and money. For this reason, we will also discuss the business case, a document that helps executive management justify the need for a project.</p><p>The course offers all the skills mentioned above used in project management. In addition, you will also explore specific types of frameworks that are popular in the field. Finally, you will learn how to select the proper project framework for the intended assignment. By the end of the course, you will have a better idea of which frameworks can boost your team's productivity. So wait no more: start this course and upgrade your skills today.</p><a href=\"https://alison.com/resume/courses/4952\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4952\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Project Management Planning and Team Effectiveness","description":"In this module, you will be introduced to the essentials of project management, project frameworks, and how they benefit project managers. You’ll also explore specific types of frameworks that are popular in the field.","topics":["Project Management Planning and Team Effectiveness - Learning Outcomes","Project Management and Team Effectiveness","Project Plan and Phases of Project Management","Project Management Frameworks","Project Management Planning and Team Effectiveness - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Project Management Planning and Team Effectiveness - Course Assessment"]}]}