{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1223","title":"Supervision Skills - Managing Employee Performance","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Make motivating and managing employee performance in the workplace easy, with this free online course.","description":"This free online Supervision Skills course will teach you about the effective management of employee performance. Just like batteries, employees can lose energy over time. This course will guide you through the theory of motivation, and teach you the best ways to keep employees motivated and enjoying their work. It will also teach you how to spot and stop a workplace bullies. Start this free online course today to grow your management abilities.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first introduce you to the different theories of motivation such as Maslow's hierarchy of needs which include food, safety, love, and self-esteem, as well as the ERG theory which includes existence, relatedness, and growth. You will also cover processed-based theories, reinforcement theory, and goal setting theory. You will learn how and when to provide supervision for both staffs and volunteers as well as how to help staff to grow.<br><br>Next, you will learn about conducting performance reviews and how to use performance appraisals in a motivational way. You will study the 70:20:10 rule and learn how to correct performance problems. You will look into performance management, study the benefits of coaching, and learn the five different types of problem solutions. You will also learn how to deal with conflict within a work team, how to manage bullying, and the importance of the Ladder of Inference.<br><br>A workplace is composed of employees of different personalities and cultural backgrounds.This makes management and supervision a test of skill and patience. This employee performance management course will teach you practical supervision skills as well as goal setting and motivational theories that will be useful for your supervision and management duties. This will not only help you promote a healthy work environment, but also help your team to grow and be happy and productive in their work. So why wait? Boost your supervision skills, today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}