{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1228","title":"Supervision Skills – Managing Groups and Employee Interaction","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to effectively manage common tricky situations in the workplace with this supervision skills course.","description":"This free online Supervision Skills course will teach you how to handle disagreements, arguments, and conflict at work. This course will teach you effective and tactful workplace management, including how best to deal with a variety of situations, take appropriate corrective action, and manage change in the organisation. Start this free online course today to build on your skills as a current or as a future supervisor.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This supervision skills course will start by introducing you to effective group and team management techniques. You will learn how to use KASH (Knowledge, Attitude, Skills, and Habits) to improve your team and to help resolve a conflict. You will then cover the topic of group dynamics and learn the characteristics of team design. You will also study team leadership and autonomy, learn how to organize effective teams, and understand important team roles and responsibilities.</p><p>Next, you will learn how to handle clashing personalities and how to take corrective action as a supervisor. The course will then give you some great skills for preventing and handling a grievance. You will then learn how to give constructive feedback that will benefit both the individual employee and the company as a whole. You will also learn how to manage change in the workplace as well as study the four practical guidelines for planning change and the transition curve.</p><p>Every manager dreams of developing and maintaining a productive workforce. This free online management course will teach you some really helpful strategies and techniques for doing just that. The course will be well suited to small business owners and aspiring managers who are seeking to improve their skills and develop their team and career. So, check out the course today, and discover some great strategies for developing a harmonious workforce.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}