{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3338","title":"Supply Chain Management and Capacity Planning","totalEnrolled":"22,740","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the central principles and practices of supply chain management and capacity planning.","description":"This free online certificate course in supply chain management and capacity planning will help you understand their importance and role in the procurement of raw materials and distribution of finished goods to customers. Learn how capacity planning can help you forecast demand and help you meet it in a timely manner. Understanding supply chains and capacity building is vital to run a successful business.","courseOutcomes":["Explain the importance of supply cha...","Describe the two inventory control m...","Outline and explain the 5S of Lean s...","List the eight types of waste that c...","Explain the importance of supply chain management","Describe the two inventory control methods: Just-In-Time (JIT) and Materials Requirement Planning","Outline and explain the 5S of Lean systems","List the eight types of waste that can be generated during the production process","Explain JIT principles","Explain the three classifications of maintenance: corrective, preventive and alternative","List the different forecasting methods","Describe the key factors to consider when choosing a location","Outline the steps involved in the capacity-planning process","Explain the three types of workflow layout a manager can chose from","Explain the importance of supply cha...","Describe the two inventory control m...","Outline and explain the 5S of Lean s...","List the eight types of waste that c...","Explain the importance of supply chain management","Describe the two inventory control methods: Just-In-Time (JIT) and Materials Requirement Planning","Outline and explain the 5S of Lean systems","List the eight types of waste that can be generated during the production process","Explain JIT principles","Explain the three classifications of maintenance: corrective, preventive and alternative","List the different forecasting methods","Describe the key factors to consider when choosing a location","Outline the steps involved in the capacity-planning process","Explain the three types of workflow layout a manager can chose from"],"courseDescription":"<p>In the far past, manufacturing and service companies focused more on producing goods and providing services that will be beneficial to their customers. They focused more on meeting the demands of the existing market and cared less about transportation since most of the customers were within the location where the goods and services were being produced. Nowadays, due to rapid development and globalization, a company in the US can manufacture products for customers who are domiciled in another country thousands of miles away and this leads to the question ‘how do we get our products there?’ Many organizations produce for both local and international consumption, how do these organizations forecast demand and produce goods that are just enough to match the demands of both the local customers and those overseas? This course provides the answers to these questions and more. It is one thing to match demand but it is another to get these goods delivered, as and when due. For instance, if you are producing for an international market, how do you get your product to the customers? By air? By sea vessels? Which is more suitable and cost effective? These same questions could be asked if the raw materials for a manufacturing process are far off. What is the most timely, cost effective and safest means to get these raw materials in? As you go through this course, you will find the answers to these questions in a very simplified manner.</p><p><br>This course begins by giving a detailed explanation of supply chain management. It also explains the role of supply chain management in the production and distribution process. As you go further, you will learn about one very important aspect of capacity planning – waste management. This topic attempts to answer some questions like ‘what is the demand for our product?’; ‘are we going to match the demand or exceed the demand?’; ‘how much production is too much production?’. Moving on, you will learn about facility layout. If you already know what the demand for your product looks like and you already know how much you’re looking to produce, how do you set up your facility to efficiently meet these production goals? What are the different facility set-up options available to you? What will be the best location for the facility?&nbsp; These and more are the questions this topic will clarify. Finally, this course will expose you to the various sources of information that are available to you when you want to make a demand forecast for your product. This course has everything you need to plan and manage your manufacturing and service capacity. It is garnished with all the ingredients that can help you plan supply chain management so that just what is needed is produced and wastes are eliminated.</p><p><br>Are you an entrepreneur who is looking to match or exceed the demand for your products? Are you looking to eliminate wastes from your production line? This course is a very perfect resource for you. It provides insight on how to go about these. Are you a supply chain manager who is looking to efficiently plan logistics for both raw materials and finished products? This course will be very useful to you. This certificate course in Supply Chain Management and Capacity Planning is very useful to students in business fields such as business administration, office management, operations management, production management and other related fields. A good understanding of this course can also help in the day to day running of the home. After all, waste is waste everywhere and they should be eliminated to reduce cost. This course is useful to anyone who is interested in efficiency. So why wait? Jump in now and become efficient.</p><a href=\"https://alison.com/resume/courses/3338\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3338\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Supply Chain Management","description":"In this module, you will learn about the principles of Supply Chain Management, Lean Manufacturing and how to eliminate waste. You'll also learn about the Just-In-Time principles and how these principles can help reduce waste.","topics":["Supply Chain Management - Learning Outcomes","Supply Chain Procurement","Supply Chain Distribution","Lean Manufacturing","Eliminating Waste","Just-in-time Systems","Supply Chain Management - Lesson Summary"]},{"name":"Module","details":"Capacity Planning and Facility Layout","description":"In this topic, you will learn how manufacturing and service organizations can plan capacity to match customers' demands. Also, this topic will help you understand the concept of facility layout in organizations and help you understand the factors that should be taken into consideration when choosing a location for your business.","topics":["Capacity Planning and Facility Layout - Learning Outcomes","Capacity Planning","Facilities Layout","Location Planning and Analysis","Capacity Planning and Facility Layout - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Supply Chain Management and Capacity Planning -  Course assessment"]}]}