{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3439","title":"Taking Meeting Minutes","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Acquire a sought-after skill by learning how to take top quality meeting minutes effectively in this free online course.","description":"Learn the finer nuances of becoming a proficient minute-taker in this free online skill development course. The structured course content will explain the basics, standards and content of meeting minutes. Master different layouts and see how to share and file minutes. You will also be able to focus on developing some of your personal skills. This is a useful course for those looking for a successful career in administration.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>It is likely that we may not recall all the key points discussed in a meeting so a well documented meeting note or ‘minute’ that highlights the discussed agenda and action points is a valuable document to have in place. It is important for organizations to have a minute-taking protocol as an effective way to maintain records of discussions and accomplishments. But how is this achieved? Are these long and complicated documents? Who reads these notes? Does taking minutes require any special skill? You will get answers to all these critical questions as you complete each module of the course. It begins with the basic understanding of taking minutes, the do’s and the don'ts, and the tasks and responsibilities of the minute taker (who can either be a specially appointed person or anyone who attends the meeting).</p><p>Learn about the importance of standards and the key tenets of pre-meeting preparation. The role of technology cannot be ignored in this aspect of meeting administration. Get acquainted with the various ways by which one can become an efficient minute taker. Capturing information quickly and accurately while a meeting is in progress entails learning special skills and techniques. You will also study the correct ways of taking and sharing meeting minutes; what kind of preparation is needed before a meeting; how a minute taker should communicate with the chairperson and the attendees; and what makes a good minute taker. The step-by-step description of all these aspects of professional minute taking will enrich your administrative skill set. Each topic has a few exercises and a self-assessment quiz that will help you to master the essential facts of minute taking.</p><p>The second module of the course covers the roles of a minute taker during and after a meeting. You will get useful tips on how to prevent common mistakes made during meetings and how to use mind-mapping tools to capture information. It also focuses on a few other personal skills that are essential for any minute taker: learn why sharpening your listening, editing and proofreading competencies will bolster your expertise in minute taking and elevate your proficiency level. This is a valued skill in any administrative role as, in addition to capturing meaningful information, the minute takers also help in keeping the meeting on track. They know the importance of setting an agenda and work closely with top executives. Many organizations offer full-time positions for professional minute takers because all business meetings dealing with critical or sensitive issues need impartial, precise and timely documentation of the proceedings. Think smart and enrol in this free course right now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}