{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3355","title":"Talent Acquisition Practices","totalEnrolled":"6,766","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the process of finding and acquiring qualified personnel with this free online human resource management course.","description":"This free online course takes you through the talent acquisition process, which means finding and hiring good people. Every company wants the best but can’t always locate them. We teach you how to keep your business competitive, attractive and employee-friendly as such human resource (HR) techniques can mean the difference between its success or failure. This course hones your leadership skills to bring out the best in those around you.","courseOutcomes":["Define ‘talent acquisition’...","Explain operational workflow ...","Discuss talent acquisition strategie...","Analyze the shortage of talent...","Define ‘talent acquisition’","Explain operational workflow","Discuss talent acquisition strategies","Analyze the shortage of talent","Compare the talent acquisition practices of different organizations","Distinguish between stakeholder expectations and key challenges","Describe how to manage risk","Explain workforce management initiatives","Compare acquisition practices used by FedEx and Google","Define ‘talent acquisition’...","Explain operational workflow ...","Discuss talent acquisition strategie...","Analyze the shortage of talent...","Define ‘talent acquisition’","Explain operational workflow","Discuss talent acquisition strategies","Analyze the shortage of talent","Compare the talent acquisition practices of different organizations","Distinguish between stakeholder expectations and key challenges","Describe how to manage risk","Explain workforce management initiatives","Compare acquisition practices used by FedEx and Google"],"courseDescription":"<p>When hiring, you should know what you’re looking for in an employee and what you have to offer. A hiring manager’s first concern is whether a candidate is qualified and capable of performing, followed by the question ‘why should they choose us as a company?’. This demonstrates the importance of attracting talent with your goals, objectives and offerings. A talent acquisition manager handles strategic short- and long-term employee planning to establish what the company needs tomorrow, next year and in five years’ time. It takes a lot of information and insider knowledge to make the personnel decisions needed to create sustainable growth and this course explains how to limit risk while increasing output and profit.&nbsp;</p><p>We examine personnel planning, which includes forecasting talent while channelling, evaluating and developing it. This process involves the HR department, a crucial body that ensures that things run smoothly as employees have the training and incentives they need to work well and stay with their company. A good talent acquisition manager also plays a role in candidate evaluation, regulatory compliance and recruiting that aligns with hiring initiatives and branding. The process should work synergistically with all facets of a business by identifying what it is that each department needs in order to attract and integrate people who can efficiently meet the needs of the business.</p><p>This course provides you with the specific skills that hiring managers and talent acquisition managers seek. It explains recruitment and also unpacks retention, which can be tricky because people grow out of positions and have personal needs, which a good business will always try to fulfill as retention is more fiscally responsible than recruitment. If you run your own business, let this course help you develop a talent acquisition plan and to make it flourish. If you are a manager or want to work in HR, this course provides crucial skills that can help you add value to the workplace.</p><a href=\"https://alison.com/resume/courses/3355\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3355\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Talent and Risk","description":"In this module, you will be introduced to talent acquisition. This will include the operational workflow in the case of talent acquisition. You will learn about the operational processes to follow in the identification and acquisition of talent.","topics":["Talent and Risk - Learning Outcomes","Talent Acquisition","Talent Acquisition Practices","IBM Initiative","Talent and Risk - Lesson Summary"]},{"name":"Module","details":"Attracting Talent","description":"In this module, you will be introduced to the HR practices adopted by FedEx. This will include how FedEx manages such a large talent pool and how FedEx managers are working on it. You will study Google's Talent Acquisition and Management Practices. You will learn how to identify the critical elements of talent management.","topics":["Attracting Talent - Learning Outcomes","Attracting Talent at FedEx","Attracting Talent at Google","Attracting Talent - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Talent Acquisition Management - Course assessment"]}]}