{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1953","title":"Technical Writing Essentials","totalEnrolled":"28,620","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the essentials of technical writing, technical reports, and professional communication with this online course.","description":"This free online technical writing course will teach you the basics of technical writing and communication. You will study the main conventions and characteristics of technical writing, the complexity and iterative nature of a writing process, and the importance of knowing your audience and writing specifically to meet their needs. You will also learn how to apply strategies to enhance clarity and readability, and more.","courseOutcomes":["Define what technical writing is, wh...","Recognize the main conventions and c...","Identify how to use rhetoric appeals...","Recognize how to effectively integra...","Define what technical writing is, why it’s important, and what it looks like","Recognize the main conventions and characteristics of technical writing","Identify how to use rhetoric appeals in a professional context and avoid logical fallacies","Recognize how to effectively integrate headings, figures and tables, and lists in written communications","Define basic terms related to conducting and disseminating various types of research","Outline how to determine the reliability, authority, and relevance of research sources in a professional context","Identify the most common types of documents used in technical communications","Outline how to create technical descriptions and write instruction manuals","Recognize how to create the appropriate format, structure and content for different types of professional documents","Define what technical writing is, wh...","Recognize the main conventions and c...","Identify how to use rhetoric appeals...","Recognize how to effectively integra...","Define what technical writing is, why it’s important, and what it looks like","Recognize the main conventions and characteristics of technical writing","Identify how to use rhetoric appeals in a professional context and avoid logical fallacies","Recognize how to effectively integrate headings, figures and tables, and lists in written communications","Define basic terms related to conducting and disseminating various types of research","Outline how to determine the reliability, authority, and relevance of research sources in a professional context","Identify the most common types of documents used in technical communications","Outline how to create technical descriptions and write instruction manuals","Recognize how to create the appropriate format, structure and content for different types of professional documents"],"courseDescription":"<p>In the course Technical Writing Essentials you will learn why, in our increasingly technological and internationalized workplaces, communications skills are among the most sought-after competencies employers require of job candidates. Every job posting you see will almost certainly ask for candidates with excellent communication skills, and the ability to work effectively in teams. The ability to communicate clearly and effectively in written, verbal, visual, and interpersonal contexts is vital for success and advancement in the workplace.</p><p>No matter how brilliant or innovative an idea maybe, if it is not communicated clearly and promoted effectively to the right audience, it will not become a reality. The course introduces you to the key elements of professional style, technical document design, collaboration, oral presentation, and research skills needed to design productive workplace technical documents and presentations for a variety of purposes and audiences.</p><p>This course will be of great interest to those wishing to pursue a career in technical writing or for any professional technical writer who wishes to improve their ability to develop workplace documents and presentations for a variety of purposes and audiences. So, why wait? Start learning how to improve your technical writing skills to become a technical writer today!</p><a href=\"https://alison.com/resume/courses/1953\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1953\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of Technical Communication","description":"This module explains the basic concepts of Technical Writing and communication such as what technical writing is, why its important, and what it looks like; the main conventions and characteristics of technical writing and the importance of defining the “rhetorical situation” in which you are communicating. This module also explains the complexity and iterative nature of a writing process in determining what writing process works best for you.","topics":["Basics of Technical Communication - Learning Outcomes","What is Technical Communication?","Understanding the Rhetorical Situation","Writing Processes","Basics of Technical Communication - Lesson Summary"]},{"name":"Module","details":"Professional Style","description":"This module looks more deeply into the style of writing expected of this genre such as how to adopt reader-centred approach (rather than a writer-centred one) that focuses on knowing your audience and writing specifically to meet their needs. This module also shows learners how to review and practice techniques to make your writing more precise and concise, as well as how to use the rhetoric in a professional context and avoid logical fallacies or inappropriate marketing language and/or verbs.","topics":["Professional Style - Learning Outcomes","Professional Style","Communicating with Precision","Writing To Persuade","Professional Style - Lesson Summary"]},{"name":"Module","details":"Document Design","description":"This module includes the information on how technical writers use formatting features to optimize readability such as how to use headings logically, different types of lists, and how to integrate various kinds of figures and tables to effectively present visual data and images. This module also provides style tips to show learners how to apply strategies to enhance clarity and readability.","topics":["Document Design - Learning Outcomes","Document Design","Headings","Lists","Figures and Tables","Style Tips: Revising to Enhance Readability","Document Design - Lesson Summary"]},{"name":"Module","details":"Research Methods","description":"Most projects you work on—whether you are developing innovative new products, planning or implementing ideas, proposing ideas, or recommending solutions—will require research. Research can save you time by determining what other similar solutions have already been proposed, what has been tried and tested in the past and what the results were, what patents are already in place, and so forth. The module is designed to help develop your research skills for conducting and disseminating research.","topics":["Research Methods - Learning Outcomes","Research Terminology","Defining the Scope of a Project","Presenting Research in a Lab Report","Research Methods - Lesson Summary"]},{"name":"Module","details":"Common Document Types - Part One","description":"Just as the literary genre of poetry contains many forms—such as sonnets, haiku, epics, limericks, etc., — each with its own set of rules and conventions, technical writing also contains many forms and each form has key conventions that must be observed. This module discusses several of the most common document forms, and reviews the general requirements for content, formatting, and style.","topics":["Common Document Types - Part One: Learning Outcomes","Correspondence: Text Messages, Emails, Memos, and Letters","Technical Descriptions and Definitions","Writing Instructions","Oral and Visual Presentations","Common Document Types - Part One: Lesson Summary"]},{"name":"Module","details":"Common Document Types - Part Two","description":"Just as the literary genre of poetry contains many forms—such as sonnets, haiku, epics, limericks, etc., — each with its own set of rules and conventions, technical writing also contains many forms and each form has key conventions that must be observed. This module discusses several of the most common document forms, and reviews the general requirements for content, formatting, and style.","topics":["Common Document Types - Part Two: Learning Outcomes","Proposals","Progress Reports","Long Reports - Recommendation Reports and Feasibility Studies","Common Document Types - Part Two: Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Technical Writing Essentials - Course Assessment"]}]}