{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5338","title":"The Fundamental Principles to Anti Money Laundering","totalEnrolled":"5,227","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to prevent money laundering that may finance crime and terrorism in this free online finance course.","description":"Money laundering is an illegal and notorious practice that converts the proceeds of crime into clean currency so that criminals can easily evade authorities. This finance and criminology course examines the tactics used by these money launderers and provides ways to identify them. We also explain different Financial Action Task Force (FATF) recommendations designed to combat international money laundering within various financial institutions.","courseOutcomes":["Discuss the concept of money launder...","Describe the impact of money launder...","Explain how red flags are essential ...","Analyse terror financing and its imp...","Discuss the concept of money laundering","Describe the impact of money laundering on a global and national scale","Explain how red flags are essential for detecting money laundering activities","Analyse terror financing and its impact","Discuss the relationship between money laundering and terror financing","Outline anti-money laundering and combating the financing of terrorism (AML/CTF) processes","Explain the role of AML/CTF laws and organisations by using the USA as an example","Discuss the concept of money launder...","Describe the impact of money launder...","Explain how red flags are essential ...","Analyse terror financing and its imp...","Discuss the concept of money laundering","Describe the impact of money laundering on a global and national scale","Explain how red flags are essential for detecting money laundering activities","Analyse terror financing and its impact","Discuss the relationship between money laundering and terror financing","Outline anti-money laundering and combating the financing of terrorism (AML/CTF) processes","Explain the role of AML/CTF laws and organisations by using the USA as an example"],"courseDescription":"<p>Money laundering is an illicit financial practice that funds crime and terrorism across the world. This technique lets criminals ‘launder’ their ill-gotten gains into legitimate capital that they could have earned through legal means. For this purpose, they use a multitude of different activities such as buying and selling assets, cryptocurrencies, engaging in online gambling, trading and investing in offshore companies. We explain how these tactics work and provide strategies to counter them.</p><p>This course is taught by the experts at Exoexcellence Consultants and is designed for aspiring financial experts and professionals who need an understanding of money laundering. The skills provided here can save different financial institutions and businesses from the plague of money laundering. The course is made up of three base topics that focus on different aspects of criminal finance.</p><p>We break down the stages of money laundering and its different tactics and indicators. We then show you the different methods employed to detect any ongoing financial crime. We delve into the various aspects of terror financing and its relation to money laundering. The course goes through various anti-money laundering (AML) laws and regulations and explains important Financial Action Task Force (FATF) recommendations. Lastly, we discuss the role of machine learning and other advanced technologies in fighting money laundering. Money laundering is a global scourge that finances crime and terrorism so sign up for this finance course to learn how to protect the integrity of your business or organisation and add a valuable element to your professional portfolio.</p><a href=\"https://alison.com/resume/courses/5338\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5338\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Illicit Financial Practices","description":"In this module, you will learn about money laundering and its various tactics. Learning to identify red flags using industries and individuals in ongoing money laundering. In addition, you will study terror financing and how this practice has a global impact. Finally, we will also view crucial AML laws.","topics":["Illicit Financial Practices - Learning Outcomes","Introduction to Money Laundering and Its Tactics","Money Laundering vs. Terror Financing","Fighting Money Laundering with Technology","Illicit Financial Practices- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Anti Money Laundering (AML) - Fundamental Principles - Course Assessment"]}]}