{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3712","title":"The Principles of Emotional Intelligence, Leadership and Coaching","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will enable you to develop your leadership and coaching skills using emotional intelligence.","description":"This free online course will teach you how Emotional Intelligence (EI) skills can build your leadership and coaching capabilities, and improve your brand of leadership. The emphasis is on the workplace, but the teaching can also be applied to your personal life. Your learning includes how to use EI as a leader in order to coach, influence, persuade, develop people’s emotional skills, and improve their and your performance.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>As a leader you are responsible for generating trust, building authentic relationships and effective teams.&nbsp; It is vital that you lead by example and inspire excellence in others. Some of the world’s most successful leaders have achieved success through emotional intelligence (EI or EQ), rather than cognitive intelligence (IQ). Emotional intelligence is the way that you combine your thinking with your feelings to make good, authentic decisions and build quality relationships. The different components that make up emotional intelligence are explored in a series of modules in this leadership training and the content includes video lessons, downloadable resources, and practical activities that you can print and work with, outside of the course. This leadership certificate is structured to cover emotional intelligence in detail giving you an understanding of emotional intelligence, how it underpins your leadership skills and capabilities, and how you can develop your emotional skills to work more effectively with the people you lead.</p><p>The main elements of emotional intelligence are covered which include awareness of behaviour, using coaching to persuade and influence, and what emotionally intelligent leadership and coaching behaviour is so that you can analyze and strengthen your capabilities through greater self-awareness. You’ll be able to identify your emotional intelligence strengths and the development areas for improvement. The next section of content discusses different personality types, giving you insights into your preferences and how they are expressed and this will specifically help you to appreciate differences, work with these and communicate better with others as an emotionally intelligent leader. Practical scenarios are used to demonstrate how you can improve your interpersonal skills by leading in different situations in order to inspire others to gain the best outcomes for everyone involved.</p><p>The insights gained through social sciences, positive psychology, and more recently, the rapid breakthroughs in neuroscience provide a whole new understanding of who we are as human beings. The learning from these disciplines can be applied to the corporate world and to leadership, and this leadership training program provides insights into how this can be achieved using easy-to-apply techniques. The only way that you can develop your emotional intelligence is by reflecting, taking action and getting feedback. There are practical activities for you to complete that will give you insights into how you are currently working with your emotional intelligence as a leader and what you need to do to improve. Enrolling in this course can help you put together a plan that will enable you to build your emotional intelligence to realise your full potential in relationships as a leader and coach in order to grow and develop your career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}