{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1710","title":"The 5S System - Lean Methodology on Workplace Optimization and Housekeeping","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use ‘lean’ methods to optimize your workplace in this free online course that covers the ‘5S’ of Kaizen.","description":"This training course teaches you how to apply ‘lean’ methodology to affect workplace optimization and housekeeping. The ‘5S’ is based on five Japanese words beginning with the letter ‘S’: ‘sort’, ‘set in order’, ‘shine’, ‘standardize’ and ‘sustain’. They can be applied to make workplace processes run more effectively and efficiently. We study the history of the ‘5 Ss’, their importance in the workplace, the guidelines for their use and more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The ‘5S’ system is part of the Japanese ‘lean’ methodology of Kaizen, which is used to organize workplaces to make them more efficient, effective and safe. We explain how the ‘5S’ system can be used to help streamline professional processes and boost production in offices and manufacturing environments.</p><p>The ‘5S’ system uses the following five Japanese words: ‘seiri’ (sort), ‘seiton’ (set in order), ‘seisō’ (shine), ‘seiketsu’ (standardization) and ‘shitsuke’ (sustain). It draws on the ideas under each letter to inspire a more constructive organizational culture. The course explores the history of Kaizen and the ‘5S’ and investigates the implementation of similar housekeeping concepts across various industries.&nbsp;</p><p>We then establish the importance and benefits of implementing this initiative. We lay out important preparation guidelines for implementing a ‘5S’ system, which includes the ‘5S’ project plan, training and other concerns that should be taken into consideration. Almost every organization can trim the fat and find ways to operate more smoothly and productively, so sign up to add these valuable ‘5S’ skills to your portfolio, particularly if you want to take a management track.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}