{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3374","title":"The Accounting Cycle and Financial Statements","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the core basics of accounting standards and cycles, financial statements and cash flows with this free course.","description":"Join us as we do a dive deep into the basics of the accounting cycle and financial statements. You will master all the steps involved in financial accounting processes and, most importantly, you will learn about the important rules that govern accounting. This knowledge is crucial to anyone running their own business or wanting to progress in a corporate, retail or financial services career.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course covers the most important parts of financial accounting; it is for everyone who wants to take their accountancy skills to the next level, whether you are a beginner or professional who wants to brush up their rusty knowledge. You will learn and understand the fundamentals of the rules that govern accounting conventions and standards. These will help you to know the differences between generally accepted accounting principles (GAAP) constraints, assumptions, and principles, and the role they play in the preparation of financial statements.</p><p>Other modules will introduce you to important topics such as the full-disclosure principle, which highlights everything that needs to be disclosed to avoid action by law enforcement agencies, a key part of protecting your reputation. You will also understand the importance of disclosing financial statements to the Securities and Exchange Commission (SEC) if you do work in the United States. Furthermore, study the principles of accounting transactions, the accounting process, completing the accounting cycle, basic accounting concepts, balance sheets and income statements, cash flow statements, financial statement ratios and calculations, and the direct and indirect methods for the preparation of cash flow statements.</p><p>Most importantly, you will gain knowledge of various accounting entries and understand how transactions affect the running of a business. There is also a ‘Beginners' Guide to Financial Statements’ module that will walk you through the foundational elements of basic accounting and reading financial statements. The ‘Accounting Cycles’ section will explain the complete accounting cycle in theory and practice through a series of videos, from journal entries to financial statements.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}