{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/5342","title":"The Accounting Principles and Assumptions Made Easy","totalEnrolled":"678","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the accounting principles and assumptions upon which international standards are based in this free online course.","description":"This course offers an invaluable opportunity to gain insight into accounting principles. We explain how to prepare your company's financial statements effectively and confidently. We show you how to ensure that your organisation meets the International Financial Reporting Standards by employing accounting standards and principles. Sign up to make sure you stay on the right side of the law by applying the best accounting practices and protocols.","courseOutcomes":["Describe important accounting princi...","Discuss how to apply the ‘accrual’ p...","Explain how to apply the ‘conservati...","Summarise the important points and s...","Describe important accounting principles and assumptions","Discuss how to apply the ‘accrual’ principle","Explain how to apply the ‘conservatism’ principle","Summarise the important points and sections of the ‘consistency’ principle","Identify the nature and importance of the ‘historic cost’ principle","Explain how to abide by and apply the ‘full disclosure’ principle","Identify the value of the ‘going concern’ principle","Discuss the importance of the ‘matching’ and ‘monetary unit’ principles","Outline tips used to deal with reliability and revenue recognition principles","Describe how corporate social responsibility (CSR) relates to accounting principles","Describe important accounting princi...","Discuss how to apply the ‘accrual’ p...","Explain how to apply the ‘conservati...","Summarise the important points and s...","Describe important accounting principles and assumptions","Discuss how to apply the ‘accrual’ principle","Explain how to apply the ‘conservatism’ principle","Summarise the important points and sections of the ‘consistency’ principle","Identify the nature and importance of the ‘historic cost’ principle","Explain how to abide by and apply the ‘full disclosure’ principle","Identify the value of the ‘going concern’ principle","Discuss the importance of the ‘matching’ and ‘monetary unit’ principles","Outline tips used to deal with reliability and revenue recognition principles","Describe how corporate social responsibility (CSR) relates to accounting principles"],"courseDescription":"<p>The main purpose of accounting principles is to establish a framework for how financial accounting is recorded and reported on financial statements. Accounting principles are guidelines that companies and other agencies must abide by when reposting their financial data and results. These guidelines and rules must be followed by accountants to ensure that financial data is standardised across borders. It is essential for financial data to be reliable as it acts as a key guide for decision-makers and keeps stakeholders informed.</p><p>This course provides a basic understanding of the main accounting principles and assumptions. Generally accepted accounting principles are important because they set the rules for financial reporting and bookkeeping. The ‘International Financial Reporting Standards’ (IFRS) cover most of the world and the ‘Generally Accepted Accounting Principles’ (GAAPs) framework applies in the United States of America. These frameworks serve an important function in maintaining consistency in financial reporting from company to company across all industries, sectors and borders.</p><p>This course is a great opportunity for you to learn about financial and economic guidelines that demonstrate the various accounting concepts. The IFRS and GAAP frameworks can help you build accurate statements regarding working cost, revenue and outcome to guide decision-making and keep investors and stakeholders informed, as stipulated by law. Sign up to learn all about the best practices in the world of accounting and the assumptions that inform international bookkeeping standards.</p><a href=\"https://alison.com/resume/courses/5342\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5342\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Importance of Accounting Principles","description":"What are the Accounting Principles? Accounting principles are the rules and guidelines that companies and other agencies must abide by when reposting their financial data and results. These principles and rules make it easier to regulate financial data by setting the standards and rules that accountants must use.","topics":["The Importance of Accounting Principles - Learning Outcomes","Introduction to Accounting Principles","Accounting Principles - Part 1","The Need for GAAPs","The Importance of Accounting Principles - Lesson Summary"]},{"name":"Module","details":"Technical Issues & Accounting Principles","description":"This module on technical issues and accounting principles works through and explains real-life examples of violations of accounting principles. The module further discusses the impact and consequences of poor ethics and violation of accounting principles and assumptions. Lastly, the real-life cases of Enron and Worldcom are discussed.","topics":["Technical Issues & Accounting Principles - Learning Outcomes","Accounting Principles - Part 2","Examples of Accounting Principle Violations","Accounting Principles & Auditing","Technical Issues & Accounting Principles - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Accounting Principles and Assumptions Made Easy - Course Assessment"]}]}