{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4945","title":"The Complete Presentation Skills Guide for All Occasions","totalEnrolled":"915","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover techniques for creating and delivering stunning presentations for all occasions in this free online course.","description":"This course provides valuable techniques from a master in the art of delivering presentations, providing an overview from their creation to their delivery. Discover skills relating to typography, the colour wheel and other considerations for creating engaging slides. You will also learn about delivery, using a remote, movement, voice modulation, strategies to overcome stage fright and elements of an extraordinary presentation.","courseOutcomes":["Select a topic for your presentation...","Outline the process of creating cont...","Categorise the types of fonts...","Identify matching colours for your s...","Select a topic for your presentation","Outline the process of creating content for your presentation","Categorise the types of fonts","Identify matching colours for your slide","Compare the different types of slide presentations","Analyse body language and voice modulation during a presentation","Explain a structured introduction","Solve your public speaking problems","Select a topic for your presentation...","Outline the process of creating cont...","Categorise the types of fonts...","Identify matching colours for your s...","Select a topic for your presentation","Outline the process of creating content for your presentation","Categorise the types of fonts","Identify matching colours for your slide","Compare the different types of slide presentations","Analyse body language and voice modulation during a presentation","Explain a structured introduction","Solve your public speaking problems"],"courseDescription":"<p>By taking this course, you will learn to deliver high-quality presentations following a simple process: selecting a topic, developing content and delivering it in style. We first introduce you to the ‘3 Es’ (eagerness, eligibility and experience) of choosing a topic before acquiring the skills to develop all the parts of presentation content. Here, we will explore proven tools like brainstorming, mind-mapping and other 'pearls of wisdom' that help to simplify the content-creation process.</p><p>Next, you will discover typography and the colour wheel and understand how to incorporate these into your slides to make them more engaging. You will investigate the different variations of slides to find the best one to use for maximum effectiveness. Following this, you will see how to structure your presentation's opening, incorporating body language, voice modulation, eye contact and stage movements to make your language, voice modulation, eye contact and gestures stand out.</p><p>This course's content is highly engaging, with stunning graphics and animations frequently used to enhance your knowledge and overall experience. It also contains passionately delivered information and presentational expertise gathered over the lifetime of a true professional. The techniques introduced here are still being used today to great success by the presenter in corporate events and educational and government organisations. So why are you waiting? Enrol today and learn how to deliver outstanding presentations.</p><a href=\"https://alison.com/resume/courses/4945\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4945\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Developing Content for a Successful Presentation.","description":"In this module, you will be introduced to the concepts of developing successful content for your presentation by understanding how to select a topic for your presentation. Also, you will learn about creating powerful content using brainstorming, mind mapping & string of pearls techniques. Finally, you will learn to create stunning slides.","topics":["Developing Content for a Successful Presentation - Learning Outcomes","Topic Selection & Content Development for a Presentation","Techniques to Create a Powerful Content","The Use of Typography in a Presentation","Developing Content for a Successful Presentation - Lesson Summary"]},{"name":"Module","details":"Mastering Slides & Delivery Skills for your Presentation","description":"In this module, you will be introduced to the world of slides and will understand how to create stunning slides using the colour wheel in 3 modes. You will also be learning how to overcome your public speaking fear, create a structured introduction and master your delivery style by following the 3 elements of an extraordinary presentation.","topics":["Mastering Slides & Delivery for your Presentation - Learning Outcomes","Art of Creating Stunning Slides for Your Presentation","Mastering Delivery for Your Presentation","Finishing in Style","Mastering Slides & Delivery Skills for Presentation – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Complete Presentation Skills Guide for All Occasions - Course Assessment"]}]}