{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4863","title":"Think Like the Great Investors","totalEnrolled":"562","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn from the world's most successful investors and cultivate an investing mindset with this free online course.","description":"One of the most common mistakes made by investors is blindly copying others in this field. If this is your case, you will never be an independent investor because you are missing an essential piece of a great investor's mindset. Successful investors never finance a project without a solid reason. That's where this course comes in! We will help you understand and develop the mentality of the greatest investors of our time.","courseOutcomes":["Explain stock investment like an exp...","Describe how the successful investor...","Discuss the mindsets an investor sho...","Distinguish the investment decisions...","Explain stock investment like an experienced investor","Describe how the successful investors invest","Discuss the mindsets an investor should have","Distinguish the investment decisions based on emotion and logic","Identify the investment mistakes to avoid","Evaluate your investment plan based on the new mindset","Analyse your investment portfolio with a new perspective","Recognise the wrong habits in investing","Explain stock investment like an exp...","Describe how the successful investor...","Discuss the mindsets an investor sho...","Distinguish the investment decisions...","Explain stock investment like an experienced investor","Describe how the successful investors invest","Discuss the mindsets an investor should have","Distinguish the investment decisions based on emotion and logic","Identify the investment mistakes to avoid","Evaluate your investment plan based on the new mindset","Analyse your investment portfolio with a new perspective","Recognise the wrong habits in investing"],"courseDescription":"<p>The great investor Warren Buffett likes to think that anyone actively involved in investing is winning over those who are not. Warren Buffett once said, \"Success in investing doesn't correlate with IQ... what you need is the temperament to control the urges that get other people into trouble in investing.\" If you want to do well in investing, it's not about being smart, it's about how you think. Warren Buffet is correct in that it would be difficult to become a successful investor without the right mindset.</p><p>Changing your mindset is one of the most important steps on your path to wealth creation. In this course, you will learn from nine great global investors. We are going to debunk five deadly investing myths to free your mindset. Warren Buffett said, \"It's good to learn from your mistakes. It's better to learn from other people's mistakes.\" Unfortunately, these blunders often cost amateur investors large sums of money. We have therefore put together more than twelve common mistakes you should avoid.&nbsp;</p><p>The human mind is the most powerful 'supercomputer' on Earth. If you 'program' it correctly, it will help you tremendously but conversely will also hinder you if you have the wrong attitude. So why not go through this course carefully and adapt your perspective where necessary. By doing this, you will significantly increase your chance of success. Why delay? Enrol in this course today!</p><a href=\"https://alison.com/resume/courses/4863\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4863\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Great Investors Mindset","description":"In this module, we will learn from 9 great investors and what they say about investing. Then, we will break down five common misconceptions that keep people from getting started and how to avoid all the mistakes to be on the right path to a profitable investing journey.","topics":["The Great Investors Mindset - Learning Outcomes","Learning From the Successful Investors","What These Great Investors Say About Investing","5 Investment Myths","Investment Mistakes to Avoid","The Great Investors Mindset - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Think Like the Great Investors - Course Assessment"]}]}