{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3168","title":"Trading with Indicators","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use technical indicators to trade and analyze financial markets in this free online course.","description":"This free online course will show you what technical indicators are and how they are used. You will be shown the importance of trading indicators and how to use a blend of indicators and time frames. Gain a thorough understanding of how to select the best trading indicators when trading regardless of the trading strategy to be implemented. Also, you will be taught the formulas that are at the heart of a successful technical trader’s toolkit.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Technical indicators are an important tool for all technical analysts. Do you know what a ‘moving average indicator’ is or why it is important for analyzing the market? In this course, you will be introduced to the concept of moving averages and be shown the moving average indicator, what it is used for and how to set up your charts to get the most from it. You will be taught how to implement the two most common moving average indicators, which are simple moving averages (SMA) and exponential moving average (EMA). See how they react to price and how they can be used as trade signals. The material also goes on to discuss moving average convergence divergence (MACD) and how it can be used to develop valuable insights into price momentum. You will be shown MACD on a chart, see how MACD reacts to price change and how traders use the indicator to extract valuable clues about the market. Perhaps most importantly, you will be shown the limitations of MACD.</p><p>Next, be introduced to the parabolic SAR (stop and reverse) indicator and study how it can be used to determine the direction that an asset is moving. Also, you will learn about the Bollinger bands technical analysis tool and how it can be correctly applied to improve trading performance. You will be taught the concept of Bollinger band deviation pinching and master how it can be interpreted on a chart. Furthermore, you will be introduced to the stochastic indicator and how to set it up correctly. Understand what the stochastic indicator measures in a trade and when to use it - or not. You will be taught the concept of ‘overbought’ versus ‘oversold’ as well as %K (fast) and %D (slow) line crossovers. In addition, learners will gain an understanding of what ‘divergence’ is and what the limitations of the stochastic indicator are.</p><p>Lastly, master the relative strength index (RSI) indicator and how to set it up correctly to supercharge your analysis. The golden ratio is everywhere in nature, from DNA through to the proportions of galaxies. This course will show you how it extends to trading by introducing you to the concept of the Fibonacci or golden ratio in trading and how you can apply Fibonacci to a chart. Break down how pivot points are used in technical trading to analyze support and resistance areas, what they can tell you, and their strengths and weaknesses. This course is suitable for new traders who have basic computer literacy who want to have the knowledge and skill needed for forex (foreign exchange) trading.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}