{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2427","title":"Transformation and Image Enhancement","totalEnrolled":"451","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about image transformation, properties of transformation and enhancement techniques in this free online course","description":"This free online transformation and image enhancement course is important for learners as they dive deeper into the world of digital image processing. The course explains the properties of Fourier Transformations along with fundamental differences between the different types of transformations. By the end of the course, you will be much better equipped with knowledge on image transformation and image enhancement techniques. Get started, today.","courseOutcomes":["Explain the Periodicity and Conjugat...","Discuss the rotation, distributivity...","Explain how Fast Fourier Transform i...","Discuss the principle of operation o...","Explain the Periodicity and Conjugate and Convolution properties of Discrete Fourier Transformation","Discuss the rotation, distributivity and scaling properties of Fourier Transformation","Explain how Fast Fourier Transform is implemented","Discuss the principle of operation of Discrete Cosine Transform(DCT)","Discuss the forms of spatial domain operations","Describe Contrast Stretching as an image enhancement technique","Explain the Power-Law Transformation","Define a histogram as it relates to digital image processing","Discuss the meaning of the Mask Processing Technique","Explain the image averaging or image smoothing operation","Explain the Periodicity and Conjugat...","Discuss the rotation, distributivity...","Explain how Fast Fourier Transform i...","Discuss the principle of operation o...","Explain the Periodicity and Conjugate and Convolution properties of Discrete Fourier Transformation","Discuss the rotation, distributivity and scaling properties of Fourier Transformation","Explain how Fast Fourier Transform is implemented","Discuss the principle of operation of Discrete Cosine Transform(DCT)","Discuss the forms of spatial domain operations","Describe Contrast Stretching as an image enhancement technique","Explain the Power-Law Transformation","Define a histogram as it relates to digital image processing","Discuss the meaning of the Mask Processing Technique","Explain the image averaging or image smoothing operation"],"courseDescription":"<p>This course begins by introducing you to the properties of Discrete Fourier Transformation and those of Fourier Transformation. You will learn how Fast Fourier Transform is implemented, understand the principle of operation of Discrete Cosine Transform(DCT) along with the fundamental difference between K-L Transform and other transformations. You will see an illustration of the rotation property of the discrete Fourier Transformation and also learn the distributive along with scaling properties of Fourier Transformation.</p><p>The course then explains image enhancement techniques and the necessity of image enhancement operations. You will learn about contrast stretching as an image enhancement technique, its importance and the reasons that may warrant its use. You will also learn about transformation techniques related to histogram-based processing where you will understand the meaning of a histogram, image averaging and image subtraction.</p><p>Next, the course explains some implementation issues surrounding histogram equalization and specification, comparing the performance of both techniques. Then, you will learn about linear smoothing operation, non-linear operations and sharpening filter. Finally, you will understand the meaning of mask processing, image averaging and the types of frequency domain techniques. Start this course today, and learn valuable skills in image enhancement and transformation.</p><a href=\"https://alison.com/resume/courses/2427\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2427\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Hadamard Transformation","description":"In this module, you will learn about the properties of Discrete Fourier Transformation and those of Fourier Transformation. You will also learn how Fast Fourier Transform is implemented, understand the principle of operation of Discrete Cosine Transform(DCT) along with the fundamental difference between K-L Transform and other transformations.","topics":["Hadamard Transform - Learning Outcomes","Rotation Invariance Property","DCT and Walsh Transform","Hadamard Transformation","K-L Transform","Hadamard Transform - Lesson Summary"]},{"name":"Module","details":"Image Enhancement and Histogram Equalization","description":"In this module, you will get to understand the necessity of image enhancement in digital image processing and discuss the forms of spatial domain operations. You will also learn about contrast stretching, the Power-Law Transformation and image averaging as image enhancement techniques.","topics":["Image Enhancement and Histogram Equalization - Learning Outcomes","Image Enhancement: Point Processing Techniques","Contrast Stretching Operation","Histogram Equalization and Specification","Image Enhancement and Histogram Equalization - Lesson Summary"]},{"name":"Module","details":"Image Enhancement Techniques","description":"This module explains the implementation issues surrounding histogram equalization and specification, comparing the performance of both techniques. You will also learn the meaning of mask processing, image averaging and the types of frequency domain techniques.","topics":["Image Enhancement Techniques - Learning Outcomes","Histogram Implementation - I","Histogram Implementation - II","Image Enhancement: Mask Processing Technique I","Image Enhancement: Mask Processing Techniques II","Image Enhancement: Mask Processing Techniques III","Image Enhancement Techniques - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Transformation and Image Enhancement - Course assessment"]}]}