{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2475","title":"Transport Management in the UK: Rail and Road","totalEnrolled":"1,360","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course introduces transport management considerations in relation to rail and road in the UK.","description":"This free online transport management course outlines considerations of the management of rail and road in the UK. You will start by learning about the role of the transport manager in the road freight haulage sector and their legal responsibilities. Next, the course will analyse the role of the transport manager in passenger rail, from tender through to operation. This knowledge will be an advantage as you begin a career in transport management.","courseOutcomes":["Explain how companies apply for road...","Examine regulations relating to road...","Discuss the reporting requirements o...","Explain how bus services are operate...","Explain how companies apply for road freight haulage licences","Examine regulations relating to road haulage","Discuss the reporting requirements of the transport manager","Explain how bus services are operated in the UK","Describe how to apply for a Public Service Operator’s licence","Outline how to apply to operate bus routes","Describe how passenger rail services are franchised","Analyse the role of the transport manager in passenger rail","Discuss the rail freight industry and its stakeholders","Explain how companies apply for road...","Examine regulations relating to road...","Discuss the reporting requirements o...","Explain how bus services are operate...","Explain how companies apply for road freight haulage licences","Examine regulations relating to road haulage","Discuss the reporting requirements of the transport manager","Explain how bus services are operated in the UK","Describe how to apply for a Public Service Operator’s licence","Outline how to apply to operate bus routes","Describe how passenger rail services are franchised","Analyse the role of the transport manager in passenger rail","Discuss the rail freight industry and its stakeholders"],"courseDescription":"<p>Firstly, this course will evaluate the role of a transport manager who is working in the road haulage industry. You will learn the definitions of some of the common terms used in road freight haulage and find out about the legal responsibilities of the transport manager before looking at the regulations and licences required. You will also discover how bus services are operated in the UK.</p><p>Next, the course will outline the organisations involved, and the role that the transport manager plays in the passenger transport sector before exploring the legalities of operating an international coach service. Then, it examines the operation of the rail passenger industry and the franchise process. Furthermore, it will define the role of the transport manager in passenger rail and describe rail freight from tender through to operation and the stakeholders involved in the rail freight industry.&nbsp;</p><p>This free online course allows you to learn and study at your own pace, anywhere and at any time. Transport management is a fast-paced and constantly evolving industry. This course introduces you to transport management and offers insider knowledge of the industry and key terms used therein. So why wait? Start learning now and take one step closer to gaining a successful career in transport management.</p><a href=\"https://alison.com/resume/courses/2475\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2475\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Road Freight and Transport Management","description":"This module will look in detail at the role of the transport manager who is working in the road haulage industry. It will include definitions of common terms used in road freight haulage, examine the legal responsibilities of the transport manager and look at the regulations and licences required.","topics":["Road Freight and Transport Management - Learning Outcomes","Road Freight and Transport Management - Definitions","The Role of the Transport Manager","Road Freight Haulage Licences","British and European Regulations","Transport Managers","Road Freight and Transport Management - Lesson Summary"]},{"name":"Module","details":"Passenger Road Transport and its Management","description":"This module examines how bus services are operated in the UK and the organisations involved. It also examines the role that the transport manager plays in the passenger transport sector and explores the legalities of operating international coach services.","topics":["Passenger Road Transport and its Management - Learning Outcomes","Bus Services in the UK","Public Service Vehicle Operator Licences and Bus Routes","Bus Service Licence and International Services","Passenger Road Transport and its Management - Lesson Summary"]},{"name":"Module","details":"Rail and Transport Management","description":"This module will explain more about rail transport including the operation of the rail passenger industry and the franchise process. Moreover, it will define the role of the transport manager in passenger rail and describe the rail freight, from tender through to operation, and examine the stakeholders involved in the rail freight industry.","topics":["Rail and Transport Management - Learning Outcomes","Operation of the Rail Passenger Industry","Rail and Transport Management - Franchising","Rail Freight and Freight Operating Companies","The Role of the Office of Rail and Road","Rail and Transport Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Transport Management in the UK: Rail and Road Assessment"]}]}