{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/2476","title":"Transport Management in the UK: Ports and Airlines","totalEnrolled":"3,795","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This online course outlines key information about air transport management and operation of ports and airlines in the UK","description":"This free online air transport management course first outlines the types of international and domestic ports and the services that they offer. Next, learn about the British water freight industry. Finally, learn about air transport management and operation of British airports, flight operations, crew rostering, and maintenance management. This is valuable information for anyone interested in air transport management, so get started today.","courseOutcomes":["Discuss the types of international a...","Explain the national and internation...","Outline the documentation required f...","Discuss the inland waterway system i...","Discuss the types of international and domestic ports and the services that they offer","Explain the national and international organisations involved with ocean freight shipping","Outline the documentation required for international freight shipping","Discuss the inland waterway system in the UK, its stakeholders and benefits","Describe the benefits of inland water freight","Describe the UK aviation stakeholders and the different types of passenger flights","Outline the flight operations that a transport manager is responsible for","Discuss crew rostering and the hours that aircrew is permitted to work","Describe route planning and the different factors involved","Outline the regulations covering freight transport in the UK","Discuss the types of international a...","Explain the national and internation...","Outline the documentation required f...","Discuss the inland waterway system i...","Discuss the types of international and domestic ports and the services that they offer","Explain the national and international organisations involved with ocean freight shipping","Outline the documentation required for international freight shipping","Discuss the inland waterway system in the UK, its stakeholders and benefits","Describe the benefits of inland water freight","Describe the UK aviation stakeholders and the different types of passenger flights","Outline the flight operations that a transport manager is responsible for","Discuss crew rostering and the hours that aircrew is permitted to work","Describe route planning and the different factors involved","Outline the regulations covering freight transport in the UK"],"courseDescription":"<p>This free online air transport management course will begin by examining the types of international and domestic ports and their services. You will learn about the national and international organisations involved with ocean freight shipping and the correct documentation required for international freight shipping. Then, the air transport management course will describe the inland waterway system in the UK, and outline both its stakeholders and the benefits of inland water freight.</p><p>There are a number of similarities between the role of the air transport manager in both the passenger and freight airline industry. This air transport management course will make it clear where the information provided applies to both sectors, or just to one of them. Next, you will hear about the UK aviation stakeholders and different types of passenger flights, specifically, the flight operations that a manager is responsible for in air transport management.</p><p>Finally, you will learn about route planning and the regulations covering air freight transport management in the UK. By the end of the air transport management course, you will have a strong understanding of what role air transport management plays in terms of ports and airlines. You will also be ready to take your next steps should you be interested in pursuing air transport management as a career path. So don't delay, start learning about air transport management now.</p><a href=\"https://alison.com/resume/courses/2476\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2476\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Transport Management for Ports and Inland Waters","description":"In this module, you will learn about types of international and domestic ports and their services. You will also find out about the national and international organisations involved with ocean freight shipping and the correct documentation required for international freight shipping. This section will explain the inland waterway system in the UK, and outline both its stakeholders and the benefits of inland water freight.","topics":["Transport Management for Ports and Inland Waters - Learning Outcomes","Types of Ports","Structure of the British Water Freight Industry","Documentation","Inland Waterways","The Benefits of Inland Water Freight","Transport Management for Ports and Inland Waters - Lesson Summary"]},{"name":"Module","details":"Transport Management for Airlines","description":"There are a number of similarities between the role of the transport manager in both the passenger and freight airline industry. This module will make it clear where the information provided applies to both sectors, or just to one of them.","topics":["Transport Management for Airlines - Learning Outcomes","Management and Operation of British Airports","Flight Operations and Crew Rostering","Flight Plans","Maintenance Management","Transport Management for Airlines - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Transport Management in the UK: Ports and Airlines Assessment"]}]}