{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3592","title":"Twitter Marketing","totalEnrolled":"1,854","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"How can you use Twitter to expose your business to potential clients? This free course breaks down all you need to know.","description":"Twitter is the ‘real deal’ in online digital marketing. This course explains the marketing fundamentals and advanced strategies that professional marketers use to promote businesses on Twitter. It takes you through techniques used to increase engagement on Twitter, get retweets and use analytics to your advantage. By the end, you will be able to make better decisions on how to use Twitter to sell your brand and boost your company.","courseOutcomes":["Discuss how to write engaging tweets...","Describe the features that should be...","Discuss the pros and cons of having ...","Explain how Twitter can be used in c...","Discuss how to write engaging tweets","Describe the features that should be present on your Twitter page","Discuss the pros and cons of having a private Twitter account","Explain how Twitter can be used in connecting to your other social media networks","Explain the importance of trending Twitter hashtags in increasing traffic and followers","Describe how to write good headlines that increase click-throughs","Explain how to use certain periods in the day to get the most engagement from your Tweets","Discuss how to dominate hashtags on Twitter and consistently rank in hashtag searches","Discuss how to write engaging tweets...","Describe the features that should be...","Discuss the pros and cons of having ...","Explain how Twitter can be used in c...","Discuss how to write engaging tweets","Describe the features that should be present on your Twitter page","Discuss the pros and cons of having a private Twitter account","Explain how Twitter can be used in connecting to your other social media networks","Explain the importance of trending Twitter hashtags in increasing traffic and followers","Describe how to write good headlines that increase click-throughs","Explain how to use certain periods in the day to get the most engagement from your Tweets","Discuss how to dominate hashtags on Twitter and consistently rank in hashtag searches"],"courseDescription":"<p>There comes a time during the lifecycle of a business where it is important to employ new strategies that will help promote it. Twitter marketing is an innovative marketing strategy that can grow your brand. There are proven strategies that will get more people to follow you, more users to retweet your posts and much more overall engagement on your Twitter profile. This short course takes you through how to use Twitter to create a business community with noteworthy people in your field. You will study best practices on how to write powerful tweets and set up a strong Twitter profile. Do you know that you can use hashtags to boost your tweets? The strategy you employ for your social media marketing should be succinct to get the maximum value: you need to be clear on your social media plans and how to execute them.&nbsp;</p><p>Having a Twitter marketing strategy ensures there is a plan centred around creating, publishing, and distributing content for your different audiences. With Twitter, you can ignite relationships with people who have common business interests with you. You will learn how Twitter can help increase your brand awareness, ensuring that you are up to date with happenings and trends in your industry. You will be taken through how Twitter boosts website search engine optimization (SEO). You will also learn how Twitter marketing drives traffic to your website and is used to get instant feedback about products or services. Facing a situation where almost no one is clicking on things you tweet can be a huge challenge, especially when you are putting in effort to grow your business. If you are a long-time Twitter user and you want to take your Twitter marketing to a new level, you will find this course very useful.</p><p>Writing engaging tweets that are useful to your audience can be daunting and do you know that making your Twitter account private might affect your overall reach? The material discusses the pros and cons of having a private Twitter account. Have you heard of the small tweaks that you can use to get more organic followers? The course describes some of the proven strategies to attract new followers. Twitter is also a very viable tool to interact with influencers and celebrities. You also cannot overlook the importance of using trending hashtags on Twitter. The course explains the importance of trending Twitter hashtags in increasing your traffic and followers. Enrol in this course to gain the knowledge you need to super-charge your Twitter marketing today!</p><a href=\"https://alison.com/resume/courses/3592\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3592\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Twitter Marketing","description":"In this module, you will discuss how to write engaging tweets. You will learn how to become a domain expert on Twitter. You will also discuss some of the proven strategies for getting more followers on Twitter.","topics":["Introduction to Twitter Marketing - Learning Outcomes","Overview of Twitter Marketing","Twitter Pages","Establishing Yourself on Social Media","Getting More Twitter Followers","Twitter Branding","Social Sharing and Google SEO","Introduction to Twitter Marketing - Lesson Summary"]},{"name":"Module","details":"Getting More Retweets and Engagement","description":"This module explains the importance of trending Twitter hashtags in increasing traffic and followers. The module also discusses how to dominate a hashtag on Twitter and consistently rank in hashtag searches.","topics":["Getting More Retweets and Engagement - Learning Outcomes","Twitter Hashtags","Using Tweets to Maximize Engagement","Twitter and Hashtag Rank","Advanced Twitter Marketing Strategy","Twitter Tools","Twitter Shortcuts and Analytics","Getting More Retweets and Engagement - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Twitter Marketing - Course Assessment"]}]}