{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1725","title":"Understanding Monopolies in Economics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Find out about the various economic and financial implications of monopolies existing within any business sector.","description":"With this free online course on understanding monopolies, you will study market situations where one producer or a group of producers acting in concert controls the supply of goods or a service. Learn about how they can prevent the entry of new suppliers into a market, and exert influence by keeping prices high and restricting output, and how they tend to show little or no responsiveness to the needs of their customers.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the basics of a monopoly. You will look into the revenue and cost graphs for a monopoly and study total and marginal revenues, as well deadweight loss. You will learn that a monopoly makes a profit equal to total revenue minus total cost. When the total output is less than socially optimal, there is a deadweight loss and when the price is set above marginal cost, the firm earns a positive economic profit.</p><p>You will then see why the slope of the marginal revenue curve for a monopolist is twice the slope of the demand curve. This course also discusses oligopoly, which is a state of limited competition, in which a market is shared by a small number of producers or sellers that dominate the market and are likely to change their prices according to their competitors. You will look into how it differs from a monopoly.</p><p>A monopoly exists when one particular business is the only supplier of a commodity or service within any particular sector of the economy, giving them significant market power and the ability to charge higher prices. By taking this economics course you will learn about the characteristics of a monopoly and when they might occur. You will also understand the economic and financial implications of a business having a monopoly in a particular commodity or service sector.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}