{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1365","title":"Understanding Supply Chain Risk Management","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn key aspects of supply chain management such as supply chain ecosystems, modern manufacturing services, and more.","description":"This free online course on Supply Chain Risk Management (SRCM) will teach you the importance of this practice and how to apply it to your organization. In a world where uncertainties abound, learning Supply Chain Risk Management (SCRM) is essential. This will help your organization reduce supply chain vulnerability by identifying and managing the risks within the supply chain, including related external factors. Gain this skill, today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first introduce you to the aim of the Supply Chain Risk Management (SCRM). It will discuss the changes and effects that a supply chain network might face when a supply chain disruption occurs in its ecosystem. You will learn what makes up a Supply Chain Ecosystem and study the different risk sources that may impact a supply chain. You will also look into cyber security which poses the biggest risk to supply chain connectivity.<br><br>You will then study the characteristics of wicked problems that supply chain faces such as terrorism, poverty, and global warming, to name a few. The course will discuss risk propagation and amplification, risk management, and resilient supply chains as well as teach you how to adopt flexibility for resilience. You will also study the three important factors of supply chain risk that are usually overlooked, as well as the six strategies that you can use to reduce overall risk exposure.<br><br>Effective management of a supply chain design is done through the coordination and collaboration of supply chain partners. This will ensure profitability and continuity of the supply chain. This course will teach business entrepreneurs and managers how to identify, monitor, detect, and mitigate threats in their supply chain. Learning these strategies for reducing overall risk exposure in supply chains will make you a crucial component of your organization's profitability. So why wait? Start learning, today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}