{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4514","title":"Understanding Cash and Fund Flow Concepts","totalEnrolled":"639","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use cash and fund flow statements to make smart financial decisions with this free online finance course.","description":"Cash and fund flow statements are important in analyzing the liquidity position of a business. Having a sound knowledge of working capital management will help you avoid cash problems and prevent financial risk. The preparation of cash flow and fund flow statements is vital in analyzing and forecasting the future performance of any business. This finance course prepares you to analyze any business's cash flow and fund flow statements.","courseOutcomes":["State reasons for preparing separate...","Compare and analyze the differences ...","Define cash flow and explain the imp...","Analyze the movement of cash and cas...","State reasons for preparing separate cash and fund flow statements from existing financial statements","Compare and analyze the differences between cash and fund flow statements","Define cash flow and explain the importance of cash flow statements","Analyze the movement of cash and cash equivalent in the cash flow statement","Discuss how to apply the ‘golden rules of cash flow’ to all items on the balance sheet and the income statement","Compute the statement of cash inflow and cash outflow of a given company with the data provided in the case study","Classify cash flow into different categories such as operating, investing and financing activities","Define ‘working capital’ and explain how it is generated","Identify the sources and uses of funds from a balance sheet analysis","Explain the concept of a fund flow statement","Discuss the relationship between current assets and current liabilities to the working capital","Distinguish the formats for preparing financial, cash flow and fund flow statements","State reasons for preparing separate...","Compare and analyze the differences ...","Define cash flow and explain the imp...","Analyze the movement of cash and cas...","State reasons for preparing separate cash and fund flow statements from existing financial statements","Compare and analyze the differences between cash and fund flow statements","Define cash flow and explain the importance of cash flow statements","Analyze the movement of cash and cash equivalent in the cash flow statement","Discuss how to apply the ‘golden rules of cash flow’ to all items on the balance sheet and the income statement","Compute the statement of cash inflow and cash outflow of a given company with the data provided in the case study","Classify cash flow into different categories such as operating, investing and financing activities","Define ‘working capital’ and explain how it is generated","Identify the sources and uses of funds from a balance sheet analysis","Explain the concept of a fund flow statement","Discuss the relationship between current assets and current liabilities to the working capital","Distinguish the formats for preparing financial, cash flow and fund flow statements"],"courseDescription":"<p>We have designed this course to break down the concepts of cash flow and fund flow into their simplest form. We have structured the course into two modules. Each contains case studies on how to independently put into practice the conceptual aspects of the cash flow and fund flow statement analysis. We explore the reasons why both cash flow and the fund flow statements have to be prepared separately from existing financial statements. We outline the meaning of cash flows, the importance of cash generation, the limitations of financial statements and how to track the cash flows. Learn to record cash flows, including cash and cash equivalents. We then explain how to identify and exclude non-cash items in the balance sheet and the income statement by not including them in the cash flow statement. We demonstrate applying the ‘golden rule of cash flow’ to all balance sheet and income statement items.</p><p>There are three mandatory financial statements required of any company. We will explore these and the importance of each statement as required by the accounting standard. Learn to classify the cash flow statements into different categories of activities. Become familiar with the format for preparing the cash flow statement before proceeding to case studies on preparing them. In the second module, we teach the concepts and the importance of the fund flow statement. Research the sources and uses of funds. We break down the concepts of working capital and how the working capital operates to explain the working capital cycle. We investigate the relation between working capital, changes in the current assets and current liabilities. We show you how to apply these concepts to prepare different statements of fund flow.</p><p>By the end of this course, you would have understood the concepts of cash and fund flow statement analysis. We have methodically taught you the step-by-step process of preparing the cash and fund flow statements in a Microsoft Excel worksheet, using case studies to cement your understanding of the economic standing of a business. This course is suitable for everyone and requires no prior accounting or finance background knowledge. So check out this course today.</p><a href=\"https://alison.com/resume/courses/4514\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4514\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Course Overview and Cash Flow Statements","description":"This module will give you an overview of the course, then you will learn the differences between cash and fund flow statements, limitations of the financial statements, formats for preparing cash flow statements, how to apply the golden rules of cash flow to all items on the balance sheet, and the income statements and much more.","topics":["Course Overview and Cash Flow Statement - Learning Outcomes","Course Overview","Decoding Cash Flow Statement","Cash Flow - Case Studies","Course Overview and Cash Flow Statement - Lesson Summary"]},{"name":"Module","details":"Fund Flow Statements","description":"In this module, you will learn the concept of fund flow, working capital concept, how to identify the sources and uses of funds from a balance sheet analysis, how to prepare fund flow statements. The module will provide you with case studies that will give you a great insight into how to analyze and compute fund flow statements.","topics":["Fund Flow Statements - Learning Outcomes","Understanding Fund Concepts","Preparing Fund Flow Statements","Additional Case Studies","Fund Flow Statements - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Cash and Fund Flow Concepts - Course Assessment"]}]}