{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1697","title":"Understanding Risk and Reward in Finance","totalEnrolled":"4,414","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about the role and importance of risk and reward in your financial dealings and investments.","description":"This free online course in understanding risk and reward in finance teaches you about financial risk, reward, and the different types of investments available to your business. All investments carry a certain degree of risk, but risk and reward go hand in hand and are important elements of understanding and securing investment. Take this free online course to learn more about risk, reward, investment, and consumption today.","courseOutcomes":["Explain the role of risk and reward ...","Assess risk and reward in investment...","Describe the different types of risk...","List the factors of production...","Explain the role of risk and reward in investment","Assess risk and reward in investments","Describe the different types of risk and reward","List the factors of production","Compare and contrast investment and consumption","Describe how wealth can be destroyed by property bubbles","Explain the role of risk and reward ...","Assess risk and reward in investment...","Describe the different types of risk...","List the factors of production...","Explain the role of risk and reward in investment","Assess risk and reward in investments","Describe the different types of risk and reward","List the factors of production","Compare and contrast investment and consumption","Describe how wealth can be destroyed by property bubbles"],"courseDescription":"<p>This course begins by explaining the role and importance of risk and reward in investment. It then describes the different types of risk and rewards for the different types of investment. You will learn the definition of human capital and its significance when it comes to investing your money. The reason why we invest is because of the Return on Capital(ROC) that we can get. This course will discuss examples of investments and gives you an idea of how much ROC you can get from each.</p><p>You will then learn the difference between investment and consumption so you will know if the money you are willing to spend is a wise investment or not. You will also cover how a housing bubble can actually lead to wealth destruction. You will then study office conundrums and the possible actions taken that might solve this problem. This course will finally discuss subprime loans and jingle mail.</p><p>No pain, no gain. This cliche has often been used to describe something that we don't want to do but need to do, and it is particularly applicable in the field of investment. Investing carries a certain amount of risk, and with that risk comes some pain, and also some gain. If you are planning to invest your hard-earned money, take this course first so you will know the rewards you can reap for the amount of risk you are willing to take. Start learning something valuable, today.</p><a href=\"https://alison.com/resume/courses/1697\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1697\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Risk and Reward in Finance","description":"This module covers the concepts of risk and reward in finance. It defines what an investment is and discusses how risk and reward are used to assess the quality of an investment. The module begins by discussing different forms of investing, the factors of production in business and how to calculate return on capital. During this module, investment and consumption are compared and contrasted. Housing bubbles are explored in depth and the key aspects of the 2008 credit crunch are explained.","topics":["Introduction to Risk and Reward in Finance - Learning Outcomes","Introduction to Risk and Reward","Human Capital","Return on Capital","Investment vs Consumption 1","Investment vs Consumption 2","Wealth Destruction 1","Wealth Destruction 2","Back of Envelope Office Space Conundrum","Introduction to Risk and Reward in Finance - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Risk and Reward in Finance - Assessment"]}]}