{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3303","title":"Understanding the Economics in Customer Relationship Management","totalEnrolled":"820","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master customer lifetime value calculations to make informed marketing decisions with this free online course.","description":"This free online course explores the economics of customer relationship management, which is critical to securing business success. We break down the idea of ‘customer lifetime value’ (CLV) and teach you how to derive and calculate it to determine the best available branding strategy. This course can help a business owner find and keep customers but is also suited to anyone working sales and customer service for a larger firm.","courseOutcomes":["Define ‘customer-centric’ marketing ...","Explain the impact of such marketing...","Outline the importance of customer l...","Illustrate how CLV calculations can ...","Define ‘customer-centric’ marketing and ‘CLV’","Explain the impact of such marketing","Outline the importance of customer loyalty and branding","Illustrate how CLV calculations can be used to find successful branding strategies","Calculate the CLV for B2B and B2C markets","Demonstrate how to derive the basic CLV formula","Define ‘customer-centric’ marketing ...","Explain the impact of such marketing...","Outline the importance of customer l...","Illustrate how CLV calculations can ...","Define ‘customer-centric’ marketing and ‘CLV’","Explain the impact of such marketing","Outline the importance of customer loyalty and branding","Illustrate how CLV calculations can be used to find successful branding strategies","Calculate the CLV for B2B and B2C markets","Demonstrate how to derive the basic CLV formula"],"courseDescription":"<p>This course focuses on utilizing CLV calculations to make critical marketing decisions. We explain how marketing evolved from its product-centric past to the current ‘customer-centric’ model that enhances business growth. After we explain CLV and identify the factors that contribute to it, we demonstrate its role in allowing businesses to estimate how much customers could spend on their wares during their lifetimes. We provide examples to demonstrate how to calculate the CLV of business-to-business (B2B) and business-to-consumer (B2C) markets with Microsoft Excel. We take you through contrasting types of customer loyalty and establish the importance of branding in securing it.</p><p>The course then presents you with a case study of Rosewood Corporation’s branding problem to illustrate the differences between individual and corporate branding while we use Excel to calculate its CLV to find the best branding strategy and marketing decisions. We explain step-by-step how to derive the CLV for markets in which customers pay before or after a service and show you how to apply CLV formulas in performing basic CLV calculations. We then show you how to calculate the CLV for a ‘cohort’, what we call a group of people who share certain traits and desires.</p><p>Businesses need to consider the CLV of their consumers to rank profitability and map purchasing patterns. If a business can identify its less profitable customers, it can find strategies to handle them so they don't drain resources that could attract more profitable customers. This course establishes the importance of CLV in developing a business and presents practical case studies to help you understand how CLV is critical to making good marketing decisions. This course suits anyone looking to work in sales, marketing or customer relations management or who runs their own business and wants to attract and retain loyal customers.</p><a href=\"https://alison.com/resume/courses/3303\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3303\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Economics of Customer Relationship Management","description":"This module, Economics of Customer Relationship Management, discusses the importance of branding and customer lifetime value in business, with examples demonstrating how to calculate the customer lifetime value of a market and the application of the customer lifetime value calculation in deciding the best branding strategy for a company.","topics":["Economics of Customer Relationship Management - Learning Outcomes","Customer-Centric Marketing","Customer Lifetime Value Calculation","Benefits of Customer Loyalty and Branding","Branding Strategy - Case Study","Maths behind Customer Lifetime Value","Economics of Customer Relationship Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding the Economics in Customer Relationship Management - Final Course Assessment"]}]}