{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1460","title":"Understanding Brexit","totalEnrolled":"3,175","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the key issues and events involved in the UK's impending exit from the EU with this free online course.","description":"This free online Brexit course will give you a better insight into the development of the European Union, Britain's relationship with it, and how this has influenced the Brexit referendum campaign. The term 'Brexit' refers to the impending withdrawal of the UK from the European Union, following a referendum in 2016. This course also reviews the timetable for UK withdrawal and negotiations as part of the withdrawal process.","courseOutcomes":["Explain the origins and main feature...","Outline the main provisions of the W...","Define important terms such as 'back...","Summarise some of the latest develop...","Explain the origins and main features of Brexit","Outline the main provisions of the Withdrawal Agreement","Define important terms such as 'backstop' and 'hard brexit'","Summarise some of the latest developments in the process","Describe the development of the European Union and Britain's relationship with it","Explain the role of party politics in the referendum campaigns","Recognise the contribution of the media in the referendum campaigns","Summarise the referendum results by country and territory","Explain the origins and main feature...","Outline the main provisions of the W...","Define important terms such as 'back...","Summarise some of the latest develop...","Explain the origins and main features of Brexit","Outline the main provisions of the Withdrawal Agreement","Define important terms such as 'backstop' and 'hard brexit'","Summarise some of the latest developments in the process","Describe the development of the European Union and Britain's relationship with it","Explain the role of party politics in the referendum campaigns","Recognise the contribution of the media in the referendum campaigns","Summarise the referendum results by country and territory"],"courseDescription":"<p>The term 'Brexit' refers to the impending withdrawal of the UK from the European Union, following a referendum in 2016, in which 51.9 per cent of voters voted in support of a withdrawal. In this course, you will learn about the timetable for withdrawal and how agreement can be reached on the UK's future relationship with Europe. You will study issues such as free trade and movement, the so-called \"divorce bill\" and the so-called \"Irish backstop\".</p><p>In November 2018, the European Commission and UK negotiators reached an agreement on the 'Withdrawal Agreement' and on an outline of the political declaration on the future EU-UK relationship. Provisions included: the rights of EU and UK citizens, a \"transition period\", the movement of goods, financial obligations and the so-called \"backstop\" or the issue of a hard border on the island of Ireland. You will learn more about this Agreement and the timeline of events leading up to it.</p><p>In March 2019, British Prime Minister Theresa May travelled to Brussels to renegotiate the Brexit deal, following the British parliament's rejection of the deal earlier in January. However, the British Prime Minister’s gambit to renegotiate the treaty, set the UK on a collision course with the rest of the EU, which insisted it was not going to re-negotiate the agreement.</p><p>In addition in this course, you will learn about Britain's historical relationship with the European Union and its development. You will analyse the Brexit campaign and learn how party politics and the media helped to shape it. Learn how Britain's decision not to hold referenda on key issues such as the Maastricht Treaty and the Single European Act, led to the rise of Eurosceptic support and new political parties, such as the United Kingdom Independence Party (UKIP). This course will be of great interest to all learners who would like to learn more about Brexit, what lead to the UK wanting to leave the EU and the implications for other EU states. So why wait? Learn more about the possible implications of Brexit on the UK and other EU states today!</p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/1460\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1460\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Brexit Process","description":"In this module you will be introduced to the subject of Brexit. You will learn about the timetable for the UK's withdrawal from the EU and how agreement can be reached on any future trading relationship with the EU.","topics":["Brexit Process - Learning Outcomes","Latest Developments","Introduction to Brexit","Withdrawal Agreement","Re-Negotiation","Brexit Process - Lesson Summary"]},{"name":"Module","details":"Brexit - Politics and the Media","description":"In this module you will learn about the development of the European Union and Britain's relationship with it. You will study the Brexit campaign and learn how party politics and the media influenced it. Finally, you will review the results of the referendum in England, Scotland, Wales and Northern Ireland.","topics":["Politics and the Media - Learning Outcomes","Britain-EU Early History","Political Campaigns","Media Coverage","Referendum Results","Politics and the Media - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Brexit - End of Course Assessment"]}]}