{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/3559","title":"Webpreneur 101: Creating Wealth Online","totalEnrolled":"3,014","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to succeed online by accelerating your earnings and reaching your financial goals, in this free online course.","description":"A webpreneur is an entrepreneur whose business operations are exclusive to the web. This free online course will introduce you to the fundamental principles of creating wealth through the internet. Study habits of highly successful people and the significance of creating a mind map, how to use various online tools to enhance your business and the key fundamentals to operating successfully in an online-only venture.","courseOutcomes":["Outline the basics of creating wealt...","Identify the habits of highly succes...","Explain how to become effective with...","State Cialdini's laws of influence...","Outline the basics of creating wealth","Identify the habits of highly successful people","Explain how to become effective with your online and offline time","State Cialdini's laws of influence","Explain how to create an online store","Summarize the impact of the web on wealth creation","Describe affiliate marketing and how to start your business without a product","Discuss the fundamentals of teaching online and how to monetize your knowledge","Outline the basics of creating wealt...","Identify the habits of highly succes...","Explain how to become effective with...","State Cialdini's laws of influence...","Outline the basics of creating wealth","Identify the habits of highly successful people","Explain how to become effective with your online and offline time","State Cialdini's laws of influence","Explain how to create an online store","Summarize the impact of the web on wealth creation","Describe affiliate marketing and how to start your business without a product","Discuss the fundamentals of teaching online and how to monetize your knowledge"],"courseDescription":"<p>It is important to understand that businesses today have to include cannot keep the web out of their marketing. This free online course will teach you the benefits of developing a positive mindset, several online business ideas, and how to use the internet to give yourself the best chance of becoming successful. Discover the major types of people in the entrepreneurship world such as dabblers, achievers, and masters. Learn the habits of highly successful people that would potentially help you to become successful as well as tools such as mind mapping for understanding yourself better, clarifying your goals and long-term direction. Some other concepts you will learn about include “hedgehog” which helps filter ideas, peoples’ personality types and how to deal with them, and examples of people such as Ryan Higa who makes a hundred thousand dollars a year through making Youtube videos and Darren Rowse who makes close to a million dollars a year through blogging.</p><p>Next up, you will learn how to use tools such as Facebook, Twitter, LinkedIn, and Youtube to brand yourself, get yourself a better job, potential customers, or traffic for your websites. How to buy a domain name and create a website without any technical expertise are then discussed along with how to position yourself as an expert in your niche, and even become an author. The course content goes on to teach you Robert Cialdini's six laws of influence which will enable you to increase your sales, gain people’s trust, and stay consistent with your public image. It’s important to understand how important building trust and branding yourself is in establishing an online business and there are specific examples included in the course material as well. You will discover how your country of origin could impact on your sales and the e-commerce course finishes by comprehensively discussing how to set up an e-commerce website and the technical aspects of online payments.</p><p>With the advent of online technologies, the opportunities for enterprising on the web have increased exponentially. A product can be manufactured from China or any other country, get posted online and delivered to a warehouse in the United States. Amazon sells over USD 230 billion every year online and this course will teach you how to open up businesses in the UK, United States, or Dubai without actually having citizenship or having to visit these countries. It will help you to understand how you can participate in and dominate the online economy and this entrepreneurship course is suitable for anyone including beginners with no experience, students, or working professionals who would love to supplement their income by making money online. This course could also be of benefit to existing businesses who want to expand their online reach and sales.</p><a href=\"https://alison.com/resume/courses/3559\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3559\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Youology: Know Yourself","description":"In this module, you will find out the reasons why you should study youology and the types of people in the entrepreneurship world. Discover the habits of highly successful people and learn how to create a mind map. The tools for understanding yourself better and how to set your goals and directions will be discussed.","topics":["Youology: Know Yourself - Learning Outcomes","Introduction to Youology","Habits of Successful People","The Concept of Hedgehog","How to Create a Mind Map","Goal Setting","Next Steps: Belief System","Youology: Know Yourself - Lesson Summary"]},{"name":"Module","details":"Wealthology: Know the Game","description":"This module will teach you the basics of creating wealth, where the money comes from, and how it is created. Learn the importance of the internet and how optimum advantage can be gained from it by using simple wealth formula. Find out the history of money, knowledge, and how transferring knowledge has evolved.","topics":["Wealthology: Know the Game - Learning Outcomes","A brief history of Money","Simple Wealth Formula","Types of Asset Classes","Lessons in Wealth From History","Webonomics: Online Opportunities","Wealthology Terms","Internetism: How Internet Impact Education and Business","Wealthology: Know the Game - Lesson Summary"]},{"name":"Module","details":"Youism: Brand Yourself","description":"In this module, you will learn how to use tools such as Facebook, Twitter, LinkedIn, YouTube to help brand yourself to get yourself a better job, potential customers, or traffic for your websites. How to buy a domain name and create a website without any technical expertise will be treated in this section of the course.","topics":["Youism: Brand Yourself - Learning Outcomes","Weapons of Influence","Trust and Branding","Effective Social Media Strategies","Facebook: Social Network","Becoming a Published Author","Creating Websites","Youism: Brand Yourself - Lesson Summary"]},{"name":"Module","details":"eCommerce: Do Business Online","description":"In this module, you will find out how to set u an eCommerce website without any technical knowledge, accept payments on your eCommerce website, and deliver your products or services. Also, learn how to build trust so that people feel comfortable buying from you. Learn to analyze your traffic sources and website performance.","topics":["eCommerce: Do Business Online - Learning Outcomes","eCommerce: Do Business Online","eCommerce: Accepting Payments","eCommerce: Do Business Online - Lesson Summary"]},{"name":"Module","details":"Video, Sales and Marketing","description":"In this module, you will learn how to create videos with better sound quality and pictures. Find out how to have a good accent in your video, the various software you can use for editing videos, creating pictures, and screen recording for tutorials.","topics":["Video, Sales and Marketing - Learning Outcomes","Video, Sales and Marketing: Tell the World","How to Create Videos","Sales and Marketing: Solve a Problem","Sales and Marketing: Copywriting","Sales and Marketing: Advertising","Video, Sales and Marketing - Lesson Summary"]},{"name":"Module","details":"Productivity: Be Effective","description":"In this module, learn how to become effective with your time online and offline, how to increase your productivity by using the right computer, and effective use of your internet browser. You will become aware of skills that will help you over the longer term on your webpreneur journey.","topics":["Productivity: Be Effective - Learning Outcomes","Productivity: Offline and Online Productivity","Productivity: How to Manage Your Time","Productivity: Be Effective - Lesson Summary"]},{"name":"Module","details":"Youniversity: Learn and Teach","description":"This module introduces you to learning faster, teaching online, and monetizing your knowledge. Become aware of online resources such as Wikipedia and Youtube to gain more knowledge. Also, learn how to set up your online university and start to make money online.","topics":["Youniversity: Learn and Teach - Learning Outcomes","Youniversity: Learn","Youniversity: Teach","Youniversity: Learn and Teach - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Webpreneur 101: Creating Wealth Online - Course Assessment"]}]}