{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4786","title":"Workplace Communication Basics","totalEnrolled":"1,634","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the critical skills of excellent workplace communication in this comprehensive free online course.","description":"What do most great employees have in common? Having excellent communication skills is essential in today’s workplace and this course can show you how you can improve yours. You will explore verbal, non-verbal and written skills. You will take a comprehensive look at many aspects of communication, including effective listening, proofreading your writing work, choosing the suitable contact medium and improving grammar, punctuation and spelling.","courseOutcomes":["Define the characteristics of excell...","List five reasons to strive for effe...","Identify how verbal communication is...","Discuss strategies for effective lis...","Define the characteristics of excellent communication","List five reasons to strive for effective communication","Identify how verbal communication is used in the workplace","Discuss strategies for effective listening","Describe how conversations are the building blocks of professional relationships","Recognise how to end a conversation positively","Explain how solid writing skills can play a significant role in your career success","Establish the purpose of written communication","Categorise the different mediums of written communication","Estimate the benefits of writing for your audience","Outline the use of the ‘broad-narrow-broad’ structure","Evaluate the need to edit and proofread your writing","Define the characteristics of excell...","List five reasons to strive for effe...","Identify how verbal communication is...","Discuss strategies for effective lis...","Define the characteristics of excellent communication","List five reasons to strive for effective communication","Identify how verbal communication is used in the workplace","Discuss strategies for effective listening","Describe how conversations are the building blocks of professional relationships","Recognise how to end a conversation positively","Explain how solid writing skills can play a significant role in your career success","Establish the purpose of written communication","Categorise the different mediums of written communication","Estimate the benefits of writing for your audience","Outline the use of the ‘broad-narrow-broad’ structure","Evaluate the need to edit and proofread your writing"],"courseDescription":"<p>We spend most of our lives engaged in communication, whether speaking, listening, reading or writing. Despite this, communicating effectively at the workplace requires a specialised set of skills. With this comprehensive course, we will walk you through the best practices to promote stable and prosperous office environments and offer clear examples for workplace communications to boost your skills.</p><p>The course will present verbal, non-verbal and written communication techniques and teach you how to improve your business writing skills. In addition, you will learn to build good relationships with your colleagues, enhance teamwork skills and increase your work quality. We will also discuss strategies for effective listening, explore how to ask closed or open questions and explain when and how to start and end a conversation positively.</p><p>We will analyse the instruments, techniques and processes that lead to an understanding within the workplace. We will also cover the basics, like why it’s essential to improve grammar, punctuation and spelling and the importance of editing or proofreading your written work. So if you are a professional looking to upgrade the quality of your interactions in the workplace, start this course today and take your communication skills to the next level.</p><a href=\"https://alison.com/resume/courses/4786\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4786\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Workplace Communication Basics","description":"In this module, you will be introduced to the benefits of excellent communication skills at the workplace and how to achieve them for your professional success.","topics":["Workplace Communication Basics - Learning Outcomes","Introduction to Workplace Communication Basics","Verbal Communication Skills","Written Communication Skills","Workplace Communication Basics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Workplace Communication Basics - Course Assessment"]}]}