{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4870","title":"Workplace Hazards: Noise, Chemicals, Stress & Violence","totalEnrolled":"405","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes four common workplace hazards and explains how to manage them.","description":"Noise hazards, chemical hazards, stress and violence are among the most prevalent workplace hazards around the world. However, we know very little about their identification and management. We have therefore designed this short course to provide industrialists, workplace managers and supervisors with all the essential insights regarding identifying and appropriately managing these four workplace hazards. Enrol today!","courseOutcomes":["Analyse the causes of stress in the ...","Indicate the symptoms of stress in t...","State the strategy of curbing violen...","Recognise the fundamental principles...","Analyse the causes of stress in the workplace","Indicate the symptoms of stress in the workplace","State the strategy of curbing violence in the workplace","Recognise the fundamental principles and practices regarding the handling of chemicals in the workplace","Summarise the workplace management activities regarding chemical exposure","Distinguish between different parts of a chemical label","Outline different measures for effective management of noise in the workplace","Recognise common problems associated with ear protection equipment","Analyse the causes of stress in the ...","Indicate the symptoms of stress in t...","State the strategy of curbing violen...","Recognise the fundamental principles...","Analyse the causes of stress in the workplace","Indicate the symptoms of stress in the workplace","State the strategy of curbing violence in the workplace","Recognise the fundamental principles and practices regarding the handling of chemicals in the workplace","Summarise the workplace management activities regarding chemical exposure","Distinguish between different parts of a chemical label","Outline different measures for effective management of noise in the workplace","Recognise common problems associated with ear protection equipment"],"courseDescription":"<p>Workplace accidents and incidents are one of the primary causes of morbidity and mortality. They come at the expense of human lives and valuable resources. The primary reason these accidents occur is the lack of education among employees and their employers. Due to this lack of instruction regarding workplace hazards, the employees and their employers fail to identify the cause of these dangers and manage them adequately.</p><p>Considering these factors, we have designed this comprehensive course. It aims to provide the employees and employers with the necessary training to identify noise hazards, chemical hazards and the factors leading to stress and violence in the workplace. Moreover, this course also discusses various tips for managing and mitigating these four workplace hazards.</p><p>The course comprises a single module with four base topics, each dedicated to the four workplace hazards mentioned earlier and their management. At the end of the module, a summary section will comprehensively review all the important points presented in the topics. Finally, this course aims to equip you with the basic and essential aspects of these workplace hazards to practically and effectively manage them in the workplace.</p><a href=\"https://alison.com/resume/courses/4870\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4870\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Common Workplace Hazards","description":"In this module, you will learn to identify the causes of stress and violence in the workplace. In addition, you will also find discussions on chemical hazards and noise hazards in the workplace. Finally, study various management strategies to allow effective mitigation of these workplace hazards.","topics":["Common Workplace Hazards - Learning Outcomes","Stress and Violence in the Workplace","Chemical Hazards in the Workplace","Noise Hazards in the Workplace","Common Workplace Hazards - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Workplace Hazards - Noise, Chemicals, Stress & Violence - Course assessment"]}]}