{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/1936","title":"YouTube Marketing: The Five Essential Steps","totalEnrolled":"20,586","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about YouTube video marketing and how to generate free targeted traffic from this free online course.","description":"This free online YouTube Marketing course will teach you about the five essential steps to make your YouTube channel a source of both website traffic and potential additional revenue. You will learn how YouTube marketing works and how to take advantage of the 'algorithm' to encourage YouTube to reward your videos with views. Learn how to create, upload, and optimize YouTube videos for maximum effectiveness.","courseOutcomes":["Identify the videos that will encour...","Describe how to make videos that kee...","Explain how to optimise videos for t...","Discuss the use a free extension to ...","Identify the videos that will encourage YouTube to send views.","Describe how to make videos that keep viewers engaged for longer.","Explain how to optimise videos for the search results.","Discuss the use a free extension to discover the best 'tags' for your video.","Explain how to direct traffic from YouTube to your website.","Discuss the set-up Playlists and their importance","Outline what makes compelling video titles.","Describe how to write video descriptions that tell YouTube what your video is about.","Explain how to create video thumbnail images for a high 'click through rate'.","Identify free online resource to research the most successful channels.","Explain how to set up your own channel.","List the steps in building a channel subscriber base.","Describe what the YouTube Partner Program is and how to apply","Identify the videos that will encour...","Describe how to make videos that kee...","Explain how to optimise videos for t...","Discuss the use a free extension to ...","Identify the videos that will encourage YouTube to send views.","Describe how to make videos that keep viewers engaged for longer.","Explain how to optimise videos for the search results.","Discuss the use a free extension to discover the best 'tags' for your video.","Explain how to direct traffic from YouTube to your website.","Discuss the set-up Playlists and their importance","Outline what makes compelling video titles.","Describe how to write video descriptions that tell YouTube what your video is about.","Explain how to create video thumbnail images for a high 'click through rate'.","Identify free online resource to research the most successful channels.","Explain how to set up your own channel.","List the steps in building a channel subscriber base.","Describe what the YouTube Partner Program is and how to apply"],"courseDescription":"<p>YouTube is a highly effective platform for promoting your own products, services, or even affiliate offers. But it's also a medium for potentially earning an extra income through YouTube's 'Partner Program'. The Partner Program is where YouTube displays ads on videos, and where the video publisher gets paid as a result of users clicking on those ads with no additional effort.</p><p>This free online course will teach you how YouTube marketing works and how to take advantage of the 'YouTube algorithm' to create videos that have the potential to get more views and engagement. You will learn how to send traffic from YouTube video to your website and how to tap into the Partner Program for an additional source of revenue</p><p>Next, you will learn what YouTube 'wants' and how to take advantage of that, and you will discover which types of videos are inclined to get the most views and why. Studying this online course will help you get the confidence to develop an effective social media marketing campaign for your business, and will help you bring more traffic to the landing page of your website and the videos on your youtube channel. Enroll in this online course today, and start learning about youtube marketing.</p><a href=\"https://alison.com/resume/courses/1936\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1936\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to YouTube Marketing","description":"This short module introduces you to YouTube as a source of both website traffic and potential additional revenue from YouTube's Partner (monetisation) program","topics":["YouTube Facts and the 'Double-Edged Sword'"]},{"name":"Module","details":"Step 1 - Understanding the YouTube 'Algorithm'","description":"This module teaches you how YouTube determines which videos get the most views and ultimately which videos are the most successful. It's vital not to skip this step of the process because knowing how YouTube works, will allow you to tailor your own videos for the best results.","topics":["Creating Videos that Attract Views and Engagement"]},{"name":"Module","details":"Step 2 - Setting up Your YouTube Channel","description":"This module teaches you how to analyse successful YouTube channels using a free online resource. You will then learn how to set up your own channel using best practices Please refer to the resources section of the course for a downloadable file with a direct link to verify your new channel after you've set it up!","topics":["Analysing Successful Channels","Create Your Own Channel"]},{"name":"Module","details":"Step 3 - YouTube Tags and Video Descriptions","description":"This module is all about video tags and descriptions. Tags are the search terms that users type in when they are searching for a video on a particular topic. The description is the text you see below a YouTube video, which helps YouTube to understand what a video is about.","topics":["Adding Tags and Creating Descriptions"]},{"name":"Module","details":"Step 4 - Uploading and Optimising a Video","description":"This module walks you through the whole process of uploading a video and fully optimising it. You will learn how to create eye catching video thumbnail images using a free design tool, how to navigate through the upload settings, how to create a Playlist, and more. The following supplementary resources can be found in the resources section of this course: Recording Tips and Tools YouTube Image and Video Specs","topics":["Upload a Video and Fully Optimise it for the YouTube Search Results AND for User Engagement"]},{"name":"Module","details":"Step 5 - Monetising Videos Through the YouTube Partner Program","description":"This module explains what the Partner Program is and how it can be an additional revenue source for YouTube marketers. Learn what the requirements are, how to meet them, and how to apply.","topics":["YouTube Video Monetisation","How to See All the Important Data for Any Video on YouTube"]},{"name":"Module","details":"Course assessment","description":"","topics":["YouTube Marketing: The Five Essential Steps - Course assessment"]}]}