{"subjectName":"Business","subjectDescription":"Discover a full suite of online business courses that will allow you to make better business decisions and succeed in today's competitive business world. Our courses provide a rich learning experience that will allow you to develop critical business skills in areas such as business... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/business.jpg","resumeLink":"https://alison.com/resume/courses/4503","title":"ZBrush: Sculpting A 3D Dragon","totalEnrolled":"966","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master key techniques to skillfully create a high-quality dragon using ZBrush and Photoshop in this free online course.","description":"This course will teach you how to create a dragon’s head in ZBrush and edit the final image in Photoshop. Discover the entire sculpting process as well as the rendering and compositing of the final image. Every step of the tutorial is explained using videos that are easy to follow. This is a perfect course for beginners and intermediate users looking to improve their sculpting skills and speed up their workflow.","courseOutcomes":["Classify  the VDM brushes with their...","Distinguish the correct set-up in or...","Recognise the right shapes and volum...","Outline the ‘concept creation’ workf...","Classify  the VDM brushes with their proper uses","Distinguish the correct set-up in order to start sculpting","Recognise the right shapes and volumes to start your model","Outline the ‘concept creation’ workflow","Select shapes and forms and refine them","Define your models with stunning details","Arrange your sculpture before rendering","Identify filters and layers in Photoshop","Compare different passes to get the best result","Classify  the VDM brushes with their...","Distinguish the correct set-up in or...","Recognise the right shapes and volum...","Outline the ‘concept creation’ workf...","Classify  the VDM brushes with their proper uses","Distinguish the correct set-up in order to start sculpting","Recognise the right shapes and volumes to start your model","Outline the ‘concept creation’ workflow","Select shapes and forms and refine them","Define your models with stunning details","Arrange your sculpture before rendering","Identify filters and layers in Photoshop","Compare different passes to get the best result"],"courseDescription":"<p>The term ‘computer graphics’ or ‘CG’ covers everything from games, movies, virtual reality and anything that deals with digital visual content. Therefore the opportunities available in the world of 3D-CG are endless. You could end up working on the newest Marvel movie, making your own indie game or creating the next Nike advertising campaign. This course delves into the computer graphic field and focuses on concept creation, a major part of any creative workflow and the first step in building new ideas. Throughout the years spent in the video game industry, our instructor has taught many students and created courses that introduce them to the world of computer graphics. Since then, many of these students have joined famous companies or started their own businesses. You will be introduced to the skills required to reach such goals and the tools to push those skills to the next level in your career.</p><p>Throughout the progress of this course, the teacher will show you the basic setup and brushes you will use and most likely need for future projects. Keep in mind that all the brushes shown here are indispensable tools that are used by all professional ZBrush users. You will be able to work with many tools to help you create a highly detailed and quality creature. Next, you will explore how to design your creature's basic shapes and forms. This phase is very important to create a solid base for the rest of your beast. In order to keep your project neat and tidy, you will learn to work with multiple subtools. As you get closer to completing the high-resolution model, the final step is to go through sculpting and detailing. In the last section of the tutorial, you will discover how to render your creation in ZBrush and export those renders to Photoshop for the final compositing of the image.</p><p>Once you have completed this course, you will create stunning concepts and become adept at presenting your creations in the best possible way. So, whether you are changing careers, looking for a vocation or are already actively studying computer graphics, this course is for you! The instructor created this course for convenience and usefulness. They have carefully designed each section to help you learn the material in a matter of hours and increase your chance to become acquainted with the tools and different brushes simply and effectively. By studying this course, you will especially benefit from the instructor’s experience creating professional art creatures and handling the software. So don't delay: an opportunity awaits to expand your knowledge in this high-demand field. The sooner you start, the quicker you will reach your goals and become a professional 3D modeller.</p><a href=\"https://alison.com/resume/courses/4503\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4503\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Create a Digital Dragon Using Zbrush and Photoshop","description":"In this module, we will learn Zbrush's user interface and how to do a basic setup. In addition, we will study the brushes that we are going to use throughout the tutorial. This will be crucial to understand in order to create high-quality details making our model more realistic. Finally, we will analyze how to render our model.","topics":["Create a Digital Dragon Using Zbrush and Photoshop - Learning Outcomes","Basic Set-up and Blockout","Detailing a Model","Rendering in Zbrush and Compositing in Photoshop","Create a Digital Dragon Using Zbrush and Photoshop - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Zbrush: Sculpting a 3D Dragon - Course Assessment"]}]}