{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4502","title":"2D and 3D Programming Using WebGL","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you the skills required to render interactive 3D and 2D graphics using WebGL.","description":"Effective use of 2D and 3D graphics are on the rise as they result in powerful and impressive displays. WebGL is used to render high-performance interactive 3D and 2D graphics within any compatible web browser without the use of plug-ins. We will teach you how to set up a WebGL project and server on various operating systems, draw objects and apply textures and colours. Explore how to transform shapes and apply ambient lighting.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>From the film industry to education and training, animation and gaming, architecture and interior design, 2D and 3D designs are becoming increasingly important. 3D modelling allows the designer to see things that they would not see in 2D. We have designed this course to help web developers and anyone interested in programming 2D and 3D graphics to create high-performance interactive 3D and 2D graphics that you can view in any compatible web browser. We begin with an overview of WebGL (Web Graphics Library). Learn the distinctions between WebGL, OpenGL and OpenGL ES and set up a WebGL server on Windows, Mac and Linux operating systems. You will also learn the six steps to rendering in WebGL: preparing the canvas, getting the WebGL context-ready, specifying and storing the geometry in a buffer object, creating and compiling shader programs and linking the shader programs with the buffer objects and finally drawing the object.</p><p>This course will teach you the distinctions between normalised and device coordinates. Following that, you will learn how to draw objects, points and a simple triangle in WebGL. Explore how to draw lines in various ways in WebGL, draw a quad with four vertices and draw a 3D cube. Finally, we demonstrate how to set up Three.js on your computer to assist in creating and displaying animated 3D graphics in a web browser using WebGL and how to apply colours and textures to shapes, move and transform objects and apply ambient light to shapes.</p><p>WebGL is the web version of OpenGL. It is a JavaScript API that allows any compatible web browser to render high-performance interactive 3D and 2D graphics without the use of plug-ins. This Alison course will provide you with first-hand knowledge required to design 2D and 3D graphics with WebGL. Set up a quick server to code WebGL on various operating systems, create a WebGL project, draw and transform objects, apply colours and textures, animate shapes and apply lighting to the objects. This course is a fantastic opportunity for anyone interested in learning 2D and 3D programming. Take this course right away and learn a new skill.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}