{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5077","title":"3D Modelling and Texturing With Blender","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn basic techniques for modeling and applying textures to 3D objects using Blender in this free online course.","description":"Are you constantly amazed by the stunning 3D graphics you see on billboards all around you and want to learn how to create something similar? This short course on computer graphics will teach you how to use the Blender software. The functionality of various menu items, panels and tools in Blender and key techniques such as ‘extruding’ will be explained. In addition, you will learn how to model various real-world objects on your own.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you ever wonder how they create 3D graphics in games and movies? Have you ever wanted to learn more about it but didn't know where to start? This foundation-level course will provide you with all the information and skills you'll need to model real-world three dimensional objects on your own. Subject matter experts from Stone River eLearning are the publishers of this course. The company specializes in high-quality, video-based IT training content.</p><p>We introduce you to the design software called ‘Blender’. Next, we will explain the basic features and tabs in Blender using examples. Then we introduce the concept of object manipulation with real-life practical demonstrations. Various tools used for modeling objects in Blender, like the ‘knife’ tool and ‘extruding’, will be addressed next. We outline the concepts of propositional editing and mirroring in Blender.</p><p>Texturing is the process of applying a 2D image to a 3D object. The following section will teach you how to add an image to all surfaces of an object. We will explore various examples to illustrate the application of texture and material. Finally, you will learn the process of rendering and adding light to the objects designed in Blender. This course is suitable for individuals interested in 3D design or who want to learn something new. Seize this opportunity to learn a new skill and enroll in this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}