{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3552","title":"3D Mobile Game Vegetation Modeling in Maya and Unity","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to create a cartoon tree in Maya and import it to Unity for mobile gaming.","description":"This free online course, 3D Mobile Game Vegetation Modeling in Maya and Unity will teach you how to create a cartoon tree and by the end of this course, you will know how to use the Multi-Cut tool to model the base of the tree, extrude and shape the tree trunk and the branches, using the Edit Mesh function. This 3D modeling course will also teach you how to UV Map the tree for easy texturing in Substance Painter and finally import in Unity.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The general overview of this course is to build a mobile game with a simple but creative combination of shapes. The concept of the whole design is to produce a structure that is cartoonish in nature with fascinating features. The final outcome will be a well-crafted tree with many branches and well-placed leaf cubes, beautified with spiral drawings and blended with colours.</p><p>This 3D environment modeling tutorial will teach you how to use this cube to form nearly all the possible parts of the tree; the trunk, the branches and the leaves and with the help of tools, how to adjust the cubic shape to a round tree-like shape by pulling the vertices inwards and outwards. In this mobile game development course, you will learn how to shape, loop, and model the branch, how to modify the trunk shape and create grass around the base. The next step to be taught includes importing your structures in Unity where you will have the ability to give your model the final outlook.</p><p>This 3D Mobile game modeling course is designed to equip you with the tools, knowledge and skills you need to start creating a 3D cartoon tree for mobile games using Maya and the Unity game engine. Whether you are creative and love to create new things, are interested in game development or simply want to improve your skills in Maya and Unity, you should definitely enrol and learn some exciting new 3D game modeling skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}