{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5027","title":"A Beginner's Guide to Building Websites Using Wix","totalEnrolled":"1,085","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Wix to design unique websites, embed email marketing and grow web traffic in this free online course.","description":"Wix is an excellent platform that you can use to build an amazing website without the need to write code. Instead, you can develop a mobile-friendly and responsive website using this platform to make your content accessible to users. This course will teach you how to build a stunning website, embed email marketing capabilities, set up a blog, increase web traffic and potentially grow your business and improve your brand visibility. Enrol today!","courseOutcomes":["Explain how to build a complete webs...","Recall the step to set up email auto...","Discuss how to monetise your email l...","Identify effective remarketing strat...","Explain how to build a complete website with Wix","Recall the step to set up email autoresponders and create an autoresponse sequence on your Wix website","Discuss how to monetise your email list","Identify effective remarketing strategies you can use for your Wix website","Discuss ways to manage Facebook Ads to get more customers","Outline the methods of building trust with the Facebook Ads algorithm","Explain how to build a complete webs...","Recall the step to set up email auto...","Discuss how to monetise your email l...","Identify effective remarketing strat...","Explain how to build a complete website with Wix","Recall the step to set up email autoresponders and create an autoresponse sequence on your Wix website","Discuss how to monetise your email list","Identify effective remarketing strategies you can use for your Wix website","Discuss ways to manage Facebook Ads to get more customers","Outline the methods of building trust with the Facebook Ads algorithm"],"courseDescription":"<p>Wix is a web-based platform that enables you to create websites without the need to learn any programming languages. You can create a unique site that meets every requirement with the help of customisable themes and templates, drag-and-drop components and other impressive tools. This course will provide a comprehensive, step-by-step tutorial on how to build a professional website from scratch using Wix and explores the basics of email marketing and how to improve your web traffic.</p><p>We will begin with a lesson on selecting a Wix plan that satisfies your needs, then guide you through creating a landing page and adding more pages and other content to your website. Some Wix apps that can drive traffic to your website will also be covered. You will also discover how to develop email autoresponders and automated response sequences by following along with the examples and walkthroughs provided. After that, you will explore ways to send email shoutouts, monitor trends and add other people to grow your email list.</p><p>Email marketing is the backbone of many businesses today and with Wix email marketing, you can quickly adopt all the latest email marketing techniques to advertise your brand. Discover how to make money from your email list while increasing traffic to your landing pages. In the concluding section, you will learn how to run Facebook and retarget ads to grow your business and use other alternative ways to get traffic to your website. This course is essential for developers, entrepreneurs, internet marketers or anybody developing a website, landing page or email list. Register today and start learning.</p><a href=\"https://alison.com/resume/courses/5027\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5027\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building Stunning Website","description":"This module will teach you the basics of building a website using Wix. You will also study how to set up your landing page and add more pages and content to your Wix website. Also, you will explore ways to set up email autoresponders and sequences, build an email list with your landing page, and do some cool landing page hacks using Wix.","topics":["Building Stunning Website - Learning Outcomes","How to Build Your Own Website","Email Marketing Made Simple with Wix","Building Email Lists with Landing Pages","Landing Page Hacks","Building Stunning Website - Lesson Summary"]},{"name":"Module","details":"Email Marketing & Sequence","description":"This module will explore ways to turn your email list into passive income. You will also review some items to give away to entice potential leads to your website. Also, you will discover how to run retargeting ads to website visitors to grow your business.","topics":["Email Marketing & Sequence - Learning Outcomes","How to Turn Emails into Passive Income","How Write Better Landing Page and Email Copy","How to Run Retargeting Ads to Website Visitors to Grow Your Business","Email Marketing & Sequence - Lesson Summary"]},{"name":"Module","details":"Other Strategies to Boost Website Traffic","description":"In this module, you will learn how to run Facebook ads to grow your business or website. You will study how to set up your Facebook pixel in ads manager and some secrets to scaling up your Facebook adverts. To assist you sell more, we will cover several alternate strategies for bringing visitors to your site and other sales-related issues.","topics":["Other Strategies to Boost Website Traffic - Learning Outcomes","How to Run Facebook Ads to Grow Your Business and Website","Facebook Advertising Secrets","Alternative Ways to Get Traffic to Your Website","Everything You Need to Know About Sales","How to Sell Yourself","Other Strategies to Boost Website Traffic - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Beginners Guide to Building Websites Using Wix - Course Assessment"]}]}