{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4139","title":"A Beginners Guide to JavaScript","totalEnrolled":"3,950","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use JavaScript with practical examples so you can enhance your coding abilities in this free online course.","description":"In this introductory course to JavaScript (JS), you will learn how to use this programming language to enhance the look and functionality of your webpage. This practical yet simple course has been designed for those learners with no prior experience of JS. JavaScript is used in almost all websites today and there is a demand for web developers with JavaScript experience.","courseOutcomes":["Explain what JavaScipt is...","Indicate how to break out of and con...","State what full-stack web developmen...","List the different types of operator...","Explain what JavaScipt is","Indicate how to break out of and continue a loop","State what full-stack web development is","List the different types of operators available in JavaScript","Distinguish between string primitive and string objects","Discuss common console errors like syntax and type reference","Indicate the online resources available to assist with JavaScript related difficulties","Distinguish between Git and Github","Explain what JavaScipt is...","Indicate how to break out of and con...","State what full-stack web developmen...","List the different types of operator...","Explain what JavaScipt is","Indicate how to break out of and continue a loop","State what full-stack web development is","List the different types of operators available in JavaScript","Distinguish between string primitive and string objects","Discuss common console errors like syntax and type reference","Indicate the online resources available to assist with JavaScript related difficulties","Distinguish between Git and Github"],"courseDescription":"<p>This is an interactive course that teaches you the basic rules and guidelines you need to excel in JavaScript, one of the world’s most popular computer programming languages. You will learn what JavaScript is and about the vast number of job opportunities that exist within the web development industry. This course provides practical coding solutions to common challenges, and you’ll discover the different online platforms that can assist you should you experience any difficulties when working with JS on your own. This course takes a beginner to intermediate level with a working knowledge of JavaScript.</p><p>As a JavaScript web developer, you could be highly compensated for your work. A web developer does not necessarily need to work for a company: this course also provides you with the opportunity to become self-employed. Are you inspired to transform your hobby into a lucrative business? The exciting aspect of this course is that you do not have to leave the comfort of your home to acquire this skill - you can enrol in this course and develop a new skill that is in demand. It also provides you with resources that you can use to hone your skills after completing this course.</p><p>JavaScript has been around since 1995 and big companies like Walmart, Netflix and Groupon use it. This programming language is very versatile. Many businesses are now offering as many products and services online as possible, which means that they require interactive websites. A career in web development is a great opportunity! Your knowledge of JavaScript can make you a successful, thriving entrepreneur. Are you contemplating a profession in web development? If so, this course will present you with all the means to get started on your journey.</p><a href=\"https://alison.com/resume/courses/4139\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4139\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Javascript","description":"The model introduces you to the JavaScript programming language and its many functionalities. Additionally, you will learn about the different big tech company that uses JavaScript in their applications.","topics":["Introduction to JavaScript - Learning Outcomes","JavaScript Market Place & Job Opportunities","Introduction to JavaScript Code and Extensions","Development tools & Console Errors","Introduction to GitHub","Online Resources and Coding Challenges","Introduction to JavaScript - Lesson Summary"]},{"name":"Module","details":"Coding Basics","description":"The module introduces you to the different JavaScript operators and their functions. You will also be able to differentiate between single-line comments and multi-line comments.","topics":["Coding Basics - Learning Outcomes","Content Object and Line Coding","Variable, Hoisting and Declaration","Operator Precedence","Coding Challenge and Solution","Coding Basics - Lesson Summary"]},{"name":"Module","details":"Primitive Data Types","description":"In this module, we will introduce you to different primitive data types. You will be able to differentiate between if/else and truthy/falsy statements. Additionally, you will learn about Boolean logic, its founder and how it came about.","topics":["Primitive Data Types - Learning Outcomes","Primitive Data Types and Manipulation","Boolean Logic & Symbols","Ternary Operators and Code Challenge","Primitive Data Types - Lesson Summary"]},{"name":"Module","details":"Advanced Data Types and Loops","description":"This module introduces you to the different arrays available and their functionalities. You will also obtain a more profound understanding of the numerous loops available and how they can enhance your project while saving time.","topics":["Advanced Data Types and Loops - Learning Outcomes","Advanced Data Types Intro","Basic Array and Object Methods","Code Challenge and Solution - Object Creation","Different Loop Types","Code Challenge and Solution - Learn to Loop","Advanced Data Types and Loops - Lesson Summary"]},{"name":"Module","details":"Beginner & Advanced Function Syntax","description":"This module introduces you to the different JavaScript functions and methods available and how they work. You will also learn about scope, specifically how JavaScript defines it and its relation to closure.","topics":["Beginner & Advanced Function Syntax - Learning Outcomes","Function Declarations and Expressions","Scope, Closure and Callbacks","JavaScript Methods","Beginner & Advanced Function Syntax - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Beginners Guide to JavaScript - Course Assessment"]}]}