{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4977","title":"A Beginner's Guide to MySQLi","totalEnrolled":"496","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you to use MySQLi with PHP to create apps that rely on a database connection.","description":"MySQL Improved Extension (MySQLi) is a technique for connecting to databases from within PHP. This course explores everything you need to know about working with MySQLi, from connecting to the database to fetching and getting results and using all available features. So why are you still waiting? Empower yourself by gaining the skills needed to build fast and scalable database-connected applications.","courseOutcomes":["Explain MySQLi's features, applicati...","Outline the steps involved in connec...","Recognise the procedure for creating...","Indicate the ways to pull single and...","Explain MySQLi's features, applications and system requirements","Outline the steps involved in connecting to a database using database software","Recognise the procedure for creating a database","Indicate the ways to pull single and multiple records from the database","Identify the process of using the MySQLi method to free up results data","List the steps involved in updating records","Discuss the importance of escaping data from another source","Describe the concept of using prepared statements to send multiple values to a query","Analyse the benefits of closing the database connection","Explain MySQLi's features, applicati...","Outline the steps involved in connec...","Recognise the procedure for creating...","Indicate the ways to pull single and...","Explain MySQLi's features, applications and system requirements","Outline the steps involved in connecting to a database using database software","Recognise the procedure for creating a database","Indicate the ways to pull single and multiple records from the database","Identify the process of using the MySQLi method to free up results data","List the steps involved in updating records","Discuss the importance of escaping data from another source","Describe the concept of using prepared statements to send multiple values to a query","Analyse the benefits of closing the database connection"],"courseDescription":"<p>MySQL Improved Extension (MySQLi ) is a relational database driver used in the PHP scripting language to connect with MySQL databases. PHP has arguably been one of the best web development languages in the world for many years. PHP is used to create more than 80% of the world's websites. Combined with the MYSQLi database, it can provide you with the ideal website for your own business. This course aims to illustrate all required elements of MySQLi, from working with data to security.</p><p>It starts by outlining the benefits of MySQLi together with the prerequisites for working with it. First, you will discover how to use PHP to connect to a MySQL server with MySQLi. Next, you will learn how to create a database table. Also, you will explore fetching and getting results. You will investigate how to create SQL queries to obtain single and multiple records. Pulling records as an object will also be covered. We will also discuss several methods for determining the quantity of data returned by a query.</p><p>From there, you will understand how to update records and how to get a property showing us the affected rows amount. The final section will cover fundamental concepts such as security and recommended practices for using database data. It will focus on escaping content when inserting, using both manual and prepared statements. You will also learn how to free the memory associated with a result and close the database connection within MySQLi. So enrol now!</p><a href=\"https://alison.com/resume/courses/4977\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4977\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Database Integration with PHP and MySQLi","description":"This module will teach you about the benefits of MySQLi and how to get started. You will learn everything you need to know about MySQLi, including what it is and how to use it, as well as some critical security issues and best practices.","topics":["Database Integration with PHP and MySQLi - Learning Outcomes","Getting Started with MySQLi","Fetching and Getting Results","Security and Finishing Up","Database Integration with PHP and MySQLi - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Beginner's Guide to MySQLi - Course Assessment"]}]}