{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3513","title":"A Complete Guide to Linux Filesystem","totalEnrolled":"1,624","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The software and directories of the Linux Filesystem are unpacked in this free online programming and sysadmin course.","description":"Understand the Linux filesystem and how to create different files and directories with this free online tutorial. You will be guided through the process of downloading and installing VirtualBox and the exciting step of creating your first virtual machine. You will also explore the terminal used to access the Linux system. Learn the basics of the Linux filesystem by studying this short course.","courseOutcomes":["Explain the different system tabs in...","Describe the process of creating a v...","Discuss the role of the Anaconda ins...","Summarise the terminal client used t...","Explain the different system tabs in Linux CentOS 8","Describe the process of creating a virtual machine","Discuss the role of the Anaconda installation program in CentOS 8","Summarise the terminal client used to connect to the virtual machine","Analyse the different types of filesystems in Linux","Outline the major Linux directories","Compare the three ways of creating files in the Linux machine","List the meanings of key file symbols","Recognise the seven file types found in Linux","Explain the different system tabs in...","Describe the process of creating a v...","Discuss the role of the Anaconda ins...","Summarise the terminal client used t...","Explain the different system tabs in Linux CentOS 8","Describe the process of creating a virtual machine","Discuss the role of the Anaconda installation program in CentOS 8","Summarise the terminal client used to connect to the virtual machine","Analyse the different types of filesystems in Linux","Outline the major Linux directories","Compare the three ways of creating files in the Linux machine","List the meanings of key file symbols","Recognise the seven file types found in Linux"],"courseDescription":"<p>Do you want to be an expert at managing business computer systems in the multi-user computing environment? This course will introduce you to Linux and give you a broad understanding of how its filesystem (FS) works. A FS is a logical collection of files on a partition or disk. Each file or directory in the Linux filesystem is uniquely identified by its name, the directory in which it resides, and a unique identifier typically called an inode. You will learn about Linux’s hierarchical file system structure, which resembles an upside-down tree, with the root directory at the base and the rest of the directories expanding off it. A partition is an information container that can span an entire hard drive, and the Oracle VirtualBox is a platform that allows users to run multiple operating systems on the same hardware.</p><p>First, you will be introduced to the general structure of the Linux operating system. Find out that Linux has multiple layers and the base layer is the hardware that manages all operating systems. The primary appeal of Linux to programmers is that the majority of its well-written user programs are independent of the underlying hardware, making them readily portable to new systems. What is the significance of using a multi-user and multitasking operating system? This value is one of the many effects you will come to understand in this course. Discover that most Linux filesystem types have a similar general structure. Its central concepts are the superblock, inode, data block, directory block and indirection block. The superblock contains information about the filesystem as a whole while the inode contains all the information relating to a specific file. You will also master the roles of the different parts of the directory tree.</p><p>Next, you will learn about the different commands and prompts in Linux that will make your job as a system administrator easier. The ‘locate command’ uses a pre-built database that should be regularly updated, while the ‘find command’ iterates over a filesystem to locate files. A ‘wildcard’ is a character used as a substitute for a class of characters in a search, thereby greatly increasing flexibility and efficiency of searches. Wildcards are commonly used in shell commands in Linux and other Unix-like operating systems. You will master the three main wildcards in Linux and the benefits of using them. Finally, you will see how to connect to Linux using absolute and relative paths, file system navigation commands, and change the system password. This course will be of interest to systems administrators or students interested in learning about the Linux file system.</p><a href=\"https://alison.com/resume/courses/3513\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3513\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Linux System","description":"In this module on the Linux System, you will learn how to install Virtualbox and create your first virtual machine. You will also learn about the Oracle virtual box and how to install and configure Linux CentOS into your computer.","topics":["Linux System - Learning Outcomes","Complete Guide to Linux File System - Introduction","Virtual Machine","Linux Installation and Configuration","CentOS 8 Installation","Linux System - Lesson Summary"]},{"name":"Module","details":"Linux File System Basics","description":"In this module on Linux File System Basics, you will learn about the terminal client used to connect to the Linux machine. You will also gain insight into the different types of file systems and directories in Linux.","topics":["Linux File System Basics - Learning Outcomes","Linux System and Terminal","File System Description","Navigation Commands and Paths","Linux File System Basics - Lesson Summary"]},{"name":"Module","details":"Linux Directories and Files","description":"In this module on Linux Directories and Files, you will learn about the three ways of creating files in the Linux machine. You will also gain insight into the fact that the locate command uses a prebuilt database that should be regularly updated.","topics":["Linux Directories and Files - Learning Outcomes","Directory Attributes and Files","Commands and Links","Root and Wildcards","Command Prompts","Linux Directories and Files - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Complete Guide to Linux File System - Course Assessment"]}]}