{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4016","title":"A Complete Edit and Color Grading Guide Using DaVinci Resolve 17","totalEnrolled":"4,636","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become a video editing master and learn editing and colour grading with DaVinci Resolve 17 in this free online course.","description":"Video editing, colour correction, and motion graphics tools have a reputation for being frustrating to newcomers and to make life even harder, there are an unlimited number of alternatives. This free online video editing course will divide the information into smaller chunks to make it easier to understand and you will learn the ins and outs about the DaVinci Resolve 17 software including basic editing, colour correction, and grading.","courseOutcomes":["Identify how to trim/cut your clips...","Recall how to properly scale, add te...","Recognize the vital elements and opt...","Indicate how you would go about crea...","Identify how to trim/cut your clips","Recall how to properly scale, add text, and effects to a page","Recognize the vital elements and options when rendering and exporting your work","Indicate how you would go about creating a proxy workflow and its purpose","Discuss various management strategies that make it easier to work with different projects","Classify the lift, gamma, gain, and offset controls on the primary wheels","Compare and contrast qualifiers and power windows","List the various video scopes that are available","Discuss ways in which you can prepare your room for grading and filming","Summarize what to look for in a camera profile to shoot high-quality footage","Explain what a node workflow may include and how it might be different if there are no skin tones involved","Identify how to trim/cut your clips...","Recall how to properly scale, add te...","Recognize the vital elements and opt...","Indicate how you would go about crea...","Identify how to trim/cut your clips","Recall how to properly scale, add text, and effects to a page","Recognize the vital elements and options when rendering and exporting your work","Indicate how you would go about creating a proxy workflow and its purpose","Discuss various management strategies that make it easier to work with different projects","Classify the lift, gamma, gain, and offset controls on the primary wheels","Compare and contrast qualifiers and power windows","List the various video scopes that are available","Discuss ways in which you can prepare your room for grading and filming","Summarize what to look for in a camera profile to shoot high-quality footage","Explain what a node workflow may include and how it might be different if there are no skin tones involved"],"courseDescription":"<p>DaVinci Resolve 17 is a popular program for video editing and colour correction because of its many features. This free online video editing tutorial will help you get started with DaVinci 17, even if you have no prior experience. You will begin by creating a new project and importing footage and then learn to edit your page by scaling, adding text and effects. Next, the instructor will illustrate simple colour and audio correction before themes like the delivery page, how to archive your project, and set up a Proxy Workflow.&nbsp;</p><p>The next section of this video editing certification will show you the steps needed to add multiple timelines and how to spot your clips. Managing and organizing your files is very important for version control, use in other projects, and efficiency and you will cover the concept of media management and the best way to organize your files. Some other learning areas include what exactly each of the tabs inside of the colour page are for and finishing off with the most technical part of this video editing training which is understanding colour correction and grading in much more detail.</p><p>With all the many features and tools in DaVinci Resolve 17, it is easy to be overwhelmed. It can be a technically challenging piece of software but this course will take you through the most important features in a systematic, understandable way so that you can apply your learning immediately. If you are in the creative or design space looking to understand more about video editing or if you are a keen videographer in your spare time and want to learn how to edit videos to create more professional masterpieces, then enrolling in this beginners course is exactly where you should start.</p><a href=\"https://alison.com/resume/courses/4016\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4016\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to DaVinci Resolve 17","description":"This module will walk you through the entire process from, opening DaVinci Resolve for the first time to exporting your first video. You will discover how to create and organize projects, import media into your project, edit pages, re-timing and more.","topics":["Introduction to DaVinci Resolve 17 - Learning Outcomes","Introducing DaVinci Resolve 17","Cut and Edit Page","Fusion, Colour, Fairlight and Deliver Page","Introduction to DaVinci Resolve 17 - Lesson Summary"]},{"name":"Module","details":"Basic Video Editing in DaVinci Resolve 17","description":"This module will teach you the fundamentals of video editing in DaVinci Resolve 17. You will import media, spot your clips, add text and music, and finally export your project.","topics":["Basic Video Editing in DaVinci Resolve 17 - Learning Outcomes","Organizing Before Starting","Spotting, Rough Cut and Adding Music and Text","Colorpage, Exporting and Media Management","Basic Video Editing in DaVinci Resolve 17 - Lesson Summary"]},{"name":"Module","details":"Introduction To The Color Page of DaVinci Resolve 17","description":"This module will focus on the colour page of DaVinci Resolve 17. You will see how the many tabs and buttons within it work without becoming overwhelmed.","topics":["The Color Page of DaVinci Resolve 17 - Learning Outcomes","Tabs on the Bottom Left","Bottom Center and Bottom Right Tabs","Read Scopes, Node Workflow,  Open FX and Color Spaces","The Color Page of DaVinci Resolve 17 - Lesson Summary"]},{"name":"Module","details":"Color Correction and Grading in DaVinci Resolve 17","description":"This module will teach you the basics of color correction and grading. You will learn how to create an aesthetically pleasing look for your footage and then adding creativity on top of it.","topics":["Color Correction and Grading in DaVinci - Learning Outcomes","Color Correcting Techniques","Color Grading Techniques","Thinking Big Picture About Color Correction and Grading","Color Correction and Grading in DaVinci - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Complete Edit and Color Grading Guide Using DaVinci Resolve 17 - Course Assesment"]}]}