{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5350","title":"A Newbie's Complete Guide to Python","totalEnrolled":"825","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online IT course teaches beginners and new developers how to code in this versatile programming language.","description":"Python is one of the world's most popular and widely used high-level programming languages, suitable for data analytics, machine learning and even design. It’s known for its general-purpose nature that can be applied in almost every software development domain. It’s the fastest-growing programming language that can be used to develop any application. Empower yourself today by gaining the skills needed to use Python professionally.","courseOutcomes":["Discuss the history and domains wher...","Outline the concept of Python IDE, i...","Recall the steps involved in the pro...","Describe the variables and data type...","Discuss the history and domains where Python finds its applications","Outline the concept of Python IDE, if statements and loops","Recall the steps involved in the programming cycle for Python","Describe the variables and data types in Python","State the Python user-defined and built-in functions","Define the different types of sequences in Python","Summarise the similarities and differences between lists and strings","Use sets and dictionaries","Identify the different types of files in Python","Create and use modules and packages","Explain errors and exceptions","List the steps involved in searching and sorting","Discuss the history and domains wher...","Outline the concept of Python IDE, i...","Recall the steps involved in the pro...","Describe the variables and data type...","Discuss the history and domains where Python finds its applications","Outline the concept of Python IDE, if statements and loops","Recall the steps involved in the programming cycle for Python","Describe the variables and data types in Python","State the Python user-defined and built-in functions","Define the different types of sequences in Python","Summarise the similarities and differences between lists and strings","Use sets and dictionaries","Identify the different types of files in Python","Create and use modules and packages","Explain errors and exceptions","List the steps involved in searching and sorting"],"courseDescription":"<p>Python is the technology of the future. In recent years, its use has exploded. Python is incredibly flexible and adaptable. It can be applied to AI (artificial intelligence) algorithms, task automation, data visualization, and complex calculations. It is also simple to learn, making it the ideal language for beginners. This course illustrates all aspects of Python, from its development and history to advanced functions. It starts by outlining the benefits of Python compared to other programming languages, such as C, C++ and Java.</p><p>You will discover the domains where it finds its applications and about the features of Python IDE (integrated development environment) as well as interactive and script modes. Variables, data types and operators will also be highlighted. Checking conditions, which are implemented using conditional statements, will be explained while functions will be described in detail. Working with sequences will also be covered and you will see how to use strings, lists and tuples.</p><p>Next, learn how to use sets in Python code. How to create, access, update and iterate through a dictionary will be explained. You will discover how to handle different types of files and text file operations. From there, you will learn about modules, packages, errors and exceptions while the final section covers searching and sorting concepts. So enrol now to discover how to use Python for real-world tasks!</p><a href=\"https://alison.com/resume/courses/5350\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5350\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Python Programming","description":"This module is an introduction to the world's most popular programming languages. You will learn about the history of Python and the domains where Python finds its applications. Python IDE, variables, data types and operators in Python will be explained. Also, you will learn about if statements, loops and functions in Python.","topics":["Introduction to Python Programming - Learning Outcomes","Introduction to Python Programming","Understanding Variables, Data Types and Operators","Controlling the Flow Using Control Structures","Using Functions","Introduction to Python Programming - Lesson Summary"]},{"name":"Module","details":"Working with Sequences","description":"This module will teach you how to work with different types of sequences in Python. First, you will discover how to write and execute Python programs using string methods to solve various problems. Also, you will learn about lists and tuples in Python.","topics":["Working with Sequences - Learning Outcomes","Working with Sequences – Strings","Working with Sequences – Lists","Working with Sequences – Tuples","Working with Sequences - Lesson Summary"]},{"name":"Module","details":"Sets, Dictionaries, Files, Modules and Exception","description":"This module will explain many important concepts in Python. You will discover how to use sets and dictionaries in Python code. The different types of files and text file operations in Python will be explained, as well as the ways to create and use modules and packages. Also, you will learn about errors, exceptions, searching and sorting.","topics":["Learning Outcomes","Working with Sets and Dictionaries","Manipulating Files and Directories","Modules, Packages, Errors and Exception","Searching and Sorting","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Newbie's Complete Guide to Python - Course Assessment"]}]}