{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4708","title":"A Practical Guide To Primavera Risk Analysis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Primavera Risk Analysis to analyse and mitigate risks professionally with this free online course.","description":"Are you a project scheduler, project manager or engineer? Learning Primavera Risk Analysis (PRA) is vital for your career. PRA is one of the leading software tools for your project schedule risk assessment. PRA is used to perform schedule authentication and create risk models with well-developed risk events. This course covers the important features of PRA used in analysing and determining contingency and risk response plans.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>All business projects have potential risks. However, companies that plan for these risks are the ones who come out on top. A ‘risk analysis’ is a process that identifies and manages possible issues that could potentially ruin or jeopardise critical projects in a company. Primavera Risk Analysis is a powerful software tool designed to carry out this process efficiently. It allows businesses to model risks and analyse the cost and time implications of minimising them. This course guides you step by step through developing a risk model and running a risk analysis using Primavera Risk Analysis. We cover all of the modelling concepts you can use to create a project risk plan successfully and subsequent risk analysis, ranging from small endeavours to megaprojects. First, we will introduce you to Primavera Risk analysis and then go through the stages of importing schedule (XER) files.</p><p>It is always good to test risk models before using them in risk analysis. We'll take you through the steps of testing your initial risk model and running your first simulation. Next, learn how to add duration and resource uncertainty and ‘quick risk’ to your model. Examine the templated quick risk feature and develop a template that can be saved and reused. After that, we'll discuss how to add correlation to your model and describe the ‘correlation effect’ and the ‘bias effect’. The ‘risk register’ is a record or system used to collect risk management status and is a vital part of risk analysis. You'll learn about the risk register and the difference between duration uncertainty and risk events, including how to set up risk scoring. This course will help you understand the differences between quantitative and qualitative risk registers and how to prepare a risk report, save a risk report and create a custom risk report.</p><p>Determining the degree of impact of risk on models is key to developing contingency plans. We cover how to build an impacted risk model, run a test risk analysis and view your first distribution histogram. Explore how to navigate the distribution histogram, tornado chart and the distribution analyser. Almost all outdoor work will be subject to some weather conditions. Weather is more complex and often requires special probabilistic techniques to model its potential effects correctly. This course will teach you how to add weather modelling to your model and work through basic examples. In addition, we provide a comprehensive real-world exercise for you to complete in your own time. This video-based course is simplified and packed with many downloadable resources and activities to aid learning as you progress through. If you are a project manager, project scheduler, project controller, engineer, cost controller, risk analyst or anyone wanting to learn how to apply Primavera Risk Analysis, then this course is for you. So don't be left out! Enrol today and learn for free.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}