{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3765","title":"A Quick Guide to Excel Tables and Functions","totalEnrolled":"3,002","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to use the various Excel table tools and features to their maximum potential.","description":"Excel has hundreds of valuable functions, but most of us only utilize a small amount of them. Imagine how much easier everyday tasks would be if you could unlock even more of the powerful tools offered by the Excel platform. With this free online Excel course, you will learn all about the world of Excel tables, shortcuts, formula-driven development, macros, the many controls available and how to create interactive charts.","courseOutcomes":["Identify the main rules and the adva...","Describe the Excel function that all...","Distinguish between the sorting and ...","Outline the concept of data aggregat...","Identify the main rules and the advantages of using Excel tables","Describe the Excel function that allows making decisions easier","Distinguish between the sorting and decision functions","Outline the concept of data aggregation","Explain the process of creating filters on Excel tables","Compare the pros and cons of Excel Form and ActiveX controls","Summarize the shortcomings of classic Excel development","Discuss the notion of formula-driven development","Identify the main rules and the adva...","Describe the Excel function that all...","Distinguish between the sorting and ...","Outline the concept of data aggregat...","Identify the main rules and the advantages of using Excel tables","Describe the Excel function that allows making decisions easier","Distinguish between the sorting and decision functions","Outline the concept of data aggregation","Explain the process of creating filters on Excel tables","Compare the pros and cons of Excel Form and ActiveX controls","Summarize the shortcomings of classic Excel development","Discuss the notion of formula-driven development"],"courseDescription":"<p>Microsoft Excel has so many different functions and is one of the most popular software packages because of its vast applications. No matter how complex your data is or the complexity of the output you would like, Excel has a way to improve data processing. This Excel tutorial begins with an introduction to Excel tables which discusses the qualities and advantages of these tables, the challenges they don't address, a practical demonstration on inserting the Excel table into a spreadsheet, and the most effective ways of working with them. You will then be taken through the steps of creating and inserting an interactive chart and the general guidelines that will assist you in making the best use of Excel tables.</p><p>The following piece of content in this Excel training covers the mechanisms of sorting functions. You will learn how to sort the contents of a range or array, in ascending or descending order using the Excel SORT function as well as the decision-making process during the execution of formulas and functions. Next, the procedure for filtering a column of data within a table to isolate the key components is described and how the sum of the corresponding product ranges or arrays can be returned. This section also teaches you how to present information on a dashboard using the SUMPRODUCT function, the steps to take to create a summary format view, the various AGGREGATE functions, and steps in ignoring errors and hidden rows.&nbsp;</p><p>The final section of this Excel formulas course illustrates the various forms of controls for ensuring interactivity and how these controls act as a connection point between the user and the server. Using the developer tab also has a large variety of interesting functions that enables the creative output of data - some of these include creating visual basic applications, designing forms, creating macros, and importing and exporting XML data. Once you understand the various functions within the developer tab, you learn how to apply these functions practically by learning how to insert various Excel form controls in the worksheet to deal with data and handle it according to your specifications, the methods of connecting the interactivity to the control to drive later functions on the dashboard and lastly, what formula-driven development is. Anyone using data in their personal or professional lives will gain great value and expertise from this Excel basic course as it uncovers the many underutilized functions and tools for a vast amount of data processing, -sorting, -filtering, and -visualization.</p><a href=\"https://alison.com/resume/courses/3765\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3765\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Excel Tables and Functions","description":"This module delves into various advanced features of Excel. You will learn how to get the most out of Excel tables, sorting, and decision-making functions.","topics":["Excel Tables and Functions - Learning Outcomes","Excel Tables","Sorting and Decision Functions","Form Controls for Interactivity","Excel Tables and Functions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["A Quick Guide to Excel Tables and Functions - Course Assessment"]}]}