{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3217","title":"Additive Manufacturing Architecture","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Sharpen your 3D printing knowledge and skills with this free online course on additive manufacturing architecture.","description":"This free online course provides you with a comprehensive understanding of 3D printing. The manufacturing industry has evolved and now uses advanced processes and cutting-edge technologies like additive manufacturing to meet soaring production goals. This course trains you to draw on these dynamic new procedures to help you achieve your professional goals and get ahead in your manufacturing career.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course begins with an overview of the applications of additive manufacturing (AM), including prototyping, tooling, and part repairs. These applications give you an idea of what AM is used for and the categories under such use falls. We then examine different available AM materials and the parameters that define their properties. We analyze the use of metal powder as an AM material and investigate their manufacture, testing techniques, process flow chart and various chemical compositions. We then go over other considerations to bear in mind when selecting AM material.</p><p>The course then moves on to laser powder bed fusion, a popular AM method, and we break down its parameters, interactions and impact. We then analyze quality control in 3D printing, identifying all production quality angles and requirements aimed at ensuring customer satisfaction. The course explores other areas like material safety data sheets (MSDS), powder management, powder re-use, mixing rules and certifications by governing bodies (for example, the global National Aerospace and Defense Contractors’ Accreditation Programme).</p><p>We then study extrusion-based 3D printing and compare the ‘direct’ and Bowden extrusion methods before discussing the stringing of molten filament, the sectoral spread of extrusion AM interventions and their applications and so on. The course covers the metal powder characterization and manufacturing techniques and explores metal injection moulding, powder properties and requirements, challenges facing the AM industry and some practical case studies of notable companies’ efforts. This course can hone your 3D printing skills and provide a detailed understanding of this important new technology that can put you ahead of the pack and keep you there.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}