{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4543","title":"Adobe After Effects: Soul Astral and Morbius Teleportation Effects","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course shows you how to use Adobe After Effects to create a video scene of a soul leaving a body.","description":"Have you ever wondered how to add stunning motion effects to videos like those seen in movies? This free course covers the techniques used for shooting videos and applying special visual effects to them. Discover how to change the background in a video and create an animation of a soul moving out of a body. Explore how to shoot videos correctly and create the illusion of a person disappearing, so the transition is smooth.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Adobe After Effects has a simple layout that makes it easy to access different tools and functions for creating animations. This course explains how to import videos to the workspace and access additional tools and functions with mouse clicks or keyboard shortcuts. Time manipulation is an essential technique in video editing that involves changing the duration of perceived time flow by compressing or expanding a clip. We will show you how to freeze a frame and stretch, split, speed up or slow down a clip. A keyframe is a point in time that remembers the values of specific properties. We will demonstrate how to use this feature for adding various visual effects to your videos in Adobe After Effects. Do you want to know how they achieved the astral projection effect in the movie ‘Doctor Strange’? We will show you how to isolate a person from the background, merge it with another video and apply different effects to give the illusion of the soul moving out of a body.</p><p>Shooting your video in the correct format is necessary to ensure your desired visual effects are applied and can work flawlessly. We provide valuable tips for shooting videos involving camera movement, light shadow and the background. Learn how to shoot two videos and combine them to make yourself disappear smoothly. Once you have shot the footage, we will teach you how to edit the videos, merge them, apply particle trails, and set their position and colors to give the illusion of disappearance. Add customized dynamic 3D particles trails using a plugin called Trapcode Form. Often videos are shaky, mainly when you record them with a mobile camera: we teach you how to stabilize shaky videos in Adobe After Effects.</p><p>We have designed this course for beginners who want to enter the field of visual graphics with no prior knowledge or experience of digital effects or motion graphics. It is also helpful for those who want to enhance their expertise in creating vibrant and professional-looking animations. You won't even need to shoot your own videos: we provide all the practice videos, which you can download from the resource section. Video animation can also add value to your business. It can boost your conversion rates, supply better interaction with your clients, emphasize your message and make points easily understandable during presentations. Visual graphics provide endless opportunities, especially in online video-sharing platforms, by helping you stand out from your competitors. Join this course and become a professional visual graphics editor and have fun creating eye-catching animations.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}