{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3671","title":"Adobe Illustrator: How to Design Doodle Text","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Adobe Illustrator and its tools to design beautiful objects and text with this free online course.","description":"In this free online course, we will introduce you to the Adobe Illustrator graphic design software. You can use Illustrator for many artworks such as logos, charts, drawings and more. We'll explore how to set up and manage your workspace in Adobe Illustrator and help you understand how to use it to create fantastic artwork in the form of doodling. You'll be able to leverage the lessons learned from this course to showcase your creative thinking.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Adobe Illustrator is a professional vector-based graphics software used for various artwork, such as logos, postcards, patterns, charts, diagrams, workflow, cartoons and more. This course will teach you how to use Adobe's vector-based graphics tools for Doodle Art. The creations from this course is a fun way to draw unique and attractive artwork with cute and child-like characters or random and abstract patterns. But before you start doodling with Adobe Illustrator, you need to know how to set up your workspace using the software. The workspace will help you modify your documents and files using various features, such as bars, panels and windows. By studying this course, you will learn how to set up an Adobe Illustrator workspace to start your artwork. Adobe Illustrator comes with sophisticated tools that learners must comprehend to utilize them effectively. This course will show you how to create high-quality artwork by using the Adobe Illustrator tools correctly.</p><p>The old school way of drawing and doodling ideas from your mind with a pen, pencil or brush on paper has given way to digital art. Did you know that you can now draw without the use of these conventional mediums? Adobe Illustrator has made this so much easier and accessible. We will show you how to customize your brush with different sizes for drawing and contouring digitally. You'll also learn how to set up your workspace dimensions so that you may create body shapes with various brush sizes. Next, we will show you how to draw a large number of face characters. When doodling, you may notice some empty spaces or gaps in your drawings. These gaps are sometimes unavoidable when drawing. This course will teach you patterns that you can use to fill up these gaps that may occur in your drawings.</p><p>After all of the above, we will show you how to use your doodle art to create print designs for a t-shirt as a bonus in this course. To make the t-shirt print catchy, we will teach you how to doodle facial expressions using Adobe Illustrator. This course is designed for beginners and anyone familiar with drawing who would like to improve their drawing and design skills using Adobe Illustrator. It's also a perfect opportunity to develop your skills if you believe yourself to be \"creative\" and often find yourself scribbling on a notebook or napkin. This course will also be beneficial if you appreciate beautiful designs on posters or in catalogues and brochures. All you need for this course is a computer with Adobe Illustrator installed on it. Some sketching skills are helpful, but it's not a dealbreaker if you can't sketch. If you have some creative ideas you want to illustrate, doodle them by enrolling in this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}