{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4497","title":"Adobe After Effects: Rain Stop Visual Effects for Beginners","totalEnrolled":"1,824","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Dive into the exciting world of post-production visual effects, creating incredible results with this free online course","description":"Visual effects bring about an exhilarating experience for your viewers, and you can do this using Adobe After Effects. It is one of the best software programs for creating motion graphics and compositing applications, and is used by millions of people worldwide. We will teach you how to create particles, sparks and rain effects, from the basics to more complex designs. So don't delay and register for this fascinating journey.","courseOutcomes":["Track the movement of objects in Ado...","Add effects to objects...","Color footage in Adobe After Effects...","Generate and color particles...","Track the movement of objects in Adobe After Effects","Add effects to objects","Color footage in Adobe After Effects","Generate and color particles","Set up a digital and phone camera to correctly shoot visual effect footage","Create simple rain effects","Create particles and a virtual camera in a 3D environment","Track the movement of objects in Ado...","Add effects to objects...","Color footage in Adobe After Effects...","Generate and color particles...","Track the movement of objects in Adobe After Effects","Add effects to objects","Color footage in Adobe After Effects","Generate and color particles","Set up a digital and phone camera to correctly shoot visual effect footage","Create simple rain effects","Create particles and a virtual camera in a 3D environment"],"courseDescription":"<p>Visual effect (VFX) is the process by which imagery is created, altered, or enhanced outside the context of a live-action shot in filmmaking and video production. It allows the integration of live-action footage and effects to create realistic objects, characters and environments. Have you ever wondered how effects in movies are made? This course includes many interesting examples and footage like the shielding effect in ‘Doctor Strange’ to help you gain a deeper understanding of visual effects using Adobe After Effects. We start by looking at the benefits and applications of visual effects. Then, we teach you how to track movements to attach effects to them, colorise footage and generate particles. You’ll discover various tricks and settings, such as direction and gravity, that can be applied to the generated particles to bring about the desired effect.</p><p>Pre-production is a vital part of VFX and plays a very significant role in the final production of the effects. Explore some of the key principles that need to be followed before the actual application of an effect in Adobe After Effects. We show you the best conditions for filming VFX footage including how to configure and set up both digital and phone cameras to produce the best footage for adding visual effects. See how to track camera footage and study a few tricks that will help you get the best tracking results. Gain insight into the main rules of filming to have a smooth tracking experience in Adobe After Effects. In addition, you will create a simple rain effect and then particles in a 3D environment so that the virtual camera can move through them.&nbsp;</p><p>This course contains resource files to help you follow the lessons. Anyone who wants to learn about Adobe After Effects or VFX in general and create an impressive portfolio will find this course useful. It is also essential for designers who design for studios and YouTube channels or who create logo animations. You can manipulate visual effects to captivate your audience and improve the engagement and interaction of your footage to make people feel what they are watching is real. All you need is a PC, an Internet connection and a smartphone to get started. By the end, you will have gained invaluable skills which you can use to create sparks from nothing, colorise them, compose them into real-life footage and finalize the look to a finished product!</p><a href=\"https://alison.com/resume/courses/4497\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4497\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Visual Effects","description":"In this module, we will introduce you to Adobe After Effects, the benefits of learning visual effects as well as their applications in animation. You will be taught how to track movements in order to attach effects to them and how to create raindrops from nothing, colorize it and composite it into real-life footage.","topics":["Introduction to Visual Effects - Learning Outcomes","Adding Effects and Generating Particles","Render and The Optimization of Workflow","Rain Stop Effects","Introduction to Visual Effects - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Adobe After Effects: VFX and Rain Stop VFX for Beginners"]}]}