{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4404","title":"Adobe Photoshop for Beginners","totalEnrolled":"14,188","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain basic skills to create, edit and animate various easy projects using Adobe Photoshop in this free online course.","description":"This free online course will teach you the fundamentals of Adobe Photoshop. You will learn how to use Photoshop panels, libraries and presets. You will also study the various classes of Photoshop tools and each of their functionalities. The course will explain the simple steps involved in developing an animation project and acquiring all the basic skills to create, modify and animate projects on your own in little to no time. Enrol today.","courseOutcomes":["Identify the purpose of each panel i...","Explain how to import objects into t...","Describe the importance of layers an...","Outline the different ways to choose...","Identify the purpose of each panel in Photoshop","Explain how to import objects into the Photoshop Library","Describe the importance of layers and their positioning in a Photoshop project","Outline the different ways to choose colours and the process to add new custom colours to colour swatches.","Distinguish the different types of layer locks in Photoshop","List the various selection, cropping and text tools","Identify the various ‘healing’ tools and state their functions","Explain the process of creating simple animations in Photoshop","Identify the purpose of each panel i...","Explain how to import objects into t...","Describe the importance of layers an...","Outline the different ways to choose...","Identify the purpose of each panel in Photoshop","Explain how to import objects into the Photoshop Library","Describe the importance of layers and their positioning in a Photoshop project","Outline the different ways to choose colours and the process to add new custom colours to colour swatches.","Distinguish the different types of layer locks in Photoshop","List the various selection, cropping and text tools","Identify the various ‘healing’ tools and state their functions","Explain the process of creating simple animations in Photoshop"],"courseDescription":"<p>Photoshop is a raster graphics editor developed by Adobe Inc. It is one of the most popular programs used by graphic designers today for creating images, illustrations, animations and much more. Photographers also use it for retouching their images and creating masterpieces in the photography and art world. Almost all organisations worldwide use Photoshop so marketing and media professionals are expected to be knowledgeable about Adobe Photoshop and other Adobe products. We will therefore focus on providing you with the knowledge to move you from a beginner to an intermediate level designer.</p><p>To begin with, we will introduce you to the Photoshop library, the various library panels and the presets offered by Photoshop. What are Photoshop layers and why do they play a critical role in any project? We will explore all the colour palettes and swatches. Discover the cropping tool, the framing tools and various ‘healing’ tools, which do wonders when removing imperfections from your projects. Another essential tool that serves mainly in the process of logo design is the ‘Pen’ tool. We will demonstrate the correct way to use this tool to create curves, straight lines and other shapes.</p><p>Text is also a vital aspect of any design. The use of the proper text can do wonders for a design. The next section of the course will focus entirely on writing text, which font to choose and the various effects you can use to elevate any text. Did you know that Photoshop allows the use of default brushes and users can create custom brushes? We will describe how to create a custom brush and its many benefits. Finally, we will dedicate the last section of the course to teaching you about creating simple animations in Photoshop. This course is ideal for people who plan to get into graphics designing and those who enjoy designing creative digital artwork. So if you want to improve your skills in creating beautiful masterpieces, this is the first step towards doing so. Take advantage of this opportunity and enrol in this course today.</p><a href=\"https://alison.com/resume/courses/4404\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4404\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Photoshop","description":"This module will teach you the fundamentals of Adobe Photoshop. You will discover the various possibilities in design and animation that can be achieved through Photoshop. The different panels, tools, and features offered by Adobe Photoshop will be explained. Various examples will be demonstrated to explain different tools and features.","topics":["Fundamentals of Photoshop - Learning Outcomes","Introduction to Photoshop","Photoshop Tools","Animation in Photoshop","Fundamentals of Photoshop - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Adobe Photoshop for Beginners - Course Assessment"]}]}