{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1846","title":"Adobe Dreamweaver CC","totalEnrolled":"4,812","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create your own website using Adobe Dreamweaver CC in this free online web development course.","description":"This training course teaches you how to use Adobe Dreamweaver CC to build websites on Mac and Windows operating systems. The program uses a user-friendly drag-and-drop interface and an HTML and CSS development environment. We show you how to create a new workspace, customize tools, work with text and insert and edit different types of images. Sign up to boost your web design skills and learn web development.","courseOutcomes":["Navigate the interface and workspace...","Describe how to preview your content...","Identify the features that make desi...","Discuss how to organize blocks of te...","Navigate the interface and workspace in Adobe Dreamweaver CC","Describe how to preview your content as you check for errors before publishing","Identify the features that make designing for multiple screens easier","Discuss how to organize blocks of text by working with ordered and unordered lists","Establish the importance and role of CSS in web design","Explain the best ways to check links, validate pages, run reports and clean up code","Provide tips on working with assets, libraries and multimedia files to manage your website","Navigate the interface and workspace...","Describe how to preview your content...","Identify the features that make desi...","Discuss how to organize blocks of te...","Navigate the interface and workspace in Adobe Dreamweaver CC","Describe how to preview your content as you check for errors before publishing","Identify the features that make designing for multiple screens easier","Discuss how to organize blocks of text by working with ordered and unordered lists","Establish the importance and role of CSS in web design","Explain the best ways to check links, validate pages, run reports and clean up code","Provide tips on working with assets, libraries and multimedia files to manage your website"],"courseDescription":"<p>This course teaches you how to use Adobe’s Dreamweaver CC program to create and host websites online while styling your virtual space and inserting images and cascading style sheets (CSS). We explain how to acquire and install Dreamweaver CC and take you through its basic interface to create a basic hypertext markup language (HTML) page and access the help menu. In the second module, you will learn how to create a website and publish it online, format your site’s content with HTML code and add hyperlinks.</p><p>The course then demonstrates how to customize and edit your webpage’s properties and examines the basics of CSS to help you make your site more interactive. We then go through panels on pages to show you how to preview your website in different web browsers. You will learn to add and format text, check available styles and use special characters using HTML. We also explain how lists work in HTML and Dreamweaver.</p><p>Lastly, the course takes you through the fundamentals of CSS and explains how to access and use Dreamweavers CSS ‘Designer’ panel to create an external CSS style sheet and use it in your set. We then demonstrate how to insert images and edit them along with background site images. Sign up today to learn web development and create innovative and eye-catching websites.</p><a href=\"https://alison.com/resume/courses/1846\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1846\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Dreamweaver CC","description":"","topics":["Adobe Dreamweaver CC - Learning Outcomes","Acquiring Dreamweaver CC","Start Using Dreamweaver CC","How to Create a New Workspace","How to Create an HTML Page","Dreamweaver CC Help"]},{"name":"Module","details":"Creating a Website","description":"","topics":["How to Create a Website","How to Publish Your Website Online","Formatting Pages","Exercise 1","Creating Hyperlinks","Exercise 2"]},{"name":"Module","details":"Customization Tools","description":"","topics":["Page Properties","Learning CSS","Previewing Pages in Browsers","Using Panels"]},{"name":"Module","details":"Working with Text","description":"","topics":["Adding and Styling Text","Formatting Text, Adding Special Characters","Formatting Using HTML","Working with Lists","Checking the Spelling"]},{"name":"Module","details":"Introduction to CSS","description":"","topics":["Introduction to CSS","Fundamentals of CSS","CSS Designer Panel","CSS Style Sheets","Exercise 4"]},{"name":"Module","details":"Images","description":"","topics":["Images in General","Photographic Images","Background Images"]},{"name":"Module","details":"Course assessment","description":"","topics":["Adobe Dreamweaver CC - Course assessment"]}]}