{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1849","title":"Adobe InDesign CS6","totalEnrolled":"15,896","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about creating professional posters, flyers, brochures and more with this free online Adobe InDesign CS6 course.","description":"This free online Adobe InDesign CS6 course teaches you how to use the popular desktop publishing platform Adobe InDesign. In this course you will learn about the basics of text formatting, image file formats and colour, as well as how an InDesign document is printed, and how its contents can affect your printing methods. Get started making professional posters, brochures, business cards and more in InDesign CS6 today with this free online course.","courseOutcomes":["Recognize how to create documents an...","Identify how to use the tools for se...","Recognize how to use frames to place...","Recognize to commands and tools for ...","Recognize how to create documents and set your personal preferences","Identify how to use the tools for selection, moving, object creation, object manipulation, and framing","Recognize how to use frames to place text and graphics","Recognize to commands and tools for formatting text and paragraphs","Discuss the different types of image files that can be used in InDesign","Identify how to import and manipulate images","Recall how to draw and manipulate objects","Recognize how to create documents an...","Identify how to use the tools for se...","Recognize how to use frames to place...","Recognize to commands and tools for ...","Recognize how to create documents and set your personal preferences","Identify how to use the tools for selection, moving, object creation, object manipulation, and framing","Recognize how to use frames to place text and graphics","Recognize to commands and tools for formatting text and paragraphs","Discuss the different types of image files that can be used in InDesign","Identify how to import and manipulate images","Recall how to draw and manipulate objects"],"courseDescription":"<p>InDesign is a desktop publishing and typesetting software program made by Adobe, and is widely used by publishing and print industry professionals for creating posters, brochures, flyers, and even eBooks. This free online course will give you a detailed understanding of what it is and how to use it.</p><p>The course starts off with a basic introduction to the application, such as creating documents, navigating the interface, setting preferences and saving documents. Then the course moves on to the main tools taking you through each type, from basic selection tools to object creation, and object manipulation. Next the course moves on to creating text frames, importing text, how to use features such as find and change, and how to track changes for collaborative work on a document. You will also learn about formatting text, paragraphs and creating columns for displaying your content in magazine or newspaper layouts.</p><p>You will also learn about images, starting of with the digital image formats, and the differences between them and which to use where and why. You will learn about importing images, moving, resizing and cropping images; along with importing images from Adobe's free Mini Bridge software, fitting images into a content frame and how to add caption to them. You will learn about creating and drawing shapes using both the predefined shapes tools, and free hand drawing using the pen and pencil tools. You will learn about editing and formatting the shapes and how to work with anchor points. Finally, the course will teach you about colors and how different settings of the color of your images and documents can affect the costs and effort required to print your documents.</p><p>So, why wait? Start this free course today and learn key skills for making professional posters, brochures and more using InDesign CS6.</p><a href=\"https://alison.com/resume/courses/1849\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1849\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started with InDesign","description":"This module shows you how to get started with Adobe InDesign.","topics":["Adobe InDesign CS6 - Learning Outcomes","Introduction to InDesign CS6","Creating a New Document","Application and Interface Overview","Working with Pages","Viewing Document Pages","Rulers, Measurements and Guidelines","Setting Preferences","Saving Your Document"]},{"name":"Module","details":"Tools Overview","description":"This module introduces you to the Tools Overview in InDesign.","topics":["Moving the Tool Panel","Selection Tools","Object Creation Tools","Shape and Frame Tools","Object Manipulation Tools","Miscellaneous Tools"]},{"name":"Module","details":"Working with Text & Formatting Options","description":"This module shows you how to work with Text & Formatting Options.","topics":["Creating a New Text Frame","Working with Columns","Importing Text","Inserting Special and Break Characters","Using Spellcheck","Using the Find/Change Feature","Tracking Changes","Character Formatting Controls","Working with Character Styles","Paragraph Formatting Controls","Working with Paragraph Styles","Working with Hyphenation Controls","Working with Tab Stops"]},{"name":"Module","details":"Working with Images","description":"This module shows you how to work with Images in Adobe InDesign.","topics":["Digital Image Format Options","Importing Images","Importing Images from Mini Bridge","Moving, Resizing and Cropping Images","Fitting Images to a Content Frame","Working with Captions"]},{"name":"Module","details":"Shapes and Drawing","description":"This module introduces you to Shapes and Drawing using InDesign.","topics":["Creating Basic Shapes","Drawing Shapes with the Pen Tool","Drawing Lines with the Pen Tool","Drawing with the Pencil Tool","Moving, Resizing and Rotating Shapes","Editing Shapes","Working with Anchor Points"]},{"name":"Module","details":"Working with Colors","description":"This module shows you how to work with Colors in InDesign.","topics":["Comparing Color Types and Modes","Working with Color Swatches","Managing Color Swatches","Importing Color Swatches"]},{"name":"Module","details":"Course assessment","description":"","topics":["Adobe InDesign CS6 - Course Assessment"]}]}