{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4398","title":"Adobe Animate for Beginners","totalEnrolled":"3,421","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the twelve principles of animation using Adobe Animate tools and interface with this free online course.","description":"In this free online course, you will learn the basics of animation on one of the most popular animation software applications. You will examine the most important features of the Adobe Animate interface and tools and study the application's various layers, timelines and symbols. We will also give you a step-by-step rundown of the twelve principles of animation that every animator should know. This course is fun and engaging.","courseOutcomes":["Identify the interface and tools of ...","List the various tools found in the ...","Distinguish between the ‘selection’ ...","Explain the function of layers in Ad...","Identify the interface and tools of Adobe Animate","List the various tools found in the toolbar of Adobe Animate","Distinguish between the ‘selection’ tool and the ‘free transform’ tool","Explain the function of layers in Adobe Animate","Explain the twelve principles of animation","Distinguish between ‘straight-ahead’ and ‘pose-to-pose’ animations","Identify the right way to ease in and out your animation","Indicate which frames to add, edit or delete when creating an animation","Identify the interface and tools of ...","List the various tools found in the ...","Distinguish between the ‘selection’ ...","Explain the function of layers in Ad...","Identify the interface and tools of Adobe Animate","List the various tools found in the toolbar of Adobe Animate","Distinguish between the ‘selection’ tool and the ‘free transform’ tool","Explain the function of layers in Adobe Animate","Explain the twelve principles of animation","Distinguish between ‘straight-ahead’ and ‘pose-to-pose’ animations","Identify the right way to ease in and out your animation","Indicate which frames to add, edit or delete when creating an animation"],"courseDescription":"<p>Adobe Animate is a popular computer animation software application developed by Adobe Inc. Many developers use it to create and design animation clips or movies, web applications, games and so on. This course seeks to introduce you to the basics of this widely used application and the twelve principles of animation. We will first demonstrate the Adobe Animate interface and tools. Then you will learn how to create, select and edit images and drawings using essential tools like the brush tool, selection tool, lasso tool, eraser and many more. In addition, the program comes with ‘layer’ tools and a timeline that will help you organise your workspace. To not duplicate a drawing repeatedly, you will learn how to create a symbol in the Adobe Animate library for later use.</p><p>Next, you will review the twelve principles of animation that every creator must know. We begin with timing and spacing and use them in your projects to gain control of the mood of your object or character. Study how to ease in and out of your animation by adding more frames. We will investigate the principles of ‘squash’ and ‘stretch’ and compare the ‘straight-ahead’ action animation to its ‘pose-to-pose’ counterpart. The ‘Arcs’ principle explains how things in real life do not move in a straight line. Finally, we will illustrate the principle of anticipation along with clear examples.</p><p>When working with character animation, it is imperative to be familiar with the follow-through and overlapping action principle. We will review the secondary action principle and discover the significance of adding little gestures to your figure when portraying an idea. Most animators like to exaggerate actions and events in their animation with the principle of exaggeration. The principle of appeal looks at quality character designs and background. We will train you on how to use or draw a perfect image for the stage or scene. Each lesson in this course is taught using Adobe Animate and will tackle all aspects of animation. All you need for this course is a PC with Adobe Animate installed. By its end, you will be able to animate unforgettable characters. So do not delay and enrol today!</p><a href=\"https://alison.com/resume/courses/4398\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4398\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Adobe Animate","description":"In this module, you will be introduced to adobe animate, the interface, and tools. You will also learn about the adobe animate file formats and presets. Then, you will study layers in adobe animate and be taught how to organize the frames of your animation using the timeline. Lastly, you will explore the types of symbols in adobe animate.","topics":["Introduction to Adobe Animate - Learning Outcomes","Interface and Tools","Adobe Animate Layers","Adobe Animate Timeline","Adobe Animate Symbols","Introduction to Adobe Animate - Lesson Summary"]},{"name":"Module","details":"The 12 Principles of Animation","description":"In this module, you will cover the 12 principles of animation that every animate should know. You will be given a step-by-step rundown of each principle with practical examples using adobe animate. You will also explore some methods and types of animations.","topics":["The 12 Principles of Animation - Learning Outcomes","Timing, Spacing & Easing","Squash & Stretch","Straight Ahead & Pose-to-pose","Arcs in Animation","Anticipation in Animation","Overlapping Action & Follow Through","Secondary Action","Exaggeration, Appeal, Solid Drawing and Staging","The 12 Principles of Animation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Adobe Animate for Beginners - Course Assessment"]}]}