{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3948","title":"Advanced Programming in iOS11 and Swift 4","totalEnrolled":"283","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the application and implementation of core data and machine learning concepts.","description":"Core Data is one of the most popular frameworks provided by Apple for iOS and macOS apps. One can use it to manage the model layer object in an application. This course introduces you to the definition of core data, how to create core data entities and attributes, and how to manipulate core data. You will also learn how to develop intelligent features and enable new experiences. Register for this course today and begin your next learning journey!","courseOutcomes":["Summarize how to restore in-app purc...","Recall how to set up project folders...","Recall how to install Alamofire and ...","Describe how to use Alamofire to dow...","Summarize how to restore in-app purchases after app deletion","Recall how to set up project folders on Xcode and install Firebase Cocoapods","Recall how to install Alamofire and AlamofireImage Cocoapods","Describe how to use Alamofire to download URLs","Describe how to create a UIView extension for binding views to the keyboard","Explain how to add users to a group with didSelectRowAt indexPath","Summarize the definition and types of machine learning","Identify how to save and fetch data from a persistent store","Recall how to start and test in-app purchases","Summarize how to restore in-app purc...","Recall how to set up project folders...","Recall how to install Alamofire and ...","Describe how to use Alamofire to dow...","Summarize how to restore in-app purchases after app deletion","Recall how to set up project folders on Xcode and install Firebase Cocoapods","Recall how to install Alamofire and AlamofireImage Cocoapods","Describe how to use Alamofire to download URLs","Describe how to create a UIView extension for binding views to the keyboard","Explain how to add users to a group with didSelectRowAt indexPath","Summarize the definition and types of machine learning","Identify how to save and fetch data from a persistent store","Recall how to start and test in-app purchases"],"courseDescription":"<p>This free online course, \"Advanced Programming in iOS11 and Swift 4\", introduces you to Core Data. Core Data is one of the most popular frameworks provided by Apple for iOS and macOS apps. Core data is used to manage the model layer object in an application. You can treat Core Data as a framework to save, modify, track, and filter the data within iOS apps. However, Core Data is not a Database. You will get a sense of what Core Data does behind the scenes and how you can interact with the various moving pieces. Alamofire is a Swift-based HTTP networking library for iOS and macOS. It provides an elegant interface on top of Apple's Foundation networking stack that simplifies several common networking tasks. By the end of this course, you should understand HTTP networking and some exposure to Apple's networking classes.</p><p>Google developed Firebase for creating mobile and web applications. It was initially an independent company founded in 2011. In 2014, Google acquired the platform, and it is now their flagship offering for app development. Firebase offers several services, including analytics, authentication, cloud messaging, and real-time database. This course outlines how to link Xcode projects and firebase projects. Machine learning is the study of computer algorithms that can automatically improve through experience and by using data. It is seen as a part of artificial intelligence. Models are built by machine learning algorithms based on sample data, known as \"training data\". These models make predictions or decisions without being explicitly programmed to do so. Machine learning algorithms are used in various applications, such as in medicine, email filtering, and speech recognition. It is also applied in computer vision, where it is difficult or unfeasible to develop conventional algorithms to perform the needed tasks.</p><p>Examples of Machine Learning are everywhere. It's how Netflix knows which show you'll want to watch next or how Facebook recognizes your friend's face in a digital photo. You will learn how to train your application to speak what it sees by recognizing it. You should be able to apply this knowledge and implement other features of machine learning in your applications. Augmented Reality (AR) entails user experiences that add 2D or 3D elements. It turns the environment around you into a digital interface by placing virtual objects in the real world, in real-time. To simplify the task of building an AR experience, ARKit combines device motion tracking, camera scene capture, advanced scene processing, and display conveniences. This course will show you how to create many kinds of AR experiences by using the front or rear camera of an iOS device. So, register for this course today and begin your next learning journey!</p><a href=\"https://alison.com/resume/courses/3948\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3948\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Maps and Core Data","description":"This module introduces you to the basics of mapping ad core data in iOS11 applications. The module discusses the implementation of in-app purchases and googles ads. You will also learn about how to add 3D touch peek and drop to a UICollectionView.","topics":["Maps and Core Data - Learning Outcomes","Maps and GPS","Alamofire and UICollection View","In App Purchases and Google Ads","Introduction to Core Data","Core Data Manipulation","Maps and Core Data - Lesson Summary"]},{"name":"Module","details":"Working with Firebase and Core ML","description":"This module introduces you to the basics of working with firebase and core machine learning. The module also analyzes full-stack development and working with groups. You will also learn about how to use machine learning to train your applications.","topics":["Working with Firebase and Core ML - Learning Outcomes","Introduction to Firebase","Full Stack Development","Working with Groups","Intro to iOS 11 Machine Learning","ARKit and SceneKit","Working with Firebase and Core ML - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Programming in iOS11 and Swift 4 - Course Assessment"]}]}