{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4138","title":"Advanced Diploma in Cloud Computing for Amazon Web Services","totalEnrolled":"3,016","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the principles and services involved in cloud computing for Amazon Web Services.","description":"Master the different services and systems to go beyond theoretical knowledge of cloud computing for Amazon Web Services (AWS) by completing this course. You will be able to implement all the essential components of AWS and demonstrate these sought-after skills to potential employers and clients. Learn how to design cost-effective and efficient systems, and expand your Amazon Web Services knowledge and skills by enrolling today.","courseOutcomes":["Create an AWS account...","Define the concepts of identity and ...","List examples of IAM storage service...","Specify the needs of each security g...","Create an AWS account","Define the concepts of identity and access management (IAM)","List examples of IAM storage services","Specify the needs of each security group rule","Evaluate the different stages in the lifecycle of an instance","Summarise the benefits of using Amazon DynamoDB","Recall the use cases of Lambda","Define the concept of disaster recovery","List the services that are used to host code repositories","Create an AWS account...","Define the concepts of identity and ...","List examples of IAM storage service...","Specify the needs of each security g...","Create an AWS account","Define the concepts of identity and access management (IAM)","List examples of IAM storage services","Specify the needs of each security group rule","Evaluate the different stages in the lifecycle of an instance","Summarise the benefits of using Amazon DynamoDB","Recall the use cases of Lambda","Define the concept of disaster recovery","List the services that are used to host code repositories"],"courseDescription":"<p>Are you looking to master the process of designing flawless IT solutions on Amazon Web Services? This course will help you figure out how to use different AWS options through examples and hands-on tutorials. You will be introduced to the core concepts and principles of identity and access management (AIM) that you will use in an organizational setting or if you want to build your own applications. Learn about Amazon Elastic Compute Cloud (Amazon EC2) as an essential part of AWS. Becoming an expert in this service will give you the necessary skills that you will need to build servers and other cloud computing tasks. You will realize the value of using a service like Amazon EC2 as it offers a scalable computing capacity in the Amazon Web Services Cloud.</p><p>Firstly, the course introduces you to Amazon EC2 instances and tags. See how to connect to your Linux instance using the Secure Shell (SSH) protocol if you want to install software or set up an API. Learn about the importance of checking the status of your instance before getting the public DNS (domain name system) name and user name to connect to your instance. This course clarifies that instance user data is used to perform common automated configuration tasks and run scripts after the instance starts. Next, you will learn about security groups, which are essentially the first step of network security in AWS. They are among the most important skills to learn and are used to troubleshoot network-related issues, including challenges that you might encounter while trying to access an instance.</p><p>Then, you will gain insight into Amazon Machine Images (AMI), which provide the information that needs to be specified when you launch an instance since there is no way of modifying it afterwards. You can launch multiple instances from a single API when you need a large number done with the same configuration. Study different Amazon EC2 storage options and configurations. Look into the strategies and principles associated with disaster recovery. Finally, you will study Amazon Simple Storage Service (Amazon S3), the AWS Command Line Interface (CLI), advanced Amazon databases and the Virtual Private Cloud. This course will interest programming students, developers and IT professionals interested in cloud computing with Amazon Web Services.</p><a href=\"https://alison.com/resume/courses/4138\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4138\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"AWS Course Introduction","description":"In this module on AWS Course Introduction, you will learn about the steps to take when creating an AWS account and different examples of IAM storage services. You will also gain insight into the EC2 Instance Connect Feature and Instance User Data.","topics":["AWS Course Introduction - Learning Outcomes","Introduction to AWS","Identity and Access Management","Introducing Amazon EC2","Connecting with EC2","Installing Control Tools","Obtaining Instance User Data","AWS Course Introduction - Lesson Summary"]},{"name":"Module","details":"More in-Depth with Amazon EC2","description":"In this module on More in-Depth with Amazon EC2, you will learn about the attributes of an Elastic Network Interface and the requirements for choosing an instance. You will also explore the advantages of creating your own AMIs and the stages in the lifecycle of an \"instance\".","topics":["More in-Depth with Amazon EC2  - Learning Outcomes","Deploy Security","Lifecycle Stages of Amazon EC2","Creating a Virtual Machine in Amazon EC2","Placement Groups with Amazon EC2","Optimize Instance Types and Purchasing Options","EIPs and ENI's","More in-Depth with Amazon EC2 - Lesson Summary"]},{"name":"Module","details":"Amazon EC2 Storage","description":"In this module on EC2 Storage, you will learn about the main volume types provided by Amazon EBS and the benefits of using EBS Volumes. You will also master Amazon EBS Snapshots and the encrypted data types when you create an encrypted EBS volume.","topics":["Amazon EC2 Storage  - Learning Outcomes","Introduction to Amazon EBS","EBS Snapshots and Encryptions","Block-Level Storage","Amazon EC2 Storage - Lesson Summary"]},{"name":"Module","details":"Amazon Simple Storage Service","description":"This module on EC2 Storage will teach you about the advantages of using Amazon S3 and the different states that buckets can take. You will also discover how policies are used to secure S3 objects and explore the Cross-origin resource sharing (CORS) concept.","topics":["Amazon Simple Storage Service  - Learning Outcomes","Introduction to Amazon S3","Versioning and Encryption","Security and Bucket Policies","Websites and Data Consistency Models","Amazon Simple Storage Service - Lesson Summary"]},{"name":"Module","details":"Introducing the AWS Command Line Interface","description":"In this module on Introducing the AWS Command Line Interface, you will learn how the AWS Command Line Interface (CLI) provides direct access to the public APIs of AWS services. You will also learn how to configure the AWS CLI and examples of instance metadata categories.","topics":["Introducing the AWS Command Line Interface  - Learning Outcomes","Command Line Interface in AWS","Installing and Configuring AWS CLI","AWS CLI with Amazon EC2, S3, and IAM","Introducing the AWS Command Line Interface - Lesson Summary"]},{"name":"Module","details":"Advanced Amazon & Databases","description":"In this module on Introducing the Advanced Amazon and Databases, you will learn about the examples of Cross-Region replication (CRR) use cases and examples of Amazon S3 storage classes. You will also learn about the benefits of using Athena and the different types of Databases in AWS.","topics":["Advanced Amazon & Databases - Learning Outcomes","Advanced Amazon S3","S3 Storage and Policies","Introducing Athena","AWS Databases","Database Services","Database Storage","Advanced Amazon & Databases - Lesson Summary"]},{"name":"Module","details":"AWS Storage and Route 53","description":"In this module on AWS Storage and Route 53, you will learn about the prominent Snowball use cases and the three types of gateways. You will also learn about the benefits of using Amazon Route 53 and the advantages of using the AWS Storage Gateway.","topics":["AWS Storage and Route 53 - Learning Outcomes","Storage in AWS","Introducing Route 53","Routing Policy Labs","AWS Storage and Route 53 - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Cloud Computing for Amazon Web Services - First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of Modules 1 - 7. You must score 80% or more to pass this assessment.","topics":["Advanced Diploma in Cloud Computing for Amazon Web Services - First Assessment"]},{"name":"Module","details":"Virtual Private Cloud","description":"In this module on the Virtual Private Cloud, you will learn about the key components of a Virtual Private Cloud and differentiate between Network ACLs and Security Groups. You will also learn about the limitations of VPC Peering and the two types of AWS Direct Connect connections.","topics":["Virtual Private Cloud - Learning Outcomes","Introducing Virtual Private Cloud","IP Network Subdivisions","Network Connections","Securing Networks","Virtual Private Cloud - Lesson Summary"]},{"name":"Module","details":"Load Balancing and High Availability Architecture","description":"In this module on Load Balancing and High Availability Architecture, you will learn about Load Balancers' use cases and benefits. You will also learn about the three types of Load Balancers and the benefits of Auto Scaling Groups.","topics":["Load Balancing and High Availability Architecture - Learning Outcomes","Introducing Load Balancers","Elastic Load Balancing (ELB)","ASG Security","Load Balancing and High Availability Architecture - Lesson Summary"]},{"name":"Module","details":"Serverless Computing","description":"In this module on Load Balancing and High Availability Architecture, you will learn about the use cases of Lambda and the minimum function memory allocation in Lambda. You will also learn about the benefits of using AWS DynamoDB and the two main components of Amazon Cognito.","topics":["Serverless Computing- Learning Outcomes","Lambda Concepts","Dynamo Features","AWS API Gateway","Serverless Computing - Lesson Summary"]},{"name":"Module","details":"Disaster Recovery","description":"In this module on Disaster Recovery, you will learn about the benefits of using a Database Migration Service and services are supported by AWS Backup. You will also learn about the benefits of using AWS CloudFront and its different use cases.","topics":["Disaster Recovery - Learning Outcomes","Disaster Recovery and DMS","Datasets and Data Synching","Amazon Web Services Backup","CloudFront  & AWS Global Accelerator","Disaster Recovery - Lesson Summary"]},{"name":"Module","details":"Monitor and Audit","description":"In this module on Monitoring and Auditing, you will learn about the different use cases of AWS Config and AWS CloudWatch Alarms. You will also learn how to recover EC2 instances with CloudWatch Alarms and master the benefits of AWS CloudTrail.","topics":["Monitor and Audit - Learning Outcomes","AWS CloudWatch Introduction","Amazon Web Service Config","AWS CloudTrail","Introduction to Eventbridge","Monitor and Audit - Lesson Summary"]},{"name":"Module","details":"SQS, SNS and Kinesis","description":"In this module on SQS, SNS and Kinesis, you will learn about the different types of message queues offered by AWS SQS and the use cases of SQS Queue Access Policy. You will also learn how to use different types of Kinesis services and recall the two types of AWS SNS clients.","topics":["SQS, SNS and Kinesis - Learning Outcomes","Messaging Introduction","Amazon Web Services: SQS","Amazon Web Services SNS","Introduction to Kinesis","SQS, SNS and Kinesis - Lesson Summary"]},{"name":"Module","details":"Other AWS Services","description":"In this module on Other AWS Services, you will learn about the services used to host code repositories and the benefits of using CloudFormation. You will also learn about the different use cases of AWS Step Functions and the benefits of using Amazon Glue.","topics":["Other AWS Services - Learning Outcomes","CICD Concepts","AWS CloudFormation","Step Functions & SWF & Amazon EMR","Additional Amazon Services","Other AWS Services - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Cloud Computing for Amazon Web Services - Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of Modules 8 - 14. You must score 80% or more to pass this assessment.","topics":["Advanced Diploma in Cloud Computing for Amazon Web Services - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Cloud Computing for Amazon Web Services - Course Assessment"]}]}