{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2504","title":"Advanced Pivot Tables in Excel","totalEnrolled":"12,740","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on Advanced Microsoft Excel PivotTables explains key functions and analysis in PivotTables.","description":"In this free online Advanced Microsoft Excel PivotTables course, you will be taken through how to make the most of powerful data analysis functions. You will be introduced to several techniques used for manipulating data in order to ensure the data is clean and consistent in PivotTables. By the end of this course, you will become better informed about the use of PivotTables in Excel.","courseOutcomes":["Describe how to put a Pivot together...","Explain how to Import data from a te...","Discuss the process of Importing dat...","Describe the cleaning of Data to use...","Describe how to put a Pivot together in Excel","Explain how to Import data from a text file","Discuss the process of Importing data from Access","Describe the cleaning of Data to use in a PivotTable","Discuss Tabular Data and setting up a Table","Explain the process of creating and Manipulating a PivotTable","Discuss the combination of Data from Multiple Worksheets","Explain Grouping and Ungrouping in a Pivot Table","Describe how to Report Layouts","Explains how to Format Error Values and Empty Cells","Differentiate PivotTable Styles and how to use them","Describe Custom Number Formatting in a Pivot Table","Describe how to put a Pivot together...","Explain how to Import data from a te...","Discuss the process of Importing dat...","Describe the cleaning of Data to use...","Describe how to put a Pivot together in Excel","Explain how to Import data from a text file","Discuss the process of Importing data from Access","Describe the cleaning of Data to use in a PivotTable","Discuss Tabular Data and setting up a Table","Explain the process of creating and Manipulating a PivotTable","Discuss the combination of Data from Multiple Worksheets","Explain Grouping and Ungrouping in a Pivot Table","Describe how to Report Layouts","Explains how to Format Error Values and Empty Cells","Differentiate PivotTable Styles and how to use them","Describe Custom Number Formatting in a Pivot Table"],"courseDescription":"<p>This free online course on Advanced PivotTable begins by explaining how PivotTables are used in Excel for analyzing data and the basic features of PivotTables. The course describes the basic features of PivotTables and the techniques used in cleaning and importing date. You will learn about how to create a PivotTable from scratch and how to create interactive dashboards in Excel.</p><p>The course explains how to import and rearrange data in Advanced PivotTables. You will learn about the separation of columns and rows in PivotTables. You will also learn about how to import data from Access database into Excel and create a PivotTable. The course identifies the process of preparing data for analysis and the importance of ensuring data is clean and consistent prior to analyzing data.</p><p>Finally, this free online course then explains the consequences of not cleaning data before analysis. You will be introduced to the key functions used in cleaning data. The course describes the various techniques used in Excel for cleaning data. You will be taken through useful tips used in managing and organizing PivotTables. You will also learn about correcting error values in PivotTables.</p><a href=\"https://alison.com/resume/courses/2504\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2504\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction","description":"In this module, you will be introduced to the processes involved in putting together a pivot table. You will learn about the functionalities and the things that can be done with pivot tables in excel. You will also learn about the basics of creating a pivot table from scratch using some data.","topics":["Introduction to Advanced PivotTables - Learning Outcomes","PivotTables Recap","Introduction to Advanced PivotTables","Introduction to Advanced PivotTables - Lesson Summary"]},{"name":"Module","details":"Importing Data","description":"In this module, you will learn how data is being imported from a text file into excel in order to put it into a PivotTable. You will also learn about the processes involved in importing data from an Access database into Excel and then create a pivot table.","topics":["Importing Data - Learning Outcomes","Importing data from a text file","Importing data from Access","Exercise 01","Importing Data - Lesson Summary"]},{"name":"Module","details":"Preparing Data for Analysis","description":"In this module, you will learn about the importance of preparing your data for proper use. You will also learn about the process of preparing your data for analysis.","topics":["Preparing Data for Analysis - Learning Outcomes","Cleaning Data","Exercise 02","Tabular Data","Preparing Data for Analysis - Lesson Summary"]},{"name":"Module","details":"Creating and Manipulating PivotTables","description":"In this module, you will learn about simple steps to managing and organizing your pivot tables. You will also learn about the different methods of creating a pivot table.","topics":["Creating and Manipulating PivotTables - Learning Outcomes","Report Layouts","Formatting Error Values and Empty Cells","Exercise 03","Combining Data from Multiple Worksheets","Creating and Manipulating a PivotTable","Grouping and Ungrouping","Creating and Manipulating PivotTables - Lesson Summary"]},{"name":"Module","details":"Formatting PivotTables","description":"In this module, you will learn about the several options that can be used for formatting the pivot tables. You will also learn about the custom number formatting.","topics":["Formatting PivotTables - Learning Outcomes","PivotTable Styles","Custom Number Formatting","Exercise 04","Formatting PivotTables - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced PivotTables in Excel - Assessment"]}]}