{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3688","title":"Advanced Diploma in VMware Ultimate Bootcamp vSphere 4.1","totalEnrolled":"224","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about advanced virtualization concepts & the installation of VMware vSphere 4.1","description":"This free online analyzes advanced virtualization concepts and explore the VMware vSphere 4.1 product suite. To get you started on this advanced diploma course, we will introduce you to VMware Tools. We will highlight the knowledge required to efficiently use VMware, beginning with installing the product and moving on to real-world troubleshooting issues. Sign up now so we can get started!","courseOutcomes":["Describe VMware Virtual Cloud Networ...","Discuss details and features of VMwa...","State how to install, configure and ...","Describe the ESX/ESXi Data Center co...","Describe VMware Virtual Cloud Network and the ESX/ESXi Data Center architecture","Discuss details and features of VMware vSphere 4.1 and its components","State how to install, configure and operate ESXi hosts and vCenter 4.1","Describe the ESX/ESXi Data Center components and their main functions","Explain the ESX/ESXi Center key features and benefits","Identify networking problems based on reported symptoms","Discuss server, VMware monitoring, and the process of optimizing resources","Explain how to avoid mistakes when making use of the resources properly","Outline specific capabilities and limitations of the use of NPIV with ESXi","Discuss the prerequisites to configure vMotion","Analyze the process of migrating from a lower version to a higher version","Describe VMware Virtual Cloud Networ...","Discuss details and features of VMwa...","State how to install, configure and ...","Describe the ESX/ESXi Data Center co...","Describe VMware Virtual Cloud Network and the ESX/ESXi Data Center architecture","Discuss details and features of VMware vSphere 4.1 and its components","State how to install, configure and operate ESXi hosts and vCenter 4.1","Describe the ESX/ESXi Data Center components and their main functions","Explain the ESX/ESXi Center key features and benefits","Identify networking problems based on reported symptoms","Discuss server, VMware monitoring, and the process of optimizing resources","Explain how to avoid mistakes when making use of the resources properly","Outline specific capabilities and limitations of the use of NPIV with ESXi","Discuss the prerequisites to configure vMotion","Analyze the process of migrating from a lower version to a higher version"],"courseDescription":"<p>This free online course will provide you with an overview to install, configure, and manage a vSphere environment. Have you ever wondered how you can automatically install the Windows Agent on all machines or how to fix error issues encountered when trying to log on to the VCM server? This course will show you. We will focus on the knowledge required to perform job-related and real-world tasks efficiently and effectively. We will introduce you to less commonly known facts and learnings about virtual machines. We will help you understand how the methodology of VMware is designed so that you can learn it, do it, and know it. We’ll also address some of the challenges, needs, and requirements in the marketplace regarding different virtualization products, including all of your cloud products. We will also take you through matters like licensing and various components of the VMware vSphere suite of applications.</p><p>This course will provide you with practical information through easy-to-learn modules that will show you how to secure your vSphere machines. You will learn about the NFS Components and how to address and access control with NFS on Linux. We will demonstrate how to create two different interface NFS data storages and outline the purpose of Raw Device Mapping (RDM). You will learn to use RDM to store shared data directly on a Logical Unit Number (LUN) in your Storage Area Network (SAN). This course explains standard licensing, virtual standard installation and inventory within the virtual centre. It analyzes managing virtual servers, as well as how to plan the vCenter server deployment. We will outline the requirements for cloning Virtual Machines on a standalone ESX/ESXi and explain how you can troubleshoot the vCenter server. You will learn how to handle startup and shutdown situations on virtual machines by nailing the Start/Stop VMs during the off-hours feature, which starts or stops VMs on a schedule.</p><p>Troubleshooting efforts that start with a narrowly conceived idea of the source of a problem often get bogged down in a detailed analysis of one component. This frustrating process often happens while the actual source of the problem is elsewhere in the infrastructure. To quickly isolate the source of performance problems, adhering to a logical troubleshooting methodology is necessary. Doing so will help you avoid preconceptions about the source of the problems. This course will provide you with the ability to manage multiple VMware at the same time. It discusses how you can create one switch and propagate it throughout the entire infrastructure. We’ll take you through the functions of the vNetwork Distributed Switches. The course material also discusses the potential backup strategies employed to utilize virtualization products such as VMware or vSphere. We’ll also look at the software recommended to backup a virtual machine, how to recover a deleted virtual machine from a data store and third-party backup. We’ll identify the main approaches to backing up virtual machines. If you’re a system administrator, system engineer, or a member of support and technical staff responsible for troubleshooting, this is the course for you. Register now to begin your next learning journey.</p><a href=\"https://alison.com/resume/courses/3688\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3688\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Course Introduction and Methodology","description":"To start, this module will introduce you to security insights you might not see from other perspectives. In this module, you will get to understand the current components of the marketplace with regards to the virtualization of products.","topics":["Course Introduction and Methodology - Learning Outcomes","Introduction","Overview of Virtualization","Course Introduction and Methodology - Lesson Summary","Course Introduction and Methodology - Assessment"]},{"name":"Module","details":"Planning and Installing ESX/ESXi","description":"To start, this module will introduce you to planning the ESX/ESXi overall deployment aspect along with the deployment guidelines for vSphere 4. The module also introduces ESXi/ESX installation and how to configure the hosting resolution and NTP server.","topics":["Planning and Installing ESX/ESXi - Learning Outcome","Planning the ESX/ESXi Deployment","Deployment Guidelines","vSphere Hypervisor (ESXi) Installation","ESX Installation","Configuring Hostname Resolution and NTP Server","Troubleshooting ESX/ESXi","Planning and Installing ESX/ESXi - Lesson Summary","Planning and Installing ESX/ESXi - Assessment"]},{"name":"Module","details":"Using Tools to Administer VMware","description":"To start, this module will introduce you to the use of tools to administer the VMware environment. Now that ESX/ESXi has been installed, you will learn about what to do next. The module also introduces various tools that are available to help manage the VMware environment.","topics":["Using Tools to Administer VMware - Learning Outcome","Overview of 3rd Party Tools","ESX/ESXi Management","Linux Command Review","Troubleshooting the vSphere Client (VIC)","Using Tools to Administer a VMware - Lesson Summary","Using Tools to Administer VMware - Assessment"]},{"name":"Module","details":"Configuring Networks","description":"To start, this module will introduce you to networking. You will learn about virtual networks, creating and modifying virtual networks when using GUI or the command line. It is essential to configure a management network. This module explains the basic networking terms that you need to know.","topics":["Configuring Networking - Learning Outcomes","Creating and Modifying Networking","Creating & Modifying Virtual Networks Using CLI","Configuring Networking - Lesson Summary","Configuring Networks  - Assessment"]},{"name":"Module","details":"Configuring Storage","description":"To start, this module will introduce you to storage and how it relates to virtual infrastructure. In this module, you will introduce you to storage concepts, the ISCSI Storage, fibre channel devices, VMSF data storage, and your NAN storage. You will also learn about Raw Device Mapping.","topics":["Configuring Storage - Learning Outcomes","Storage Concepts","iSCSI Storage (GUI & Command Line)","Fibre Channel Storage","VMSF Datastores (GUI & Command Line)","NAS Storage and NFS Datastores (GUI & Command Line)","Raw Device Mapping (RDM)","Configuring Storage - Lesson Summary","Configuring Storage - Assessment"]},{"name":"Module","details":"vCenter Server 4.1 Licensing","description":"To start, this module will introduce you to standard licensing, virtual standard installation & inventory when looking for items in the virtual centre. It analyzes managing virtual servers and then planning for the vCenter server deployment. This module further explains how you could troubleshoot the vCenter server, and data-based issues.","topics":["vCenter Server 4.1 Licensing - Learning Outcomes","VMware Licensing","vCenter Server Installation","vCenter Server Inventory","Managing vCenter Server","Planning vCenter Server Deployment","Troubleshooting vCenter Server and Database","vCenter Server 4.1 Licensing - Lesson Summary","vCenter Server 4.1 Licensing - Assessment"]},{"name":"Module","details":"Advanced Diploma in VMware Ultimate Bootcamp vSphere 4.1 - First Assessment","description":"In order to pass this assessment, you will need to score 80 per cent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Advanced Diploma in VMware Ultimate Bootcamp vSphere 4.1 - First Assessment"]},{"name":"Module","details":"VM Creation Configuration, and Snapshots","description":"To start, this module will introduce you to the process of creating a VM. The process of creating multiple VM along with how to make use of templates with contents will be discussed. You will learn about Virtual appliances in making use of your favourite VMware Converter.","topics":["VM Creation Configuration Snapshot - Learning Outcomes","Creating a Virtual Machine","Create Multiple VMs, Templates, & Clones","Virtual Appliances","VMware Converter (P2V - V2V)","Managing VMs","Virtual Machine Startup/Shutdown","Virtual Machine Snapshots","Web Access Management","Virtual Machine Troubleshooting & Best Practices","VM Creation Configuration Snapshot - Lesson Summary","VM Creation Configuration, and Snapshots - Assessment"]},{"name":"Module","details":"Security and Permissions","description":"To start, this module will introduce you to the important process of controlling user access & password. You will also learn about active directory integration, managing firewalls, and SSH access. With ESX only, you will learn how to run elevated privileges, the switch user, the sudo, the set UID.","topics":["Security and Permissions - Learning Outcomes","Controlling User Access and Passwords","ESX/ESXi Active Directory (AD) Integration","Managing Firewalls","SSH Access","Running Elevated Commands (su, sudo, setuid/setgid)","VMsafe and vShield Zones","Security and Permissions - Lesson Summary","Security and Permissions - Assessment"]},{"name":"Module","details":"Server and VM Monitoring","description":"To start, this module will introduce you to Server and VMware monitoring. You will learn about optimizing resources. You will learn how to avoid mistakes when making use of the resources properly and make sure everything fits together. This module explains VMware performance and monitoring.","topics":["Server and VM Monitoring - Learning Outcomes","Optimizing Resources","Performance Monitoring","Configuring Alarms","ESXi/ESX and vCenter Logs","Server and VM Monitoring - Lesson Summary","Server and VM Monitoring - Assessment"]},{"name":"Module","details":"Advanced ESX/ESXi and vCenter Management","description":"To start, this module will introduce you to the advanced management of both the vCenter and your host. This module explains the storage view motions, the maps that are available to you, and configuring the regular standard view motions. You will learn about the DRS and host profiles.","topics":["Advanced ESX/ESX and vCenter Management - Learning Outcomes","Storage Views & Topology Maps","Storage vMotion","Configuring vMotion","Distributed Resource Scheduler (DRS) Cluster","Resource Pools and Monitoring","vNetwork Distributed Virtual Switches","Host Profiles","Linked Mode Group of vCenter Servers","Advanced ESX/ESX and vCenter Management - Lesson Summary","Advanced ESX/ESXi and vCenter Management - Assessment"]},{"name":"Module","details":"Patching and Upgrading ESX/ESXi","description":"To start, this module will introduce you to patching and upgrading your host. It explains how to patch the ESX/ESXi standalone host to enable patching of hosts independently. This module also covers the update manager to enable you to patch not only the host but other systems as well.","topics":["Patching and Upgrading ESX/ESXi - Learning Outcomes","Patching ESX/ESXi Standalone Hosts","Patching with Update Manager","Upgrades and Migrations","Patching and Upgrading ESX/ESXi - Lesson Summary","Patching and Upgrading ESX/ESXi - Assessment"]},{"name":"Module","details":"Disaster Recovery and Backup","description":"To start, this module will introduce you to the Site Recovery Manager (SRM). You will learn about high availability and fault tolerance. This module explains the VCP command-line utilities. You will learn about VMware data recovery as well as some third-party backup solutions.","topics":["Disaster Recovery and Backup - Learning Outcomes","Site Recovery Manager (SRM)","High Availability (HA)","VM Fault Tolerance","Microsoft Clustering","Backup Strategies","Using VCB Command Line Utilities","VMware Data Recovery","Third-Party Backups","Disaster Recovery and Backup - Lesson Summary","Disaster Recovery and Backup - Assessment"]},{"name":"Module","details":"Advanced Diploma in VMware Ultimate Bootcamp vSphere 4.1 - Second Assessment","description":"In order to pass this assessment, you will need to score 80 per cent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Advanced Diploma in VMware Ultimate Bootcamp vSphere 4.1 - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in VMware Ultimate Bootcamp vSphere 4.1 - Final Assessment"]}]}