{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4093","title":"Advanced Features of the Hadoop Ecosystem","totalEnrolled":"259","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Get an in-depth look into the Apache Hadoop ecosystem and its components in this hands-on, free online big data course.","description":"The Hadoop ecosystem is a vital part of big data analytics. Learn how to use its features and components in this free online course. You will explore Sqoop, Hive databases, the Spark ecosystem, Flume, Apache Pig, Scala and even Cloudera. The material combines theory with practice to provide you with practical knowledge through hands-on activities. Ready to take your knowledge of Hadoop to the next level? Enrol now!","courseOutcomes":["Explain how to import incremental da...","Describe how to export incremental d...","Summarize Hive partitioning, bucketi...","Select Hive tables for different fil...","Explain how to import incremental data from RDBMS to HDFS and from RDBMS to Hive","Describe how to export incremental data from Hive to RDBMS and from HDFS to RDBMS","Summarize Hive partitioning, bucketing and indexing","Select Hive tables for different file formats","Outline and develop Pig Latin scripts in Pig","Analyze and schedule the Oozie Workflow using coordinator","Describe Flume integration with HDFS","Explain how to read data from HDFS to Spark 1.x, and how to read and load data from Hive to Spark 1.x using Spark SQL","Explain how to import incremental da...","Describe how to export incremental d...","Summarize Hive partitioning, bucketi...","Select Hive tables for different fil...","Explain how to import incremental data from RDBMS to HDFS and from RDBMS to Hive","Describe how to export incremental data from Hive to RDBMS and from HDFS to RDBMS","Summarize Hive partitioning, bucketing and indexing","Select Hive tables for different file formats","Outline and develop Pig Latin scripts in Pig","Analyze and schedule the Oozie Workflow using coordinator","Describe Flume integration with HDFS","Explain how to read data from HDFS to Spark 1.x, and how to read and load data from Hive to Spark 1.x using Spark SQL"],"courseDescription":"<p>In a world where organizations rely on fast, informed decision-making, big data analytics exists to extract meaningful insights from huge amounts of information. It plays an important role in every field from health and economics to banking, as well as in government; new opportunities and challenges continue to emerge to deal with massive amounts of data. The Apache Hadoop Ecosystem, with its open source components, is designed to answer these needs: to store, process, evaluate, analyze and mine data. Unlike traditional systems, Hadoop handles multiple types of workloads consisting of different types of data, with massive parallel processing using industry-standard hardware.</p><p>Hadoop stores data in the Hadoop distributed file system (HDFS), which is designed to run on standard hardware. HDFS is very fault-tolerant, provides high throughput access to application data and is suitable for applications that have large data sets. This course illustrates how different types of data can be stored on HDFS and how to process it using the various components of the Hadoop ecosystem. Cluster computing frameworks like MapReduce have been widely adopted for large-scale data analytics. Resilient distributed datasets (RDDs) enable efficient data reuse in a broad range of applications. RDDs are fault-tolerant, parallel data structures that let users explicitly persist intermediate results in memory, control their partitioning to optimize data placement, and manipulate them using a rich set of operators.</p><p>Are you interested in big data? Would you like to further your understanding of Hadoop software? This course is for database and dataware house developers, big data developers and architects, data scientists, analysts and any technical personnel who are interested in learning and exploring the features of big data and its tools. With comprehensive lessons guiding you step-by-step and theory to back it up, the course follows with hands-on sessions to get practical experience in Sqoop, Hive, Spark, Flume, Apache Pig and Cloudera. So if you are looking to increase your knowledge of the advanced features of the Hadoop ecosystem, start this free online course today!</p><a href=\"https://alison.com/resume/courses/4093\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4093\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Advanced Features of the Hadoop Ecosystem","description":"This module will cover the software packages used in the Hadoop Ecosystem. You will be introduced to the data transfer tool Sqoop and learn about data storage and performance in Hive, how to execute queries and create Hive tables in different file formats. After this you will cover Oozie workflow action nodes and executing the Pig and Shell action.","topics":["Advanced Features of Hadoop Ecosystem - Learning Outcomes","Working with Sqoop","Working with Hive","Data Storage and Performance in Hive","Working with Pig -Troubleshooting and Optimization","Working with Oozie","Flume Integration with HDFS","Cloudera Administration","Introduction to Scala and Apache Spark","Advanced Features of the Hadoop Ecosystem - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Advanced Features of Hadoop Ecosystem"]}]}