{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2516","title":"Advanced Diploma in Cryptography","totalEnrolled":"2,955","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain an in-depth understanding of the concept of Cryptography primitives in this online cryptography training course.","description":"In this free online Cryptography course, you will learn about the relevant and fundamental practices involved in securing computer systems and data. You will also learn about the practical instantiations of Cryptographic Primitives, their proofs, and the applications of each of those primitives. This course will benefit anyone who is looking to pursue a career in Cryptography or those who want to improve the security of their systems and data.","courseOutcomes":["Outline the advanced applications of...","Discuss the practical instantiations...","Explain how to onstruct CPA-secure c...","Describe the theoretical and practic...","Outline the advanced applications of Cryptography","Discuss the practical instantiations of Pseudorandom Generators","Explain how to onstruct CPA-secure ciphers using pseudorandom functions","Describe the theoretical and practical constructions of Block Ciphers","Design Message Authentication Codes using Hash Functions","Explain the concept of Authenticated Encryption","Outline the applications of the Padded RSA Public-Key Cryptosystem","List the properties of the Zero-Knowledge Proof Protocol","Outline the advanced applications of...","Discuss the practical instantiations...","Explain how to onstruct CPA-secure c...","Describe the theoretical and practic...","Outline the advanced applications of Cryptography","Discuss the practical instantiations of Pseudorandom Generators","Explain how to onstruct CPA-secure ciphers using pseudorandom functions","Describe the theoretical and practical constructions of Block Ciphers","Design Message Authentication Codes using Hash Functions","Explain the concept of Authenticated Encryption","Outline the applications of the Padded RSA Public-Key Cryptosystem","List the properties of the Zero-Knowledge Proof Protocol"],"courseDescription":"<p>This free online Cryptography training course highlights the increasing need for knowledge about the security of systems and data in this modern digital age. You will learn about the paradigms and principles of modern Cryptography as well as the formal security definitions and constructions of various cryptographic primitives such as Message Authentication Codes, Hash Functions, Digital Signatures and more. The advanced applications of Cryptography will be outlined in the first section of the course. You will learn about the syntax and security definitions of the Symmetric-Key Encryption Scheme. The notion of Perfect Security and its limitations will also be discussed in this section.</p><p>Next, you will be introduced to the concepts of computational security where you will study the security properties of Pseudo-Random Generators and Stream Ciphers. You will also consider the practical and theoretical instantiations of Pseudo-Random Generators and the different modes of operations of Block Ciphers. Thereafter, you will learn about the applications of Message Authentication Codes and Cryptographic Hash functions. You will learn how to construct different security ciphers with the use of message authentication codes and cryptographic hash functions. In the next section, you will learn about the properties and various types of Cyclic Groups. You will also consider the relevance of this cryptographic primitive in the security of data.</p><p>Lastly, you will learn about the features of the Public key Cryptosystem and its various models. You will study the principles of Identification Schemes, Signature Schemes, Number Theory and Zero Knowledge Protocols; all of which are part of the Asymmetric-Key Encryption Scheme. This course is a great starting point for anyone who is looking to pursue a career in Cryptography or Cybersecurity. It will also be highly relevant to those who want to learn to improve the security of their systems and data. Why wait, start this course today!</p><a href=\"https://alison.com/resume/courses/2516\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2516\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Symmetric Key Cryptography","description":"This module presents an introduction to the science of Cryptography. It discusses the importance of cryptography and its relevance in the context of the current digital age. You will learn about the features of symmetric key cryptography such as perfect security, stream ciphers, message authentication codes and more.","topics":["Symmetric Key Cryptography - Learning Outcomes","Introduction to Cryptography","Symmetric Key Encryption","Cryptanalysis of Historical Ciphers","Perfect Security","Limitations of Perfect Security","Symmetric Key Cryptography - Lesson Summary"]},{"name":"Module","details":"Computational Security","description":"In this module, the approaches that are currently in use in modern cryptography will be discussed. Semantic security in the context of various cybersecurity attack models will be defined. You will also be introduced to reduction-based proofs and pseudo-random generators.","topics":["Computational Security - Learning Outcomes","Introduction to Computational Security","Semantic Security","Pseudo-random Generators","Operations on Pseudo-random Generators","Computational Security - Lesson Summary"]},{"name":"Module","details":"Pseudo-random Generators","description":"In this module, the theoretical and practical instantiations of pseudo-random generators will be explained. You will also learn about the concept of one-way functions and the significance of pseudo-random functions in designing symmetric-key primitives.","topics":["Pseudo-random Generators - Learning Outcomes","Provably Secure Instantiation of PRGs","Practical Instantiation of PRGs","CPA Security","Pseudo-random Functions","CPA Secure Encryption from PRF","Pseudo-random generators - Lesson Summary"]},{"name":"Module","details":"Block Ciphers","description":"In this module, you will learn the various modes of operations of Block Ciphers that can be used to construct efficient cypher-plaintext-attack secure ciphers. The theoretical and practical constructions of Block Ciphers will also be explained.","topics":["Block Ciphers - Learning Outcomes","Modes of Operations of Block Ciphers","Output Feedback Mode and Counter Mode","Theoretical Construction of Block Ciphers","Practical Construction of Block Ciphers","Data Encryption Standard Architecture","Passive and Active Adversary","Block Ciphers - Lesson Summary"]},{"name":"Module","details":"Message Authentication Codes","description":"This module discusses how to achieve message integrity and authenticity with the use of Message Authentication Codes. You will learn about the various ways of constructing these cryptographic primitives to carry out various functionalities and the principles of Information-theoretic message authentication codes.","topics":["Message Authentication Codes - Learning Outcomes","Message Integrity and Authentication","Message Authentication Codes for Long Messages","Block-wise Fully-Secure CBC","Information Theoretic Secure MACs","Construction of Information Theoretic Secure MACs","Message Authentication Codes - Lesson Summary"]},{"name":"Module","details":"Cryptographic Hash Functions","description":"In this module, you will also learn about the various applications of cryptographic hash functions and how to construct different kinds of this cryptographic primitive. Some generic attacks on hash functions and how to prevent them will be discussed. The principles of the Random Oracle Model will also be explained.","topics":["Cryptographic Hash Functions - Learning Outcomes","Introduction to Cryptographic Hash Functions","Constructing Fixed Length Compression Functions","Message Authentication Using Hash Functions","Hash Function Attacks and Applications","Random Oracle Model","Hash Functions in the Random Oracle Model","Cryptographic Hash Functions - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Cryptography - First Assessment","description":"This module is the first assessment, which enables you to review your learning so you can determine your knowledge and understanding of module 1 - 6 of the course.","topics":["First Assessment"]},{"name":"Module","details":"Cyclic Groups","description":"In this module, the definitions and properties of cyclic groups will be discussed. You will also learn the various cryptographic hardness assumptions in cyclic groups, the features of the prime-order cyclic groups and the elliptic-curve based cyclic groups.","topics":["Cyclic Groups - Learning Outcomes","Introduction to Cyclic Groups","Cryptographic Hardness Assumptions","Candidate Cyclic Groups","Cyclic Groups based on Elliptic Curves","Discrete Logarithm Assumptions","Public-Key Cryptosystems","Cyclic groups - Lesson Summary"]},{"name":"Module","details":"Authenticated Encryption Schemes","description":"In this module, learn about the definitions and implications of authenticated encryption. The objectives of secure communication will be outlined and you will learn how to compose CPA-secure ciphers. The properties of key exchange protocols will also be highlighted.","topics":["Authenticated Encryption Schemes - Learning Outcomes","Authenticated Encryption","Composing CPA Secure Cipher and Secure MAC","Other Approaches for Authenticated Encryption","Key Exchange Protocols","Generic Constructions of Key Exchange Protocol","Authenticated Encryption Schemes - Lesson Summary"]},{"name":"Module","details":"Public-key Cryptosystem","description":"In this module, the concepts of public-key encryption are introduced. You will learn about the origins of public-key cryptography and its underlying architecture and syntax. The various schemes that are based on the public key cryptosystem will also be analyzed.","topics":["Public Key Cryptosystem - Learning Outcomes","RSA Public-Key Cryptosystem","CCA Secure Public-Key Ciphers","RSA Assumption","El Gamal Encryption","Hybrid Public-Key Cryptosystem","Public-Key Cryptosystem - Lesson Summary"]},{"name":"Module","details":"Public-Key Ciphers","description":"In this module, learn about chosen-ciphertext-security for public-key cryptosystems. Public key ciphers, which are based on various security models, will also be discussed.","topics":["Public-Key Ciphers - Learning Outcomes","CCA-Insecurity","Plain RSA Cipher","Digital Signatures","RSA Signatures","Identification Schemes","Public-Key Ciphers - Lesson Summary"]},{"name":"Module","details":"Identification Schemes and Zero-knowledge Protocol","description":"In this module, you will be introduced to the various identification schemes and their properties. You will also learn about the concept of zero-knowledge protocols and their applications.","topics":["Identification Schemes and Zero-Knowledge Protocol - Learning Outcomes","Fiat-Shamir Transformation","Modular Arithmetic","Secret Sharing","Zero-Knowledge Protocols","NP-Complete Class","Identification Schemes and Zero-Knowledge Protocol - Lesson Summary"]},{"name":"Module","details":"Advanced Diploma in Cryptography - Second Assessment","description":"This module is the second assessment, which enables you to review your learning so you can determine your knowledge and understanding of module 7 - 11 of the course.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Cryptography - Course Assessment"]}]}