{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3970","title":"Advanced Photo Editing and Exporting","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Level-up your photo editing skills to advanced using Adobe Photoshop and Adobe Lightroom with this free online course.","description":"Adobe Lightroom and Photoshop are two very popular and powerful software packages that are used to edit and export images across the photography and design industries. This free online advanced photo editing course will equip you with many advanced enhancing techniques like sun flare and Orton effects along with tips for photo exposure, blending and object removal, which you can use to export for platforms such as social media and printing.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Photographers and designers rely on Adobe Lightroom and Adobe Photoshop for large portions of their work and it always helps to have extra knowledge and skills in order to create even more professional images and artwork. This free online Adobe Photoshop certification begins by showing you how to use the clone tool to blend even distorted parts of an image, and also how to heal images with the heal tool. The many import presets options in Adobe Lightroom are covered as well as how to import presets into Lightroom, how to create your own presets, and update and manage them. Learning dodging and burning techniques are covered before you delve deep into creating dreamy landscapes with Orton effects in Lightroom and other tools such as the graduated filter tool and sun flare effect.</p><p>Exporting for purpose is extremely important because images need to be optimal for social media, print, online documents, web design etc. These specifications and settings when used correctly make the world of difference and you will learn about the best respective settings for PNG, DNG, TIFF, JPG/JPEG, and lastly the PSD format which is Photoshop’s own format. Photoshop has many great features that can take your skills from beginner to advanced such as blending and exposure blending, how to blend daytime and nighttime images, how to merge images, removing objects in an image as well as some great tools such as the lasso tool, spot healing brush, and the clone stamp tool.</p><p>Knowing the ins and outs of Adobe Photoshop and Lightroom on an advanced level can make a great difference to your photo editing process and how efficient you are in creating artwork for various reasons. Exploring the tools in this Adobe Lightroom tutorial can equip you to make eye-catching creations for use on many platforms which has a direct impact on your career ambitions. Whether you are passionate about social media, print or web design, these skills can be applied across all industries and all you need to do is enrol for this exciting course and choose the niche you want to be in as a creative.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}