{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2331","title":"Advanced Knowledge Representation and Reasoning","totalEnrolled":"1,075","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the methods of knowledge representation, computational learning and reasoning in this free online course.","description":"Knowledge representation and reasoning is an essential aspect of artificial intelligence. This free online course describes the several methods of knowledge representation and reasoning, approaches to computational learning, the order of logics, and the areas of applications of processes within the domain of cognitive reasoning. By the end of this course, you will become better informed about the logic behind computational logic and reasoning.","courseOutcomes":["Describe resolutions for ground clau...","List the different types of resoluti...","Discuss resolutions refutation proof...","Describe the concept of soundness an...","Describe resolutions for ground clauses and resolvents","List the different types of resolution rules","Discuss resolutions refutation proof systems","Describe the concept of soundness and completeness","Explain the answering of queries in first order logic","Describe resolutions for ground clauses and resolvents","List the different types of resolution rules","Discuss resolutions refutation proof systems","Describe the concept of soundness and completeness","Describe the answering of queries in first order logic","Explain the answer extraction process in first order logic","Discuss the infinite resolution branch in the procedural control of reasoning","Describe resolutions for ground clau...","List the different types of resoluti...","Discuss resolutions refutation proof...","Describe the concept of soundness an...","Describe resolutions for ground clauses and resolvents","List the different types of resolution rules","Discuss resolutions refutation proof systems","Describe the concept of soundness and completeness","Explain the answering of queries in first order logic","Describe resolutions for ground clauses and resolvents","List the different types of resolution rules","Discuss resolutions refutation proof systems","Describe the concept of soundness and completeness","Describe the answering of queries in first order logic","Explain the answer extraction process in first order logic","Discuss the infinite resolution branch in the procedural control of reasoning"],"courseDescription":"<p>Knowledge representation and reasoning is an important area of artificial intelligence concerned with the symbolic representation of knowledge in an automated way by reasoning programs. This free online course on Advanced knowledge representation and reasoning will explain to you in detail the contribution of thinking to intelligent behaviour. You will be introduced to the concept of logic, psychology and philosophy of reason. The course focuses on how humans are able to behave intelligently and apply knowledge appropriately to adapt to their environment.</p><p>The course begins by explaining the use of declarative semantics in first-order logic. The course describes conceptualization as a field of study in artificial intelligence and how satisfiability is often regarded as a notion of truth. You will learn about the formulation of knowledge in a descriptive way and the underlying principles that guide the development of knowledge formula. You will study the roles of axiom in artificial intelligence and the use of models in knowledge representation.</p><p>This free online course then discusses the rules of inferences, theorems and proofs in knowledge representation. You will study the relationship between existential and universal generalization. You will also get to know more about the concept of soundness and completeness. This course will be of great advantage to computer science professionals with a keen interest in computation behavior. Get started today and be well equipped with the required knowledge to thrive in the world of artificial intelligence.</p><a href=\"https://alison.com/resume/courses/2331\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2331\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Knowledge Representation and Reasoning: First Order Logic","description":"In this module, you will learn about how first order logic also called predicate logic for first order predicate calculus is a language co-opted by the artificial intelligence community for knowledge representation purposes.","topics":["Knowledge Representation and Reasoning: First Order Logic - Learning Outcomes","First Order logic I","First Order Logic II","Knowledge Representation and Reasoning: First Order Logic - Lesson Summary"]},{"name":"Module","details":"Knowledge Representation and Reasoning: Inference in First Order Logic","description":"In this module, you will learn how inferences are used as a process of arriving at new sentences from existing sentences. You will also learn about how conceptualization consists of the objects functions and relations.","topics":["Knowledge Representation and Reasoning: Inference in First Order Logic - Learning Outcomes","Inference in First Order Logic I","Inference in First Order Logic II","Answer Extraction","Procedural Control of Reasoning","Knowledge Representation and Reasoning: Inference in First Order Logic - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Knowledge Representation and Reasoning - Assessment"]}]}