{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4258","title":"Advanced Features in Microsoft PowerPoint","totalEnrolled":"1,547","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become expert in Microsoft PowerPoint by mastering some of its advanced features with this free online course.","description":"This free online course shows you how to use some of Microsoft PowerPoint‘s advanced features. We take you beyond the ordinary features of the program to some of its more high-level capabilities that can make your presentations more engaging and lively. This course suits anyone who often meets clients or students and would like to captivate their audience with advanced presentation skills.","courseOutcomes":["Explain customizing the status bar o...","Compare contents on slides by creati...","Outline how to configure the program...","Discuss how to create a ‘SmartArt’ g...","Explain customizing the status bar of your PowerPoint 2016 to suit your specific needs","Compare contents on slides by creating multiple presentation windows","Outline how to configure the program to automatically save your work after specific time intervals","Discuss how to create a ‘SmartArt’ graphic and insert a mathematical equation","Arrange sections in your presentation and organize your slides","Compare and merge slides in PowerPoint 2016","Describe how to use the ‘annotation’ tool to improve the quality of your presentation","Select action buttons to a slide show to help your audience navigate some of the slides by themselves","Summarize some of the important points to consider while presenting a live broadcast","Explain customizing the status bar o...","Compare contents on slides by creati...","Outline how to configure the program...","Discuss how to create a ‘SmartArt’ g...","Explain customizing the status bar of your PowerPoint 2016 to suit your specific needs","Compare contents on slides by creating multiple presentation windows","Outline how to configure the program to automatically save your work after specific time intervals","Discuss how to create a ‘SmartArt’ graphic and insert a mathematical equation","Arrange sections in your presentation and organize your slides","Compare and merge slides in PowerPoint 2016","Describe how to use the ‘annotation’ tool to improve the quality of your presentation","Select action buttons to a slide show to help your audience navigate some of the slides by themselves","Summarize some of the important points to consider while presenting a live broadcast"],"courseDescription":"<p>Of all the productivity tools on the market, Microsoft Office Suite is among the most popular as it is dynamic, easy to learn and useful in almost every area of business and communication. The suite usually comes with a couple of programs, most commonly Word, Excel and PowerPoint. Many curriculum vitae (CVs) and resumes suggest that candidates are ‘proficient’ in PowerPoint but most people only know the program’s basic functions and not as much as you would expect someone who is ‘proficient’ to know. This free online course helps you move past basic PowerPoint functions and keeps you abreast with its newer features, including those contained in the Microsoft 2019/365 suite. Skill use of PowerPoint offers you a great advantage on the job market because of its many uses and this course can help you become a power user of the program.</p><p>We begin with an overview of what to expect in the course before showing you how to customize PowerPoint 2016’s user interface. We then explain how to work with multiple windows simultaneously and how to change the program’s options to suit your needs. Do you know that you can modify slide masters and slide layouts in PowerPoint? The course explores such features and demonstrates how to create a custom slide layout, add headers and footers and modify the ‘notes master’ and ‘handout master’. We then take you through the steps required to create and modify ‘SmartArt’ graphics or add and write maths equations. You will learn how to perform some media and animation functions such as adding audio and video to a presentation, setting video playback options and customizing animations and transitions. Do you know that you can collaborate, add and manage comments on a presentation? This course demonstrates the use of these interesting functions. We conclude by teaching you how to secure and distribute your presentations and examine some exciting new features exclusive to PowerPoint 365.</p><p>Microsoft PowerPoint is a great communication tool that can be used to win over prospective clients and keep students riveted. It is very useful if you are looking to create a visual depiction of abstract ideas or want to explain how well your product performs, providing a boost to business executives seeking investors. Do you want to learn a valuable new skill? This course can take you from being a mere user of PowerPoint to becoming an expert so sign up to master its advanced features and become truly ‘proficient’.</p><a href=\"https://alison.com/resume/courses/4258\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4258\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Modifying and Customizing PowerPoint","description":"In this module, you will learn how to modify the PowerPoint environment, customize design templates, add SmartArt and Math equations to a presentation as well as work with media and animation.","topics":["Modifying and Customizing PowerPoint - Learning Outcomes","Modifying the PowerPoint Environment","Customizing Design Templates","Adding SmartArt and Math Equations to a Presentation","Working with Media and Animations","Modifying and Customizing PowerPoint - Lesson Summary"]},{"name":"Module","details":"Presentations and Slideshows in PowerPoint","description":"In this module, you will learn about some exciting new features of PowerPoint such as collaborating on a presentation, customizing a slideshow as well as securing and distributing a presentation. You will also learn about some of the newer features of Microsoft PowerPoint - especially the 2019/365 version.","topics":["Presentations and Slideshows in PowerPoint - Learning Outcomes","Collaborating on a Presentation","Customizing a Slideshow","Securing and Distributing a Presentation","What's New in PowerPoint 2019/365","Presentations and Slideshows in PowerPoint - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Features in Microsoft PowerPoint - Course Assessment"]}]}