{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4692","title":"Advanced iOS Programming","totalEnrolled":"411","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online programming course takes you through all aspects of tailoring iOS for your mobile clients’ needs.","description":"Over the past decade, there has been an increase in the demand for iOS app developers due to more companies adopting a mobile-first approach. iOS developers must be well-versed in iOS and how it interacts with various Apple devices, as well as be able to tailor their applications to their clients’ needs. In this course, we've gathered essential knowledge and resources to help you understand how to excel at iOS mobile development.","courseOutcomes":["Discuss the principles of geocoding...","Distinguish between latitude and rev...","Generate more annotations for the ma...","Select data from the accelerometer a...","Discuss the principles of geocoding","Distinguish between latitude and reverse latitude","Generate more annotations for the map","Select data from the accelerometer and compass","Describe the features of the CloudKit and recall its setting up procedures","Distinguish between the various purchase types","Discuss the roles receipts play in in-app purchasing","Discuss the principles of geocoding...","Distinguish between latitude and rev...","Generate more annotations for the ma...","Select data from the accelerometer a...","Discuss the principles of geocoding","Distinguish between latitude and reverse latitude","Generate more annotations for the map","Select data from the accelerometer and compass","Describe the features of the CloudKit and recall its setting up procedures","Distinguish between the various purchase types","Discuss the roles receipts play in in-app purchasing"],"courseDescription":"<p>Do you want to learn how to create applications for iOS and Apple devices? This course provides advanced skills and methods for coding iOS applications. We begin by teaching you how to access remote data using JSON, and read and parse data using the PHfetch result. Learn how to perform various iOS media operations such as recording videos, audios, and playing recordings. Then see how to use the ImagePicker to select and capture images from the library and how to access the iOS media library.</p><p>You will also learn how to configure the iOS GPS and mapping system, how to program an application that converts physical street addresses into latitude and longitude using geocoding, and how to calculate distance using the MapKit. Study how to obtain users' current location, and how to get users' motion data using the accelerometer, gyroscope, and compass. Discover numerous social networking capabilities in an iOS app that uses the UIActivityViewController and SLRequest, and learn how to use the Facebook SDK. Finally, we will show you how to set up CloudKit and produce hosted content, as well as how to configure the iOS in-app purchase option and set up iAD.</p><p>This course is a perfect tool for programmers who want to learn how to create apps for iOS devices. It will set you apart from the crowd by assisting you in mastering JSON coding, providing you with a competitive advantage. The material covers remote data access, conducting media operations, GPS and mapping systems, writing a program that posts to several social networks using SLRequests, and configuring in-app purchasing and iAD. Enroll today and you'll be ready to code in no time.</p><a href=\"https://alison.com/resume/courses/4692\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4692\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Remote Data Access and iOS Media","description":"In this module, you will be introduced to remote data access and JSON. You will learn to parse JSON into objects that applications can use, read JSON files locally, and how to retrieve the data from a remote service. You will also learn how to create an image gallery, play, and record videos as well as how to access users' media libraries.","topics":["Remote Data Access and iOS Media - Learning Outcomes","iOS Remote Data Access","OS Media - Part One","iOS Media - Part two","Remote Data Access and iOS Media - Lesson Summary"]},{"name":"Module","details":"iOS GPS Mapping and Motion Framework","description":"In this module, you'll learn how to get GPS and map data, display maps, and get directions. You'll also learn about geocoding and the map kit tool, as well as how to use location services, calculate distances and display your current location. You'll learn how to use the motion framework and get data from the accelerometer and gyroscope.","topics":["iOS GPS Mapping and Motion Framework - Learning Outcomes","iOS GPS and Mapping Part One","iOS GPS and Mapping - Part Two","iOS Motion Framework","iOS GPS Mapping and Motion Framework - Lesson Summary"]},{"name":"Module","details":"iOS Social Networking, CloudKit and In-App Purchasing","description":"In this module, you be introduced to social networking options and you will learn the steps needed to set up Cloud kit, you will learn about in-app purchasing, purchase types, and how to make purchase flow. You will also learn how to validate receipts and how to make money using iAd.","topics":["iOS Social Networking, and CloudKit  - Learning Outcomes","iOS Social Networking","iOS CloudKit","iOS In-App Purchasing - Part One","iOS In-App Purchasing Part Two","iOS Social Networking, and CloudKit - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced iOS Programming - Course assessment"]}]}