{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2351","title":"Advanced Diploma in Introduction to Internet of Things","totalEnrolled":"5,924","courseIncludes":["20-30 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Obtain a diploma and learn the fundamentals of Internet of Things IOT and programming in this free online course.","description":"This course about the Internet of Things (IOT), will be of great interest to students and individuals who have requisite background knowledge of networking and computer programming. The course describes the fundamental concepts behind the IOT as well as its applications in computer programming . By the end of this course, you will be able to use some concepts of the Internet of Things to solve computational problems using real-life scenarios.","courseOutcomes":["Discuss the different fundamental co...","Explain functionality-based IoT prot...","Analyze machine-to-machine communica...","Discuss Python and Python IDE and li...","Discuss the different fundamental concepts behind the internet of things","Explain functionality-based IoT protocol organization","Analyze machine-to-machine communication as an important concept in building internet of things","Discuss Python and Python IDE and list some of their features","Define data fusion","Explain Vehicle-to-Everything (V2X) paradigm","Discuss the different fundamental co...","Explain functionality-based IoT prot...","Analyze machine-to-machine communica...","Discuss Python and Python IDE and li...","Discuss the different fundamental concepts behind the internet of things","Explain functionality-based IoT protocol organization","Analyze machine-to-machine communication as an important concept in building internet of things","Discuss Python and Python IDE and list some of their features","Define data fusion","Explain Vehicle-to-Everything (V2X) paradigm"],"courseDescription":"<p>This IOT course begins by explaining the various fundamental concepts behind the internet of things (IoT) and an overall understanding of how an internet of things is created. You will be learning some connectivity terminologies. This course will teach you about network configuration of the internet of things and gateways as well as some essential building blocks of the Internet of Things including sensors and actuators. You will also learn about the types of sensors, their features and their different functionalities.</p><p>The course content will then explain some applications of sensor networks and the concept of coverage in sensor networks. You will also be introduced to the concepts of mobility and machine to machine communication, the basics of Software-Defined Networking (SDN) and how it can be used in the context of the internet of things. You will also be learning the fundamentals of cloud computing.</p><p>This Internet of Things diploma course will introduce you to the python programming language, Raspberry Pi and its importance in the development of the internet of Things. You will learn about the architecture of fog computing. You will also learn about how IOT can help in building smart cities and smart homes. This course is for everyone who wants to obtain a Diploma in the fundamentals of the Internet of Things and programming. Why wait, learn some new skills today!</p><a href=\"https://alison.com/resume/courses/2351\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2351\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Overview of Internet of Things","description":"In this module, you will be introduced to different fundamental concepts behind the internet of things. You will also be introduced to the networking aspects and the essential building blocks of the internet of things.","topics":["Overview of Internet of Things - Learning Outcomes","Introduction to IoT","Basics of Internet of Things","Sensing","Actuation","Overview of Internet of Things - Lesson Summary"]},{"name":"Module","details":"Networking and Connectivity","description":"In this module, you will be introduced to the various protocols used different purposes in the Internet of Things. You will also be introduced to the protocols used for communication and networking of the internet of things.","topics":["Networking and Connectivity - Learning Outcomes","Basics of IoT Networking","IoT Protocols","Communication Protocols","Advanced Message Queuing Protocol","Networking and Connectivity - Lesson Summary"]},{"name":"Module","details":"Connectivity Technologies","description":"In this module, you will be introduced to technologies such as hart and wireless HART and Bluetooth technology as a tool for building IoT connectivity. You will also be introduced to the basic concepts in sensor networks.","topics":["Connectivity Technologies - Learning Outcomes","Connectivity Technologies","6LoWPAN and RFID protocols","Wireless HART","Bluetooth Technology","Z-wave","Connectivity Technologies - Lesson Summary"]},{"name":"Module","details":"Sensor Networks","description":"In this module, you will be introduced to some applications of sensor networks and the concept of coverage in sensor networks. You will also be introduced to the concepts of mobility and machine to machine communication.","topics":["Sensor Networks - Learning Outcomes","Concepts of Sensor Networks","Node Behaviour","Applications of Sensor Networks","Coverage","Mobile Sensor Networks","UAV Networks","Machine to Machine Communication","Sensor Networks - Lesson Summary"]},{"name":"Module","details":"Interoperability and Arduino Programming","description":"In this module, you will be introduced to interoperability in the Internet of Things (IoT). You will also be introduced to the basics of Arduino programming and the integration of sensors and actuators with the Arduino platform.","topics":["Interoperability and Arduino Programming - Learning Outcomes","Interoperability in Internet of Things","Introduction to Arduino","Integration of Sensors and Actuators with Arduino","Interoperability and Arduino Programming - Lesson Summary"]},{"name":"Module","details":"Diploma in Introduction to Internet of Things - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Introduction to Internet of Things - First Assessment"]},{"name":"Module","details":"Python Programming and Raspberry Pi","description":"In this module, you will be introduced to the python programming language. You will also be introduced to Raspberry Pi, its importance in the development of Internet of Things and the implementation of IoT with Raspberry Pi.","topics":["Python Programming and Raspberry Pi - Learning Outcomes","Introduction to Python Programming","Python Programming Applications","Introduction to Raspberry Pi","Implementation of IoT with Raspberry Pi","Overview of Implementation with Raspberry Pi","Python Programming and Raspberry Pi - Lesson Summary"]},{"name":"Module","details":"Software-Defined Networking & Cloud Computing","description":"In this module, you will be introduced to the fundamentals of Software-Defined Networking (SDN) and how it can be used in the context of internet of things. You will also be introduced to the basics of cloud computing.","topics":["Software-Defined Networking & Cloud Computing - Learning Outcomes","Software-Defined Networking","Controller Placement","Software-Defined IoT Networking","Fundamentals of Cloud Computing","Cloud Computing Service Models","Service Management and Security in Cloud Computing","Software-Defined Networking & Cloud Computing - Lesson Summary"]},{"name":"Module","details":"Introduction to Sensor Cloud","description":"In this module, you will be introduced to sensor cloud technology which is popular for the development of IoT environments. You will also be introduced to the fundamentals of an open-source platform known as OpenStack.","topics":["Introduction to Sensor Cloud  - Learning Outcomes","Cloud Computing - Practical","Sensor Cloud","Issues of Sensor Cloud","Introduction to Sensor Cloud - Lesson Summary"]},{"name":"Module","details":"Fog Computing and Smart Cities","description":"In this module, you will be introduced to the fundamentals of fog computing as well as the architecture of fog computing. You will also learn about how IoT can help in building smart cities and smart homes.","topics":["Fog Computing and Smart Cities - Learning Outcomes","Fog Computing","Introduction to Smart Cities","Issues in Smart Cities","Smart Homes","Fog Computing and Smart Cities - Lesson Summary"]},{"name":"Module","details":"Connected Vehicles and Smart Grid","description":"In this module, you will be introduced to the concept of connected vehicles and intelligent connected vehicles. You will also be introduced to the fundamentals of smart grid and its different challenges and facets.","topics":["Connected Vehicles and Smart Grid - Learning Outcomes","Connected Vehicles","Intelligent Connected Vehicles","Smart Grid","Facets of Smart Grid","Connected Vehicles and Smart Grid - Lesson Summary"]},{"name":"Module","details":"Diploma in Introduction to Internet of Things - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Introduction to Internet of Things - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Introduction to Internet of Things - Final assessment"]}]}