{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3367","title":"Amazon Web Services: Basic","totalEnrolled":"8,623","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers identity access management, VPC security, content delivery and AWS best practices.","description":"The best way to use the Amazon Web Service offering is by having a comprehensive knowledge of these services and how to manipulate them to meet your needs. This free online course will aid you in launching several EC2 (elastic computing) instances and get familiar with other services of AWS. It will also teach you what is needed to keep your account and resources fully secured.","courseOutcomes":["Discuss the history of Amazon Web Se...","Outline the functions of EC2, LightS...","State the procedures for creating an...","State the process for creating diffe...","Discuss the history of Amazon Web Services","Outline the functions of EC2, LightSail, Elastic Beanstalk and Lambda batch processing","State the procedures for creating and setting up a root account and a user in AWS","State the process for creating different types of group in the Amazon IAM","List IAM best practices","Distinguish between security groups and network ACL (access control list)","Recall and mask the failure of an instance or software using the elastic IP","Recall and create a connection between the VPC and another AWS service without requiring access over the Internet or through a NAT device or gateway","List the five Route 53 routing policies","Analyze the procedure for attaching EBS (elastic block store) volumes and show how to detach a volume and add to another EC2","Discuss the history of Amazon Web Se...","Outline the functions of EC2, LightS...","State the procedures for creating an...","State the process for creating diffe...","Discuss the history of Amazon Web Services","Outline the functions of EC2, LightSail, Elastic Beanstalk and Lambda batch processing","State the procedures for creating and setting up a root account and a user in AWS","State the process for creating different types of group in the Amazon IAM","List IAM best practices","Distinguish between security groups and network ACL (access control list)","Recall and mask the failure of an instance or software using the elastic IP","Recall and create a connection between the VPC and another AWS service without requiring access over the Internet or through a NAT device or gateway","List the five Route 53 routing policies","Analyze the procedure for attaching EBS (elastic block store) volumes and show how to detach a volume and add to another EC2"],"courseDescription":"<p>‘Amazon Web Services: Basic’ is a free online course that has been specially prepared to take you through AWS’s core services around management tools, migration, database storage and security. The material is detailed yet easy to comprehend. AWS is the world’s most comprehensive and broadly adopted cloud platform. It provides cloud services from data centres and multiple availability zones (AZs) spread across the world. This course outlines AWS’s global infrastructure, the regions in which it is located as well as some of the typical customers. You will learn how to migrate data without having to move from platform to platform. You will also see how to move your database from onsite to AWS and from one region to the other using the database migration services. This course covers the different support plans and various ways to access the support provided by Amazon. If you want to learn how to turn your infrastructure into code, you will need to complete this course.</p><p>When creating and setting up an AWS account, it is important to understand the security services needed to keep your account safe, and AWS provides many ways to keep your account secured. Did you know that it is possible to assign a role to a user from another AWS account and give access to your AWS account? This course illustrates how to add users and assign roles in AWS. Monitoring your activities on identity access management (IAM) will be much easier to do when you apply the best practices covered by the material. Services in AWS require that you provide credentials when you access them as this helps these services determine whether you have permissions to access the resources that are owned by that service. The AWS management console requires that you enter your password and you can create access keys for your account to access the AWS command line interface (AWS CLI) or API. This course will teach you how to create access keys and delete access keys.</p><p>Furthermore, setting up your network in AWS can be very confusing and, if not done correctly, can cause your resources to be open to the public. Most of your resources are stored on a virtual private cloud (VPC) so you have to ensure it is set up correctly so that resources are secure and can communicate internally through the Internet. This course illustrates the VPC and how it works. You will also learn about Route 53 and its policies. If you complete this course, you will be able to set up your first virtual network with very little or no supervision. AWS has many types of EC2 (elastic computing) instances: if you need high CPU power, lots of RAM or storage, AWS may have the right instance to meet your needs. In this course, you will learn how to launch several very useful EC2 instances.</p><a href=\"https://alison.com/resume/courses/3367\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3367\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Amazon Services and Support","description":"In this module, you will learn about the history of amazon web services( AWS), AWS global infrastructure and the located regions. This module outlines the features used for the core services in the AWS and the AWS application services. It explores the different amazon support plans.","topics":["Amazon Services and Support - Learning Outcomes","Overview of AWS","Core Services","Services Continued","Amazon Support","Amazon Services and Support - Lesson Summary","Amazon Services and Support - Assessment"]},{"name":"Module","details":"Creation, Security, and Best Practices","description":"This module analyzes the step by step procedures for creating and setting up an AWS account. It explores the IAM section and how to manipulate it to get your desired result; adding policies, groups or users. This module covers the best practices of IAM.","topics":["Creation, Security, and Best Practices - Learning Outcomes","Creating an AWS Account","Security Services","IAM (Identity Access Management)","Roles, Policies and Best Practices","Creation, Security, and Best Practices - Lesson Summary","Creation, Security, and Best Practices - Assessment"]},{"name":"Module","details":"Net and Content Delivery","description":"In this module, you will learn about the overview of virtual private cloud( VPC). It analyzes route 53 (RTS) and its policies. This module explores the NAT gateways ( Network address translation ), how to put the NAT in a public subnet and creating a route to the NAT gateway. It distinguishes between security groups and network ACL.","topics":["Net and Content Delivery - Learning Outcomes","Net and Content Delivery","RTS ( Route 53)","VPC ( Virtual Private Cloud)","VPC Security","Net and Content Delivery - Lesson Summary","Net and Content Delivery - Assessment"]},{"name":"Module","details":"Storage and Object Lifecycles","description":"This module discusses AWS storage; how to create buckets and objects. It explores the components and structure of the S3. This module analyzes storage classes in S3 and their individual attributes. It takes you through the pricing/cost in the AWS storage.","topics":["Storage and Object Lifecycles - Learning Outcomes","Storage Overview","Object Lifecycle, Versioning, and Permissions","Storage and Object Lifecycles - Lesson Summary","Storage and Object Lifecycles - Assessment"]},{"name":"Module","details":"EC2 (Elastic Computing)","description":"This module illustrates hands-on practicals on how to launch several EC2 instances. you will be taken through an overview of EC2. It analyzes amazon machine images (AMI’s)and what it is comprised of. This module outlines the categories of amazon machine images. You will learn about elastic block store (EBS) and snapshots.","topics":["EC2 - Learning Outcomes","EC2 Overview","Instance Types and AMI","EBS and Snapshots","Launch an EC2","EC2 - Lesson Summary","EC2 (Elastic Computing) - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Amazon Web Services ; Basic - Final Assessment"]}]}