{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3394","title":"Amazon Web Services: Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free training course covers the operations of auto scaling and other services in AWS with certification available.","description":"This intermediate-level course on Amazon Web Services (AWS) teaches you about the features of auto-scaling as well as elastic, classic, and application load balancers. AWS Lambda is a way to perform server-less operations and this course will teach you about its importance. You will also learn about cloud formation in AWS. Start this course today to master the Amazon Relational Database Services (Amazon RDS).","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This training course with optional certification has been specially designed to introduce you to Amazon’s platform for providing on-demand cloud computing and APIs to individuals, companies, and governments. It highlights the features and benefits of various components of auto-scaling as a function in Amazon Web Services. The elastic, classic and application load balancers will also be covered. Amazon Web Services Lambda is available on the AWS platform and completing this course will help you understand its serverless, event-driven operations. The features and operations of the Elastic BeanStalk will also be covered.</p><p>See how the Amazon Relational Database Services (Amazon RDS) runs ‘in the cloud’ to simplify the setup, operation, and scaling of a relational database. An understanding of the working operations of the Amazon RDS is needed if you want to use this service. The EC2 and RDS are services under AWS. However, you will need to learn about the differences in the working operations in order to use these services. Aside from the use of relational databases, nonrelational databases are also available. An example of a nonrelational database is DynamoDB, which you will learn about. Completing this course will also help you learn about the operations of the ElastiCache. You will also be able to identify the two open-source engines supported by ElastiCache. Amazon Redshift is another service under AWS and you study how secure it is.</p><p>Furthermore, the material will teach you about the concept and functions of cloud formation in AWS. You will also learn about the functions, as well as the relationship between templates and stacks. CloudWatch is an important part of Amazon Web Services which you will need to understand in order to apply it appropriately in any given situation. There are different events and logs that occur in CloudWatch and this course will help you understand their functions and features. CloudTrail can be used to monitor AWS API calls. However, in order to use it efficiently, you will need to know about the two trail types available. Data migration is possible when you understand the operations of the AWS Migration Hub. Understand how centralized tracking, migration flexibility, and improved visibility can be done on the hub. When you complete this course, you will be able to identify the functions, features and importance of the Application Discovery Service, Database Migration Service (DMS) and the Server Migration Service (SMS). This course will be of great interest to computer science students, developers and solutions architects with an interest in understanding AWS better. So, register for this course and start your next learning journey today. Optional certification is available on completion.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}