{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3186","title":"An Introduction to Computer Vision","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course lays out the basics of image formation and warping and explains how computers detect features.","description":"As we open up our data to further types of inputs other than traditional text, computer vision lets machines track what is viewed onscreen. This free online course breaks down the process of analyzing image data, including object recognition and image classification, which enables us to examine our unstructured data more closely. Sign up to explore the various theoretical and practical benefits of computing with images.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course establishes computer vision’s significance in extracting higher-level abstractions and information from images. We begin with a historical review of computer vision to track its evolution over the last few decades. We study the initial forays into computer vision and the efforts that contributed to understanding images and led to the emergence of deep learning. We also trace the origin of various designs and advances in the field of computer vision over the last half century. The course breaks down the image-formation process that uses a set of lighting conditions, scene geometry, surface properties and camera optics. We then delve into the use of digital cameras to create essential effects such as exposure, nonlinear mappings, sampling and aliasing and ‘noise’.</p><p>We then show you how to represent an image by breaking it down into tiny pixels. This includes the use of image-processing techniques to preprocess images and convert them into forms suitable for further analysis and the various image-processing operators that map pixel values from one image to another. We then unpack the method of applying filters to an image for modifying or enhancing its features. The course covers the role of histogram equalization as it uses a collection of pixel values in the vicinity of a given pixel to determine its final output value to perform local tone adjustment of the image. We demonstrate the image-enhancement process in which the transfer function of the filter modifies part of the signal frequency spectrum. We also highlight the use of Fourier analysis to determine the frequency characteristics of various filters.</p><p>The course then shows you how to use fast Fourier transform (FFT) to perform large kernel convolutions. This includes the process of decomposing an image into its sine and cosine components using Fourier transforms. We establish the significance of sampling and aliasing in the processing of images. We also demonstrate how the sampling rate determines the digitized image’s spatial resolution and the occurrence of aliasing when the sampling rate is not high enough to capture the detail in the image. Lastly, we discuss the method of increasing and decreasing the resolution of an image using interpolation and decimation filters. This informative course suits those studying computer science or anyone interested in these cutting-edge technologies.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}