{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4245","title":"An Introduction to NumPy Library for Python","totalEnrolled":"875","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free computer development course, learn about the functions and tools of the NumPy library for Python.","description":"Achieve a basic understanding of how Numerical Python (NumPy) works in this free online course. You will be able to master the art of using NumPy to perform different mathematical computations and take advantage of its superiority compared to traditional Python lists. You will also gain insights into the array object in NumPy that makes all this possible. Expand your knowledge and skills by taking this programming course today.","courseOutcomes":["Recall what an array object in NumPy...","Evaluate the examples of range param...","Discuss NumPy dimensions and operati...","List the examples of NumPy array pro...","Recall what an array object in NumPy is","Evaluate the examples of range parameters","Discuss NumPy dimensions and operations","List the examples of NumPy array properties","Describe the examples of methods used for scientific computing in NumPy","Explain the NumPy random choice method","Differentiate between axis 0 and axis 1 in NumPy","Compute the mathematical functions in NumPy","Recall what an array object in NumPy...","Evaluate the examples of range param...","Discuss NumPy dimensions and operati...","List the examples of NumPy array pro...","Recall what an array object in NumPy is","Evaluate the examples of range parameters","Discuss NumPy dimensions and operations","List the examples of NumPy array properties","Describe the examples of methods used for scientific computing in NumPy","Explain the NumPy random choice method","Differentiate between axis 0 and axis 1 in NumPy","Compute the mathematical functions in NumPy"],"courseDescription":"<p>Do you want to become more expert in using NumPy to perform mathematical computations? This course helps you understand why an array object in NumPy is significantly faster than the standard lists found in Python. You will discover that ‘ndarray’ refers to the array object in NumPy and understand that an array is different from a Python list because it stores values with the same data type. On the other hand, a Python list can store elements and values that have different data types. You will be able to master the keys you use when you want to view the documentation in NumPy and use Booleans to represent the actual value of a Python expression. You will develop your experience of the different examples of array properties in NumPy.</p><p>Firstly, the course introduces you to the different examples of range parameters in NumPy including the start, stop and step parameters. We will clarify that you have to pass at least one of these parameters. You will find out that you can use 1 as the default value when you do not provide the step parameter. You will also discover that the shape of any particular array refers to the number of elements found in each dimension. What is NumPy slicing? This course presents the steps to take when taking elements from a specific index to another given index. You will learn to use different commands to print other Python elements and exclude certain index elements depending on your desired application. In addition, you will master NumPy shape and reshaping and find out that the shape attribute returns a tuple in NumPy.</p><p>Next, you study the different methods used for scientific computing in NumPy. We explain how to use the linspace function to create numeric sequences and use the max function to find the maximum value of any given array. You will generate random floats between 0 and 1 and use the randint() function to generate random integer values. We show how you can use stacking to join arrays in NumPy. Finally, you will study NumPy mathematical functions, axes, vertical and horizontal stacking, random choice and bite types. This course will interest developers wanting to learn how to use NumPy with Python.</p><a href=\"https://alison.com/resume/courses/4245\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4245\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The NumPy Library","description":"In this module, on the NumPy Library, you will learn about the different examples of NumPy array properties. You will also discover the three primary examples of range parameters in Numpy and master the various data structures in Python.","topics":["The NumPy Library - Learning Outcomes","Introduction to NumPy","NumPy Dimensions","Arrange Argument and Shape","NumPy Slicing","The NumPy Library - Lesson Summary"]},{"name":"Module","details":"NumPy Functions and Stacking","description":"In this module, on NumPy Functions and Stacking, you will learn about the examples of methods used for scientific computing in NumPy and various types of NumPy functions. You will also learn how to use the different types of mathematical functions in NumPy and the two types of staking methods.","topics":["NumPy Functions and Stacking - Learning Outcomes","NumPy Functions","The NumPy Axes","Numpy Functions and Stacking","NumPy Functions and Stacking - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to NumPy Library for Python - Course Assessment"]}]}