{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5059","title":"An Introduction to Java Programming","totalEnrolled":"3,825","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the fundamental concepts of Java: classes, objects, packages, methods and much more in this free online course.","description":"Java is a practical, dynamic and relatively easy-to-learn programming language used in various applications. This course will demonstrate everything from installations and setups to programming with multiple loops. We will explain the role and significance of features of Java, like classes, packages and various loops. You will gain the skills to understand basic Java programs, fix errors and write Java programs independently.","courseOutcomes":["Explain the purpose and significance...","Discuss the evolution of Java...","List various keywords in the Java la...","Describe the concept of object-orien...","Explain the purpose and significance of the Java language","Discuss the evolution of Java","List various keywords in the Java language","Describe the concept of object-oriented programming","Define objects, classes, methods and constructors","Distinguish the three types of variables that can be contained by a class","Summarize the role of Java packages","Define a ‘single array’ and a ‘multidimensional array’","Explain the purpose and significance...","Discuss the evolution of Java...","List various keywords in the Java la...","Describe the concept of object-orien...","Explain the purpose and significance of the Java language","Discuss the evolution of Java","List various keywords in the Java language","Describe the concept of object-oriented programming","Define objects, classes, methods and constructors","Distinguish the three types of variables that can be contained by a class","Summarize the role of Java packages","Define a ‘single array’ and a ‘multidimensional array’"],"courseDescription":"<p>Have you ever wondered how Java came about? Java was created by accident! In 1992, James Gosling and his team were working on a set-top box at the time, and they started by ‘cleaning up’ C++, which interestingly resulted in a new language they called ‘Java’ or ‘Oak’. This course aims to teach you the fundamental concepts of Java to help you build your programming foundation. This course is published by subject matter experts from Stone River eLearning, a company specializing in video-based technology training content.</p><p>We will begin by introducing you to object-oriented programming. Then we will outline the concepts of objects and classes with the help of several examples. Following that, you will learn why a class needs a default constructor, the purpose of constructors and the syntax of writing a constructor for a class. Did you know that keywords are also known as 'reserved words’? We will outline the function of several keywords and how you use them in a program. Finally, we will investigate syntax formation, object definition and the processes of 'Declaration, Instantiation, and Initialization' of an object.</p><p>Java Loops are used extensively in a variety of programs. We will discuss the various types of loops that Java supports next. In addition, we will cover concepts such as methods, packages, string builders and inheritance. Ultimately, with the help of practice projects, we will teach you polymorphism and data encapsulation. This course is a rigorous coding boot camp in which participants actively participate in the development of their logical and analytical thinking to solve interactive problems. This course is for you if you enjoy challenges and want to get your hands dirty with coding. Enroll right away!</p><a href=\"https://alison.com/resume/courses/5059\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5059\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamental Concepts of Java","description":"This module will teach you the fundamental principles of Java programming. The evolution of Java and its significance will be discussed. Various reasons for the global adoption of Java will also be explored. You will learn about Java keywords, syntax, and several rules for writing Java programmes.","topics":["Fundamental Concepts of Java - Learning Outcomes","Introduction to Java","Writing a Basic Program in Java","Arrays, Classes and Methods","Java String Builder, Inheritance and Packages","Polymorphism and Encapsulation in Java","XAMPP and Practice projects","Fundamental Concepts of Java - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["An Introduction to Java Programming - Course Assessment"]}]}