{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4813","title":"Android App Building 102 - Purr, Audiobook Log, and Skeleton","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study essential programming and learn to design apps from start to end with this free online course.","description":"App Inventor 2 shows you how to build Android applications from the ground up. For non-techies, the UI tools make designing applications relatively simple. Start creating HelloPurr, the Audiobook Log and the Skeleton Review app to lay the foundations for basic programming with a practical learning experience to handle your projects. Master the Google Developer console on the Android market like a pro to publish or update your creations.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Many people have brilliant app ideas. The difficulty is they don't have the essential skills or education to turn ideas into reality. Building an app, regardless of its complexities or platform, needs technical knowledge such as coding, UX/UI design and other domains. However, App Inventor 2 cuts through the clutter and allows anyone with no coding experience to develop Android apps from the ground up. It comes with two graphical user interface (GUI) tools that simplify developing Android apps. The 'blocks' designer is a clever and unusual feature that helps you construct code by dragging object blocks together rather than programming with Java. These graphical UI significantly accelerate development while offering an ideal platform for teaching people to program. The software is oriented for new programmers to help them create Android apps by converting complex coding languages into visual drag-and-drop blocks. This innovative system eliminates the need for users to learn code before building mobile apps. Familiarise yourself with the functions of App Inventor's key elements, such as the user interface, layout and media. Each component can have its own set of methods, events and properties.</p><p>Without the necessity for technical computing, this course will teach you all you need to know regarding developing apps. Do you have a computer with a solid internet connection? Perhaps you have a basic understanding of Android applications? And have you already created a concept for an app that doesn't yet exist? While the course aims for those without prior coding experience, it also serves professional application developers who want to study a fresh outlook. Get started with a complete buildup of two uncomplicated applications, HelloPurr and the Audiobook Log. First, you will discover how to use the ‘button’ and ‘label’ components. Then, we demonstrate the arrangement, checkbox and sound components' functionalities in detail with focused video lessons. Next, you will explore how to integrate long audio tracks and use spacing tools for visual balance. Finally, you will have the skills necessary to create your book logger by programming the player component and incorporating checkboxes to track the reading progress.</p><p>By the end of this course, you will have built the third Android application, Skeleton Review. You will learn how to identify between Project Inventor 2 file types while working on the app. You'll also learn how to recover, upload, export and share project files with coworkers. Gain practical experience with the ‘canvas’, ‘labels’ and ‘ball’ elements by designing the Skeleton project from beginning to end. Once you know how to set up the Google developer interface, you'll acquire a step-by-step guide for App publishing. You'll also view a simple example of uploading APK files to the Google Play Store, where apps get viewed by 1 billion active Android users from over 190 countries. There are around 3.48 million apps available, with approximately 3739 new apps published daily. This course aims to provide a solid basis for integrating and programming crucial components to publish apps on the Android market. Nowadays, anyone can create an app. It is time to put your brilliant ideas to work and develop a unique Android app. Enrol right away!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}