{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4815","title":"Android App Building 103 - My Business and Free Form Task","totalEnrolled":"511","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches the fundamentals of programming and creating apps without writing any code.","description":"Do you want to create an application but lack the necessary skills and expertise to make that possible? This course teaches you how to create two types of Android apps: a business app and a free form tasks app using App Inventor 2. You'll explore all the stages, from designing a basic home screen layout with the ‘designer’ editor to implementing various functionality using the ‘block’ editor and publishing the apps.","courseOutcomes":["Recognise how to use App Inventor 2 ...","Describe the ‘designer’ and ‘block’ ...","Summarise how to use the ‘palette’, ...","Discuss the process of creating your...","Recognise how to use App Inventor 2 with ease and effectiveness","Describe the ‘designer’ and ‘block’ editors","Summarise how to use the ‘palette’, ‘viewer’, ‘components’ and ‘properties’ sections","Discuss the process of creating your business app and free tasks form for Android","Describe the Google Play Market, Google Play Developer Account and Google Play Console","Outline the steps involved in publishing your Android applications to the Google Play Store","Recognise how to use App Inventor 2 ...","Describe the ‘designer’ and ‘block’ ...","Summarise how to use the ‘palette’, ...","Discuss the process of creating your...","Recognise how to use App Inventor 2 with ease and effectiveness","Describe the ‘designer’ and ‘block’ editors","Summarise how to use the ‘palette’, ‘viewer’, ‘components’ and ‘properties’ sections","Discuss the process of creating your business app and free tasks form for Android","Describe the Google Play Market, Google Play Developer Account and Google Play Console","Outline the steps involved in publishing your Android applications to the Google Play Store"],"courseDescription":"<p>If you want to become an app developer but are intimidated by the thought of programming since you have no experience with coding or technology, this course is for you. You will be taken step by step through creating your valuable app. It begins by introducing the process of developing an Android business application. You'll learn how to build the home screen and navigation bar layouts with components like Activity Starter, PhoneCall and TextBox and how to add distinctive functions to your application with the ‘blocks’ section.</p><p>Then you will learn how to create and implement the main screen of the form task list using components like ListView and ListPicker to display your list items and receive user input. Following that, you will discover how to pass data between screens, add tasks to file, delete the list, toggle filter bar and main image, cancel tasks, show new tasks first and make them attractive by using and arranging certain built-in blocks in a specific way.</p><p>Next, the course discusses the Google Play Market, Google Play Developer Account and Google Play Console. Then you'll find out how to create a Google Play account and a Google Play Developer account in just a few steps and understand the distinctions between them. Next, we will demonstrate a variety of application graphic assets such as screenshots, high-resolution icons and feature graphics. Finally, you will learn how to upload and publish your Android applications to the Google Play Store and how to update your ready-to-use app.</p><a href=\"https://alison.com/resume/courses/4815\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4815\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Creating Android Applications using App Inventor 2","description":"This module walks you through all the steps of creating Android apps with the Inventor 2 programme and its capabilities, such as the component editor and blocks editor. Then you will gain a thorough grasp of the Google Play Market and learn how to publish your Android apps on the Google Play Store.","topics":["Creating Android Applications using App Inventor 2 - Learning Outcomes","Your Fourth App: My Business App","Your Fifth App: Free Form Task List","Getting Your App to the Market","Creating Android Applications using App Inventor 2 - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Android App Building 103 - My Business and Free Form Task - Course Assessment"]}]}