{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4785","title":"Android App Building 101- Introduction","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Stop imagining that clever app idea you have and make it a reality using App Inventor 2 with this free online course.","description":"Entry-level and skilled Android developers are already in a growing market. MIT App Inventor 2 is an impressive tool for getting started as a programmer. This Android course aims to educate on the fundamentals of the structural and functional elements of App Inventor, such as the ‘Designer’ viewer and ‘block’ editor. Enrol in this brief video-based training course and learn how to build apps without typing a line of code.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>App Inventor is a fantastic learning tool for discovering the programming principles and getting you up and running as an Android developer. It is a cloud-based, open-source solution for developing mobile apps. Some of the service's advantages include compatibility with Mac OS X, GNU/Linux and Windows operating systems. In addition, you will know how to test ongoing projects on any Android smartphone! MIT App Inventor is a simple, visual programming environment that allows anyone to easily create completely operational apps for smartphones and tablets. This course aims to educate learners on the fundamental App Inventor capabilities: you will learn everything from how to install the program to the structural and functional components of the tool. As you may know, App Inventor 2 is 100% free to use and may even get utilised for business purposes.</p><p>We'll demonstrate how to create a Gmail account (if you don't have one already) in the first module. Then you'll learn how to connect to your development environment using a web browser, then a USB-connected phone and finally by installing the Android emulator. Many people design Android apps as a hobby while others are more interested in money. But what exactly can you create with App Inventor? In short, App Inventor enables anybody to create apps by defining ‘blocks’ to indicate their behaviour. You may create games, educational applications based on user-generated data and apps that leverage the phone's sensors. You don't have to be a coding genius. Begin by learning about mobile development fundamentals, then the functionality of the discrete program elements like design, layout and blocks. Later, you will learn how to alter the components by dragging and dropping them to create application behaviour.</p><p>By the end of this course, you should be able to follow the steps for installing App Inventor 2 on your computer, connect to your AI Companion and establish the Android emulator. You will understand the functionalities of the main components to create projects by inserting blocks while testing the work as you go. The modules will assist newbies and non-technical audiences in how to add commands, with essential recommendations for managing those block relationships. Utilise the blocks editor to handle errors or delete blocks in App Inventor. Master the software's primary components, such as the ‘Designer’ viewer and block editing parts, to gain efficient programming skills. Understanding the behaviour of the blocks is vital since it allows you to adjust the functionality as the project evolves. It's time to turn your programming hobby into a full-time occupation from the comfort and privacy of your home. These brief lectures will provide everyone with a foundational notion for starting to develop Android applications. Enrol now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}