{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4920","title":"Android App Building 108 - Pong Art Game","totalEnrolled":"374","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the joys of programming with this free online course without worrying about coding for Android development.","description":"If you want to be a developer, MIT App Inventor 2 is a great place to start as it does not need advanced programming knowledge. This course teaches you how to manage the canvas, the user interface (UI) and sensors to improve your app design skills while making a Pong mobile app without writing code. If you sign up for this class, you'll learn how to use the Android market like a pro so that you can publish your projects on the Google Play Store.","courseOutcomes":["Distinguish between App Inventor's l...","Describe the processes of adding the...","Explain the concept of the accelerat...","Outline the characteristics and prop...","Distinguish between App Inventor's layout, storage, media, and user interface components","Describe the processes of adding the components into the App Inventor 2 project","Explain the concept of the acceleration sensor component","Outline the characteristics and properties of the ball component","Indicate the building process to program the paddle length and movement","Describe the procedures involved in the button toggling game selection feature","Identify the blocks needed to establish the Canvas component and color settings","Recall the method of constructing the game initialisers","Describe the procedures needed to develop the ball collisions against paddles and walls","Define how to add a red-hit flash and ‘game over' alert box","Discuss the steps to prepare apps for deployment to the Google Play Store","Determine how to update apps on the Android marketplace","Distinguish between App Inventor's l...","Describe the processes of adding the...","Explain the concept of the accelerat...","Outline the characteristics and prop...","Distinguish between App Inventor's layout, storage, media, and user interface components","Describe the processes of adding the components into the App Inventor 2 project","Explain the concept of the acceleration sensor component","Outline the characteristics and properties of the ball component","Indicate the building process to program the paddle length and movement","Describe the procedures involved in the button toggling game selection feature","Identify the blocks needed to establish the Canvas component and color settings","Recall the method of constructing the game initialisers","Describe the procedures needed to develop the ball collisions against paddles and walls","Define how to add a red-hit flash and ‘game over' alert box","Discuss the steps to prepare apps for deployment to the Google Play Store","Determine how to update apps on the Android marketplace"],"courseDescription":"<p>App Inventor 2 is a great way to learn programming principles and start your journey towards an Android development career. This innovative software contains two user interface tools, the designer and the editor, that make building applications uncomplicated. The program enables anybody to create apps for smartphones and tablets from the ground up. Its designer section lets users integrate the components by dragging objects like puzzle pieces instead of writing complex Java. This course will teach you all you need to know about developing game applications. In addition, the lessons offer a deeper comprehension of the block programming method utilized by App Inventor 2 in creating mobile applications. If you've never programmed before, this course is for you. It also helps professional app developers who want to look at things differently.</p><p>Explore how to build a full Pong game from the ground up and become acquainted with the essential components and sensors that will serve as the foundation for the game's architecture. Learn all you need about programming layouts and major built-in features like control, procedures and initializers. You'll also discover how to configure the accelerometer to handle movement and speed data. Next, customize the settings for the Ping Pong game, such as colors, the ball track and the paddle movement. Later, you will visualize the building process for configuring the game mode screen. Finally, we provide some tips on customizing the paddle. As you progress, you will gain skills in integrating dynamic buttons, label components, layouts and toggle groups to forge the game options and the setting screens.</p><p>After completing this program, you will have created an iconic Android app: Pong. The method employs short, in-depth video lectures to help you learn App Inventor 2 at home. Master the software's core functions, such as the designer and the editor, to learn how to program more successfully. Know how to configure control, procedures, logic, mathematics, list, color, logic and variable blocks in the Block Editor. You will utilize the App Inventor 2 canvas, buttons, arrangement, storage and sensor elements. We will arm you with valuable ideas and suggestions for releasing your app on Google Play. Use App Inventor 2 to develop Android apps and upload the APK project files to Google Play. You're almost a member of the twenty-first century's computer programming elite. Register now!</p><a href=\"https://alison.com/resume/courses/4920\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4920\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building Android Games with App Inventor","description":"This module explains the foundation of the Ping Pong game using App Inventor 2. Beginning with a presentation on what makes the accelerometer sensor work while moving the smartphone. Then, you will learn how to construct the app's screens and layouts. Lastly, you will comprehend how to fix primary programming problems by simple troubleshooting.","topics":["Building Android Games with App Inventor - Learning Outcomes","Presenting the Android Game App","Designing the Ping Pong Homepage","Building the Game Settings Layouts","Developing the Groups Arrangements","Building Android Games with App Inventor - Lesson Summary"]},{"name":"Module","details":"Preparing Android Games for Publishing","description":"This module explores the built-in blocks for programming the primary game behaviour, the colour bouncing, and the collisions against the paddle or walls. You will study the final pieces of the game, such as the red line and the 'game over' screen from start to end. Lastly, you will get the instructions for handling your apps on the marketplace.","topics":["Preparing Android Games for Publishing - Learning Outcomes","Configuring the Game Settings Screen","Building the App Initialiser Blocks","Programming the Movement and Collisions","Finishing the Ping Pong Application","Managing Apps on the Google Play Store","Preparing Android Games for Publishing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Android App Building 108 - Pong Art Game - Course Assessment"]}]}