{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3085","title":"Angular: Fundamentals","totalEnrolled":"1,439","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamentals of Angular so you can build cool mobile and desktop web applications.","description":"This free online course in Angular fundamentals teaches you all about the Angular tool and how it’s used for developing dynamic single-page applications. You will analyze the prerequisites for Angular and grapple with the integrated development environment (IDE) and the model view controller (MVC). Explore how Angular components are built and how they fit into the lifecycle of an app.","courseOutcomes":["Discuss the prerequisites for this c...","Outline choices for code editors for...","Explain how to design an application...","Outline the reasons why we choose on...","Discuss the prerequisites for this course and IDE","Outline choices for code editors for developing Angular applications","Explain how to design an application with MVC in mind and how to break your Angular logic into reasonable margins","Outline the reasons why we choose one approach over the other in HTML","State the purpose of forms","Define data binding","Explain the use of Angular routing engine","Evaluate how surfaces can make your code easier to maintain","Explain how to create your own custom pipes","List the new changes made on Angular2","Discuss the prerequisites for this c...","Outline choices for code editors for...","Explain how to design an application...","Outline the reasons why we choose on...","Discuss the prerequisites for this course and IDE","Outline choices for code editors for developing Angular applications","Explain how to design an application with MVC in mind and how to break your Angular logic into reasonable margins","Outline the reasons why we choose one approach over the other in HTML","State the purpose of forms","Define data binding","Explain the use of Angular routing engine","Evaluate how surfaces can make your code easier to maintain","Explain how to create your own custom pipes","List the new changes made on Angular2"],"courseDescription":"<p>Angular is a very popular TypeScript and has vast applications in web development and programming. This free online course starts by introducing you to the prerequisites of Angular, the integrated development environment (IDE) and the choices you have for code editors when developing Angular apps. The course material also discusses Angular components, which play the role of the controller. Learn how to design applications with the model view controller (MVC) in mind and how to break your Angular logic into reasonable margins. Some other points of discussion are HTML and Angular markups as well as the documents object model (DOM).</p><p>Next, delve into templates and where to build the HTML that will be displayed for your component. Templates can be embedded with components or managed in their own HTML file and you will be taught why you would choose one approach over the other. The course then analyzes forms, and which tools Angular provides to build forms and validate and process users’ input. Learn about data binding as the process of displaying data to the user and be guided through how to use the URL to control the navigation of your application. Finally, you will see how to use directives to change the structure of a document and how to reuse code by creating surfaces and using it in different components. Other topics covered are how to perform common formatting and filtering tasks and the new changes and best practices regarding Angular2.</p><p>You can refine your coding skills by enrolling in this free online Angular fundamentals course and open a whole new world of coding opportunities. This versatile language is easy to understand and can be used to perform many coding tasks and create compelling mobile and desktop apps.</p><a href=\"https://alison.com/resume/courses/3085\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3085\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Angular","description":"In this Module, you will identify the prerequisites for this course and Installer Development Environment IDE, about your choice for code editors for developing Angular applications. It gives you an insight on what it means to design application with MVC in mind and how to break your angular logic into reasonable margins. Then how to use TypeScript to turn Java script into a strongly typed language.","topics":["Introduction to Angular - Learning Outcomes","Prerequisites and IDE","Angular MVC","TypeScript","Introduction to Angular - Lesson Summary","Introduction to Angular Assessment"]},{"name":"Module","details":"Angular Components","description":"In this Module, you will discover how Angular components are built and how they fit into the lifecycle of an application. You will understand where to build the HTML that will be displayed for your component, you will learn some of the reasons why we choose one approach over the other. You will discover some efficient tools to build forms, validate and process users input. Then you will learn the various types of Data binding available in Angular.","topics":["Angular Components - Learning Outcomes","Building Angular Components","Templates","Building Forms with Angular","Data Binding","Angular Components - Lesson Summary","Angular Components Assessment"]},{"name":"Module","details":"Routing, Directives and Services","description":"In this Module, you will learn how you can use URL to control the navigation of your application. How to use directives both to pass information in and receive information from HTML components. You will also discover how to use directives to change the structure of a document. Then finally you will learn how to reuse codes by creating surfaces, and how surfaces can make your code easier to maintain.","topics":["Routing, Directives and Services - Learning Outcomes","Routing","Directives","Services","Routing, Directives and Services - Lesson Summary","Routing, Directives and Services Assessment"]},{"name":"Module","details":"HTTP and Pipes","description":"In this Module, you will learn you how to perform common formatting and filtering task. Then also you will discover how to create your own custom pipes.","topics":["HTTP and Pipes - Learning Outcomes","HTTP","HTTP Contd","Pipes","HTTP and Pipes - Lesson Summary","HTTP and Pipes Assessment"]},{"name":"Module","details":"Updates and Best Practices","description":"In this Module, you will learn how to use the very speeding blocks of Angular and how to make them work together to build a fully functioning page application.","topics":["Updates and Best Practices - Learning Outcomes","Completing the App","Angular Tool Best Practices","Updates and Best Practices - Lesson Summary","Updates and Best Practices Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Angular fundamentals - Course assessment"]}]}