{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4700","title":"Angular Directives Fundamentals","totalEnrolled":"108","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course is a basic introduction to Angular directives that describe fundamental essential functions.","description":"Angular directives are classes that add additional behaviour to elements in your Angular applications. We provide you with an understanding of built-in directives, attribute directives and writing structural directives. We explain how to provide conceptual information on how directives work. We help you to set condition values. We answer questions like ‘what is an Angular direction?’ and ‘what is an Angular direct task?’.","courseOutcomes":["Identify the various different direc...","Define the three different types of ...","Outline what is the attribute direct...","Discuss what Angular directives CLI ...","Identify the various different directives: attribute, structural and component","Define the three different types of directives","Outline what is the attribute directive and Directives API","Discuss what Angular directives CLI is and its components","Classify what are the basic structural directives","Recognise how to identify and use an Nglf structural directive","Explain the component directives and explain how to use them","Compare the component property binding and the user details","Identify the various different direc...","Define the three different types of ...","Outline what is the attribute direct...","Discuss what Angular directives CLI ...","Identify the various different directives: attribute, structural and component","Define the three different types of directives","Outline what is the attribute directive and Directives API","Discuss what Angular directives CLI is and its components","Classify what are the basic structural directives","Recognise how to identify and use an Nglf structural directive","Explain the component directives and explain how to use them","Compare the component property binding and the user details"],"courseDescription":"<p>This course on Angular directives walks you through creating a highlight directive that sets the background colour of the host element to yellow. This course provides accurate knowledge of changing the appearance or behaviour of DOM elements and Angular components with attribute directives. We explain and describe the tools' characteristics and functions and guide you through specific information about writing structural directives, providing an understanding of conceptual information on how directives work. We supply the answers to questions relating to Angular's built-in structural directives. We discuss creating an application and the tools you will use before teaching you to assess the various ways of adding and modifying Angular directives.</p><p>Following this, we prepare you for the types of tools you will need to develop your different directives. First, you will be able to learn how to use the tools in ‘Nglf Structural Directive’ correctly and the ‘NgFor Structural Directive’, including understanding what mistakes to avoid. Next, you will discover how to troubleshoot the errors to have a thriving operational directive. Finally, learn how to set up component directives and what Angular directives and DOM elements are used for.</p><p>This course will supply you with the aptitude required to use Angular directives as a beginner. It provides precise and detailed procedures you can apply in your working field. This course is ideal for those starting to use Angular directives or employees who want to learn how to use it to its full potential. Register for this course and become professional in using this site.</p><a href=\"https://alison.com/resume/courses/4700\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4700\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Modularity","description":"This Module will help you study an Introduction to Angular Directives and the terminology used in this course. We will start by examining what are the three types of directives. Also, you will study the specifications of using each directive. You will receive the tools to answer questions like: What are the three different types of directives?","topics":["Introduction to Modularity - Learning Outcomes","Introduction to Angular Directives","Three Types of Directives","Angular Directives CLI","Angular Directives Declaration","Introduction to Modularity - Lesson Summary"]},{"name":"Module","details":"Host Decorators and Directive Inputs","description":"This module will help you analyze how to work with attribute directives API. Also, you will begin by exploring what types of activities are the Renderer2 exercises. You will be able to answer questions like: What is Renderer2? How to build an action directive? What is a HostListener?","topics":["Host Decorators and Directive Inputs - Learning Outcomes","Attribute Directives API","Renderer2 Exercise","Building and Actions of a Directive","Host Decorators","Directive Inputs","Input, HostBinding, and HostListener","Clone Repository","Host Decorators and Directive Inputs - Lesson Summary"]},{"name":"Module","details":"NGIF, NGFOR, NGSWITCH Directives","description":"This module will help you analyze how to understand basic structural directives. Also, you will begin by exploring what is the NGIF Structural Directive. You will be able to answer questions like: What is an NGIF Structural Directive? What is NGFOR Structural Directive?","topics":["NGIF, NGFOR, NGSWITCH Directives - Learning Outcomes","Basic of Structural Directives","NGIF Structural Directive","NGFOR Structural Directive","NGSWITCH Structural Directive","NGSWITCH With Enum","Structural Directives API","If and Hide Structural Directive","NGIF, NGFOR, NGSWITCH Directives - Lesson Summary"]},{"name":"Module","details":"Directives, Bindings, and Output Components","description":"This module will help you study an Introduction to component directives and the terminology used in this course. We will help you by examining what are the component bindings. This will also give you answers to questions like: What are the Component Bindings? How can you identify components?","topics":["Directives, Bindings, and Output Components - Learning Outcomes","Component Directive","Component Bindings","Component Output Binding Exercise","Composing Components","Directives, Bindings, and Output Components - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Angular Directives Fundamentals - Course assessment"]}]}