{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3556","title":"Animation 101: Learning the Basics in Toon Boom Harmony","totalEnrolled":"3,867","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a greater understanding of the basic principles of animation using Toon Boom Harmony in this free online course.","description":"In this practical course on the basics of animation in Toon Boom Harmony, you will be focusing on the ‘Bouncing Ball’ project. One of the most important exercises that animators first learn, this will teach you about time and spacing, squash, stretch and, most importantly, art. These principles are crucial in the process to bring animations to life. No prior knowledge of animation is required to start this course so enrol now!","courseOutcomes":["Discuss the basic principles of anim...","Label layers and frames in your anim...","Define ‘squash’ and ‘stretch’ in ani...","Distinguish between timing and spaci...","Discuss the basic principles of animation","Label layers and frames in your animation project","Define ‘squash’ and ‘stretch’ in animation","Distinguish between timing and spacing in animation","Explain how to add background colour to your animation","Explain how to export an animation project to any ‘movie’ format","Describe ‘hangtime’ in animation","Outline the steps involved in creating a bouncing ball animation","Distinguish between 2-D animation and other animations or drawings","Discuss the basic principles of anim...","Label layers and frames in your anim...","Define ‘squash’ and ‘stretch’ in ani...","Distinguish between timing and spaci...","Discuss the basic principles of animation","Label layers and frames in your animation project","Define ‘squash’ and ‘stretch’ in animation","Distinguish between timing and spacing in animation","Explain how to add background colour to your animation","Explain how to export an animation project to any ‘movie’ format","Describe ‘hangtime’ in animation","Outline the steps involved in creating a bouncing ball animation","Distinguish between 2-D animation and other animations or drawings"],"courseDescription":"<p>Are you interested in exploring the field of animation? Looking for a good place to start? This course introduces you to the fundamentals of animation using a hands-on, demonstrative approach. You will be taught to use Toon Boom Harmony, a program that allows animators to create art and 2-D animated designs. The course is built around the ‘Bouncing Ball’ animation project, which consists of a simple basketball (circle) bouncing in and out of the frame. A great starting point for beginner animators, this project helps demonstrate time, spacing, squash, stretch and art.&nbsp;</p><p>Beginning with setting up the project in the program, you will be guided through the steps to follow when creating a new file or scene. You will also learn how to extend the exposure of the horizon and path of action to the end of the timeline. Then you will be taught how to draw the basketball and paste it into different frames as well as how to rotate the program view to stretch the ball. Next, gain insight into the technique for animating the second arc of the bouncing ball and learn how the ball should look or be stretched after impact on the ground and during its peak. Lastly, finishing the last bounce of the ball and adding empty frames to the end of the timeline to clearly show the ball has left the frame will round off the animation.</p><p>Toward the conclusion of the course, you will learn how to export your project from Toon Boom Harmony to a ‘movie’ format. From setup to export, each stage in the process is carefully broken down and explained to your understanding. If you are a beginner animator or want to learn about 2-D animation, this course is designed to help you get started. No prior knowledge of animation or any programming is required. So are you ready to begin your journey? Register today and enjoy learning the basics of 2-D animation.</p><a href=\"https://alison.com/resume/courses/3556\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3556\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics in Toon Boom Harmony","description":"In this module, you will learn the basics of the toon boom harmony animation program using the \"bouncing ball\" animation project. You will study some of the principles of animation such as timing and spacing, squash and stretch, amongst others. Then, you will be taught the setup of the project, how to animate it and import it into a movie format.","topics":["Basics in Toon boom Harmony - Learning Outcomes","Introduction!","Timing and Spacing","Setting up: The Bouncing Ball","Animating The bouncing","Animating The Second Arc","Finishing the Bouncing Ball's Last Bounce","How To Export Your Animation","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Animation 101: Learning the Basics in Toon Boom Harmony - Course Assessment"]}]}