{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4213","title":"Animated Lettering Using Procreate - Beginner to Advanced","totalEnrolled":"1,273","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the steps involved in creating simple to advanced animated letters using Procreate in this free online course.","description":"Have you ever wanted to include animated lettering in your digital artwork? Procreate is graphic editing software with animation features accessible to both beginners and experts. Discover the program’s interface by examining the various panels and tools used to create animated letters. Learn about processes such as layer positioning, required to create both simple and complex letter animations, and enhance your skills as a digital artist.","courseOutcomes":["Outline the steps involved in creati...","Describe the functions of various to...","List the different ways to save and ...","Explain the functionality of differe...","Outline the steps involved in creating a new document in Procreate","Describe the functions of various tools offered by Procreate","List the different ways to save and export animation","Explain the functionality of different panels in Procreate","Indicate the process of creating an ‘oscillation’ between two given points","Outline the importance of arranging background and foreground layers in an animation project","Describe the significance of using grid lines in a project","Explain the purpose of using layer masks in a project","Outline the steps involved in creati...","Describe the functions of various to...","List the different ways to save and ...","Explain the functionality of differe...","Outline the steps involved in creating a new document in Procreate","Describe the functions of various tools offered by Procreate","List the different ways to save and export animation","Explain the functionality of different panels in Procreate","Indicate the process of creating an ‘oscillation’ between two given points","Outline the importance of arranging background and foreground layers in an animation project","Describe the significance of using grid lines in a project","Explain the purpose of using layer masks in a project"],"courseDescription":"<p>Digitalisation has made it easier than ever to create, edit and animate artworks and designs. There are numerous applications on the market for designing and illustrating purposes, accessible to everyone from tech giants to freelance designers working from home. Procreate is one such ‘raster’ graphics editing application, popular for creating digital illustrations and hand letters for art projects in any field. An easy-to-use application, Procreate offers a wide array of controls and tools but is straightforward to learn and accessible for beginners. Not all illustration and graphics software allows for the creation of animations, but Procreate offers this in its program, making it a popular choice amongst digital artists. This course delves into the use of Procreate to design simple to complex letter animations to help you not only elevate your art but your animation skills too.</p><p>To begin, you will be introduced to the interface of Procreate, which includes a tutorial on the various panels and tools offered. Following this, a simple animation will be designed to show you how easy it is to use this application. How-to steps and an explanation of why each step plays a significant role in the creation of perfect animation will be provided. Afterward, a simple letter animation project will be demonstrated. You will also learn how various panels can be used to add effects to simple or complex animations. The positioning of layers in any project is a critical factor in the successful outcome of an animation, so study how to position layers in a particular sequence and use layer masks to conceal and reveal parts of a layer.</p><p>Procreate offers functions like ‘oscillations’ and ‘ping-pong’ to give different effects to animation and this course presents a project that demonstrates the use of these features. Finally, a complex animation that illustrates multiple words will be explained with detailed steps on how to create this for yourself. Animation is not everyone’s cup of tea but Procreate offers a simple interface and easy-to-understand controls for individuals who wish to pursue animation and illustration as their career choice. This is a fun and easy-to-understand course and can be taken by anyone who wishes to learn simple or complex letter animations, either for fun or professionally. Take advantage of this opportunity and step up your animation game to impress anyone around you. Enrol now!</p><a href=\"https://alison.com/resume/courses/4213\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4213\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Animation in Letters","description":"This module will introduce you to the processes involved in creating animated letters using Procreate. You will learn about Procreate panels, their functionalities as well as the use of different brushes and other tools. The steps involved in creating simple to complex animations will also be explained.","topics":["Animation in Letters - Learning Outcomes","Beginner and Intermediate Animations","Advanced Animations","Animation in Letters - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Animated Lettering Using Procreate - Course Assessment"]}]}