{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4407","title":"App Development using Dart Programming Language","totalEnrolled":"1,899","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to use the client-optimized Dart programming language to create applications in this free online course.","description":"This course will introduce you to the Dart programming language from its basics, such as the setup process, to advanced concepts like concurrency. In this course, you will learn about console input and output, data types, variables, functions and operators. You will also learn about flow control, exception handling and the different collection types like lists, queues and maps, as well as using classes in Dart.","courseOutcomes":["Outline the process for printing to ...","Recall the process of creating varia...","Identify the various operator types ...","Distinguish between the ‘for’ loop a...","Outline the process for printing to the console and taking user input from it","Recall the process of creating variables","Identify the various operator types used in Dart","Distinguish between the ‘for’ loop and the ‘for in’ loop","Explain the functions of the ‘break’ and ‘continue’ statements","Outline the process for creating a function with Dart","Identify different optional parameter types","Explain function recursion","Recall different collection types available in Dart","Describe the process of iterating over a collection","Define a ‘constructor’","Explain the process of inheriting properties from a class","Outline the process for printing to ...","Recall the process of creating varia...","Identify the various operator types ...","Distinguish between the ‘for’ loop a...","Outline the process for printing to the console and taking user input from it","Recall the process of creating variables","Identify the various operator types used in Dart","Distinguish between the ‘for’ loop and the ‘for in’ loop","Explain the functions of the ‘break’ and ‘continue’ statements","Outline the process for creating a function with Dart","Identify different optional parameter types","Explain function recursion","Recall different collection types available in Dart","Describe the process of iterating over a collection","Define a ‘constructor’","Explain the process of inheriting properties from a class"],"courseDescription":"<p>This short course covers the Dart programming language and its use in creating applications. We begin by introducing you to the language and the process of setting up the developer environment for Dart programming. We will explore the console input and output tutorials, variables and writing comments. Next, we introduce Dart data types (like strings, numbers and Booleans) and operators like arithmetic, relational and type-test operators. You will analyse flow control, using ‘if’ and ‘switch’ statements, ‘for’ loops and ‘for in’ loops and much more.</p><p>The second half of the course begins by explaining the process of creating a basic function and tutorials on function parameters, return values and recursion. Then, we investigate handling exceptions and collection types like lists, maps, Enums, sets and queues. Finally, the course concludes with demonstrations on how to create classes, class constructors, class inheritance and tutorials on advanced concepts like runes, debugging and concurrency.</p><p>The Dart programming language is a modern, light and powerful programming language for quickly creating applications for different platforms. This course covers all you need to know to start building apps with the language and is suitable for individuals interested in learning this increasingly popular language. So start now and be on your way to creating applications using Dart in just three hours.</p><a href=\"https://alison.com/resume/courses/4407\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4407\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Dart Programming Basics","description":"This module introduces the course content and covers some common operations in the Dart programming language. You will learn to setup and run Dart, as well as how to print information to the console, and take information from a user. You will also learn about comments, variables, datatypes, and operators in the Dart language.","topics":["Dart Programming Basics – Learning Outcomes","Introduction and Setting Up","Datatypes and Operators","Dart Programming Basics – Lesson Summary"]},{"name":"Module","details":"Flow Control, Functions & Exception Handling","description":"In this module, you will learn how to control the order in which parts of an app's code are executed. You will also learn to create and use functions in the Dart Language. You will learn about if & switch statements, for and while loops, as well as the break and continue statements. You will also learn to handle exceptions with the Dart Language.","topics":["Flow Control, Functions & Exception Handling – Learning Outcomes","Control Flow","Dart Functions","Handling Errors & Exceptions","Flow Control, Functions & Exception Handling – Lesson Summary"]},{"name":"Module","details":"Collections, Classes & Objects","description":"In this module you will be introduced to various collection types, and classes in the Dart Programming Language. Collections covered include lists, maps, enumerations, sets, queues, and much more. You will also learn about class constructors, class inheritance, method overriding, debugging & Concurrency.","topics":["Collections, Classes & Objects – Learning Outcomes","Dart Collections","Classes and Objects","Extras & Conclusion","Collections, Classes & Objects – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["App Development using Dart Programming Language – Course assessment"]}]}