{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5100","title":"App Development Using Pascal","totalEnrolled":"376","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online coding course, you will learn app development from scratch using the Pascal programming language.","description":"The continued use of the Pascal programming language is attributed to its support for structured programming, data structures and its consistent use of loops and conditional structures. As a result, Pascal is considered by some to be a preferred language for programming instructions. We have designed this foundational course to teach you how to develop applications using Pascal with first-hand programming practices.","courseOutcomes":["Set up Pascal on a Windows OS...","Identify the mathematical operators ...","Distinguish between the variable typ...","Explain and state examples of proced...","Set up Pascal on a Windows OS","Identify the mathematical operators used in Pascal","Distinguish between the variable types and state how to declare them","Explain and state examples of procedures in Pascal","Create and declare case statements","Create a repeat until loop in Pascal","Create a file in Pascal","Discuss the use of the file exist function in Pascal","List some procedures used in Pascal programming","Set up Pascal on a Windows OS...","Identify the mathematical operators ...","Distinguish between the variable typ...","Explain and state examples of proced...","Set up Pascal on a Windows OS","Identify the mathematical operators used in Pascal","Distinguish between the variable types and state how to declare them","Explain and state examples of procedures in Pascal","Create and declare case statements","Create a repeat until loop in Pascal","Create a file in Pascal","Discuss the use of the file exist function in Pascal","List some procedures used in Pascal programming"],"courseDescription":"<p>There are several programs to choose from if you want to be an adept applications developer. Pascal programming language is known for its strength in implementing conditionals and control structures. Therefore, this course has been designed to teach app development using Pascal, a language considered to be the foundation of well-known industry-standard applications. We begin by teaching you the fundamentals of Pascal programming: you will first discover how to set up Pascal and write your first program using mathematical operators.</p><p>Variables are essential programming components since they allow you to save data for later use. We show you how to declare and use different types of variables and constants in your program and how to use conditionals to write Pascal programs that make decisions based on predefined terms. You will learn how to use loops and string functions in your programs, as well as how to create records. Finally, we will demonstrate how to work with Pascal files, use the daytime functions, and create and use arguments.</p><p>This course is designed primarily for those without prior knowledge of Pascal programming. We will walk you through Pascal's components, features and elements step-by-step. From the fundamentals to advanced concepts such as conditionals, loops, arrays, and more, we've embedded Pascal source code and simple projects to help you understand various programming concepts. This course is ideal for anyone looking to begin a career in programming.</p><a href=\"https://alison.com/resume/courses/5100\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5100\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Pascal Operators and Variables","description":"In this module, you will be introduced to the basics of Pascal programming, you will learn about variables, how to get users' information and how to create your first program, also learn how to implement conditionals and logical operators in your programs.","topics":["Introduction to Pascal Operators and Variables - Learning Outcomes","Setting up Pascal","Using Math Operators","Variables and Getting User Input","Using If, Else and If Else Statements","Introduction to Pascal Operators and Variables - Lesson Summary"]},{"name":"Module","details":"Using Loops, Arrays and Case statements","description":"In this module, you will learn how to use case statements in your programs, also learn about the different types of loops and how to implement them, you will be shown how to write your pascal programs with string functions and how to use arrays and create records.","topics":["Using Loops, Arrays and Case statements - Learning Outcomes","Using Case Statement","Overview of Loops","Using String Functions","Arrays and Records","Using Loops, Arrays and Case statements - Lesson Summary"]},{"name":"Module","details":"Working with Files and Procedures","description":"In this module, you will be shown how to work with Pascal files, how to use the file exist and the daytime functions as well as how to compare dates, use the encode date feature and how to define and use procedures in conjunction with arguments and functions in your programs.","topics":["Working with Files and Procedures - Learning Outcomes","Working with Files","Using the Day-Time Function","Using Procedures","Working with Files and Procedures - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["App Development Using Pascal - Course Assessment"]}]}