{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2353","title":"Arduino and Programming in Internet of Things","totalEnrolled":"5,594","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about Arduino programming in Internet of Things (IoT), Raspberry Pi and Python with this free online course.","description":"The Internet of Things (IoT) is a field of study that covers physical objects that have sensors, processing ability, software and other technologies that connect and exchange data with other such devices over the internet or other communication networks. Arduino is an open-source electronics platform that is based on easy-to-use hardware and software. This programming course introduces you to the basics of Arduino and explains how to use Python.","courseOutcomes":["Explain the importance of ‘interoper...","List the features of Arduino program...","Discuss Arduino’s sensor interface...","Outline the features of the Raspberr...","Explain the importance of ‘interoperability’ in the context of the Internet of Things","List the features of Arduino programming","Discuss Arduino’s sensor interface","Outline the features of the Raspberry Pi","Describe the basic functions of Python","Explain the importance of ‘interoper...","List the features of Arduino program...","Discuss Arduino’s sensor interface...","Outline the features of the Raspberr...","Explain the importance of ‘interoperability’ in the context of the Internet of Things","List the features of Arduino programming","Discuss Arduino’s sensor interface","Outline the features of the Raspberry Pi","Describe the basic functions of Python"],"courseDescription":"<p>This course shows you how to use the programming language Python and explains its role in embedded systems application development. Embedded software applications are specialized programs running on non-personal computer devices (for example, as part of a microchip or another application that sits on top of the chip to control specific functions of a device). We teach you about Python’s integrated development environment (IDE), its data types and basic control statements. The IDE is a coding tool that allows you to easily write, test and debug your code.</p><p>The course covers remote data logging and the Raspberry Pi interface. The Raspberry Pi is a low cost computer the size of a credit card that plugs into a conventional computer monitor and uses a standard keyboard and mouse. It lets people of all ages explore computing while they learn Python.</p><p>Finally, you will learn how to capture data from sensors. We explain how to use Arduino to integrate sensors and actuators and examine the sensor’s interface with Arduino to help you understand various types of sensors and the distributed hash table (DHT) sensor library. Sign up for this training course to learn how to use basic Python and Arduino programming language commands and integrate with the Internet of Things (IoT).</p><a href=\"https://alison.com/resume/courses/2353\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2353\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Interoperability and Arduino Programming","description":"In this module, you will be introduced to interoperability in the Internet of Things (IoT). You will also be introduced to the basics of Arduino programming and the integration of sensors and actuators with the Arduino platform.","topics":["Interoperability and Arduino Programming - Learning Outcomes","Interoperability in Internet of Things","Introduction to Arduino","Integration of Sensors and Actuators with Arduino","Interoperability and Arduino Programming - Lesson Summary"]},{"name":"Module","details":"Python Programming and Raspberry Pi","description":"In this module, you will be introduced to the python programming language. You will also be introduced to Raspberry Pi, its importance in the development of Internet of Things and the implementation of IoT with Raspberry Pi.","topics":["Python Programming and Raspberry Pi - Learning Outcomes","Introduction to Python Programming","Python Programming Applications","Introduction to Raspberry Pi","Implementation of IoT with Raspberry Pi","Overview of Implementation with Raspberry Pi","Python Programming and Raspberry Pi - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Arduino and Programming in Internet of Things - Final Assessment"]}]}