{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4809","title":"AWS Solutions Architect Exam Prep","totalEnrolled":"775","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Prepare for the AWS Solutions Architect Certification examination with this free online course on Alison.com.","description":"Are you looking to take your AWS certification to the next level? Or are you looking for better career opportunities within the AWS design and implementation industry? If you are, then you have come to the right place. This course on AWS systems architecture helps you prepare for the Solutions Architect exam in the most comprehensive manner possible. So don't waste time. Enroll now and open new horizons and professional opportunities today!","courseOutcomes":["Describe the AWS Solutions Architect...","Identify the methods available withi...","Outline the services and tools withi...","Examine the variety of resources ava...","Describe the AWS Solutions Architect examination requirements and prerequisites in detail","Identify the methods available within the AWS framework to create resilient architecture designs","Outline the services and tools within AWS to construct well-architected solutions","Examine the variety of resources available to design high-performance architectures","Analyze the various options available within AWS to ensure the safety and security of data in the cloud","Discuss the methods and tools at the users' disposal to ensure cost optimization of architectures","Describe the AWS Solutions Architect...","Identify the methods available withi...","Outline the services and tools withi...","Examine the variety of resources ava...","Describe the AWS Solutions Architect examination requirements and prerequisites in detail","Identify the methods available within the AWS framework to create resilient architecture designs","Outline the services and tools within AWS to construct well-architected solutions","Examine the variety of resources available to design high-performance architectures","Analyze the various options available within AWS to ensure the safety and security of data in the cloud","Discuss the methods and tools at the users' disposal to ensure cost optimization of architectures"],"courseDescription":"<p>In this Amazon Web Services (AWS) Solutions Architect crash course, Joe Holbrook, the CLO at Techcommanders, will be taking you on a comprehensive preparation journey to take your qualification to the next level. This course is your go-to guide for the Solutions Architect exam with AWS service demos, whiteboard discussions, examination tips and documentation links. We kick off with an overview of the solutions architect examination. Then we will discuss the various certifications, roles and prerequisites required. As part of the course preparation, we will discuss designing resilient architectures. We describe single and multi-tier architectural solutions along with best practices for design architecture. Is your cloud architecture lacking a planned approach? We will discuss preparing the AWS environment and virtual private clouds next.</p><p>The following section will examine the services offered by AWS to compute workloads such as EC2, Lambda and Elastic Beanstalk. The scalability and elasticity of these solutions are critical. Each section of the course provides some exam tips and techniques that will assist in applying this knowledge. In addition, we identify other essential AWS services such as elastic cache and other solutions for database domains such as Aurora and DynamoDB. We will demonstrate the use of all these applications and ensure the management of AWS resources orderly using CloudFormation. Next, we look for ways to keep your resources and deployments secure. When it comes to cloud computing, security is of paramount importance. Luckily, AWS provides numerous services that ensure data safety in the cloud. We analyze issues as simple as passwords and learn about restricting access to services that keep track and set off alarms.</p><p>AWS provides an array of services to ensure errors and faults are recognized early. We demonstrate these services, such as AWS config, S3 and data-in-transit. Ensuring that the AWS solutions are cost-effective is integral to designing and implementing resources. Luckily, AWS has a wide variety of cost optimization and billing management services within its framework. The AWS solutions architect certification can open many doors for individuals within the cloud-developing industry. These opportunities can lead to better growth and income streams for individuals in the short and long term. This online course on Alison.com will guide you every step of the way to achieve the AWS certification and your professional and personal goals. So enroll now and get started!</p><a href=\"https://alison.com/resume/courses/4809\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4809\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Design Resilient Architectures","description":"In this module, the learner will examine the framework for well-architected solutions and deployments. The module starts off with an examination overview along with an introduction to the course instructor. Best practices for could solutions and tools available to ensure deployments are scalable and elastic shall be analyzed.","topics":["Design Resilient Architectures - Learning Outcomes","AWS Certification - Overview","Designing Your Deployments","AWS Environment Planning","Virtual Private Cloud","AWS Design Fundamentals","AWS Route 53","Design Resilient Architectures - Lesson Summary"]},{"name":"Module","details":"Design High Performance Architectures","description":"In this module, the learner will be going through the key tools and services that can be used to design high-performance architectures. Identifying scalable solutions along with AWS design principles shall be discussed. The performance of cloud-based services will be examined. DevOps and AWS CloudWatch services shall also be discussed.","topics":["Design High Performance Architectures - Learning Outcomes","Compute Solutions for a Workload","Placement Groups and Lambda Performance","AWS Storage Options","Storage Performance and Connectivity Options","AWS Systems Manager","Section Summary and Questions","Design High Performance Architectures - Lesson Summary"]},{"name":"Module","details":"Design Secure Applications and Architectures","description":"In this module, the learner will be going through certain aspects of security and best practices in the AWS framework. The various types of users within AWS shall be identified. The application of AWS Cloudtrail and Cloudwatch log trails shall be discussed. VPC flow logs, NACLS, and security groups along with S# permissions shall be described.","topics":["Design Secure Applications and Architectures - Learning Outcomes","AWS Security Overview","Admin Users, Trusted Advisors and CloudWatch","CloudTrail and CloudWatch Features","VPC Flow Logs, Security Hub and Bastion Host","Security groups, Resources and Maintenance","S3 Permissions, IAM and Encryption Demo","Data-in-Transit and S3","AWS Config, Inspector and Guardduty","Section Summary","Design Secure Applications and Architectures - Lesson Summary"]},{"name":"Module","details":"Design Cost Optimized Architectures","description":"This module will be dealing with identifying the most cost-effective architecture design solutions with AWS. The learner will be going through several cost models available such as EC2, lambda, and dynamo along with numerous others. A discussion on AWS costing and pricing tools shall be carried out.","topics":["Design Cost Optimized Architectures - Learning Outcomes","Cost-Effective Storage Solutions, S3 and EBS","EC2 and Cost-Effective Compute Services","LightSail, S3 Lifecycles and Billing Management","AWS Costing Plans, Pricing calculators and Savings","AWS Budgeting and Cost Management","Section Summary","Design Cost Optimized Architectures - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AWS Systems Architect Exam Prep - Course assessment"]}]}