{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4569","title":"AWS Hands-on: Implementing RDS, DynamoDB and CRUD Operations","totalEnrolled":"340","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how to develop relational databases (RDS) and NoSQL (DynamoDB) for Amazon Services in this free online course.","description":"When companies store data and require computing power, they turn to cloud computing options like Amazon Web Services. Depending on the use case, you'll want to know about relational and non-relational database types. This course will not only teach you Amazon RDS (a service that enables the use of various relational engines) and DynamoDB (non-relational), but you'll also develop them programmatically with the help of Python and Boto3.","courseOutcomes":["Identify the various tools used for ...","Distinguish between relational (RDS)...","Create an RDS PostgreSQL instance...","Discuss the arguments required for t...","Identify the various tools used for development","Distinguish between relational (RDS) and non-relational (DynamoDB) databases","Create an RDS PostgreSQL instance","Discuss the arguments required for the create_db_instance","Explain the role of Postico and pgAdmin","List the benefits of using the downloadable version of DynamoDB","Define the notion of backup instance","Create a table with DynamoDB","Identify the various tools used for ...","Distinguish between relational (RDS)...","Create an RDS PostgreSQL instance...","Discuss the arguments required for t...","Identify the various tools used for development","Distinguish between relational (RDS) and non-relational (DynamoDB) databases","Create an RDS PostgreSQL instance","Discuss the arguments required for the create_db_instance","Explain the role of Postico and pgAdmin","List the benefits of using the downloadable version of DynamoDB","Define the notion of backup instance","Create a table with DynamoDB"],"courseDescription":"<p>Discover the cloud computing platform, and become competent in implementing relational (RDS) and non-relational database (DynamoDB) options. This course shows you how to develop these options with Python programming using the Boto3 package. You'll start by learning about the development tools (packages, integrated development environment or IDE, and Python) that will help you in your journey. Then, you will create an AWS (Amazon Web Services) account and understand how to prepare your environment based on your operating system.</p><p>In the next section, the instructor introduces the Amazon Relational Database Service. Become familiar with Boto3 documentation and create an RDS PostgreSQL DB instance. You’ll connect to the instance via Postico and then describe, modify, back up, restore, and delete an RDS instance. After that, the presenter introduces DynamoDB. You will grasp how to create a table and then describe, update, and delete it.</p><p>The final section goes into more detail about RDS. You will launch an RDS instance, verify the connection with Postico, build a configuration file for RDS instance credentials, connect to the RDS instance with psycopg2, create tables, insert, read, update and delete data. Finally, you'll study the downloadable version of DynamoDB. Become competent in creating tables, writing data (including conditionally updating), and reading data (including preparing and scanning items). The demand for physical servers is decreasing, yet the opportunities in cloud technology are expanding fast - so, be on top of the cloud, not under it and learn to develop with AWS.</p><a href=\"https://alison.com/resume/courses/4569\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4569\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Relational and Non-Relational Databases","description":"This module will introduce you to two database types; First, a relational database called the Amazon Relational Database Service (RDS), and DynamoDB, a NoSQL (also known as a non-relational) database that does not require SQL to implement.","topics":["Relational and Non-Relational Databases - Learning Outcomes","Introduction and Tools","Installation for Windows and Mac","Intro to Relational Database Service (RDS)","Intro to DynamoDB and Boto3","More RDS with Boto3 - psycopg2","The Downloadable Version of DynamoDB","Relational and Non-Relational Databases - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AWS Hands-on: Implementing RDS, DynamoDB and CRUD Operations - Course Assessment"]}]}