{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4565","title":"AWS Hands-on: Working with S3, EC2 and VPC","totalEnrolled":"797","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore Amazon Web Services, including how to create a virtual private cloud (VPC), in this free online course.","description":"Discover how Amazon Web Services (AWS) enables you to store and access resources by developing a virtual private cloud (VPC). Instead of using the AWS console, this course looks at a graphical interface that uses Python to accomplish this goal via point-and-click. You will learn software development fundamentals by using Boto3, a Python library. Start your journey by enrolling for free and earning optional AWS certification.","courseOutcomes":["Prepare your development environment...","Explain what S3 is, what it stands f...","Define bucket and object...","Describe the purpose of versioning...","Prepare your development environment based on your operating system","Explain what S3 is, what it stands for, and its various use cases","Define bucket and object","Describe the purpose of versioning","Outline the various aspects that you can configure when hosting a website in an S3 bucket","Recall what a virtual private cloud is and what it enables one to do","List the various concepts related to VPCs","Distinguish the purpose between public and private subnets","Indicate how various instance types may differ","Discuss how you would go about associating a public subnet with a public route table","Prepare your development environment...","Explain what S3 is, what it stands f...","Define bucket and object...","Describe the purpose of versioning...","Prepare your development environment based on your operating system","Explain what S3 is, what it stands for, and its various use cases","Define bucket and object","Describe the purpose of versioning","Outline the various aspects that you can configure when hosting a website in an S3 bucket","Recall what a virtual private cloud is and what it enables one to do","List the various concepts related to VPCs","Distinguish the purpose between public and private subnets","Indicate how various instance types may differ","Discuss how you would go about associating a public subnet with a public route table"],"courseDescription":"<p>The uses of Amazon Web Services (AWS) are varied and across many industries such as data and analytics, infrastructure software, migration, security, and much more. This course shows you a simple use case of securely storing objects and performing basic operations. You will learn about the tools (an integrated development environment, library, and programming language) and create an AWS account. Next, based on your operating system, you will discover how to set up your environment.</p><p>In the next section, you'll explore the fundamental concept of buckets and bucket operations, including creating and deleting a bucket. After that, you study object operations, including how to upload small and large files, read objects, make multiple copies of them and be introduced to the idea of a lifecycle policy. Following that, the instructor illustrates a particular use case, the hosting of a website.</p><p>The final section introduces you to a virtual private cloud (VPC). You will learn how to create a VPC, an Internet gateway, public and private subnet, route table, add a name tag to resources and attach the gateway to a VPC. Subsequently, you'll study the Elastic Compute Cloud Instance (EC2) and construct a security group, a startup script, launch an EC2 instance, connect to the EC2 instance, and then see how to perform basic actions like describing, modifying, stopping and starting an instance. So, get ahead by learning how to be a creator in the virtual world by taking this free online AWS course.</p><a href=\"https://alison.com/resume/courses/4565\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4565\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Prep and Simple Storage Service (S3)","description":"This module will help you get everything set up so you can follow along with the course before illustrating the Simple Storage Service (S3), covering bucket operations, object operations, and website hosting.","topics":["Prep and Simple Storage Service (S3) - Learning Outcomes","Preparing the Environment for Development","Windows Environment Setup","MacOS Environment Setup","Bucket Operations","Object Operations","Website Hosting","Prep and Simple Storage Service (S3) - Lesson Summary"]},{"name":"Module","details":"Virtual Private Cloud and Elastic Compute Cloud","description":"This module will advance in-depth knowledge about the virtual private cloud (VPC), and the elastic compute cloud (EC2). You will go from checking the Boto3 documentation and installing PyCharm to creating and manipulating an EC2 instance.","topics":["Virtual Private Cloud and Elastic Compute Cloud - Learning Outcomes","Intro to Virtual Private Cloud","More on the Virtual Private Cloud","Elastic Compute Cloud Instance and Virtual Server","More on Elastic Compute Cloud (EC2)","Virtual Private Cloud and Elastic Compute Cloud - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AWS Hands-on: Working with S3, EC2 and VPC - Course Assessment"]}]}