{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4687","title":"AWS DevOps Continuous; Integration, Delivery and Deployment","totalEnrolled":"1,038","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course is a step-by-step process of integration, delivery and deployment of a software application.","description":"AWS is a real-time cloud platform to help you fully manage a continuous delivery service for application and infrastructure updates. We provide you with an understanding of AWS CodePipeline, and what it can do for you and examine all the components and benefits of the platform. We will provide information to assist you in applying an application's integration, delivery and deployment. So, why wait? Enroll today!","courseOutcomes":["Analyze the software build process a...","Define continuous integration and de...","Identify how CD Pipeline and AWS Cod...","Describe AWS CodeDeploy features and...","Analyze the software build process and how it's beneficial for your release process","Define continuous integration and delivery integration inside the software delivery process","Identify how CD Pipeline and AWS CodePipeline work","Describe AWS CodeDeploy features and how it works","Recognize how to apply CI and CD Pipeline in the AWS platform","Distinguish how to properly set up AWS roles","Indicate how to correctly set up Jenkins in AWS","Evaluate how to set up a Jenkins job","Analyze the software build process a...","Define continuous integration and de...","Identify how CD Pipeline and AWS Cod...","Describe AWS CodeDeploy features and...","Analyze the software build process and how it's beneficial for your release process","Define continuous integration and delivery integration inside the software delivery process","Identify how CD Pipeline and AWS CodePipeline work","Describe AWS CodeDeploy features and how it works","Recognize how to apply CI and CD Pipeline in the AWS platform","Distinguish how to properly set up AWS roles","Indicate how to correctly set up Jenkins in AWS","Evaluate how to set up a Jenkins job"],"courseDescription":"<p>Amazon Web Services (AWS) is the world's most comprehensive and broadly adopted cloud platform, offering over two hundred fully-featured services from data centers globally. This course provides accurate knowledge of the process of integration, delivery and deployment of an application. It describes and clarifies the characteristics and functions of the tools. It guides you through specific information about the AWS platform, helping you understand 'CodeDeploy' and 'CodePipeline.' We provide answers to questions relating to the Jenkins platform and explore how to correct coding errors. We discuss creating an application and the tools you require, then teach you to assess the various ways of adding and modifying those jobs.</p><p>Following this, we will prepare you for the various AWS tools you will need to develop your application. First, learn how to correctly use the tools in AWS and Jenkins to avoid mistakes. Next, you will discover how to troubleshoot the errors to have a functional and successful application. We explain how to set up notifications to monitor your coding. Finally, we clarify what AWS is and what you use Jenkins for before ultimately conveying how to fix errors in the application.</p><p>This course will equip you with the skills needed to use AWS to integrate, deliver and deploy an application at a beginner level. It provides precise and detailed techniques you can use in your working field. It is ideal for those starting an application or employees who want to learn how to use it to its full potential. Register for this course and become confident in developing applications.</p><a href=\"https://alison.com/resume/courses/4687\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4687\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"AWS CodePipeline and AWS CodeDeploy","description":"This module will begin by providing you with an introduction to the tools and vocabulary you will be using throughout this course. You will be able to study in-depth the main areas to manage. This Module will provide answers to questions like: What is AWS CodePipeline? What is the benefit of using it?","topics":["AWS CodePipeline and AWS CodeDeploy - Learning Outcomes","Introduction to Software Build and Release Processes","Software Build and Release Processes","AWS CodePipeline","How AWS CodeDeploy Works","How Jenkins Works","Project Setup","Setup PostgreSQL Database in AWS RDS","Setup Node, API Project","Setup Sqitch (Database Schema Framework)","AWS CodePipeline and AWS CodeDeploy - Lesson summary"]},{"name":"Module","details":"AWS Roles and Prerequisites","description":"This module begins by providing you with samples about effective CI and CD Pipeline procedures like: What mistakes to avoid. We will help you organize information linked to creating AWS CodeDeploy.You will find the answer to questions like: Why is beneficial the detection of errors and notifications? How can you correct codes?","topics":["AWS Roles and Prerequisites - Learning Outcomes","CI and CD Pipeline Deep Dive","Create AWS CodeDeploy Application","Build CD Pipeline","Build and Deployment Notifications","CI, CD Pipeline with Source Code Changes","AWS Roles and Prerequisites - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["AWS DevOps Continuous; Integration, Delivery and Deployment - Course assessment"]}]}