{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3549","title":"Azure Masterclass: Analyze Data With Azure Stream Analytics","totalEnrolled":"2,579","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how you can benefit from Azure Stream Analytics business intelligence software with this free online course.","description":"Data analysis has proven to be a game-changing competitive advantage to many organizations across the world. Azure is one of the most widely-used business intelligence systems that allows you to make the most of your data and this free online course on Azure Stream Analytics discusses the tools used to collect real-time information, how to combine Azure Stream Analytics and Microsoft Power Business Intelligence (BI) and visualize analytical data.","courseOutcomes":["Discuss the functions and capabiliti...","Recall how to input data into ASA...","Describe how to create queries and d...","Paraphrase how to output the results...","Discuss the functions and capabilities of Azure Stream Analytics (ASA)","Recall how to input data into ASA","Describe how to create queries and data analysis pipelines with ASA","Paraphrase how to output the results of the data analysis pipeline to various output formats","Explain how to work with ASA and Microsoft Power Business Intelligence","Outline how to visualize your data","Discuss the functions and capabiliti...","Recall how to input data into ASA...","Describe how to create queries and d...","Paraphrase how to output the results...","Discuss the functions and capabilities of Azure Stream Analytics (ASA)","Recall how to input data into ASA","Describe how to create queries and data analysis pipelines with ASA","Paraphrase how to output the results of the data analysis pipeline to various output formats","Explain how to work with ASA and Microsoft Power Business Intelligence","Outline how to visualize your data"],"courseDescription":"<p>Having business-critical information at your fingertips is a critical aspect of making strategic business decisions in the modern workplace. In this course, you will be introduced to Azure Stream Analytics (ASA), an effective solution for exactly this. More specifically, you will learn about the basics of ASA and learn how to create real-time analytical queries through Azure portal. You will learn how to create a stream analytics ‘job’ based on three main requirements: input, query and output. Storing data using SQL expanded databases for manipulation and curation will also be discussed. Even if you don’t have any prior experience using Azure or similar software, this free online Azure course guides you with comprehensive video demonstrations to help familiarize you with the tools and layouts of the Azure portal.&nbsp;</p><p><br>The next section of this Azure Masterclass covers ASA components and functions and their various uses. You will learn the kinds of “jobs” Azure can do, the types of inputs and outputs at your disposal, and the many methods of visualization you can use. The content then covers the many aspects of Azure ‘queries’ including query structures, key functions to filtering input data, how SQL coding language can be used to create queries and built-in functions such as aggregate, analytics, record, conversion and scalar, and the different data types that can be used in Azure. The last part of this data analytics course covers another analytics service available that can be used alongside Azure, known as Microsoft Power Business Intelligence (Power BI). As well as being a suite of tools for analyzing data, you can use Power BI to share real-time insights based on your analysis and all of this is illustrated through simple-to-understand written and video content.&nbsp;</p><p><br>This Azure Masterclass has a wide range of applications in the modern workplace and will allow you to form a solid understanding of how to create queries to collect analytical data and visualize this data in a creative and meaningful way. Enrolling in this free online Azure course will benefit students and seasoned professionals involved in data analysis, data science, business analysis, business intelligence analysis, data engineering and business intelligence development.</p><a href=\"https://alison.com/resume/courses/3549\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3549\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Azure","description":"In this module, you will be introduced to Azure stream analytics. This includes the full layout of the portal and the functions that you can use to connect multiple services of your company. You will learn how to input data and how to output the results of the analysis into multiple forms of visualisation. You will also study Microsoft Power BI.","topics":["Introduction to Azure - Learning Outcomes","Introduction to Azure Stream Analytics","The Azure Pipeline","ASA Jobs and Components","Microsoft Power BI Visualisation","Introduction to Azure - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}