{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5004","title":"Basics of Webpack","totalEnrolled":"171","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how to use Webpack for resolving common issues to create quality JavaScript apps in this free online course.","description":"Webpack is one of the tools available for bundling JavaScript files into a single file with a rich plugin interface. This free online Webpack course will give you a clear understanding of core concepts to solve the problem of bundling and how it differs from other technologies. Discover how to develop custom web applications using a modular approach and the stages involved in adding new features and capabilities to a project.","courseOutcomes":["Discuss how to code a Webpack-enable...","Lists the function of Webpack...","Summarize the significance of Webpac...","Explain the source maps, ‘watch’ mod...","Discuss how to code a Webpack-enabled JavaScript project from scratch","Lists the function of Webpack","Summarize the significance of Webpack in modular JavaScript","Explain the source maps, ‘watch’ mode and development server","Indicate the difference between Webpack and other tools","Describe the steps for installing, configuring and running Webpack","Recognize the use of node.js and npm package manager","State the process of creating a new project using Codeanywhere","Discuss how to code a Webpack-enable...","Lists the function of Webpack...","Summarize the significance of Webpac...","Explain the source maps, ‘watch’ mod...","Discuss how to code a Webpack-enabled JavaScript project from scratch","Lists the function of Webpack","Summarize the significance of Webpack in modular JavaScript","Explain the source maps, ‘watch’ mode and development server","Indicate the difference between Webpack and other tools","Describe the steps for installing, configuring and running Webpack","Recognize the use of node.js and npm package manager","State the process of creating a new project using Codeanywhere"],"courseDescription":"<p>Are you looking for a comprehensive course to enhance your Java skills and experience? This course will give you in-depth knowledge about the features and capabilities of Webpack, core concepts and how it works to start building your JavaScript applications. We will also cover how to install, configure and test it successfully. Learn how to set up and create a new project using online web applications. Find out how to solve browser caching issues using cache busting in Webpack to improve web application performance.</p><p>Additionally, you will learn how to create a workspace in Cloud9 and install Angular CLI, Node and others. Find out why we need Webpack plugins and how to extract all CSS into a separate CSS file. Discover how to configure Webpack-dev-server to make our development process faster and more convenient. Learn how to bundle a JavaScript application with bundle.js files in Webpack. Familiarize yourself with the command that will run Webpack in ‘watch’ mode and the various types of loaders.</p><p>Finally, we will demonstrate how to install, configure and run Webpack. Discover how to upgrade node and npm versions within the Codeanywhere workspace environment. Anyone with a background in HTML, web servers and configuration will benefit from this fascinating course. People lacking experience or skills can also learn valuable information from this field of study. By the end of this course, you will create a web application with better performance. Jumpstart your career as a professional web developer today and enroll now!</p><a href=\"https://alison.com/resume/courses/5004\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5004\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Webpack","description":"In this module, you will learn how to code a Webpack-enabled JavaScript project from scratch and add more Webpack features and capabilities to the project. Discover the steps for installing, configuring and running Webpack before delving into using node.js and npm package manager.","topics":["Fundamentals of Webpack - Learning Outcomes","Introduction to Webpack","How to Prepare Webpack","How to Use Webpack","Fundamentals of Webpack - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Webpack - Course Assessment"]}]}