{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5254","title":"Basics of AutoCAD, SolidWorks and T-Flex","totalEnrolled":"3,401","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free CAD online course teaches you how to use AutoCAD, SolidWorks, T-FLEX and FreeCAD software.","description":"Computer-aided design (CAD) is a rapidly expanding segment within the labor market due to its widespread adoption in top manufacturing industries such as civil engineering. Statistics show that the demand for CAD designers will increase as technology advances even further. We created this course to help you understand the basics, roles, and requirements of a CAD designer and the applications of various CAD design software programs.","courseOutcomes":["State the applications of computer-a...","Discuss the day-to-day duties of a C...","Recall the procedures involved in re...","Identify the states of mechatronics ...","State the applications of computer-aided design (CAD) software","Discuss the day-to-day duties of a CAD engineer","Recall the procedures involved in reverse engineering","Identify the states of mechatronics simulation","Explain the principles of extrusion in CAD","Distinguish between various blending operations in CAD","List and discuss the parameters of civil drawings","Explain the function of various keyboard commands used in AutoCAD","State the features and applications of FreeCAD and Solidworks","Distinguish between the various versions of T-FLEX CAD","State the applications of computer-a...","Discuss the day-to-day duties of a C...","Recall the procedures involved in re...","Identify the states of mechatronics ...","State the applications of computer-aided design (CAD) software","Discuss the day-to-day duties of a CAD engineer","Recall the procedures involved in reverse engineering","Identify the states of mechatronics simulation","Explain the principles of extrusion in CAD","Distinguish between various blending operations in CAD","List and discuss the parameters of civil drawings","Explain the function of various keyboard commands used in AutoCAD","State the features and applications of FreeCAD and Solidworks","Distinguish between the various versions of T-FLEX CAD"],"courseDescription":"<p>Since its inception, computer-aided design (CAD) has grown in popularity and relevance due to its widespread adoption by top manufacturing industries such as civil engineering to design and execute projects. This course has been created to teach you the features and applications of various software used in CAD. It begins with an overview of the history and significance of CAD, as well as the skills, requirements, and roles of a CAD designer. Learn about product design, cost estimations, and considerations for using CAD, as well as solid and fluid mechanisms terms and laws.</p><p>The idea behind 3D drawings is to add a third dimension to designs to show depth all in one view. By taking this course, you will also learn about 2D drawings, the Z coordinate, geometry, and modeling in CAD. Discover the concepts of assemblies and mechatronic simulations in CAD, as well as extrusion and rotation. We will teach you about grids, regular polygons, and blending operations in CAD. Learn the properties of various parameters in civil drawings such as walls and columns, and then the features and applications of AutoCAD, T-FLEX, FreeCAD, and SolidWorks in computer-aided design.</p><p>The value of CAD cannot be overstated, from preliminary design and layouts to design details, calculations, and 3D modeling. The demand for these jobs will only increase as technology advances. This course was created to serve as a free online guide for anyone interested in becoming a CAD designer. Upskill by enrolling today!</p><a href=\"https://alison.com/resume/courses/5254\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5254\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of Computer-Aided Design (CAD)","description":"In this module, you will be introduced to the basics of computer-aided design, you will learn the importance, requirements, and roles of a CAD designer. You will also learn about 2D and 3D shapes in CAD, geometry, and modeling and also assemblies and mechatronic stimulation in CAD","topics":["Basics of Computer-Aided Design (CAD) - Learning Outcomes","Introduction to Computer-Aided Design (CAD)","Fluid Mechanisms and 2D Shapes in CAD","3D Shapes and Assemblies in CAD","Basics of Computer-Aided Design (CAD) - Lesson Summary"]},{"name":"Module","details":"Advanced Computer-Aided Design Operations","description":"In this module, you will learn about the extrusion, rotation, and various blending operations in CAD, you will also learn the properties of various parameters in civil drawings as well as the characteristics and applications of AutoCAD, SolidWorks, and FreeCAD","topics":["Advanced Computer-Aided Design Operations - Learning Outcomes","Operations in Computer-Aided Design","Grids, and Parameters in Civil Drawings","Introduction to Solidworks and FreeCAD","Advanced Computer-Aided Design Operations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of AutoCAD, SolidWorks and T-Flex - Course Assessment"]}]}