{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3920","title":"Basic Programming in iOS11 and Swift 4","totalEnrolled":"351","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course guides you through the Apple integrated development environment and basic iOS app development.","description":"Would you like to create your own iPhone and iPad iOS 11 apps but are unsure where to start? This free online course will introduce you to the basic foundations of building apps on iOS platforms. We will outline how to install Xcode 9, code Swift 4 and teach you some of the best programming practices. With the aid of object-oriented programming, you will be able to build professional apps. Let’s get started!","courseOutcomes":["Describe how to install Xcode9 and t...","Differentiate between local and glob...","Summarize the concept of object-orie...","Explain why Git version control make...","Describe how to install Xcode9 and the Beta 4 update","Differentiate between local and global variables","Summarize the concept of object-oriented programming","Explain why Git version control makes programming easier","Identify how to display data in collection view cells","Differentiate between table views and collection views","Explain how to create a web request in Xcode","Differentiate between polymorphism and enumerations","Compare input accessory views and IBDesignable","Describe how to install Xcode9 and t...","Differentiate between local and glob...","Summarize the concept of object-orie...","Explain why Git version control make...","Describe how to install Xcode9 and the Beta 4 update","Differentiate between local and global variables","Summarize the concept of object-oriented programming","Explain why Git version control makes programming easier","Identify how to display data in collection view cells","Differentiate between table views and collection views","Explain how to create a web request in Xcode","Differentiate between polymorphism and enumerations","Compare input accessory views and IBDesignable"],"courseDescription":"<p>Xcode is a complete developer toolset for creating apps for Mac, iPhone, iPad, Apple Watch, and Apple TV. It brings user interface design, coding, testing, debugging, and submitting to the App Store into a unified workflow. Xcode also supports source code for C, C++, AppleScript, Python, Ruby, and Swift. Xcode includes the GUI tool Instruments, which runs atop a dynamic tracing framework, DTrace, created by Sun Microsystems and released as part of OpenSolaris. Swift is a powerful and intuitive programming language for iOS, iPadOS, macOS, tvOS, and watchOS. Xcode also integrates built-in support for source code management using the Git version control system and protocol. Swift results from the latest research on programming languages, combined with decades of experience building Apple platforms. Writing Swift code is interactive and fun. The syntax is concise yet expressive, and Swift includes modern features developers love. Swift code is safe by design yet also produces software that runs lightning-fast.&nbsp;</p><p>We will install Xcode 9, which provides a completely rebuilt source code management component with seamless Git and GitHub integration. The ability to run multiple concurrent simulators and wirelessly debug on physical devices such as the iPhone and Apple TV makes it very suitable for programming. Object-oriented programming aims to implement real-world entities like inheritance, hiding, polymorphism, and more. The main aim of OOP is to bind together the data and the functions that operate on them so that no other part of the code can access this data except the function in question. OOP focuses on the objects developers want to manipulate rather than the logic required to manipulate them. This programming approach is well-suited for programs that are large, complex, and actively updated or maintained.</p><p>If you are working on a project over time, you may want to keep track of the changes made, by whom, and when those changes were made. This becomes increasingly important if you end up having a bug in your code. Git can also be a bit confusing when you first start learning it. Since the introduction of Apple devices, the demand for mobile apps has been steadily growing. As a result, the App Store has become a market leader where mobile users from every corner of our planet can find quality applications to their liking. This course introduces you to Git version control and the terminal basics. You will learn about the various actions you can do with the terminal and set up GitHub.This course outlines a comprehensive step-by-step guide from idea to execution on how to build professional iOS applications. So, register for this course today and begin your next learning journey!</p><a href=\"https://alison.com/resume/courses/3920\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3920\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Xcode and Core iOS","description":"This module introduces you to the basics of Xcode and core ios. The module also analyzes the fundamental aspects of Swift 4 and how they can be applied in programming. You will also learn about how to set up a GitHub account and how to handle Git merge conflicts.","topics":["Introduction to Xcode and Core iOS - Learning Outcomes","Getting Started with Xcode","Learn to Code with Swift 4","Object Oriented Programming","Extensions and Protocols","Version Control with GIT","Introduction to Xcode and Core iOS - Lesson Summary"]},{"name":"Module","details":"Building Apps with Swift 4","description":"This module introduces the learner to building professional apps with swift 4. The module also analyzes auto layouts, segues, and how to implement them in our programs. You will also learn about user validations and authentication in ios 11.","topics":["Building Apps with Swift 4 - Learning Outcomes","Auto Layout and Segues","Building Professional Apps","Tables and Data","Networking and API","User Validation and Actions","Channels and Messages","Building Apps with Swift 4 - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basic Programming in iOS11 and Swift 4 - Course Assessment"]}]}