{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4885","title":"Basics of PowerPoint 2021","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to quickly create stunning, slick presentations with PowerPoint 2021 in this free online course.","description":"A well-done PowerPoint presentation can mean the difference between securing a job and not. Microsoft PowerPoint summarises the key points representing powerful proposals and business ideas. It is therefore prudent to have the best modern skills for creating such work. In this course, you will learn the fundamental principles of modern PowerPoint presentations. You will explore and master the new features of MS PowerPoint 2021 and its functions.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, ‘Basics of PowerPoint 2021’, we will introduce you to the newest features in Microsoft PowerPoint. We will explore and familiarise ourselves with the interface and explain how to customise the ‘quick access’ toolbar to enhance efficiency. Creating visually stunning presentations is quite simple but a lot can go wrong if you ignore the details. Discover what makes a PowerPoint presentation compelling so you can keep your audience rapt with every slide. We have designed this course to help you master different presentation methods and best practices in creating professional slides for your PowerPoint presentations.</p><p>Did you know there are quick and easy ways to select objects in your slides? This feature saves you a lot of time when working on your slides. Selection, alignment and grouping are essential skills for designing well-articulated presentations. You will learn the dexterous art of grouping objects together so that you can apply formatting to multiple items at once. In addition, learn how to reuse slides from other presentations and create slides from an outline. Other vital points you will master include how to correctly resize a background image using ‘crop’ and ‘fill’ functions, using the ‘eyedropper’ tool to create a consistent colour throughout your presentations, locking shapes and setting a default shape.</p><p>One of the newest features in PowerPoint is the ‘slide zoom’. With slide zoom, you can create more engaging and live content in your presentations. Videos are also an essential part of PowerPoint presentations these days. You will discover different techniques of how you can insert your own videos and also how you can use videos as a motion background to add a bit of interest. In addition, we will demonstrate how you can add audio and incorporate screenshots from other applications into your slides. This course includes exercises to help you practise what we teach you. If you are keen on creating excellent presentations using PowerPoint 2021, then you are in the right place! You do not need prior knowledge of PowerPoint before signing up for this course. Click on the ‘register’ button and explore all the features that PowerPoint 2021 offers.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}