{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4392","title":"Beginners Guide to Microsoft Word","totalEnrolled":"5,378","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to use the various Microsoft Word options to their maximum potential.","description":"Even though Microsoft Word offers hundreds of valuable functions, most of us only use a small portion of them. Consider how much simpler our daily work would be if we used even a fraction of Microsoft Word's features. This course will introduce you to the world of MS Word by demonstrating how to do more work with less effort. Use the advice in this course to your advantage and learn how to use this program successfully.","courseOutcomes":["Explain the process of managing docu...","Recognise the opportunities and bene...","Explain how to use Microsoft Word’s ...","Describe how to modify the view and ...","Explain the process of managing documents in Microsoft Word","Recognise the opportunities and benefits of MS Word's menus","Explain how to use Microsoft Word’s interface","Describe how to modify the view and theme of a Microsoft Word document","Discuss how to format the document in Microsoft Word","Outline the different print settings","Identify how to insert tables, pictures, shapes and ‘SmartArt’ in Microsoft Word","Compare the ways to insert and use a table and chart in Microsoft Word","Distinguish different options available in Microsoft Word options","Summarise the various tips to manage header and footer in Microsoft Word","Explain the process of managing docu...","Recognise the opportunities and bene...","Explain how to use Microsoft Word’s ...","Describe how to modify the view and ...","Explain the process of managing documents in Microsoft Word","Recognise the opportunities and benefits of MS Word's menus","Explain how to use Microsoft Word’s interface","Describe how to modify the view and theme of a Microsoft Word document","Discuss how to format the document in Microsoft Word","Outline the different print settings","Identify how to insert tables, pictures, shapes and ‘SmartArt’ in Microsoft Word","Compare the ways to insert and use a table and chart in Microsoft Word","Distinguish different options available in Microsoft Word options","Summarise the various tips to manage header and footer in Microsoft Word"],"courseDescription":"<p>This course aims to teach you how to create and manage documents professionally. It starts by illustrating the most basic Microsoft Word options, teaching you the different methods of launching the program and the options on the start home page. Discover how to open an existing file or create a new or blank template. We will then describe how recovering unsaved files can be a valuable alternative. Understanding the MS Word interface allows you to manage different options and use them appropriately. Learn how to create new documents or open existing ones, save your newly created or updated document and manage print settings.</p><p>The following section explores the home menu. Examine how to manage clipboards, cut, copy or paste. We demonstrate how to customise fonts and paragraphs and modify font styles. The ‘insert’ menu allows you to add multiple items to your document. Learn to insert and format a cover page, blank page and page break. We will illustrate the different methods of inserting tables, table designs and layouts. Learn the MS word tables by practically making an invoice, certificate, attendance and CV. Next, we explain how to insert a picture or shape and use the 'SmartArt' function and customise the ideal template for your purposes.</p><p>The final section of the course describes how to use the ‘built-in’ option. You will learn how to use the Windows tool to take a screenshot, link and bookmark objects and add cross-references and comments. We will describe how to add a header, footer, text box and symbols. Next, you will customise the document colour, fonts, page background and border. This course includes an explanation of page setup, paragraph indent, citations, tables of figures, footnotes and endnotes. You will discover how to adjust the display, save and understand more advanced settings. Finally, we will walk you through Microsoft Word's new features, ‘draw’ and ‘developer’ menu. Sign up for this course and start benefiting from the insights you have gained.</p><a href=\"https://alison.com/resume/courses/4392\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4392\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Microsoft Word","description":"This module serves as a beginner's guide to Microsoft Word. You will learn how to use the basic features of MS Word. You'll also look at the File and Home menus and the options they offer.","topics":["Introduction to Microsoft Word - Learning Outcomes","Introduction to Microsoft Word","Microsoft Word Basics","File Menu in Microsoft Word","Home Menu in Microsoft Word","Introduction to Microsoft Word - Lesson Summary"]},{"name":"Module","details":"Insert Menu in Microsoft Word","description":"This module explores the Insert menu in Microsoft Word. You will discover how to insert and format a page, table, picture, chart, text box and symbols. Also, you will learn how to take a screenshot, link and bookmark objects and add cross-references and comments.","topics":["Insert Menu in Microsoft Word - Learning Outcomes","Pages and Tables in Insert Menu","Illustrations in Insert Menu","Other Group of Tools in the Insert Menu","Insert Menu in Microsoft Word - Lesson Summary"]},{"name":"Module","details":"Other MS Word Menus and Options","description":"This module explores the remaining groups of tools in the Microsoft Word menus. You will discover how to set up a page, format a document and create a table of contents, footnotes, and endnotes. Also, you will learn how to customize MS Word's options.","topics":["Other MS Word Menus and Options - Learning Outcomes","Design and Layout Menus","Reference, Mailings, Review and View Menus","Microsoft Word Options","Draw and Developer Menu","Other MS Word Menus and Options - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Beginners Guide to Microsoft Word - Course Assessment"]}]}