{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5103","title":"Beginners' Guide to Affinity Designer","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to use Affinity Designer to create beautiful and professional graphics.","description":"Do you enjoy art? Do you want professional-looking graphic designs but don't know what platforms to use? This course will introduce you to Affinity Designer's user interface and the tools you'll need to create illustrations, logos, graphics, website and application designs. In addition, we'll show you various photo editing techniques and tricks, including ways to blend images, create color transitions, crop parts of an image and more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Affinity Designer is a vector graphics editor that lets you create logos, graphic illustrations, and website and application designs. First, it will introduce you to the user interface and various drawing and editing tools of Affinity Designer to get you started. Next, you'll learn how to draw lines, use multiple geometric shapes in your drawings, add colors and modify the properties of lines and shapes. We'll show you how to select the right Persona for your artwork, set up standard image properties for website and print use, and export your finished drawings. You'll learn to create a vector illustration from a simple hand-drawn sketch and apply editing and other tools to transform it into your desired image.</p><p>Next, we'll show you the functions of layers, how to employ them in your artwork and how to create a user interface design. Following that, you will learn how to design a simple logo for your brand or company. Discover several image editing tools and tricks such as combining images, removing and changing image backgrounds and many more. 'Gradient' in vector graphics lets you change color or opacity between multiple images in your artwork. You'll explore the gradient overlay feature and use it to transition gradually between different colors to blend numerous images smoothly.</p><p>We designed this course for beginners in graphic design who want to build and enhance their drawing and photo editing skills. The course instructor, Greg Pew, explains the essential tools and features of Affinity Designer and shows beginners how to create artwork by following simple and easy-to-follow instructions. In addition, it provides valuable resource material and templates to help you create drawings following the procedures outlined by the instructor. Graphic designing and image editing skills are lucrative whether you work in an organization or are a freelancer. Don't miss out on the opportunity to build your skills in vector graphics and photo editing. Join this course now and learn for free!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}