{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3279","title":"Bitcoin for Everybody","totalEnrolled":"2,704","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about blockchain and Bitcoin technologies with this free online cryptocurrency course.","description":"Explore the concept of Bitcoin as an upcoming ‘store of value’ or an asset that retains value over time in this quick course, which provides a tangible lifecycle comparison between Bitcoin and other forms of money. By the end, you will understand Bitcoin technology and be able to decipher the various misconceptions around cryptocurrencies.","courseOutcomes":["Describe how money arises spontaneou...","Explain the history and evolution of...","Identify government interventions in...","Compare the various monetary standar...","Describe how money arises spontaneously","Explain the history and evolution of money","Identify government interventions into the market for money","Compare the various monetary standards","Discuss why Bitcoin is not a pyramid scheme and why it is not likely to be banned worldwide","Explain the foundation behind Bitcoin security","Explain what a Bitcoin 'wallet' is and what a Bitcoin 'node' is","Compare the trade-offs between the use of Bitcoin and Altcoin","Explain how Bitcoin operates despite having no direct leadership","Distinguish between the different means of acquiring Bitcoin","Describe the best practices in Bitcoin privacy and security","Explain what the Lightning Network is and how it works","Describe how money arises spontaneou...","Explain the history and evolution of...","Identify government interventions in...","Compare the various monetary standar...","Describe how money arises spontaneously","Explain the history and evolution of money","Identify government interventions into the market for money","Compare the various monetary standards","Discuss why Bitcoin is not a pyramid scheme and why it is not likely to be banned worldwide","Explain the foundation behind Bitcoin security","Explain what a Bitcoin 'wallet' is and what a Bitcoin 'node' is","Compare the trade-offs between the use of Bitcoin and Altcoin","Explain how Bitcoin operates despite having no direct leadership","Distinguish between the different means of acquiring Bitcoin","Describe the best practices in Bitcoin privacy and security","Explain what the Lightning Network is and how it works"],"courseDescription":"<p>This course begins with a comparative discussion of Bitcoin economics and explores the history of money. This is followed by an explanation of the various attributes of a good store of value. Next, the course covers the Gartner hype cycles of money adoption, gives an outline of the Gartner cohorts and tracks the transition of money to a medium of exchange, mapping the nature of money compared to that of Bitcoin. Various common misconceptions such as the ‘Bitcoin bubble’ are also discussed. You will study the use of energy in any medium of exchange and the Bitcoin Proof of Work (PoW), and delve into an explanation of the foundation and backing behind Bitcoin and money in general. Is Bitcoin secure and is it making other monies obsolete? Is Bitcoin a pyramid scheme and is a government ban unlikely? All these pertinent questions will be examined.</p><p>You will then dive deeper into Bitcoin technology by looking into a brief history of encryption as outlined in the series, ‘Cypherpunks Write Code’. Get an explanation of Bitcoin ‘nodes’ and blockchain technology, and see how nodes interact with each other in a network. Analyze how Bitcoin works, progressing through the levels of ‘mining’, validating and transacting. This is followed by an explanation of the Bitcoin governance model, control process and its owners. The course also compares Altcoins, an alternative digital currency, to Bitcoins. Delve deeper into the practical use of Bitcoins, and discover key concepts such as Bitcoin wallet, acquisition, security and privacy, and common scams within the cryptocurrency space.</p><p>You will truly understand the concept of Bitcoin by unearthing its history and its practical applications in today's world. Various misconceptions surrounding the existence and use of Bitcoins are clearly explained and clarified. By taking this course you will understand Bitcoin technology and apply the knowledge to invest safely and be part of the Bitcoin blockchain network.</p><a href=\"https://alison.com/resume/courses/3279\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3279\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Bitcoin Economics","description":"This module discusses Bitcoin economics, the origin of money, its existence and its evolution. It consists of topics that cover the following aspects: The Origins of Money, The Evolution of Money, Why Bitcoin Must Use Energy and Proof of Work, and Comparison of Monetary Standards.","topics":["Bitcoin Economics - Learning Outcomes","The Origins of Money","The Evolution of Money","Common Misconceptions","Why Bitcoin Must Use Energy and Proof of Work","Comparison of Monetary Standards","Bitcoin Economics - Lesson Summary"]},{"name":"Module","details":"Bitcoin Investment","description":"This module explains the concept of bitcoin investment. It covers the following key aspects: The backing and foundation of Bitcoin and Money in general, What makes Bitcoin secure, Bitcoin obsoletes other monies, Bitcoin is not a pyramid scheme and Bitcoin and the unlikeliness of a government ban.","topics":["Bitcoin Investment - Learning Outcomes","Do Bitcoin and Money Need Backing?","What Secures Bitcoin","Bitcoin Obsoletes Other Monies","Bitcoin is Not a Pyramid Scheme","Bitcoin and the Unlikeliness of a Government Ban","Bitcoin Investment - Lesson Summary"]},{"name":"Module","details":"Bitcoin Technology","description":"This module explains more about how the technology behind Bitcoin works. It covers the following topics: Bitcoin history and philosophy - the Cypherpunks write code, the genesis of bitcoin files and networks, Bitcoin wallets and nodes, Understanding the Bitcoin network without math, History of Bitcoin core and control and Bitcoin vs. Altcoins.","topics":["Bitcoin Technology - Learning Outcomes","Cypherpunks Write Code","Bitcoin Nodes","Bitcoin Governance","Who Controls Bitcoin","Bitcoin vs. Altcoins","Bitcoin Technology - Lesson Summary"]},{"name":"Module","details":"Bitcoin in Practice","description":"This module explains more about Bitcoin in practice, it will cover basic instruction on putting Bitcoin into practice in this unit. This includes acquiring Bitcoin, using a Bitcoin wallet and the Lightning Network, privacy and security practices, and avoiding common pitfalls, scams, and mistakes.","topics":["Bitcoin in Practice - Learning Outcomes","Acquiring Bitcoin and Common Scams","Using a Bitcoin Wallet","Bitcoin Privacy and Security Basics","Bitcoin in Practice - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Bitcoin for Everybody - Course assessment"]}]}