{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4375","title":"Blender: How to Create a 3D Barrel","totalEnrolled":"2,117","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the use of Blender and other supporting tools to create and design 3D models with this free online course.","description":"In this course, you will learn how to create a 3D model of a barrel using Blender and other complementary tools. You will be given lessons on asset creation, design and texture. You will learn about tools like Marmoset Toolbag, Substance Painter, and many more. If you are looking for a hands-on approach to learning the application of Blender and other tools, this free online course will prove valuable. Start learning now.","courseOutcomes":["Arrange a plain board using Blender...","Select the body of a barrel using mu...","Translate UV unwrapping effectively ...","Describe metal rings and wooden mate...","Arrange a plain board using Blender","Select the body of a barrel using multiple boards","Translate UV unwrapping effectively using Rizom","Describe metal rings and wooden material texturing","Identify a label and design a wine splash feature","Relate texture maps and combine maps using Photoshop","Arrange a plain board using Blender...","Select the body of a barrel using mu...","Translate UV unwrapping effectively ...","Describe metal rings and wooden mate...","Arrange a plain board using Blender","Select the body of a barrel using multiple boards","Translate UV unwrapping effectively using Rizom","Describe metal rings and wooden material texturing","Identify a label and design a wine splash feature","Relate texture maps and combine maps using Photoshop"],"courseDescription":"<p>This course will help you become more advanced in your use of the Blender software and highlights the use of complementary tools such as Rizom UV, Marmoset Toolbag, Substance Painter, and Photoshop in the creation of a 3D barrel as an illustration of 3D model development. Ever wonder how the environment features used by game developers are made? Look no further. The course begins with a module on creating assets where you will learn about how a 3D barrel can be created from scratch, using plain boards. You will learn how to create a barrel frame, sideboards, metal rings, tap, cork and stands using Blender. You will also learn how to carry out a UV unwrap of the 3D model. See how to prepare the resulting map for the Rizom UV tool, as well as how to effectively use it to complete the unwrapping process.</p><p>Furthermore, you will learn to texture surfaces. By showing you the process of texturing the wood materials of the barrel frame and the metal rings, you'll be guided on how to use the Substance Painter tool for the effective texturing of your 3D model. Texturing is considered one of the most enjoyable and engaging processes of 3D modelling. You will then be shown how to implement final adjustments and post effects on the models and texture maps before exporting for further processing. Also, master how to effectively combine maps using Photoshop. Finally, the course provides you with lessons on the Marmoset Toolbag, and how it can be used for the baking and rendering of all your model creation processes, as well as the final export.</p><p>Whether you are a graphic designer, artist, game developer, 3D animator, or any practitioner across the graphic-creative spectrum, one constant concern is that of being able to produce high-quality, detailed representations of the physical environment or elements thereof. This is exactly the kind of concern that Blender and the set of complementary tools discussed in this course help you resolve. It shows you how to effectively develop, texture and design a 3D model using Blender, Substance Painter, Rizom UV, Photoshop, and Marmoset Toolbag. There are also downloadable resources that will help facilitate learning by practice.&nbsp;</p><a href=\"https://alison.com/resume/courses/4375\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4375\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Creating the Assets","description":"In this module, you will learn about the processes involved in creating assets for 3D models using Blender. Using the case of a 3D barrel, you will learn how to create tap, cork, and stand assets, as well as carry out a UV unwrap.","topics":["Creating the Assets - Learning Outcomes","Building the Barrel","Creating the Assets: UV Unwrap","Creating the Assets: Maps","Completing the Wood Material","Creating the Assets - Lesson Summary"]},{"name":"Module","details":"Texturing, Exporting and Rendering","description":"In this module, you will learn about the final aspects of completing a 3D model. Continuing with the example of the 3D barrel, you will learn how to texture materials, export the maps, and render them using Marmoset Toolbag.","topics":["Learning Outcomes","Creating Textures","Final Adjustments and Rendering","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Blender: How to Create a 3D Barrel - Course assessment"]}]}