{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3201","title":"Bootstrap 4 - Exploring New Features","totalEnrolled":"591","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Grasp the fundamentals of the Bootstrap 4 framework in creating a responsive website in this free online course.","description":"This course describes how the Bootstrap 4 framework is used to create a responsive web design. It takes you through HTML and CSS design templates used to develop a simple website. Important features of Bootstrap 4 - including jumbotron, REMs and EMs, as well as the unified UI element - are explained by the material. By the end of your study, you will learn how basic HTML, CSS and JavaScript are used for web design.","courseOutcomes":["Explain the Bootstrap 4 framework...","Describe the process of creating a r...","Analyze the important features of Bo...","Discuss the process of organizing an...","Explain the Bootstrap 4 framework","Describe the process of creating a responsive website","Analyze the important features of Bootstrap 4","Discuss the process of organizing and rearranging files in the Bootstrap folder","Explain the means of linking files and folders","Describe the process of creating a jumbotron","Explain the Bootstrap 4 framework...","Describe the process of creating a r...","Analyze the important features of Bo...","Discuss the process of organizing an...","Explain the Bootstrap 4 framework","Describe the process of creating a responsive website","Analyze the important features of Bootstrap 4","Discuss the process of organizing and rearranging files in the Bootstrap folder","Explain the means of linking files and folders","Describe the process of creating a jumbotron"],"courseDescription":"<p>Interested in building a career in website development as a professional developer? Then, you will need to learn about Bootstrap 4, which is a client-side CSS framework that helps create good-looking sites with little effort. In web development, developers and designers play very different roles. ‘Bootstrap 4 - Exploring New Features’ is a free online course that analyzes the exciting features and functionalities of the framework, and takes you through how to build a responsive website using the enhanced features of Bootstrap 4. This short course begins by taking you through the processes of downloading Bootstrap 4 and creating relevant folders. You see how the folders on ‘CSS’, ‘img’ and ‘js’ are arranged in the Bootstrap folder. Learn how to operate an editor that will be used in building your responsive site. Identify a variety of editors that can be employed and what informs the choice of selecting a particular one. The course shows you how to download an editor, unzip it, and get it ready for use in developing a website. Learn how to recommend the right extensions to use when creating any type of file and master the process of linking files together when working with an editor.</p><p>Furthermore, the material demonstrates how to link HTML, CSS and Bootstrap files. Bootstrap 4 supports several Internet browsers and outlines their compatibility. You will learn how to open up the head tags and body tags, and study the applications and functionalities of navigation bars in developing a website. The course also provides an in-depth discussion of how to develop a jumbotron, including how to insert background images.&nbsp;</p><p>The course explains how Bootstrap 4, by supporting Internet Explorer 9, has been able to embrace some much-loved CSS modules. You will see how Bootstrap 4 has been able to clean up its components with the removal of the classic well, panel, and thumbnail components. Be introduced to the new card components and their unique characteristics. Finally, you will be taken through how to download the Microsoft Visual C++ component. If you are interested in a simple and free front-end framework for faster and easier web development, then this course would be a great fit for you. Are you a developer in the quest to update your professional skills? Then, enrol in this free online course today and get the opportunity to use Bootstrap 4 to easily create responsive and visually appealing web designs.</p><a href=\"https://alison.com/resume/courses/3201\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3201\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Bootstrap 4","description":"This module discusses aspects of downloading and creating Bootstrap folders, along with the basic procedures for organizing files. Get to study the Bootstrap 4 Framework used in creating a responsive website as well as the installation of XAMPP.","topics":["Bootstrap 4 - Learning Outcomes","Getting Started With Bootstrap 4","Creating a Responsive Website","Installing XAMPP","Bootstrap 4 - Exploring New Features - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Bootstrap 4 - Exploring New Features - Course Assessment"]}]}