{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1222","title":"Building a Responsive User Interface using Bootstrap","totalEnrolled":"9,622","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Bootstrap to build a responsive website for desktops, tablets, and cellphones, with this free course.","description":"These days, with nearly every company and individual having their own website, you need one that stands out from the rest. Developed with CSS, JavaScript, and HTML, Bootstrap is an easy-to-use and responsive front-end web design framework that features a huge number of accessible resources to help any web development project really shine. With this free online course, you learn all about Bootstrap's most important components in no time at all.","courseOutcomes":["List the benefits of using JavaScrip...","Describe how to create a Modal Dialo...","Describe how to create inline help o...","Explain how LESS can help you with a...","List the benefits of using JavaScript in Bootstrap","Describe how to create a Modal Dialogs and Alerts","Describe how to create inline help on your website","Explain how LESS can help you with achieving semantic mark-up and tidying up your code","Recognize package managers that help manage the use of LESS within Bootstrap","Discuss why you should not modify your Bootstrap files","Discuss what a content delivery network (CDN) is, how it works and how it helps host your websitej","List the benefits of using JavaScrip...","Describe how to create a Modal Dialo...","Describe how to create inline help o...","Explain how LESS can help you with a...","List the benefits of using JavaScript in Bootstrap","Describe how to create a Modal Dialogs and Alerts","Describe how to create inline help on your website","Explain how LESS can help you with achieving semantic mark-up and tidying up your code","Recognize package managers that help manage the use of LESS within Bootstrap","Discuss why you should not modify your Bootstrap files","Discuss what a content delivery network (CDN) is, how it works and how it helps host your websitej"],"courseDescription":"<p>This Bootstrap tutorial course will first introduce you to Visual Studio and ASP.NET integration. You will learn what a browser link is, how to use templates with generated code, how to scaffold a project, and how to use scaffolding to determine templates' content. You will also be introduced to the useful support and extensions found in Visual Studio. The course will also teach you how to enable functionality from JavaScript, create modal dialog boxes and alerts for your website, provide inline help, and create tabs and scroll spy.<br><br>You will then learn what LESS is, how to install it, and how LESS can help you achieve semantic markup for your code. You will also be introduced to real-world considerations for a Bootstrap application. You will learn about the factors to be considered before editing a Bootstrap files. The course will also teach you how to host your website as well as how to use a CDN (Content Delivery Network) and what a CDN involves.<br><br>All the information you need to develop an easy-to-use and responsive web page is at your fingertips with this free Bootstrap course. This course is best taken after completing Alison's Introduction to Responsive Design Using Bootstrap. It will also be useful for you to have knowledge of Web Page Design Using HTML5 and CSS3, as well as experience developing websites. But if you're ready to go, why wait? Try out this course, and prepare to wow your clients and superiors with your newly-acquired web development skills in no time!</p><a href=\"https://alison.com/resume/courses/1222\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1222\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Visual Studio and ASP.NET Integration","description":"In this module you will be introduced to Visual studio and ASP.NET integration. You will learn what a browser link is and how to use templates with generated code. The course teaches you how to scaffold a project and how you can use scaffolding to determine what the content of templates will be. You will also be introduced to useful support and extensions found in Visual Studio.","topics":["Module 1: Learning Outcomes","Browser Link","Templates","Scaffolding Optimization","Visual Studio Support","Module 1: Lesson Summary"]},{"name":"Module","details":"JavaScript Functions","description":"This module shows you how functionality from JavaScript can be enabled by adding attributes and classes. You will learn about creating modal dialog boxes and alerts for your website. You will also learn about providing inline help and how to create tabs and scroll spy.","topics":["Module 2: Learning Outcomes","JavaScript and Bootstrap","Modal Dialogs","Providing Help","Module 2: Lesson Summary"]},{"name":"Module","details":"Using Bootstrap with LESS","description":"This module introduces you to LESS which is a CSS pre-processor, meaning that it extends the CSS language. You will learn what LESS is, how to install it, and how LESS can help you achieve semantic mark-up for you code.","topics":["Module 3: Learning Outcomes","Introduction to LESS","LESS workflow with Bootstrap","Semantic HTML markup with Bootstrap","Advanced Applications","Module 3: Lesson Summary"]},{"name":"Module","details":"Bootstrap in the Real World","description":"This module introduces you to real world considerations for your Bootstrap application. You will learn about what you should think of before you start editing your Bootstrap files. You will also learn about hosting your website, and about using a CDN (Content Delivery Network) and what it involves.","topics":["Module 4: Learning Outcomes","Bootstrap, but not Bootstrap","Enhancing Applications","Putting it all together","Module 4: Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Building a Responsive User Interface with Bootstrap Assessment"]}]}