{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4032","title":"Building a Spreadsheet Model","totalEnrolled":"984","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of building effective spreadsheet forecasting models and business models in this free online course.","description":"Spreadsheet models provide an invaluable tool for analyzing complex data sets, comparing various scenarios, and making decisions that would otherwise take much longer and greater effort. This free online Microsoft Excel training course will introduce you to the basic principles and procedures for making spreadsheet models for forecasting, evaluating different scenarios and business decision-making purposes.","courseOutcomes":["List the components of an effective ...","Outline the procedure for developing...","Define sensitivity analysis and expl...","Analyze the effect of adjusting inpu...","List the components of an effective spreadsheet forecast or model","Outline the procedure for developing a spreadsheet model","Define sensitivity analysis and explain its importance","Analyze the effect of adjusting input parameters on potential outcomes using the sensitivity analysis method","Summarize the key functions of a spreadsheet business model","Describe the process of presenting the outputs of your spreadsheet model","State the common risks that should be highlighted in a business model","List the components of an effective ...","Outline the procedure for developing...","Define sensitivity analysis and expl...","Analyze the effect of adjusting inpu...","List the components of an effective spreadsheet forecast or model","Outline the procedure for developing a spreadsheet model","Define sensitivity analysis and explain its importance","Analyze the effect of adjusting input parameters on potential outcomes using the sensitivity analysis method","Summarize the key functions of a spreadsheet business model","Describe the process of presenting the outputs of your spreadsheet model","State the common risks that should be highlighted in a business model"],"courseDescription":"<p>Decision-making in a business environment is influenced by numerous factors, which can be difficult and time-consuming to analyze without an automated tool. This free online Microsoft Excel tutorial will teach you the basic principles and procedures for creating spreadsheet models for forecasting, business analysis, and decision-making. The course will begin with an introduction to the guiding principles of spreadsheet model building that ensure that one can create a robust, effective and user-friendly model. You will also learn about the key elements that a spreadsheet model must contain. In particular, you will study the purpose and scope of a model with the help of practical examples. After that, you will uncover the definitions, assumptions and sources of data used in a spreadsheet model. This is essential for the model users to know about the model’s terminologies and the origin of the data, bearing in mind that many users will be non-experts in spreadsheet modelling. At this stage, you will then undertake an exercise that will help you to apply the knowledge gained.</p><p>The following part of this Microsoft Excel certification will take you through the step-by-step procedure of building a model, beginning with the data input process. In the next stage, you will study the intermediate calculations, what they are, and the role they play in the overall model. This will pave the way for the core model, which is the main component of the spreadsheet where the critical calculations and processing take place. The results of this processing are presented in the output data and executive summary tab. Then, you will discover how a model can be reviewed and be introduced to sensitivity analysis and building a spreadsheet model of a business. The principles and the structure of the business model will be unveiled in this section of this Microsoft Excel course. In addition, you will study the planning and decision-making process using a business model, followed by scenario planning techniques.</p><p>The last section of this comprehensive course will have you explore and learn how to present the outputs of a spreadsheet model to the target audience and to call them to action and make use of the spreadsheet models and the outcome obtained. Students of business finance and management will find this course useful, particularly in applying theoretical knowledge to practical industry examples. This Microsoft Excel training course will also be helpful to anyone else who wants to add an in-demand, practical skill for application in business and general problem-solving.</p><a href=\"https://alison.com/resume/courses/4032\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4032\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Basics of Spreadsheet Modelling","description":"In this module, you will study the basic principles and procedures for creating, testing and updating spreadsheet forecasting models. You will also learn about the development of business models, presenting the model’s outputs and planning and decision making using the model.","topics":["The Basics of Spreadsheet Modelling - Learning Outcomes","Introduction to Spreadsheet Modelling","The Spreadsheet Modelling Process","Sensitivity Analysis","Business Models","Presenting Model Outputs","The Basics of Spreadsheet Modelling - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Building a Spreadsheet Model - Course Assessment"]}]}