{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3888","title":"Build a Text-Based RPG With C++","totalEnrolled":"720","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Boost your career by developing your C++ programming skills as you build your very own RPG in this free online course.","description":"Do you want to boost your career by developing your C++ programming skills? Are you interested in building your own Role-playing Video Game (RPG)? Start your C++ journey today! Learn how to build a dungeon crawler type game from start to finish with this course. We will take you through how the game will work and the steps to implement it. You will also learn how to organize project files which is essential when working on large projects.","courseOutcomes":["Identify how to store object informa...","List the steps in creating a text-ba...","State how to create custom classes...","Explain how to organize project file...","Identify how to store object information and data with classes","List the steps in creating a text-based dungeon crawler game","State how to create custom classes","Explain how to organize project files","Define game loops in C++","Describe how to implement game loops","Explain the game character class","State how to implement the player class","Identify how to set up inventory","Identify how to build the dungeon class","State three specific functionalities of building a dungeon class","Discuss how to improve up the dungeon game","Identify how to store object informa...","List the steps in creating a text-ba...","State how to create custom classes...","Explain how to organize project file...","Identify how to store object information and data with classes","List the steps in creating a text-based dungeon crawler game","State how to create custom classes","Explain how to organize project files","Define game loops in C++","Describe how to implement game loops","Explain the game character class","State how to implement the player class","Identify how to set up inventory","Identify how to build the dungeon class","State three specific functionalities of building a dungeon class","Discuss how to improve up the dungeon game"],"courseDescription":"<p>This course will teach you how to build a dungeon crawler type game from start to finish. Learn to build a C++ project from scratch. Many courses will teach you bits and pieces, but this course will teach you the big picture from start to finish. You will learn to organize project files, which is important, especially when working on projects with dozens of files. You will create custom classes that will help you in implementing various aspects of the game. Implement game logic, basically stuff like game loops – that makes decisions and constantly runs, updating the whole game. Also, learn to make decisions based on various game factors. By the end, create a text-based dungeon crawler game from scratch so there will be no Graphical User Interface (GUI). The game you make will just be kind of input-output text-related stuff.</p><p>This course requires you to have C++ experience because we won’t cover the language basics. In other words, we assume all students that take this course understand the basics of C++ and can launch right into the actual game development itself. Some experience with dungeon crawlers could be beneficial but not necessary because you will understand ahead of time precisely what you will be building. If you have never played the game before, do not worry, the first section of the course will explain how everything works. Visual Studio Code is a fantastic Integrated Development Environment (IDE) recommended for you to write your code. We use Visual Studio Code in this course, and it will be easier if you can follow along. You can learn more about C++ in general because everything in this course was geared towards building the game, but C++ has many different applications.</p><p>The topics covered in the course include the project discussion, which will go over how the game will work – such as the steps you will need to take to implement it. Then you will learn to build the item class. The next thing will be the game character class, building the room class, player class, and finally, the dungeon class. The dungeon class is where most of the logical functionalities are going to go. Most of the others are just there for data. Finally, what will be put all together in the main class will be running and debugging. There will likely be a couple of things that could be improved upon by the end. You will have a fully working and functional game, and we will show you all the steps in the course. Having completed the course, you will understand how to improve a game. The code can be improved, especially as the more you know C++, the more you realize you can change certain things. You can add more levels to the dungeon, add more exciting things such as items, enemies, and more. Discover many ways to improve the game. Want to start building a C++ project? Sign up for this course today and learn how to build a dungeon crawler type game from start to finish!</p><a href=\"https://alison.com/resume/courses/3888\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3888\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building a Game with C++","description":"This module introduces building a game with C++ and how to build a C++ project from scratch. Explore how to organize project files, create your classes and put them in separate files. Learn the different functions needed and some codes that will guide you when building a room class.","topics":["Building a Game with C++ - Learning Outcomes","Project Discussion","Building Item Class","Building the Game Character Class","Building the Room Class","Building a Game with C++ - Lesson Summary","Building a Game with C++ - Assessment"]},{"name":"Module","details":"Player, Dungeon Class and Debugging","description":"This module analyses how to implement the player class and the sub-class for the game character. This module explores the functionalities and how the game loop will be generic. Lastly, learn how to build a dungeon class.","topics":["Player, Dungeon Class and Debugging - Learning Outcomes","Building the Player Class","Building the Dungeon Class","Running and Debugging","Player, Dungeon Class and Debugging - Lesson Summary","Player, Dungeon Class and Debugging - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Build a Text-Based RPG With C++ - Course Assessment"]}]}