{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5359","title":"Building a Responsive Website with Bootstrap","totalEnrolled":"867","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Bootstrap to build interactive, responsive websites in this free online web development course.","description":"Websites provide organisations and businesses with an opportunity to establish a positive first impression and reassure visitors that they are legitimate. This web development course explains how to build a website with Bootstrap. We establish the importance of using CSS and HTML to build websites and then show you how to set up projects and add Bootstrap components. Sign up to take your web development and design skills to the next level.","courseOutcomes":["Describe how to create a responsive ...","Recognise the various ‘rules’ of CSS...","Explain how to use HTML to create a ...","Outline the steps required to create...","Describe how to create a responsive website","Recognise the various ‘rules’ of CSS","Explain how to use HTML to create a website","Outline the steps required to create a website using CSS and HTML","Highlight how to add an HTML file","Explain how to add containers with Bootstrap","Discuss how to properly use Bootstrap components","Outline how to create a responsive website with Bootstrap","Describe how to create a responsive ...","Recognise the various ‘rules’ of CSS...","Explain how to use HTML to create a ...","Outline the steps required to create...","Describe how to create a responsive website","Recognise the various ‘rules’ of CSS","Explain how to use HTML to create a website","Outline the steps required to create a website using CSS and HTML","Highlight how to add an HTML file","Explain how to add containers with Bootstrap","Discuss how to properly use Bootstrap components","Outline how to create a responsive website with Bootstrap"],"courseDescription":"<p>Responsive web design (RWD), also known as ‘responsive design’, makes websites fun and easy to use across a broad range of devices and screen sizes, from small to large. We begin this web development course by explaining how to create responsive websites with HTML and CSS. We also examine the use of CSS ‘rules’ to edit the menu and background image. We go through the basics of CSS code and outline the components of a responsive website.</p><p>This course explains the interaction between Bootstrap, HTML and CSS as they are used to build responsive websites. We demonstrate the importance of using Bootstrap templates to build your website and show you how to do so. We explain how to use the Bootstrap website to add components and containers. These skills are useful in web design and development and allow you to create interactive, responsive online spaces.</p><p>This course provides the tools you need to confidently build websites using Bootstrap, CSS and HTML. We show you how to use pre-created Bootstrap templates and go through the interface and in detail. We explain how to use Bootstrap features like adding interactive buttons and containers. Sign up to learn the fundamentals of web development and pick up the skills you need to build responsive, interactive&nbsp; websites with HTML, CSS and Bootstrap.</p><a href=\"https://alison.com/resume/courses/5359\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5359\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Complete Responsive Web Design","description":"This course will begin by helping you analyse the steps and tools required to create a responsive website. We will also help you find information on the project setup file. You will have the opportunity to explore the complete website structure. We will help you find answers to questions like: How can you use CSS rules? or Why use HTML to build?","topics":["The Complete Responsive Web Design - Learning Outcomes","Introduction to Responsive Web Design","Project Setup","Website Structure","Chrome Dev Tools","Editing the Top Menu","Understanding the Image Area","Working With Services","The Responsive Page","Responsive Web Design Conclusion","The Complete Responsive Web Design - Lesson Summary"]},{"name":"Module","details":"Web Development with Bootstrap","description":"This course will begin by helping you understand what bootstrap is. We will also help you find information on exploring the bootstrap website. You will have the opportunity to add bootstrap to an HTML file and understand what bootstrap containers are. You will find answers to questions like What is bootstrap? or How can you use bootstrap templates?","topics":["Web Development with Bootstrap - Learning Outcomes","Intro to Bootstrap","Exploring the Bootstrap Website","Adding Bootstrap to HTML File","Understanding Bootstrap Containers","Adding Components","Web Development with Bootstrap Summary","Web Development with Bootstrap - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Building a Responsive Website with Bootstrap - Course assessment"]}]}