{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1636","title":"Building Bots Using The Microsoft Bot Framework","totalEnrolled":"2,792","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to build a bot and add intelligence to it.","description":"This free online course in building bots with the Microsoft Bot Framework will teach you how to get started with building your own bots. With more than half of all web traffic being made up of bots, they are a great way of helping customers, gathering your website's data, and creating automation for certain services. Bots often handle many tasks, from weather reports, to giving directions, to taking orders for restaurants and more.","courseOutcomes":["Discuss how to use the Microsoft Bot...","Explain the uses of LUIS and the Bot...","Explain how to publish your bot....","Discuss connecting your bot to your ...","Discuss how to use the Microsoft Bot Framework to create a bot.","Explain the uses of LUIS and the Bot Connector.","Explain how to publish your bot.","Discuss connecting your bot to your users using the Bot Connector.","Explain the benefits of using the Azure Bot Service for your bot.","Discuss how to use the Azure Bot Service.","Discuss how to use the Microsoft Bot...","Explain the uses of LUIS and the Bot...","Explain how to publish your bot....","Discuss connecting your bot to your ...","Discuss how to use the Microsoft Bot Framework to create a bot.","Explain the uses of LUIS and the Bot Connector.","Explain how to publish your bot.","Discuss connecting your bot to your users using the Bot Connector.","Explain the benefits of using the Azure Bot Service for your bot.","Discuss how to use the Azure Bot Service."],"courseDescription":"<p>With this online course Building Bots Using The Microsoft Bot Framework will walk you through the creation of a bot and introduce you to the software available to help you, along with introducing you to the Azure Bot Service and how it can help you create an effective bot.</p><p>The course starts off with introducing you to the Microsoft Bot Framework and how it can help you create a bot. You will be taught how to create conversational dialogs from the ground up, and also how to incorporate NLS and deep learning technology into your bot.</p><p>Lastly, you will look at the Azure Bot Service Preview, where you will learn how this service allows your bot to develop its intelligence quickly and effectively, using a combination of the Microsoft Bot Framework and Azure Functions. You will also examine the Azure Portal, Visual Studio, and LUIS to further understand how to increase your bot’s intelligence.</p><p>This course will be of interest to anyone who wishes to learn more about the new and upcoming field of bots and bot tools. It will also be of interest to anyone looking to increase their knowledge of how to make their bots more intelligent and useful.</p><a href=\"https://alison.com/resume/courses/1636\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1636\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building a Conversational Bot","description":"This module look at the Microsoft Bot Framework in detail. It walks you through the process of creating your own bot, and explains how to incorporate NLS and deep learning.","topics":["Building a Conversational Bot Learning Outcomes","The Bot Framework and New Bot Processes","Connecting to Users and Dialog Smarts","Building a Conversational Bot Lesson Summary"]},{"name":"Module","details":"Introducing the Azure Bot Service","description":"This module examines the Azure Bot Service Preview, enabling you to further develop your bot’s intelligence. It also looks at other useful software such as the Azure Portal, and LUIS.","topics":["Introducing the Azure Bot Service Learning Outcomes","Introducing The Azure Bot Service","Introducing the Azure Bot Service Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Building Bots Using The Microsoft Bot Framework Course Assessment"]}]}