{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3562","title":"Building Websites with Photoshop CC","totalEnrolled":"2,946","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the steps involved in building a professional website using Photoshop CC in this free online course.","description":"If you have ever wanted to design beautiful, functional websites, then this free online web design course will set you on the right path. Photoshop CC is the perfect platform to use because of its extensive tools and functionalities. Learn about the various grid systems that can be used as templates to build professional looking web pages, wireframing and UI design and importantly, how to extract HTML and CSS from Photoshop.","courseOutcomes":["List the functionality of various to...","Summarize the workflow process of de...","Outline the importance of the 960 gr...","List the various techniques to creat...","List the functionality of various tools in Photoshop.","Summarize the workflow process of designing a web layout.","Outline the importance of the 960 grid system in creating a web layout.","List the various techniques to create wireframe objects.","State the importance of organizing and colour coding the layers panel.","Explain how to create, save, and use a custom style for multiple objects.","Explain how to use clipping groups and linked smart objects in your design.","State the purpose of an asset generator.","Outline the steps involved in generating HTML With Photoshop.","Relate how to set up a structural CSS for implementation into a project.","List the functionality of various to...","Summarize the workflow process of de...","Outline the importance of the 960 gr...","List the various techniques to creat...","List the functionality of various tools in Photoshop.","Summarize the workflow process of designing a web layout.","Outline the importance of the 960 grid system in creating a web layout.","List the various techniques to create wireframe objects.","State the importance of organizing and colour coding the layers panel.","Explain how to create, save, and use a custom style for multiple objects.","Explain how to use clipping groups and linked smart objects in your design.","State the purpose of an asset generator.","Outline the steps involved in generating HTML With Photoshop.","Relate how to set up a structural CSS for implementation into a project."],"courseDescription":"<p>As businesses around the world expand, the pressure to maintain and upgrade to meet technological needs grows. One of the many requirements that organizations must meet in order to sustain or improve their position in the corporate world is to have an online presence. The majority of businesses today have an online presence, whether through social media or their own website. Having a website allows businesses to showcase their services and portfolio of projects to prospective customers, making it easier for customers to contact them. Today, a website has become the face of an organization, and the absence of one can have a negative impact on the business. This free online Photoshop CC course simplifies the process of creating a website for your business or organization by providing step-by-step instructions on how to create a fully functional website with Photoshop CC. To build a website with Photoshop CC, you must have a basic understanding of markup languages such as HTML and CSS. The first step in any website project is to create a mindmap of the website contents, the functionality it will provide, and the placement of individual elements on the web layout. Once a decision has been made, it is critical to draft it for use as a reference throughout the development process.</p><p>You will begin by using a wireframe to create a layout of all of the elements that will be present on the website. A Photoshop wireframe serves as the project's blueprint and this course uses the wireframe layout known as the 960 grid system. The use of guides is another important command that aids in the creation of a good layout. Guides can also be moved, removed, and locked in place to prevent accidental movement. With the wireframe and guides in place, you will first design various sections of the web layout to serve as the foundation for your website. Following that, once the sections have been determined, you will learn how to create various types of wireframe objects and configure their properties. Thereafter, several methods for creating wireframe objects will be demonstrated. It is critical to name wireframe objects because they serve as references for the actual objects that will be created later. You will then begin creating and assigning actual layout objects to the wireframe - every object created in the web layout has properties that must be determined, whether it is text, a button, an image, or a link. Some objects, such as links, paragraphs, headings, and buttons, will be created in Photoshop, while others, such as images, will be imported using Photoshop's intelligent features, such as linked smart objects. Adding styles to objects is another important process that will take place after the objects have been arranged and placed in their proper positions. The course content covers how to use internal styles and external style sheets to apply different styles to individual elements and groups of objects and the functionality of each object will be assigned and this will be done using HTML. The various ways to extract HTML and CSS from Photoshop CC, as well as how to rebuild each section of the layout using the extracted code will be explained. The final bit of course content includes teaching you how to test each section of the website so it’s ready for launch.&nbsp;</p><p>Photoshop has made it easier than ever for anyone to create a fully functional website. Having a professional website instantly builds brand credibility and this web design course is ideal for anyone who wants to learn how to create a website for their business or personal use.</p><a href=\"https://alison.com/resume/courses/3562\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3562\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction","description":"This module will introduce you to the course's content. You will comprehend the course's workflow and the various topics that will be covered. Various techniques and markup languages for designing the website will also be outlined. You will also learn how to set up and save various Photoshop customizations for web layout design.","topics":["Introduction - Learning Outcomes","Introduction to Photoshop","Setting Up Photoshop","Introduction - Lesson Summary"]},{"name":"Module","details":"Structuring Layouts with Photoshop","description":"This module will teach you how to structure an overall layout for designing a website. You will discover how grid systems and guides are used to position various objects in the layout. Various wireframing and colour-coding techniques for groups of objects will also be demonstrated.","topics":["Structuring Layouts with Photoshop - Learning Outcomes","Introduction to 960 Grid System","Introduction to Wireframing","Organizing the Layers & Filling up the Wireframe Sections","Finalizing and Exporting the Wireframe","Structuring Layouts with Photoshop - Lesson Summary"]},{"name":"Module","details":"Applying Design To The Wireframe","description":"In this module, you will add design to all wireframe objects created in the previous module. You will learn how to gather design resources efficiently and how to use layer styles to add effects to layout objects. Linked smart objects, the use of layer masks to position content, and designing with clipping groups will also be demonstrated.","topics":["Applying Design To The Wireframe - Learning Outcomes","Gathering the Design's Resources","Designing the Header Section","Designing Other Sections of the Wireframe","Applying Design To The Wireframe - Lesson Summary"]},{"name":"Module","details":"Getting The Layout Out Of Photoshop And Into Code","description":"In this module, you will learn how to extract Html and CSS code from Photoshop. You will learn how Photoshop's asset generator aids in the real-time generation of assets, as well as how to use the slice tool. The steps involved in setting up an external style sheet to be used with the layout will also be outlined.","topics":["Getting The Layout Out Of Photoshop and Into Code - Learning Outcomes","Introduction to Asset Generator","HTML and CSS Generation in Photoshop","Getting The Layout Out Of Photoshop and Into Code - Lesson Summary"]},{"name":"Module","details":"Rebuilding The Layout With Code","description":"This module will teach you how to rebuild the website layout using the extracted code. You will also learn some new HTML and CSS commands, as well as how to link Html and CSS for an object. A detailed explanation of how to code each section of the layout will be provided.","topics":["Rebuilding The Layout With Code - Learning Outcomes","Rebuilding the Header and Hero Section","Rebuilding Other Sections of the Website","Rebuilding The Layout With Code - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Building Websites with Photoshop CC - Course Assessment"]}]}