{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3952","title":"Building a Machine Learning App Interface","totalEnrolled":"561","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course shows you how to build a handwriting recognition app and covers the basics of Core ML.","description":"This is a free online course that introduces you to the fundamental concepts of machine learning, and how to start building apps that can ‘think’. It explains how convolutional neural networks work and how to classify images. Learn how to build the app interface using the interface builder. This course explains how to make a simple iOS app in Xcode as well as how to create a new Swift project. Register and start today!","courseOutcomes":["Differentiate between Keras and Tens...","Explain how a convolutional neural n...","Classify images and how to install A...","Describe the method to build an app ...","Differentiate between Keras and TensorFlow","Explain how a convolutional neural network works","Classify images and how to install Anaconda with Keras","Describe the method to build an app that can recognize handwriting using Core ML","Summarize how to perform OCR (optical character recognition) handwriting recognition using OpenCV, Keras, and TensorFlow","Apply and set up the environment that enables you to draw on your screen","Explain machine learning, and how it works","Outline the uses of machine learning","Explain the process of integrating machine learning into iOS apps","Differentiate between Keras and Tens...","Explain how a convolutional neural n...","Classify images and how to install A...","Describe the method to build an app ...","Differentiate between Keras and TensorFlow","Explain how a convolutional neural network works","Classify images and how to install Anaconda with Keras","Describe the method to build an app that can recognize handwriting using Core ML","Summarize how to perform OCR (optical character recognition) handwriting recognition using OpenCV, Keras, and TensorFlow","Apply and set up the environment that enables you to draw on your screen","Explain machine learning, and how it works","Outline the uses of machine learning","Explain the process of integrating machine learning into iOS apps"],"courseDescription":"<p>Machine learning is basically a way that our programs and applications can learn from different data that has been passed into our application to make predictions, based on the information that was received. A great way to use deep learning to classify images is to build a convolutional neural network (CNN). The Keras library in Python makes it simple to build a CNN. This is a free online course that introduces you to Keras and you will learn the difference between TensorFlow and Keras. A dataset in machine learning is simply a collection of data pieces that can be treated by a computer as a single unit for analytic and prediction purposes. This means that the data collected should be made uniform and understandable for a machine that doesn't see data the same way as humans do. This course explains how a CNN works and how to classify images.</p><p>Next, you will learn how to run values through convolutional layers, and all the cool processing you need to do. The material describes how to build your CNN using Keras. The goal of machine learning is to mimic the human mind. It can be used to identify things like objects or images, make predictions and even analyze and identify speech. This course teaches you how to build an app that can recognize handwriting using Core ML. It explains the process of importing Core ML to a project in order to use it. This course teaches you how to perform OCR (optical character recognition) handwriting recognition using OpenCV, Keras, and TensorFlow. You will understand the process involved in making a prediction using Core ML to create a request handler. This course teaches you how to handle the result given from Core ML and use the result to cycle through. You will discover what is required in order to determine what number you are actually predicting.</p><p>Finally, you are going to learn everything you need to know to start building more intelligent apps and your own machine learning models. Core ML is the foundation for domain-specific frameworks and functionality. It supports Vision for analyzing images, and Natural Language for processing text. Core ML also supports Speech for converting audio to text, and Sound Analysis for identifying sounds in audio. This course will introduce you to Core Machine Learning, how it works, and how to use it properly. It gives you hands-on knowledge on how to correctly integrate machine learning into iOS apps. You will be guided on how to make a custom UI (user interface) collection view flow layout. This course will be of benefit to website and application developers, and digital or data analysts with basic knowledge of the Python environment.</p><a href=\"https://alison.com/resume/courses/3952\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3952\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building A Convolutional Neutral Network","description":"This module introduces you to the uses of Keras. You will learn the difference between tensor flow and Keras. It explains how Convolutional Neural Network works and how to classify images. This module teaches you how to run values through convolutional layers. You will also learn to build your Convolutional Neural Network using Keras.","topics":["Building A Conventional Neural Network - Learning Outcomes","Use Of Keras And CNN Dataset","CNN Virtualization","Machine Learning Accuracy","Building A Conventional Neural Network - Lesson Summary"]},{"name":"Module","details":"Building A Handwriting Recognition App","description":"In this module, you will learn how to build an app that can recognize handwriting using the Core ML module. This module teaches you how to draw on your screen in ML. You will learn how to import the core ML model to a project in order to use it. You will learn how to handle the result given from Core ML and use the result to cycle through.","topics":["Building A Hand Writing Recognition App - Learning Outcomes","Writing Interface","Reading Metadata","ML Predictions","Building Hand Writing Recognition App - Lesson Summary"]},{"name":"Module","details":"Core Machine Learning Basics","description":"In this module, you will learn about Machine learning, how it works. It explains the process of integrating Machine Learning into iOS Apps. You will learn how to build the app interface using the interface builder. This module teaches you how to make a custom UI collection view flow layout.","topics":["Core Machine Learning Basics - Learning Outcomes","Core Machine Learning Analysis","Interface Building","Image Cell and Helper File","Machine Learning Layout","ML Prediction And Photo Analysis","Core Machine Learning Basics - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Building Machine Learning App Interface - Course Assessment"]}]}