{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3029","title":"Diploma in C++ Fundamentals","totalEnrolled":"4,397","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the Standards and Syntax Fundamentals of C++ through demonstrations in this free online C++ fundamental course.","description":"The programming language C++ is very popular across the world because it is extremely fast and stable. This free online course will give you more insights into modern C++ how to get simple user inputs through practical demonstrations and examples. This introductory C++ course will guide you to understand the standards, features and fundamentals of C++ language to kick-start your programming career.","courseOutcomes":["Explain the history and standardizat...","List the uses of compiler and linker...","Identify the features of C++ environ...","Define Fundamental data types...","Explain the history and standardization of C++ language","List the uses of compiler and linker","Identify the features of C++ environment","Define Fundamental data types","List the characteristics of C++ language","Discuss Comments, Whitespace and Variables","Differentiate between L and R values","List the examples of operators","Analyze old style string and new style string type object","Explain the history and standardizat...","List the uses of compiler and linker...","Identify the features of C++ environ...","Define Fundamental data types...","Explain the history and standardization of C++ language","List the uses of compiler and linker","Identify the features of C++ environment","Define Fundamental data types","List the characteristics of C++ language","Discuss Comments, Whitespace and Variables","Differentiate between L and R values","List the examples of operators","Analyze old style string and new style string type object"],"courseDescription":"<p>Get your C++ certification by exploring this practical C++ fundamentals free online course. You will explore why this programming language is so popular by being introduced to the history and standardization of C++ as well as the more intricate details such as what compilers and linkers are and their uses. Getting the basics of installation right is very important and your learning will include setting up a C++ Integrated Environment specifically within Microsoft Surface Studio and then the fundamentals of programming using C++ including practical demonstrations.</p><p><br>The next part of this free online C++ training discusses new features of C++ and C++ 11 including the concept of programming, characteristics of C++ and how to use C++ reference documentation. Once this is complete, the course discusses Code Efficiency and the important data types that are predefined in the standard C++ language. The last part of the content guides you through operations and operands to form expressions that produce results over a particular time and examples of different operators. You will also analyze code strings such as the uses of literal string, old style strings, new style string type objects and the very important process of getting user inputs.</p><p>If you are already in programming and want to add C++ to your skills or are just curious on how C++ works, then enrolling in this course will give you the fundamental training required to understand this popular language and its uses. The course is practical in nature and allows you to apply your learning from day one.</p><a href=\"https://alison.com/resume/courses/3029\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3029\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"C++: Fundamentals","description":"In this module, you will learn the uses of compiler and linker. Next you will learn the history and standards of C++ language. You will also learn how to program using C++. You will learn the characteristics of C++ language. You will also learn C ++ comments, whitespace and declaring variables.","topics":["C++: Fundamentals - Learning Outcomes","Getting Started","Few Starter Examples","Learning About C++","C++ Comments, Whitespace and Declaring Variables","C++: Fundamentals - Lesson Summary","C++ Fundamentals | First Assessment"]},{"name":"Module","details":"Syntax Fundamentals","description":"In this module, you will learn the fundamentals of data types. You will also learn about sizeof operations. You will understand the difference between L and R values. You will learn different examples of operators. Then you will learn about getting simple user input.","topics":["Syntax fundamentals - Learning Outcomes","Fundamental Data Types","Demonstrating Sizeof and IEE Operations","Constant, L and R Values","Operations and Precedence","Literal Strings","Syntax fundamentals - Summary","Syntax Fundamentals | Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["C++ Fundamentals - Final Assessment"]}]}