{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2221","title":"C++ and Compiling C Programs to Assembly Language","totalEnrolled":"1,884","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn all you need to know about C++ and how C programs are compiled to assembly language from this free online course.","description":"This free online course on C++ and compiling C programs to assembly language can be of great help to students aspiring to be able to write simple and programs in C and also converting the program to assembly language. The course gives an insight on such required compilation steps like pre-compilation, actual compiler output and linking. Many other important topics are discussed in the course, so get started today.","courseOutcomes":["Identify the three main tasks that a...","Discuss how local variables and func...","Describe the roles of prologue and e...","Describe the roles of __cdecl and __...","Identify the three main tasks that are performed when compiling a program","Discuss how local variables and function parameters could be assessed","Describe the roles of prologue and epilogue in C","Describe the roles of __cdecl and __stcall function calls in C","Describe how arguments are passed to a function","Explain what happens when a function Fn (int x, int y ) is invoked with more number of argument","Explain what happens when a function: Fn (int x, int y ) is invoked with fewer argument","Discuss why it is compulsory to move parameters from right to left","Describe the roles of these functions: string length, string compare and memory copy","Identify the three main tasks that a...","Discuss how local variables and func...","Describe the roles of prologue and e...","Describe the roles of __cdecl and __...","Identify the three main tasks that are performed when compiling a program","Discuss how local variables and function parameters could be assessed","Describe the roles of prologue and epilogue in C","Describe the roles of __cdecl and __stcall function calls in C","Describe how arguments are passed to a function","Explain what happens when a function Fn (int x, int y ) is invoked with more number of argument","Explain what happens when a function: Fn (int x, int y ) is invoked with fewer argument","Discuss why it is compulsory to move parameters from right to left","Describe the roles of these functions: string length, string compare and memory copy"],"courseDescription":"<p>The course begins by introducing you to the steps involved in compiling a C program to assembly language. These steps are the pre-compilation, actual compiler output and linking.&nbsp; You will also get to understand the concepts of prologue and epilogue in relation to how high-level function calls are translated into low-level assembly instructions.</p><p>The course then moves on to explain the common calling conventions in C and how variables are passed and assessed in the same C language. As the course progresses, C++ is introduced as a powerful object-oriented programming language. You will learn how to access the local variable in a C++ program and explain the significance of “ This Pointer” in C++</p><p>Finally, You will understand the significance of passing arguments to a function by analyzing what happens when a function is invoked with fewer arguments or with more number of arguments. You will aslo compare the significance of recursion and loops and then choose the better option to be used by programmers. Start this course today, and equip yourself with the knowledge of C++ and compiling C programs to assembly language.</p><a href=\"https://alison.com/resume/courses/2221\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2221\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Compiling C to Assembly Language","description":"In this module, you will learn about the compilation of C programs to assembly language. You will understand how high-level function calls are translated into low-level assembly instructions, along with how variables are passed and assessed.","topics":["Compiling C to Assembly Language - Learning Outcomes","Compiling a C Program","Compiling a C Program to Assembly language","Execution of a C Program","Function calls in C","C++ Functions at Assembly Language Level","Compiling C to Assembly Language - Lesson Summary"]},{"name":"Module","details":"C++ and Special Functions","description":"In this module, you will be introduced to C++ and some Special Functions. You will compare C vs C++ at an assembly language level, recursions & loops, and also learn about optimizing certain functions by exploiting hardware loops in C.","topics":["C++ and Special Functions - Learning Outcomes","Passing Arguments to a Function","Variable Number of Argument Function","Implementing Printf()","Recursion Vs Loops","Exploiting Hardware Loops","Security of Local Variables","C++ and Special Functions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["C++ and Compiling C Programs to Assembly Language - Course assessment"]}]}