{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3025","title":"Diploma in C++ Intermediate","totalEnrolled":"3,219","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the concepts of C++ object-orientated programming such as Data Structures and Pointers in this free online course.","description":"If you want to up your game in C++ and already have the basic knowledge of this popular programming language, then this free online C++ course is for you. The next level of C++ training includes basic concepts of object-oriented programming using C++, defining and implementing data structures and pointers, arrays and strings and their manipulation. Discover classes and structs, enums, and standard library string all with practical examples.","courseOutcomes":["Distinguish between the various synt...","Identify variables, arrays, strings ...","Distinguish flow control statements ...","Recall and use iterations in C++ pro...","Distinguish between the various syntax for declaring classes, structs, union and Enums in C++","Identify variables, arrays, strings in C++ programs","Distinguish flow control statements in C++ programs","Recall and use iterations in C++ programs.","Recall and use pointers to process to process arrays, pass arguments, and improve program efficiency in C++","Solve pointer Arithmetic in C++","Identify the basic syntax to declare a pointer data type and understand pointers as a memory address and how to pass pointers as parameters into method calls","Describe how to overload function and operators in C++","Identify the symbols representing Lambda in C++","Distinguish between the various synt...","Identify variables, arrays, strings ...","Distinguish flow control statements ...","Recall and use iterations in C++ pro...","Distinguish between the various syntax for declaring classes, structs, union and Enums in C++","Identify variables, arrays, strings in C++ programs","Distinguish flow control statements in C++ programs","Recall and use iterations in C++ programs.","Recall and use pointers to process to process arrays, pass arguments, and improve program efficiency in C++","Solve pointer Arithmetic in C++","Identify the basic syntax to declare a pointer data type and understand pointers as a memory address and how to pass pointers as parameters into method calls","Describe how to overload function and operators in C++","Identify the symbols representing Lambda in C++"],"courseDescription":"<p>The next chapter in your C++ programming learning provides a comprehensive guide to understanding the various concepts of object-oriented programming including: class, class library, member variable or instance, member methods, public, protected or private. The course consists of two modules which are Data Structure and Pointers, and Array and Strings and all their respective sub-topics. You will learn how to solve common problems in C++, how to create objects in codes and the automatic calls made when specific objects of classes are created. The basic syntax of functions that relates to C++, how to access fields of data structure variables and pointers are then covered along with key features of C++ classes. Here you will gain an understanding of class inheritance, composition, standard templates library, method overloading and overriding and generic programming which enables you to write a general algorithm that works with all data types. The course illustrates the use of templates to make classes and functions more reusable and adaptable and it also explains the concept of scope and the access specifiers keywords while distinguishing between the scoped and unscoped Enums.</p><p><br>This advanced C++ course moves on to get you started on writing codes in which the compilers can optimize to improve the performance using the inline functions. It explores the use of array notation and pointer notation to access elements of an array, array declaration and its characteristics. You will be able to implement typedef in defining a data structure and in assigning address values to pointers. Pointers and their uses are explained and specifically how to use lambda syntax for defining functions in a pointer.</p><p><br>This free online C++ Intermediate course is perfect for those who want to broaden their C++ knowledge and perform more intricate programming functions in this widely-used language. You should enrol if you have some skills in programming and/or C++ and want to refine these in order to open more career opportunities in programming.</p><a href=\"https://alison.com/resume/courses/3025\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3025\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Structures and Pointers","description":"This module describes the concepts of data structures and pointers in C++. It illustrates with hands on practical examples, how data structures and pointers can be used to manipulate and modify our codes. This module comprises of ten subtopics that explicitly explains concepts related to data structures, pointers and its implementation.","topics":["Data Structures and Pointers - Learning outcomes","Classes and Structs in C++","Enums","Unions","Typedef","Introduction to Pointers","Pointers and Array Indexing","Using Const with Pointers","Pointers to String Literals","References","Smart Pointers","Lesson Summary - Data structures and Pointers","Data Structures and Pointers - Assessment"]},{"name":"Module","details":"Arrays and Strings","description":"This module describes the concepts of arrays and strings in C++. It illustrates with hands on practical examples, how arrays and strings can be used to manipulate and modify our codes. This module comprises of seven subtopics, that explicitly explains concepts related to arrays ,strings and its implementation.","topics":["Arrays and Strings - Learning outcomes","Arrays","Standard Library Strings","More Standard Library Strings","Functions","More Functions","Function Pointers","Control Statements","Lesson summary - Arrays and String","Arrays and Strings - Assessments"]},{"name":"Module","details":"Course assessment","description":"","topics":["C++ Intermediate - Course Assessment"]}]}