{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2692","title":"C Programming - Logic and Statements","totalEnrolled":"3,001","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free advanced course in using logic and statements in C programming. Optional certification available on completion.","description":"This free online coding course will teach you how C programming works with statements and logic. It delves into conditional flow statements and their mechanisms, and teaches you about 'if' statements and logical operators. You will be introduced to the concept of ‘goto’ and loops in C programming, as well as custom functions and boolean values (or bools) in the language.","courseOutcomes":["Discuss what a conditional flow stat...","Explain how to create an IF statemen...","Discuss how logical AND operator wor...","Recognize how to create a simple fun...","Discuss what a conditional flow statement is and can be used for","Explain how to create an IF statement and how IF statements work","Discuss how logical AND operator works","Recognize how to create a simple function in C","Discuss Boolean operations and how they work","Discuss how bitmasking works","Recognize the use of and how to create a while loop","Recognize how to break down and understand data structures","Discuss what a conditional flow stat...","Explain how to create an IF statemen...","Discuss how logical AND operator wor...","Recognize how to create a simple fun...","Discuss what a conditional flow statement is and can be used for","Explain how to create an IF statement and how IF statements work","Discuss how logical AND operator works","Recognize how to create a simple function in C","Discuss Boolean operations and how they work","Discuss how bitmasking works","Recognize the use of and how to create a while loop","Recognize how to break down and understand data structures"],"courseDescription":"<p>This advanced C program language online course begins by teaching the concept and function of conditional flow statements and their mechanisms. You will learn how to implement simple IF statements before diving further into their use alongside logical operators. Next, you study the logical OR statements.</p><p>The material will teach you about goto statements and loops in C programming as well as blocks of code - and see why many consider the use of goto in C to be a bad practice. Next, you will be learning about the while loop in C, custom functions in the language, the concept of booleans and bitmasks as well as about changing data using bitmasks.</p><p>Finally, this free online course will teach you about data structures within C programming and displaying data in memory as binary. In this concise course, you will learn what you need to know, whether you want to develop a career as a programmer or simply expand your knowledge on this subject. Enroll in this course today and start learning about logic and statements in the C programming language.</p><a href=\"https://alison.com/resume/courses/2692\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2692\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Conditional Flow Statements","description":"In this module you will learn about using conditional flow statements to have your program make decisions. you will learn about the if statement what it is and how it works. you will learn about nesting if statements inside each other. you will learn about the logical AND and OR operators for combining conditions in your if statement.","topics":["Conditional Flow Statements - Learning Outcomes","Introducing Conditional Flow Statements","The Mechanisms for Control Flow Statements","Implementing a Simple if Statement in C","More About if Statements and Logical Operators","Introducing Logical OR","Conditional Flow Statements - Lesson Summary"]},{"name":"Module","details":"Using Statements","description":"In this module you will learn about using statements in your C program. you will learn about the GOTO statement and how it works. you will learn about creating your own functions. you will learn about creating and using while loops. you will learn about more Boolean operations such as AND, OR, NOT etc. you will learn about bit masking what it allows you to do.","topics":["Using Statements - Learning Outcomes","Introducing GOTO and Loops in C","More About Blocks of Code and GOTO Statements","Introducing the While Loop in C","Introducing Custom Functions in C","Introducing Booleans","Introducing Bitmasks","Changing Data Using Bitmasks","Introduction to Data Structures","Displaying Data in Memory as Binary","Using Statements - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["C Programming - Logic and Statements - Course Assessment"]}]}