{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2691","title":"C Programming - Pointers, Constants and Strings","totalEnrolled":"2,419","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use constants, strings and pointers in C programming in this free course with optional certificate.","description":"C is one of the most popular and widely used programming languages and is commonly used to program operating systems such as Unix. With this free online course, you will build on your knowledge of this general-purpose program language by deepening your knowledge of pointers, strings and constants. Start your learning journey today by completing this simple-to-follow tutorial.","courseOutcomes":["Explain how use pointers to manipula...","Discuss how to change the address a ...","Identify why you need to know pointe...","Explain the difference between a var...","Explain how use pointers to manipulate or change variables data","Discuss how to change the address a pointer is pointing at","Identify why you need to know pointers","Explain the difference between a variable and a constant","Discuss what a constant is and why it exists","Explain where and how constants are stored","Explain how to create an array","Explain how use pointers to manipula...","Discuss how to change the address a ...","Identify why you need to know pointe...","Explain the difference between a var...","Explain how use pointers to manipulate or change variables data","Discuss how to change the address a pointer is pointing at","Identify why you need to know pointers","Explain the difference between a variable and a constant","Discuss what a constant is and why it exists","Explain where and how constants are stored","Explain how to create an array"],"courseDescription":"<p>This free online course takes a deep dive into the subject of pointers in C programming. It begins by discussing the use of pointers for direct memory access and manipulation in C. The material moves on to teach you about changing the memory location contained within a pointer and talks about pointers containing memory locations of multi-byte variables. It then explains how pointers have memory addresses and introduces the char pointer and explains why you need to learn pointers in C programming.</p><p>Furthermore, you will be learning about the important concept of constants and string literals in C programming before reviewing and clarifying some of the information you have learnt. Next, you will study both strings and constants in C, and a new way to visualize random access memory (RAM). You will also be learning how to use a pointer to directly manipulate data in memory in C programming.</p><p>Finally, you will study the character string as an array of characters in C programming. Whether you are aiming towards a career in computer programming or simply want to build your knowledge in one of the most popular program languages, this course is a great choice.</p><a href=\"https://alison.com/resume/courses/2691\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2691\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Using Pointers","description":"In this module you will learn about using pointers in your program. you will learn about change a value in the address a pointer is pointing to. you will learn about changing what a pointer points to. you will learn about using pointers with strings. you will learn about why you need to know about pointers.","topics":["Using Pointers - Learning Outcomes","Using Pointers for Direct Memory Access and Manipulation in C","About Changing the Memory Address Contained within a Pointer","Pointers Containing Memory Addresses of Multi-Byte Variables","Pointers Have Memory Addresses Too","Why Do You Need to Learn Pointers","Introducing the Char Pointer","Using Pointers - Lesson Summary"]},{"name":"Module","details":"Constants and String Literals","description":"In this module you will learn about constants and string literals. you will learn about the difference between a constant and a variable. you will learn about creating arrays. you will learn about using pointers with the arrays and to directly manipulate data in memory.","topics":["Constants and String Literals - Learning Outcomes","Introducing Constants and String Literals in C","Important Review and Clarifications","More About Strings and Constants in C","A New Way to Visualize RAM","Using a Pointer to Directly Manipulate Data in Memory in C","Introducing the Character String as an Array of Characters in C","Constants and String Literals - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["C Programming - Pointers, Constants and Strings - Course Assessment"]}]}