{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2689","title":"C Programming - Introduction","totalEnrolled":"23,144","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the basics, key concepts and features of the C Programming language with this free online course.","description":"This free online basic course on C programming language will teach you the basics of the C programming language, the importance of understanding binary and give you a brief introduction to hexadecimal. You will learn about how programming works, the structure that defines all programs and how to start writing your first program. Enroll this online course today if you want to learn programming fundamentals!","courseOutcomes":["Identify why programming languages a...","Explain a binary number system...","Identify why you need to use include...","Explain how a programming language u...","Identify why programming languages are needed.","Explain a binary number system","Identify why you need to use include statements in your programs","Explain how a programming language uses RAM","Recognize that when programming you must specify the type of data you are using or creating","Discuss the structure that defines all programs","Identify what you need to learn to learn any programming language","Identify the need to install a compiler in order to create programs","Recognize how to create a C program to display a piece of text on screen","Identify why programming languages a...","Explain a binary number system...","Identify why you need to use include...","Explain how a programming language u...","Identify why programming languages are needed.","Explain a binary number system","Identify why you need to use include statements in your programs","Explain how a programming language uses RAM","Recognize that when programming you must specify the type of data you are using or creating","Discuss the structure that defines all programs","Identify what you need to learn to learn any programming language","Identify the need to install a compiler in order to create programs","Recognize how to create a C program to display a piece of text on screen"],"courseDescription":"<p>This free introduction to C Programming online course begins by discussing the importance of programming languages. You will study the binary number system and learn how to convert between binary, hexadecimal, and decimal. You will also learn why you need to include statements in your programs, then you will learn how you must specify the type of data you are using or creating in your program.</p><p>Furthermore, in this computer programming language, you will learn the role of RAM in programming a language, how data stored in RAM only exists while your computer is turned on, as well as how programming languages work with data. You will also learn how some functionality is shared by all programming languages and how a program is fundamentally a sequence of many sets of 0s and 1s, each set being a unique instruction telling your computer to do something.</p><p>Finally, in this basic online course on programming, you will explore what syntax is in the terms of programming languages, identify what a function is and how they run in your program as well as how to create a C program to display a piece of text on screen. A deeper understanding of the C programming language, its key concepts and features is essential for C programming competency. Enroll in this online course today and start learning the C programming language.</p><a href=\"https://alison.com/resume/courses/2689\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2689\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Programming, Binary and Hexadecimal","description":"In this module you will learn about why programming languages exist and what they are. you will learn about binary and hexadecimal number systems. you will learn about converting from decimal to binary and hexadecimal. you will learn how to count in both binary and hexadecimal.","topics":["Introduction to Programming, Binary and Hexadecimal - Learning Outcomes","Introduction to Computer Science for Everyone","Which Programming Language","Binary Tutorial","The Importance of Understanding Binary","Hexadecimal Tutorial","Introduction to Programming, Binary and Hexadecimal - Lesson Summary"]},{"name":"Module","details":"How Programming Works","description":"In this module you will learn about how a program works. you will learn about include statements to add functionality to your program. you will learn about what syntax is and what a program is fundamentally.","topics":["How Programming Works - Learning Outcomes","Include Statements","How Programming Languages Work with Data","Some Basics Concerning RAM","Programs are Data Too","How Programming Works - Lesson Summary"]},{"name":"Module","details":"Program Flow","description":"In this module you will learn about how a program flows. you will learn about how program is executed from memory. you will learn about what a function is and about return values. you will learn about the 3 steps needed to learn any programming language.","topics":["Program Flow - Learning Outcomes","About Program Flow","Functions, Methods, Routines","About Arguments and Return Values","About Syntax and Functions","Program Flow - Lesson Summary"]},{"name":"Module","details":"Writing Your First Program","description":"In this module you will be introduced to writing your first program. you will learn how to create a basic program to say Hello on screen. You will learn about how you need a compilers to construct and run your program in a form the computer can understand.","topics":["Writing Your First Program - Learning Outcomes","Writing Your First Program in C","Review of Your First Program","Running Your First Program","Writing Your First Program - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["C Programming - Introduction  - Course Assessment"]}]}