{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2690","title":"C Programming - Numbers, Variables and Arrays","totalEnrolled":"3,698","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamentals of numbers, variables and arrays in the C Programming language from this free course.","description":"This course will teach you the basics of numbers, variables and using an array in C programming. You will learn about signed and unsigned numbers, the basics of numeric overflow and ASCII as well as about the connection between function return values and variables.","courseOutcomes":["Recognize the differences between us...","Explain how fractions work and are s...","Understand what numeric overflow is...","Identify the basic numeric data type...","Recognize the differences between using a signed number and an unsigned number","Explain how fractions work and are stored in binary","Understand what numeric overflow is","Identify the basic numeric data types available in C","Explain what a variable is","Recognize how and where to use placeholders","Identify what a pointer is and what it is used for","Know what an array is","Explain how to create a pointer","Recognize the differences between us...","Explain how fractions work and are s...","Understand what numeric overflow is...","Identify the basic numeric data type...","Recognize the differences between using a signed number and an unsigned number","Explain how fractions work and are stored in binary","Understand what numeric overflow is","Identify the basic numeric data types available in C","Explain what a variable is","Recognize how and where to use placeholders","Identify what a pointer is and what it is used for","Know what an array is","Explain how to create a pointer"],"courseDescription":"<p>This tutorial in C Programming begins by discussing the basics of signed and unsigned numbers before moving on to look at numeric overflow. Then you will learn the fundamentals of binary numbers, discuss fractional numbers and study numeric data types in C. You will also learn the basics of ASCII (American Standard Code For Information Interchange) and the CHAR data type, as well as how numbers are encoded as characters in ASCII.</p><p>Furthermore, you will master variables and their function in C before going on to explore the connection between function return values and variables. After that, the material takes you through terminating strings of text and other data when building in C, then delves into the printf function and gives you an overview of placeholders.</p><p>Finally, you will be learning about the arrays and pointers, looking at how to create a pointer in C, assigning a value to a pointer and getting the value stored at a memory address using a pointer. In this concise course on programming in C, you will build on your basic knowledge and move into more complex areas to form a deeper understanding of this useful programming language.&nbsp;</p><a href=\"https://alison.com/resume/courses/2690\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2690\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Numbers","description":"In this module you will learn about numbers in a C program. you will learn about the different numeric data types in C, you will learn about signed and unsigned numbers and the difference between the two. You will learn about character data type and ASCII values for your keyboard.","topics":["Numbers - Learning  Outcomes","Basics of Signed and Unsigned Numbers","The Basics of Numeric Overflow","Fractional Numbers in Binary","Numeric Data Types in C","The Basics of ASCII and the Char Data Type","How Numbers are Encoded as Characters in ASCII","Maximum Values for Unsigned Integers in C","Minimum and Maximum Values of Signed Integers","Numbers - Lesson Summary"]},{"name":"Module","details":"Variables","description":"In this module you will learn about variables in a C program. you will learn about what a variable is. you will learn about return values and how they work with functions. you will learn about creating and using strings. you will learn about using placeholders to print your variables on screen.","topics":["Variables - Learning Outcomes","Introducing Variables","The Connection Between Function Return Values and Variables","Terminating Strings of Text and Other Data","More About the Printf Function and an Introduction to Placeholders","Variables - Lesson Summary"]},{"name":"Module","details":"Arrays and Pointers","description":"In this module you will learn about pointers. you will learn about what a pointer is and how to create one. you will learn about what an array is. you will learn about assigning values using a pointer, and getting values using a pointer. you will learn about referring to a variables address place in RAM.","topics":["Arrays and Pointers - Learning Outcomes","Introducing Arrays and Pointers - Part One","Introducing Arrays and Pointers - Part Two","Introducing the Pointer Data Type","How to Create a Pointer in C","Assigning a Value to a Pointer","Getting the Value Stored at a Memory Address Using a Pointer","A Chance to Practice and Use What You Have Learned","Arrays and Pointers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["C Programming - Numbers, Variables and Arrays - Course Assessment"]}]}