{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4315","title":"CAD for Kids - Tinkercad for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online computer design course for kids explores the amazing world of 3D design and printing with Tinkercad.","description":"Does your child want to become an engineer or architect? If the answer is 'yes,' then this course is a must-have! Every engineer, architect or product designer must learn about 3D design or CAD (computer-aided design) and it is never too early to learn. This course is ideal for children between the ages of 7 and 12. The video lessons and exercises will have your child or pupils creating amazing designs in no time.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course offers an introduction to the fundamentals of 3D and 3D printing for elementary and middle school (primary) students. Students work with hands-on exercises and learn how to use computer-aided design (CAD) software to create their designs. They are guided through a series of video lessons and exercises to learn the software tools they need to create amazing models. In this course, students learn to set up their own free Tinkercad account to create and store 3D designs. They identify and use the functions and commands in the software's interface and learn to move, rotate, and adjust shapes freely in space. Students also learn to group together a set of shapes to create detailed models and prepare files to export for 3D printing.</p><p>Some of the skills developed in this course include: creativity, analytical and spatial thinking, problem solving, technical design, and project planning. During the ‘getting started’ section of the course, students learn the tools necessary to open an account and get familiar with the software's interface. Once they learn the basics about getting around the software, they begin exploring shape properties, the copy/paste commands, and the duplicate and group commands. Students also learn how to use 'holes' to subtract volume and shape their designs. Some additional commands included are the 'align' and 'mirror' commands. Students also learn how to use the 'workplane' and the 'ruler'. The last lesson explores how to import/export files from a computer to a 3D Printer.</p><p>CAD is a valuable skill for anyone interested in exploring the fields of engineering, architecture, or design. CAD software is frequently used by different types of engineers and designers to aid in the design processes. It can be used to create two-dimensional (2D) drawings or three-dimensional (3D) models. The purpose of CAD is to optimize and streamline the designer's workflow, increase productivity, improve the quality and level of detail in the design, improve documentation communications and often contribute toward a manufacturing design database. CAD software outputs come in the form of electronic files, which are then used accordingly for manufacturing processes. Compared to traditional technical sketching and manual drafting, the use of CAD design tools can have significant benefits for engineers and designers.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}