{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4827","title":"Certified Social Media (Network) Cyber Security & Analysis: Level 1","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course analyzes, collects and visualizes vital user information from various social media outlets.","description":"How often do you find yourself checking in on social media each day? This course will provide you with the skills and tools you'll need to investigate and monitor an ever-expanding and constantly changing social media ecosystem. Social media intelligence allows one to gather intelligence from social media sites like Facebook, Twitter, Instagram and so on. This type of intelligence gathering is one element of Open-Source Intelligence (OSINT).","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Social media intelligence’ (SMI or SOCMINT) and ‘social network analysis’ refers to the collaborative tools and solutions that allow organizations to analyze conversations, respond to social signals and synthesize social data points into meaningful trends and analyses based on the user's needs. Social media intelligence allows one to gather intelligence from social media sites, using both intrusive and non-intrusive means, from open and closed social networks. This type of intelligence gathering is one element of Open-Source Intelligence (OSINT).</p><p>OSINT is primarily used in national security, law enforcement and business intelligence functions and is of value to analysts who use non-sensitive intelligence in answering classified, unclassified or proprietary intelligence requirements across the various intelligence disciplines. So what jobs could you potentially apply for after completing this course? Careers such as an OSINT analyst, a SOCMINT analyst or an open source investigator are just a few and many other roles may pique your interest.</p><p>This practical course with up-to-date social network analysis level-1 training will provide you with the solid foundation of real-world knowledge and expertise you need to conduct online investigations using free and open-source tools effectively. How will this course help you to get a job? Social media intelligence (SMI or SOCMINT) is an emerging field and averages £28,000-£32,000 per annum in salary (which varies with experience). The chances of working for law enforcement are also high. So don't delay and register today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}