{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3817","title":"Cocos2d-x C++ Game Development: Tic-Tac-Toe","totalEnrolled":"349","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to make multi-device games like tic-tac-toe using Cocos2d-x and C++ with this free online course.","description":"Cocos2d-x is a free but fast, powerful, and popular game development engine that is also very easy to use. Begin your thrilling journey in game development with this free online game development course and learn how you can make cross-platform, multi-device games for android, iOS, Windows, Linux, and others with Cocos2d-x using C++ using the popular game called tic-tac-toe (also known as ‘noughts and crosses’) as your example project.","courseOutcomes":["Explain how to create a fully functi...","Describe the process and commands to...","Describe how to create the menu syst...","Describe how to create and implement...","Explain how to create a fully functional multi-device cross-platform tic-tac-toe game in Cocos2d-x using C++","Describe the process and commands to set up and initiate the project","Describe how to create the menu system for the game","Describe how to create and implement splash scenes into the games","Describe how to build a grid system and create game logic in the tic-tac-toe game","Explain how to implement an AI system into the game","Describe how to build other important parts of the games like pause, toggling, leaderboards, achievements and game over, etc. to make the game more user-friendly","Describe how to build unlock achievements in the tic-tac-toe game","Identify key C++ commands and codes to develop games in Cocos2d-x","Describe how to write a C++ program in Cocos2d-x for creating games","Explain how to create a fully functi...","Describe the process and commands to...","Describe how to create the menu syst...","Describe how to create and implement...","Explain how to create a fully functional multi-device cross-platform tic-tac-toe game in Cocos2d-x using C++","Describe the process and commands to set up and initiate the project","Describe how to create the menu system for the game","Describe how to create and implement splash scenes into the games","Describe how to build a grid system and create game logic in the tic-tac-toe game","Explain how to implement an AI system into the game","Describe how to build other important parts of the games like pause, toggling, leaderboards, achievements and game over, etc. to make the game more user-friendly","Describe how to build unlock achievements in the tic-tac-toe game","Identify key C++ commands and codes to develop games in Cocos2d-x","Describe how to write a C++ program in Cocos2d-x for creating games"],"courseDescription":"<p>With computers in every home and smartphones in every hand, the demand for video or digital games has reached an all-time high. It has resulted in high demand for developers or professionals who can design or create a wide variety of immersive and entertaining games. Many gaming engines are available today to help developers, both amateur and professionals, develop more games for playing on all platforms like iOS, Windows, Linux, and others. Fuelling this passion and thrill for making entertaining games is Cocos2d-x, a fast, powerful, and popular gaming engine. In this free online game tutorial, learn to develop a game in Cocos2d-x using C++ and take your first step as a game developer. You will be creating tic-tac-toe, a simple but sought–after game known as noughts and crosses or Xs and Os around the globe.</p><p>This game design certificate consists of two modules further divided into different topics which will help you learn and easily understand game design basics and the process, commands, and techniques of making games using C++ in Cocos2d-x Game Engine. Easy step-by-step tutorials walk you through programming and making a fully functional, awesome tic-tac-toe game from start to finish. You will begin by setting up and creating the main menu for the game and move on to creating the Grid and AI system and then learn to scale your skills further by programming other levels or parts of the game like game over, pause systems, leader boards, and achievements, etc.</p><p>If you are interested in becoming a professional in game development, then this course is for you. This course will allow you to learn game development, whether you are an experienced gaming developer looking for a quick refresher in Cocos2d-x engine commands or a complete beginner. Your C++ experience will also be very handy in understanding some of the technical details in the course. So if you are a game development enthusiast, enrol in this free online course and gain the skills and knowledge you need for all your future gaming projects in Cocos2d-x using C++.</p><a href=\"https://alison.com/resume/courses/3817\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3817\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting-Up, Creating Main Menu and Grid System","description":"Take the first step to develop a multi-device Tic-tac-toe game on Cocos2d-x using C++. Learn important features and prerequisites to set up your gaming project. Get to know codes and C++ commands to create and design functional game scenes and a Grid system for the game stages. The module finishes off with programming an amazing AI into the game.","topics":["Setting-Up, Creating Main Menu and Grid System – Learning Outcomes","Setting Up and Creating the Main Menu","Creating the Grid System and AI System","Setting-Up, Creating Main Menu and Grid System - Lesson Summary"]},{"name":"Module","details":"Implementing Game Over State, Pause System and Progress States","description":"After creating and initializing grid and AI systems, it’s now time to give it a final touch by implementing other functionalities like Game Over and Pause Systems. You will also learn to code for implanting unlocking achievements levels in the game.","topics":["Game Over State, Pause System and Progress States- Learning Outcomes","Implementing Game over and Pause Systems","Implementing Unlocking Achievements","Game Over State , Pause System and Progress States - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Cocos2d-x C++ Game Development: Tic-tac-toe - Course Assessment"]}]}