{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1443","title":"Computer Networking - Wired and Wireless Networks and Protocols","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the structure and function of wired and wireless networks and their protocols with this free computer course.","description":"This free online course in Computer Networking introduces you to the basic structure and features of both wired and wireless networks and their protocols. Computer networking has become an indispensable part of both our personal lives and our business operations, which makes understand computer networks a very valuable asset in modern life. This free online course will teach you the ins and outs of computer networking for any application.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The course begins by introducing you to networking fundamentals. This will give you a better understanding of what wired and wireless networks are about. You will first learn the basics of both networks' media, protocols, standards, and concepts. The course will then tackle cabling systems for wired networks, in particular, the twisted-pair cables. cables and signaling, and other types of cable. The course will then discuss Internet Protocol(IP) addresses in detail, including IP Ranges. You will look into the difference between the Internet Protocol V4 and Internet Protocol V6.<br><br>The course will then teach you about the role of the Default gateway and DNS server in networking. You will also learn how to implement TCP/IP in the Command Line as well as discover and see TCP/IP tools used to manage and troubleshoot networks. Basic TCP/IP tools such as command prompt, ipconfig, and ping will also be taught and demonstrated. The course will also describe and demonstrate the function of advanced TCP/IP tools such as Netstat, Pathping, Nslookup, Telnet, NbtStat, and Netsh.<br><br>Wired and Wireless network connections both have their advantages and disadvantages. Understanding these can make a big difference to your networks in terms of reliability and stability, speed, security, installation, maintenance, and cost. This free online Computer Networking - Wired and Wireless Networks and Protocols course will give you a better knowledge of the structure and function of both network connections. So, check out the course, and gain a better understanding of computer networking, today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}