{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3587","title":"Configuration and Monitoring of VMware vSphere 6.0","totalEnrolled":"806","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the configuration processes as well as the monitoring of VMware vSphere 6.0 from this free online course.","description":"This course on the configuration and monitoring of VMware vSphere 6.0 gives you a comprehensive guide on the processes involved in the creation of virtual machines and the configuration of VM hardware. Learn how to integrate the ESXi Active Directory (AD) and the functions of the distributed resource scheduler (DRS) cluster in VMware. Start this course now and enhance your VMware 6.0 configuration knowledge today.","courseOutcomes":["Create multiple virtual machines, te...","Explain the functions of virtual app...","Explain how to control users access ...","Differentiate between multiple user ...","Create multiple virtual machines, templates and clones","Explain the functions of virtual appliances and how to export VM to OVF format","Explain how to control users access and permissions in VMware vSphere Client 6.0","Differentiate between multiple user permissions explicit and inherited in VMware","Explain the function of transparent memory page sharing (TPS) in VMware 6.0","Explain the resource pool configuration process in VMware vSphere 6.0","Identify the processes of creating a linked mode group of vCenter Servers in VMware","Explain how to patch the ESXi Standalone Hosts and vCSA 6.0","Differentiate between Unitrends free and Unitrends enterprise as third-party backup options in VMware 6.0","Create multiple virtual machines, te...","Explain the functions of virtual app...","Explain how to control users access ...","Differentiate between multiple user ...","Create multiple virtual machines, templates and clones","Explain the functions of virtual appliances and how to export VM to OVF format","Explain how to control users access and permissions in VMware vSphere Client 6.0","Differentiate between multiple user permissions explicit and inherited in VMware","Explain the function of transparent memory page sharing (TPS) in VMware 6.0","Explain the resource pool configuration process in VMware vSphere 6.0","Identify the processes of creating a linked mode group of vCenter Servers in VMware","Explain how to patch the ESXi Standalone Hosts and vCSA 6.0","Differentiate between Unitrends free and Unitrends enterprise as third-party backup options in VMware 6.0"],"courseDescription":"<p>This course introduces you to the processes of creating virtual machines as well as the configuration of VM hardware in vSphere 6.0. You will learn about the functions of the VM properties via vSphere Web Client along with the functionality of the Virtual Machine Remote Console (VMRC) as well as that of the distributed resource scheduler (DRS) cluster. You will also see how to deploy a virtual machine from existing templates and the processes involved in the customization of operating systems. This course teaches you about the deployment of virtual appliances which helps in eliminating problems of installation in VMware as well as how to obtain ESXi host permissions and how to export virtual machines to open virtualization format (OVF).</p><p>Ever wondered how pre-conversion is carried out in the configuration of VMware vCenter Converter? This course explains the pre-conversion process in the configuration of vCenter Converter as well as how to automatically start up and shut down. This course analyzes the differences between virtual machines and physical hardware, the different types of storage reports that can be collected and how these storage reports can be exported using .csv files. You will then learn how to set up the ESXi account security configuration and how to detect advanced vMotion errors during the configuration process. This course then explains the purpose of setting up ESXi firewalls in a virtual machine, the functions of TCP and UDP ports in ESXi firewalls, as well as how to manage data encryption for security purposes.</p><p>Finally, you are exposed to the functions of snapshots in virtual machines. Get to know about the installation process of the ESXi standalone patch. You will also get to learn about the new updates made to the vSphere Replication (VR) version 6.0. This course is targeted at students, researchers, IT enthusiasts and professionals as well as anyone interested in VMware configuration. Begin this course today and improve your VMware vSphere 6.0 configuration knowledge.</p><a href=\"https://alison.com/resume/courses/3587\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3587\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"VM Creation, Configuration, and Snapshot","description":"This module will introduce you to the processes involved in the creation of virtual machines and the configuration of virtual machine hardware. You will learn how to create multiple VMs, how to export VM to OVF Format, and the functions of virtual machines snapshot in VMware vSphere 6.0.","topics":["VM Creation, Configuration, and Snapshots - Learning Outcomes","VM Virtual Hardware","Create Multiple VMs, Templates & Clones","Virtual Appliances","Configuration and Use of vApps","VMware Converter (P2V – V2V)","Managing VMs","Virtual Machine Startup & Shutdown","Virtual Machine Snapshots","Virtual Machine Troubleshooting & Best Practices","VM Creation, Configuration, and Snapshots - Lesson Summary","VM Creation, Configuration, and Snapshots - Assessment"]},{"name":"Module","details":"Security and Permissions","description":"In this module, you will be introduced to how user access and passwords are managed in the ESXi host. You will learn about the ESXi Active Directory (AD) integration, how to manage ESXi firewalls to avoid breakdown, the functions of TCP and UDP ports in ESXi firewalls, and how to manage data encryption.","topics":["Security and Permissions - Learning Outcomes","Controlling User Access and Passwords","ESXi Active Directory (AD) Integration","Managing Firewalls","Managing Security Certificates","Security and Permissions - Lesson Summary","Security and Permissions - Assessment"]},{"name":"Module","details":"Server and VM Monitoring","description":"In this module, you will be introduced to the functions of transparent memory page sharing (TPS) in VMware 6.0. You will learn how to configure the resource pool along with the process of deploying extremely latency-sensitive applications. Get to discuss the functions of monitoring performance in VMware vSphere 6.0.","topics":["Server and VM Monitoring - Learning Outcomes","Optimizing Resources","Resource Pools","Latency Sensitive Applications","Performance Monitoring","Configuring Alarms","ESXi & vCenter Logs","Server and VM Monitoring - Lesson Summary","Server and VM Monitoring - Assessment"]},{"name":"Module","details":"Advanced ESXi and vCenter Server Management","description":"This module demonstrates how to generate a vCenter storage report in VMware 6.0. You will learn how to use as well as configure storage vMotion migration and the functions of distributed resource scheduler (DRS) cluster. Learn how to create, edit, and attach host profiles in VMware vSphere 6.0.","topics":["Advanced ESXi and vCenter Server Management - Learning Outcomes","Storage Reports","Storage vMotion","Configuring vMotion","Enhanced vMotion","Distributed Resource Scheduler (DRS) Cluster","DRS Cluster Monitoring","Profile Driven Storage, Datastore Clusters & Storage DRS (SDRS)","Host Profiles","Linked Mode Group of vCenter Servers","Advanced ESXi and vCenter Server Management - Lesson Summary","Advanced ESXi and vCenter Server Management - Assessment"]},{"name":"Module","details":"Patching and Upgrading ESXi","description":"This module will introduce you to the installation process of the ESXi standalone patch. You will learn how to patch the VMware vCenter Server (vSCA) 6.0 through the command line and how to update Manager remediation Defaults. Study the configuration options in the vCenter environment and how to use the Web Client to upgrade the VMware tools.","topics":["Patching and Upgrading ESXi - Learning Outcomes","Patching ESXi Standalone Hosts & vCSA 6.0","Patching the vCenter Environment","Upgrades and Migrations","Patching and Upgrading ESXi - Lesson Summary","Patching and Upgrading ESXi - Assessment"]},{"name":"Module","details":"Disaster Recovery and Backup","description":"This module analyzes the updates in the vSphere replication version 6. You will learn about the features of VMware Site Recovery Manager (SRM), VMware Fault Tolerance, and the virtualization of the Microsoft clusters.","topics":["Disaster Recovery and Backup - Learning Outcomes","vSphere Replication 6","Site Recovery Manager (SRM)","High Availability (HA)","VM Fault Tolerance","Microsoft Clustering","Backup Strategies","vSphere Data Protection","Third Party Backups","Disaster Recovery and Backup - Lesson Summary","Data Recovery and Backup - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Configuration and Monitoring of VMware vSphere 6.0 - Course Assessment"]}]}