{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2759","title":"Core Excel Skills For Accountants and Financial Professionals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the core Microsoft Excel skills every accountant or financial professional needs in this free online course.","description":"This course provides the fundamental Microsoft Excel skills that every accountant or financial professional requires. We cover important features from logical tests involving ‘IF’ statements to pivot tables and the new dynamic array functions. We teach you the key Excel features used daily in bookkeeping and to give financial presentations. This course provides valuable spreadsheet skills that can take your financial career to the next level..","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Microsoft Excel is the tool of choice for most accountants and financial professionals, and possessing advanced Excel skills can make a real difference to your career prospects. However, many bookkeepers and financial officers lack the fundamental Excel skills required to carry out daily tasks efficiently and accurately. These abilities include the use of logical tests and ‘IF’ statements, lookups and pivot tables.</p><p>This course has been designed and developed by an accountant and focuses on the Excel skills used daily in the industry. Some of these skills are basic, such as summing with criteria and using logical tests. However, some are advanced, like the use of dynamic arrays. Each of our topics represents a necessary ability for the job and familiarity with some of the newer features of Excel 365 can put you ahead of the curve.</p><p>This short training course provides you with a basic knowledge of Excel and covers logical tests and ‘IF’ statements, lookup formulas, summing with criteria, working with tables, pivot tables and dynamic arrays. We use workbooks and exercises to allow you to practice your new skills, grounding your newfound theoretical knowledge in practical demonstrations. Excel is an industry-standard tool for those working in finance, so sign up to add this popular spreadsheet program to your portfolio.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}