{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1618","title":"Create Android Apps Using Firestore","totalEnrolled":"26,697","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to develop apps for Android using Firestore database technology with this free online course.","description":"This free online application development course will teach you how you can create excellent android apps with Firestore. You will learn how to set up a new project using Firebase and Android Studio, develop the user interface (UI) for an Android app, and link a post to the Firestore database. You will also study how to create and customise toggle buttons for an app, configure the 'recycler view' to the database, and more!","courseOutcomes":["Set up a project using Firestore and...","Develop the features of a user inter...","Create and customise toggle buttons....","Set listener values and snapshots....","Set up a project using Firestore and Android Studio.","Develop the features of a user interface (UI).","Create and customise toggle buttons.","Set listener values and snapshots.","Implement a 'like' function.","Configure text fields and buttons.","Create user authentication settings in Firestore.","Develop a comments function for the app.","Explain the hierarchical structure of documents in Firestore.","Apply security rules in Firestore.","Describe the functions for editing and deleting posts and comments.","Describe how to configure an options menu.","Demonstrate how to configure an alert box with buttons.","Set up a project using Firestore and...","Develop the features of a user inter...","Create and customise toggle buttons....","Set listener values and snapshots....","Set up a project using Firestore and Android Studio.","Develop the features of a user interface (UI).","Create and customise toggle buttons.","Set listener values and snapshots.","Implement a 'like' function.","Configure text fields and buttons.","Create user authentication settings in Firestore.","Develop a comments function for the app.","Explain the hierarchical structure of documents in Firestore.","Apply security rules in Firestore.","Describe the functions for editing and deleting posts and comments.","Describe how to configure an options menu.","Demonstrate how to configure an alert box with buttons."],"courseDescription":"<p>In this course, you will learn how to develop a stylish interactive app, using Firestore database technology. The course shows you how to work on the user interface (UI), for example the controller for adding new posts or \"thoughts\", and how to create and customise category buttons, text fields and alert boxes. You will learn how to configure code using Android Studio. Develop secure login capability, using Firebase authentication.</p><p>Next, the course reviews how to implement Firestore security rules, to protect your database and restrict access to permitted users. You will use mockup designs to help you lay out and customise your app, so you can produce a professional product. You will learn how to incorporate tap response functionality, apply it to the app's elements and learn how to add the corresponding code.</p><p>If you’re interested in Android app development as a future career, or if you’re an IT professional seeking to improve your skills, then this clear and simple course is the one for you. In this course you will be invited to develop the app's functionality, to \"make it your own\" and customise it with different colours and assets. Participants in the course are encouraged to create a new app from scratch, using what you have learned in the course. So, get a head start by learning from an industry leading programmer. Practice and learn in your own time and repeat the lessons as often as you need.</p><a href=\"https://alison.com/resume/courses/1618\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1618\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Firestore and Android - Android App development","description":"In this module you will learn about Android App development and it covers topics such as Android App Project Setup; Post View UI; Database Connection; Main Page Categories; Thoughts Adaptor; Data Fetching; Real-time Updates; Adding Likes.","topics":["Firestore and Android (Part 1) - Learning Outcomes","Android App Project Setup","Post View UI","Database Connection","Main Page Categories","Thoughts Adaptor","Data Fetching","Real-time Updates","Adding Likes","Firestore and Android (Part 1) - Lesson Summary"]},{"name":"Module","details":"Firestore and Android - Adding Comments","description":"In this module you will learn about Android app development and it covers topics such as Introduction to the Module; Login/Create User Screens; User Authentication; Options Menu; Adding Comments; Comments Adaptor; Displaying Comments; Security Rules.","topics":["Firestore and Android (Part 2) - Learning Outcomes","Introduction to the Module","Login/Create User Screens","User Authentication","Options Menu","Adding Comments","Comments Adaptor","Displaying Comments","Security Rules","Firestore and Android (Part 2) - Lesson Summary"]},{"name":"Module","details":"Firestore and Android - Interface Development","description":"In this module you will learn about Android app development and it covers topics such as Introduction to the Module; Project Setup; Interfaces; Deleting a Comment; Updating a Comment; Comments Security; Deleting Thoughts and Comments; Thought Security Rules; Overview and Tasks.","topics":["Firestore and Android (Part 3) - Learning Outcomes","Introduction to the Module","Project Setup","Interfaces","Deleting a Comment","Updating a Comment","Comments Security","Deleting Thoughts and Comments","Thought Security Rules","Overview and Tasks","Firestore and Android (Part 3) - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Create Android Apps Using Firestore - End of Course Assessment"]}]}