{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4162","title":"Creating a Carousel and a Task List using JavaScript","totalEnrolled":"248","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to create a dynamic carousel image slider and a task list using JavaScript in this free coding online course.","description":"In this course, you will learn to use JavaScript to create a dynamic carousel image slider and task list for a webpage. See how to add images to a slider, display information on an image, style, and add interactivity to a carousel. You will also learn to create a fully functional task list with the ability to add, delete and cross out items as well as download, store, and retrieve the list from local storage.","courseOutcomes":["Set up the environment for creating ...","Explain the need for adding images i...","Recall the objects needed to create ...","Create an active dot indicator...","Set up the environment for creating a carousel with JavaScript","Explain the need for adding images into an array, before adding them to a carousel","Recall the objects needed to create a carousel with JavaScript","Create an active dot indicator","Explain the different kinds of interactivity that could be added to a carousel","Describe the process of automating a carousel slider with JavaScript","Describe the setup process for a JavaScript task list","Create button interaction for a task list","Add cross-out and delete functionality for a task list","Create a text file from a list","Add download functionality to a list","Store and retrieve information from the local storage","Set up the environment for creating ...","Explain the need for adding images i...","Recall the objects needed to create ...","Create an active dot indicator...","Set up the environment for creating a carousel with JavaScript","Explain the need for adding images into an array, before adding them to a carousel","Recall the objects needed to create a carousel with JavaScript","Create an active dot indicator","Explain the different kinds of interactivity that could be added to a carousel","Describe the process of automating a carousel slider with JavaScript","Describe the setup process for a JavaScript task list","Create button interaction for a task list","Add cross-out and delete functionality for a task list","Create a text file from a list","Add download functionality to a list","Store and retrieve information from the local storage"],"courseDescription":"<p>This web development course demonstrates and explains the process of creating a dynamic carousel and task list using JavaScript. It begins by demonstrating the process of setting up the development environment for creating the carousel, and how images could be sourced and added to the project. Ot proceeds to show how to create required objects, apply styling with CSS (cascading style sheets), and add interactivity to the slider. This part concludes with demonstrations of how to automate the slider, set slide conditions, and create dot indicators.</p><p>The second demonstrates the process of creating a dynamic task list using JavaScript and commences with setting up the development environment. This is followed by lessons on how to create buttons to be used to add items to the list, as well as an event listener, used to provide an error message. Task list styling as well as cross-out, delete and download functionality are demonstrated next. The course wraps up with an explanation of how to locally store, and retrieve the task list.</p><p>Carousel sliders and task lists are present on a lot of websites, and learning to create dynamic ones for a website is certainly worth adding to your web development repertoire. This short course covers everything you need to know to create them both using JavaScript. New and experienced developers will find this course useful, as well as anyone who would like to learn to create a carousel or task list for their website. Start now and learn to create dynamic carousels and task lists in under three hours.</p><a href=\"https://alison.com/resume/courses/4162\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4162\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Creating a Carousel","description":"In this module, you will learn to set up the developer environment for creating a carousel, as well as the process for adding images to a webpage, with captions and other information. You will also learn to add styling to the Carousel with CSS, set the conditions for the carousel, automate the carousel, and create dot indicators.","topics":["Creating a Carousel – Learning Outcomes","Introduction and Setting Up","Dot Indicators and Conclusion","Creating a Carousel – Lesson Summary"]},{"name":"Module","details":"Creating a Task List","description":"This module covers the process of creating a Task List with JavaScript. You will learn to set up the needed tools, create Button Interaction to add items, add CrossOut and Delete Functionality, and style the Task list using CSS. Additionally, you will learn to download, save and retrieve the task list from local storage.","topics":["Creating a Task List – Learning Outcomes","Introduction and Setting Up","List Download, Local Storage and Overview","Creating a Task List – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Creating a Carousel and a Task List using JavaScript – Course assessment"]}]}