{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4958","title":"Creating a Graphical User Interface With Java Swing","totalEnrolled":"448","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the techniques for successfully building a graphical user interface with Java Swing in this free online course.","description":"A graphical user interface lets us interact with electronic devices like computers and smartphones through buttons, menus and icons. Java Swing is easy to use since it is lightweight. This free online course will give you everything you need to develop your application with user-friendly interfaces and an interactive experience. Learn to use JProgressBar, JSlider and their advanced components. Discover how to use the toolbar and tooltip.","courseOutcomes":["Explain the basics of the Java Swing...","Outline the steps for creating a gra...","Discuss the different swing componen...","Describe how to use JLabel and JButt...","Explain the basics of the Java Swing framework","Outline the steps for creating a graphical user interface","Discuss the different swing components for designing applications","Describe how to use JLabel and JButton","State the steps for creating event classes and interface","Summarise the differences between AWT and Java Swing","Identify the process of creating a swing graphical user interface in NetBeans","Lists the various types of Swing layouts","Indicate how to connect the MySQL database in NetBeans","Explain the basics of the Java Swing...","Outline the steps for creating a gra...","Discuss the different swing componen...","Describe how to use JLabel and JButt...","Explain the basics of the Java Swing framework","Outline the steps for creating a graphical user interface","Discuss the different swing components for designing applications","Describe how to use JLabel and JButton","State the steps for creating event classes and interface","Summarise the differences between AWT and Java Swing","Identify the process of creating a swing graphical user interface in NetBeans","Lists the various types of Swing layouts","Indicate how to connect the MySQL database in NetBeans"],"courseDescription":"<p>Web developers must know the most popular programming languages if they want to further their careers. This course will teach you how to use the Java Swing library to create a graphical user interface and explains the difference between Abstract Window Toolkit (AWT) and Swing. Familiarise yourself with the commonly used components in Java Swing and other classes like JToggleButton, JDialog and JColorChooser.</p><p>Additionally, you will learn how to use the NetBeans GUI Builder to handle Swing controls and print text. Learn how to create design event classes and interfaces for the listeners. Uncover ways of connecting to the MySQL database in Netbeans and delve deeper into using ‘action’ and ‘timer’ classes. Become familiar with ‘thread’ in Swing and multiple threading when working with the user interface.</p><p>Finally, learn how to change the appearance and feel of a Swing component before using drag and drop features. Find out how to set the system tray and splash screen as well as the various classes used in menu creation. Due to the market's demand for developers, you will have a better chance of landing your dream career if you complete this course. Enrol now!</p><a href=\"https://alison.com/resume/courses/4958\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4958\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building Applications Using Java Swing","description":"In this module, you will study the basics of the graphical user interface and the different swing components before delving deeper into the layouts. Learn how to handle the events listeners, work with the swing in NetBeans and find out the use of thread.","topics":["Building Applications Using Java Swing - Learning Outcomes","Basics of Java Swing","Swing Components and Event Listeners","Advance Swing Components","Building Applications Using Java Swing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Creating a Graphical User Interface With Java Swing"]}]}