{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1527","title":"Create iOS Apps Using Firestore","totalEnrolled":"2,328","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create iOS apps using Firestore with this free online iOS app development course.","description":"This free online iOS app development course will show you how to design cutting-edge apps for iOS using Firestore. You will learn how Firestore can help give your iOS app a competitive edge with it's easy to manage real-time end databases. You will also learn how to retrieve data and use observers and one-time fetches as well as filter, sort and update documents, and authenticate users using Firebase SDK.","courseOutcomes":["Create and save data to a Firestore ...","Develop log in and create user featu...","Explain Firestore transactions...","Develop user specific security rules...","Create and save data to a Firestore database","Develop log in and create user features for an iOS app","Explain Firestore transactions","Develop user specific security rules","Develop an options menu to edit and delete posts","Explain how a gesture recogniser is used","Create and save data to a Firestore ...","Develop log in and create user featu...","Explain Firestore transactions...","Develop user specific security rules...","Create and save data to a Firestore database","Develop log in and create user features for an iOS app","Explain Firestore transactions","Develop user specific security rules","Develop an options menu to edit and delete posts","Explain how a gesture recogniser is used"],"courseDescription":"<p>In this course you will learn how to create a Firebase project, which involves using Google P-lists and the Cocoapod add-on. The project app in this course utilises Firebase's Firestore system. Firestore makes it easy to manage a real-time back-end database and the tools and resources are helpful to many app developers.</p><p>The course begins by introducing you to the structure and architecture of using Firestore. You will learn how to add documents to the database, using various methods. The course teaches you how to retrieve data using observers and one-time fetches and how to filter, sort and update documents. Next, the course shows you how to authenticate users using the Firebase SDK, specifically using email and password. You will learn about doing transactions and multiple reads and writes at one time.</p><p>In addition, in this course you will learn how to apply security rules - lock down specific paths, collections or documents - based on whether you are an authenticated user or another user. The course shaows you how data is sorted and categorised and how real-time updates can be used. You will learn how to develop a 'like star' feature that updates successfully, and to develop authentication and log in/log out features.</p><p>If you want to design cutting-edge apps for iOS, getting familiar with Firestore technology will give you a competitive edge. Using this technology means you can be confident you are using the best development software and receive the support of important players such as Apple and Google. The DevSlopes instructor in this video-based course is a top programmer in the industry, so why not learn from the best? Start learning how to create iOS apps today!</p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/1527\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1527\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Creating an App in Firestore","description":"In this module you will learn how to create and save data to a Firestore database, retrieve data using observers and one-time fetches, and use Firebase SDK with Firestore to create a project app.","topics":["Creating an App in Firestore - Learning Outcomes","Introduction to the Course","Setting up a Project","About Firestore","Developing the User Interface","Adding Data to the Database","MainVC UI Setup","Fetching Data from Firestore","Sorting and Filtering","Updating Documents","Creating an App in Firestore - Lesson Summary","Firestore iOS - First Assessment"]},{"name":"Module","details":"Developing App Features","description":"In this module you will learn how to develop log in, create user features for an app, develop secure user authentication and use xcode to customise a Comments UI.","topics":["Developing App Features - Learning Outcomes","Introduction to the Module","Log In/Create User VC","Setting Up User ID","Logging In and Out","Comments Setup","Comments Configuration","Comments and Transactions","Displaying Comments","Setting Security Rules","Developing App Features - Lesson Summary","Firestore iOS - Second Assessment"]},{"name":"Module","details":"Using an App","description":"In this module you will learn how to develop an options menu to edit and delete posts, develop user specific security rules, and use code from Cloud Firestore to delete collections.","topics":["Using an App - Learning Outcomes","Introduction to the Module","Adding an Options Menu","Tap Gesture Recogniser","Deleting a Comment","Edit Comments","Advanced Comments Security","Deleting Thoughts","Deleting Thoughts and Comments","Summary and Task","Using an App - Lesson Summary","Firestore iOS - Third Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Firestore iOS - End of Course Assessment"]}]}