{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3566","title":"Create a Cartoon Fishing House in Maya","totalEnrolled":"1,874","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Hone your 3D modelling and animation skills with Maya by designing a beautiful fishing house in this free online course.","description":"This free online course trains you to use Autodesk Maya to simply design a fishing house. We take you through the process of building a grey box using key Maya tools and features like ‘bevel’, ‘vertex’, ‘chamfer’ vertices, and ‘nCloth’. We show you how to do so in easy steps. This course not only helps you boost your Maya skills but gives you the confidence to explore the world of 3D modeling and design to become an accomplished animator.","courseOutcomes":["Describe how to create a beautiful l...","Identify the important steps in mode...","Discuss the value of the ‘grey box’ ...","Recognize basic commands and techniq...","Describe how to create a beautiful low-poly cartoon fishing house in Maya","Identify the important steps in modeling a low-poly cartoon fishing house in Maya","Discuss the value of the ‘grey box’ in designing and creating a low-poly model","Recognize basic commands and techniques used in Maya","Describe the key tools and modes used for modifying various shapes and sizes","Explain how to detail the floors and walls of a low-poly fishing house","Discuss the benefits of applying new features like ‘chamfer’ vertices or ‘nCloth’ in styling and detailing features","Explain how to create low-poly scenes like water or other landscapes in Maya","Recognize the importance of adding smaller assets to finalize your work","Explain how to navigate the user interface of the program","Describe how to create a beautiful l...","Identify the important steps in mode...","Discuss the value of the ‘grey box’ ...","Recognize basic commands and techniq...","Describe how to create a beautiful low-poly cartoon fishing house in Maya","Identify the important steps in modeling a low-poly cartoon fishing house in Maya","Discuss the value of the ‘grey box’ in designing and creating a low-poly model","Recognize basic commands and techniques used in Maya","Describe the key tools and modes used for modifying various shapes and sizes","Explain how to detail the floors and walls of a low-poly fishing house","Discuss the benefits of applying new features like ‘chamfer’ vertices or ‘nCloth’ in styling and detailing features","Explain how to create low-poly scenes like water or other landscapes in Maya","Recognize the importance of adding smaller assets to finalize your work","Explain how to navigate the user interface of the program"],"courseDescription":"<p>This free online course teaches you the basics of 3D modelling in Autodesk Maya, which is more often known as simply ‘Maya’ and is a 3D visual effect, animation and graphic design program. This leading software is used worldwide to design stunning 3D graphics and animation effects. We show you how to do so in easy steps with little technical jargon. Simple video tutorials help you understand the basic techniques of designing 3D models. We provide a hands-on understanding of the program, including its primary tools and user interface.</p><p>We walk you through the creative process from planning and creating the grey box (the basic shape of the model) to building the fishing house itself. We guide you through various Maya tools and features to create the floors and walls of your structure. We then explain how to design and make the structures and assets more distinctive by applying specific tools like ‘bevel’, ‘vertex’ and others while demonstrating the use of specific features like ‘nCloth’ and ‘chamfer’ vertices.</p><p>If you work mostly in two dimensions, then this course is a perfect fit as it improves your design skills and helps you master 3D-modelling technology through step-by-step tutorials. These skills can boost your creativity and performance as a designer. By completing this simple fishing house in class, you can master Maya and take your place as an artist and professional animator.</p><a href=\"https://alison.com/resume/courses/3566\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3566\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting Up and Modeling the Fish House","description":"This module comprises of step by step tutorials that teach you how to set up a project in Maya, create the gray box and then build and design both floors of fishing house. You also learn how to create and add unique shapes, planks and edges with simple commands and features of Maya like Chamfer Vertices.","topics":["Setting Up and Modeling the Fish House - Learning Outcomes","Gray Box Modeling","Building The First Floor","Second Floor Base and Cabin Details","Setting Up and Modeling the Fish House - Lesson Summary"]},{"name":"Module","details":"Roof Hatch and Other Finishing Up Details","description":"The lessons in this module demonstrate skills that ensure more creativity in Maya. It teaches you how to add polishing up assets to complete the fishing house. You will learn about interesting assets such as Roof Hatch, BBQ, Life Belt, Fishing Rod, lantern, Cloth shed, and Chair. The tutorial ends with a beautiful and unique low poly fishing house.","topics":["Roof Hatch and Other Finishing Up Details -Learning Outcomes","Roof Hatch, Life Belt, Lantern and Other Details.","Finishing Up The Details","Roof Hatch and Other Finishing Up Details - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Create a Cartoon Fishing House in Maya - Course Assessment"]}]}