{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2492","title":"Cryptography: Pseudo-Random Generators and Block Ciphers","totalEnrolled":"508","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the theoretical instantiations of Pseudo-Random Generators and Block Ciphers, in this free online course.","description":"In this free online course, you will learn about the theoretical instantiations of Pseudo-Random Generators and the practical construction of Block Ciphers. You will also learn about the Chosen Ciphertext Attack (CCA) Security and how to approach designing an efficient CCA-Secure Scheme. This course will benefit anyone who wants to improve their understanding of how Pseudo-Random Generators work to improve the security of their computer systems.","courseOutcomes":["Discuss the theoretical instantiatio...","Discuss the practical instantiations...","Outline the limitations of Stream Ci...","Identify the variants of Pseudo-Rand...","Discuss the theoretical instantiations of Pseudo-Random Generators","Discuss the practical instantiations of Pseudo-Random Generators","Outline the limitations of Stream Ciphers","Identify the variants of Pseudo-Random Functions","Explain how to construct CPA-Secure Ciphers using Pseudo-Random Functions","Describe how to construct CPA-Secure Ciphers from Pseudo-Random Functions","Explain the various modes of constructing CPA-Secure Ciphers","Discuss the theoretical and practical constructions of Block Ciphers","Discuss the theoretical instantiatio...","Discuss the practical instantiations...","Outline the limitations of Stream Ci...","Identify the variants of Pseudo-Rand...","Discuss the theoretical instantiations of Pseudo-Random Generators","Discuss the practical instantiations of Pseudo-Random Generators","Outline the limitations of Stream Ciphers","Identify the variants of Pseudo-Random Functions","Explain how to construct CPA-Secure Ciphers using Pseudo-Random Functions","Describe how to construct CPA-Secure Ciphers from Pseudo-Random Functions","Explain the various modes of constructing CPA-Secure Ciphers","Discuss the theoretical and practical constructions of Block Ciphers"],"courseDescription":"<p><span style=\"font-weight: 400;\">This free online course highlights the instantiations of Pseudo-Random Generators (PRGs) and the practical construction of Block Ciphers. You will learn about the concept of one-way functions, how to design PRGs with one-bit and arbitrary expansions, the recent developments in the area of practical instantiations of PRGs, constructions based on Linear Feedback Shift Register(LFSR), Software ciphers and more. </span><span style=\"font-weight: 400;\">The variants of Pseudo-Random Generators will be discussed in the first section of the course. </span></p><p><span style=\"font-weight: 400;\">Next, you will gain insight into a very important building block for the Symmetric-Key Cryptosystem namely Pseudo-Random Functions (PRFs). You will see how to construct Pseudo-Random Generators from Pseudo-Random Functions. </span><span style=\"font-weight: 400;\">Then, you will learn about designing efficient Chosen Plaintext Attack (CPA) Secure Ciphers from Pseudo-Random Functions. You will see some drawbacks of the CPA-Secure Cipher, and you will be shown how to design efficient CPA-Secure Ciphers from Pseudo-Random Permutations via modes of operations; like the Electronic Code Book (ECB) mode, Counter (CTR) mode, and more. </span></p><p><span style=\"font-weight: 400;\">Thereafter, you will learn about the construction of provably-secure Pseudo-Random Functions from provably-secure Pseudo-Random Generators. </span><span style=\"font-weight: 400;\">Lastly, you will gain insight into the practical construction of Block Ciphers and an introduction to the Chosen Ciphertext Attack (CCA) Security Model. You will also see an overview of the Data Encryption Standard(DES) and the Advanced Encryption Standard(AES). This course is a great starting point for anyone who wants to learn about the working principles of Pseudo-Random Generators and Block Ciphers, to improve the security of their computer systems and data. Why wait, start this course today!</span></p><a href=\"https://alison.com/resume/courses/2492\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2492\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pseudo-Random Generators","description":"In this module, the theoretical and practical instantiations of Pseudo-Random Generators will be explained. You will also learn about the concept of one-way functions and the significance of Pseudo-Random Functions in designing symmetric-key primitives.","topics":["Pseudo-random Generators - Learning Outcomes","Provably Secure Instantiation of PRGs","Practical Instantiation of PRGs","CPA Security","Pseudo-random Functions","CPA Secure Encryption from PRF","Pseudo-random generators - Lesson Summary"]},{"name":"Module","details":"Block Ciphers","description":"In this module, you will learn the various modes of operations of Block Ciphers that can be used to construct efficient cypher-plaintext-attack secure ciphers. The theoretical and practical constructions of Block Ciphers will also be explained.","topics":["Block Ciphers - Learning Outcomes","Modes of Operations of Block Ciphers","Output Feedback Mode and Counter Mode","Theoretical Construction of Block Ciphers","Practical Construction of Block Ciphers","Data Encryption Standard Architecture","Passive and Active Adversary","Block Ciphers - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Cryptography: Pseudo-random Generators and Block Ciphers - Course Assessment"]}]}