{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5556","title":"Cryptocurrency & Blockchain for Everyday Users - Navigating and Using Web3","totalEnrolled":"315","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course you will learn how to navigate Web3 and use cryptocurrency, DeFi and NFTs","description":"Get ahead of the game and gain the skills and knowledge needed to participate with confidence in Web3. Learn to navigate and participate in Web3, blockchain and cryptocurrency with this practical course that includes step-by-step demonstrations and even giveaways. You will understand the main concepts of Blockchain and Web3, set up wallets, use block explorers, buy and sell crypto, demystify NFTs and DeFi and interact with blockchain apps.","courseOutcomes":["Distinguish between Web1, Web2 and W...","Describe how a blockchain works...","Categorize and classify wallets as h...","Explain the role of a miner...","Distinguish between Web1, Web2 and Web3","Describe how a blockchain works","Categorize and classify wallets as hot, cold, custodial and non-custodial","Explain the role of a miner","Identify and recoginze transactions on a blockchain explorer","Explain smart contracts","Describe Decentralized Finance and Non-Fungible tokens","Distinguish between Fungible and Non-Fungible assets","Discuss how to buy and sell cryptocurrency with fiat (traditional currency)","Describe the difference between a swap or DEX and a central exchange","Explain how to use a swap","Distinguish between Web1, Web2 and W...","Describe how a blockchain works...","Categorize and classify wallets as h...","Explain the role of a miner...","Distinguish between Web1, Web2 and Web3","Describe how a blockchain works","Categorize and classify wallets as hot, cold, custodial and non-custodial","Explain the role of a miner","Identify and recoginze transactions on a blockchain explorer","Explain smart contracts","Describe Decentralized Finance and Non-Fungible tokens","Distinguish between Fungible and Non-Fungible assets","Discuss how to buy and sell cryptocurrency with fiat (traditional currency)","Describe the difference between a swap or DEX and a central exchange","Explain how to use a swap"],"courseDescription":"<p>Web3, blockchain, NFTs, DeFi, and the Metaverse have all made headlines in the last few years. With companies like Facebook rebranding to Meta &amp; investing billions in the metaverse, and brands such as Gucci and Nike crushing it with NFTs, it's hard to escape from these terms. But I'm here to help you embrace them instead of escaping them so you can hop on this trend and not get left behind.</p><p>The aim of this course is to give you the skills needed to navigate and participate in Web3 and use blockchain applications. This course is a practical hands-on course, with lots of demonstrations and access to live online Q&amp;A classes and giveaways.</p><p>By the end of this course, you will have a better understanding of Web3 &amp; blockchain as we will explain the main concepts in an easy-to-understand way. You will learn how to select and set up a wallet and store digital items safely. Also, you will discover how to use block explorers, buy, sell and transfer cryptocurrency. We will provide you with a better understanding of NFTs and DeFi and equip you with the skills and confidence needed to interact with apps based on blockchain and Web3.</p><a href=\"https://alison.com/resume/courses/5556\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5556\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Navigating and Using Web3 and Blockchain","description":"In this module, you will be introduced to Web3 and blockchain. You will learn about public keys, private keys, wallets and addresses. And you will also learn to use a blockchain explorer to track transactions on a blockchain.","topics":["Navigating & Using Web3 and Blockchain– Learning Outcomes","Introductions","Web3 - The Basics","Things to Explore","Setting up a Wallet and Funding a Wallet","Decentralized Finance","NFTs and the Metaverse","Navigating & Using Web3 and Blockchain – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Cryptocurrency & Blockchain for Everyday Users– Course Assessment"]}]}