{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3855","title":"CSS Layout - Creating a Float Based Responsive Website","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online web development course will teach you how to create a float-based responsive website using CSS.","description":"Have you always wanted to try your hand at creating functional websites? In this digital age, the opportunities for people with web development skills are truly endless. This free online web development training is a great place to start your journey and it will teach you all the skills and techniques needed to create a dynamic, responsive website including wireframes and content, using Cascading Style Sheets (CSS) coding.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Hone your creativity and passion for web development and learn the ins and outs of web development. This free online web development tutorial uses CSS coding language, which developers use to change and tweak the presentation of websites. This includes everything from page layouts to colours and fonts. The course starts by showing you how to navigate the actual HTML and CSS windows and how to set up the development environment - linking the HTML and CSS files together. Then the building blocks of the website, known as the wireframe, is created. Once this is done, you will learn how to code in HTML, add HTML main structure to the website, learn all about info cards and how to update the HTML with various styles. This part of this web development training will also discuss how to create a responsive navigation bar, columns for grid purposes, the top section content as well as a float grid.</p><p>Beautiful images and graphics are important for the overall look and feel of a website and the following bit of content in this web development for beginners course focuses on how to create an image gallery on the website using CSS, including how and where to source images, and import them to the scene using CSS command lines. Content is the next key theme and you will then study how to update content areas (single and two-column areas), the functions of and how to create a contact form, the process involved in creating a website footer, sourcing fonts, and how to conduct a thorough website review.&nbsp;</p><p>Having a great-looking, functional website is all good and well but, ensuring that it can scale across different devices like laptops, mobile phones and tablet computers is as important, if not more important in terms of user experience. The content in this course will show you exactly how to create a float-based responsive website in no time and will allow you to express yourself creatively as well as learn some in-demand skills which you can apply across a range of jobs and even hobbies. Enrol in this comprehensive course and expand your skill set to include web development which can open a whole new world of job opportunities.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}