{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1660","title":"Data Science - Visualizing Data and Exploring Models","totalEnrolled":"10,877","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about data science techniques, applying visualizations to display data, feature engineering methods, and more!","description":"This free online Data Visualization course teaches you about visualizing data and exploring models. Data visualization is a highly useful way to explore data and can help you determine relationships between columns. With this course, you will learn how to apply visualizations to display your data and about feature engineering and constructing machine learning models. You will learn how to evaluate your model in Azure ML, R, and Python, and more!","courseOutcomes":["Discuss the importance of data explo...","Recognize what you use for data visu...","Recognize what you use for data visu...","Identify the different types of plot...","Discuss the importance of data exploration","Recognize what you use for data visualizations in R","Recognize what you use for data visualizations in Python","Identify the different types of plots or charts you can use to visualize your data","Discuss the process of feature engineering","Identify features and methods available in R for creating Machine learning models","Identify features and methods available in Python for creating Machine learning models","Outline the process and options for evaluating your machine learning model","Discuss the importance of data explo...","Recognize what you use for data visu...","Recognize what you use for data visu...","Identify the different types of plot...","Discuss the importance of data exploration","Recognize what you use for data visualizations in R","Recognize what you use for data visualizations in Python","Identify the different types of plots or charts you can use to visualize your data","Discuss the process of feature engineering","Identify features and methods available in R for creating Machine learning models","Identify features and methods available in Python for creating Machine learning models","Outline the process and options for evaluating your machine learning model"],"courseDescription":"<p>This course begins by discussing the importance of data exploration. It will teach you what to use for data visualizations in R and in Python. You will study different plots for different views such as scatter and line plots, bar plots, histograms, box plots, violin plots, Q-Q plots. You will also learn that scatter plot of individual columns can be useful for detailed exploration of the features in your dataset.</p><p>You will then study feature engineering which is the process of using domain knowledge of the data to create features that make machine learning algorithms work. You will look into models which are evaluated based on statistics about the errors, or residuals, in the predicted values. You will study the features and methods available in R and Python for creating Machine learning models including the process and options for evaluation.</p><p>Learn about about data science theory and practice with this free, online course. Upon completing the course, you will have a better understanding of the functions of exploratory data analysis and what factors can affect your views of data, as well as a much better insight into the different types of charts to help visualize your data as well as the libraries and packages available for R and Python. Start this course today to improve your data literacy!&nbsp;</p><a href=\"https://alison.com/resume/courses/1660\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1660\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Exploration and Visualization","description":"In this module, you will be introduced to exploratory data analysis and data visualization. You will learn about the reasons for exploratory data analysis. You will learn about what can affect your views of data. You will learn about the different types of charts you can use to visualize your data. You will learn about the libraries and packages available for R and Python for visualizing your data.","topics":["Data Exploration and Visualization Learning Outcomes","Exploratory data analysis","Data visualization with R","Data visualization with Python","Data Exploration and Visualization Lesson Summary"]},{"name":"Module","details":"Building Models in Azure ML","description":"In this module, you will be introduced to building models, you will learn about feature engineering and constructing models. You will learn about what feature engineering is and about how to construct and machine learning model. You will learn about creating a machine learning model in R and Python. You will learn about evaluating your model, and why you should evaluate your model. You will learn about evaluating you model in Azure ML, R and Python.","topics":["Building Models in Azure ML Learning Outcomes","Feature Engineering","Creating and Scoring Models","Modeling in R","Modeling in Python","Model Evaluation and Comparison","Building Models in Azure ML Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Data Science - Visualizing Data and Exploring Models - Course Assessment"]}]}