{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3351","title":"Data Visualization in Excel: All Excel Charts and Graphs","totalEnrolled":"2,336","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the use of Excel ‘s charts and graphs to represent data in meetings and reports with this free online course.","description":"Learn how to use Microsoft Excel to its full capacity in this free online course on data visualization. We explore the most reliable practices for using charts and graphs in Excel and explain how to combine them for different representation strategies. This course can help you shine at work as Excel is a staple tool of most professional environments and mastery thereof will boost your career.","courseOutcomes":["Compare various chart formats...","List the elements of charts...","Explain the ‘spaghetti plot’ and how...","Outline the best practices for bar c...","Compare various chart formats","List the elements of charts","Explain the ‘spaghetti plot’ and how to avoid it","Outline the best practices for bar charts","Discuss how to prevent clutter","Analyze stock graphs","Explain why we should avoid using pie graphs","Describe how to maximise visual effect using Excel","Compare various chart formats...","List the elements of charts...","Explain the ‘spaghetti plot’ and how...","Outline the best practices for bar c...","Compare various chart formats","List the elements of charts","Explain the ‘spaghetti plot’ and how to avoid it","Outline the best practices for bar charts","Discuss how to prevent clutter","Analyze stock graphs","Explain why we should avoid using pie graphs","Describe how to maximise visual effect using Excel"],"courseDescription":"<p>This course covers the fundamentals of Microsoft Excel and demonstrates how to use its tools to represent graphic data concisely and logically. These tools will help captivate your audience and make comparisons and trends easier to recognize and illustrate. We show you how to tell a story using graphs and break down each graph and chart type by explaining their use and underlying principles. We unpack the best and easiest methods used to visually convey messages while describing their elements and highlighting tips and tricks to bring out the best in you and your work.</p><p>We begin with ‘bar’ and ‘column’ charts and explain how you can use the differences between them to make a point. The course then moves onto ‘line’ charts and their features and illustrates how to avoid a common problem involved with their use: the ‘spaghetti plot’, which is a basic plotting error that occurs all too frequently. We then study ‘area’ charts and discuss how they differ from more well-known line charts. The course then covers ‘pie’ and ‘doughnut’ charts and navigates their many shortcomings. In contrast, the ‘scatter plot’ or ‘XY’ chart is commonly used in the scientific community to convey experimental data precisely while identifying data outliers and anomalies.</p><p>The course examines the ‘waterfall’ chart, which is used primarily in the world of finance, before comparing ‘combination’ and ‘pivot’ charts. We teach you how to create and read stock charts, radar graphs and even meteorological ‘surface’ charts and heatmaps. With each type, we go through its characteristics, features, format and unique uses. We introduce you to ‘sparklines’, which are a type of mini chart, and show you how to generate infographics with Excel. This course offers an opportunity to learn and hone a useful skill as data drives the Information Age and explaining it is made easier by effective use of charts and graphs. To that end, sign up to improve your use of Excel, which will boost your value in the classroom and workplace.</p><a href=\"https://alison.com/resume/courses/3351\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3351\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Utilizing Excel for Data Visualization","description":"In this Module, Utilizing Excel for Data Visualization, you will learn the fundamental properties of each of the Excel charts and graphs and utilise them to their full capacity. You will study the formats and best practices as well as other techniques to maximise data visualization.","topics":["Utilizing Excel for Data Visualization - Learning Outcomes","Introducing Excel and its Basics","Most important Charts and Best Practices","Important Charts and Frequency Distribution","Chart Efficiency","Pivot and Specified Charts","Mini Charts and Infographics","Utilizing Excel for Data Visualization - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Data Visualization in Excel: All Excel Charts and Graphs - Course Assessment"]}]}