{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1664","title":"Data Science - Working with Data - Revised","totalEnrolled":"10,881","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to prepare and analyze data using different software and programming languages in this free online course.","description":"Any scientific career requires the ability to work with and prepare data. This data science course shows you how to acquire the information you need for a project and how to recognize the usefulness of different data sets. We examine Python and ‘R’ programming languages in Azure Machine Learning (Azure ML) and take you through the lifecycle of data and machine learning. We blend research methodology and programming to teach you data science.","courseOutcomes":["Describe the flow of data in an Azur...","Compare R and Python...","Determine which programming language...","Install both R and Python in your Az...","Describe the flow of data in an Azure ML experiment","Compare R and Python","Determine which programming language suits you better: R or Python","Install both R and Python in your Azure ML environment","Discuss data preparation (or ‘data munging’)","Define ‘quantization’ and explain your variables","Break down how to deal with missing values in data sets","Explain why you should scale your variables","Describe the flow of data in an Azur...","Compare R and Python...","Determine which programming language...","Install both R and Python in your Az...","Describe the flow of data in an Azure ML experiment","Compare R and Python","Determine which programming language suits you better: R or Python","Install both R and Python in your Azure ML environment","Discuss data preparation (or ‘data munging’)","Define ‘quantization’ and explain your variables","Break down how to deal with missing values in data sets","Explain why you should scale your variables"],"courseDescription":"<p>Study the flow of data in Azure machine learning (Azure ML) in this data science course. We explain how to prepare your data and compare continuous and categorical variables. We then show you how to remove repeated values and outliers and study the quantification of information and the scaling of data.</p><p>The course introduces you to the data flow in Azure ML and covers ‘batch’ and real-time processing. We examine the different types of ‘joins’ you can use on your data. A ‘data join’ occurs when two data sets are combined side by side. We teach you how to use the R and Python programming languages with Azure and establish their role in completing data science projects.</p><p>The course then moves on to data sampling and preparation. We compare continuous and categorical variables and define ‘quantization’. ‘Data munging’ or ‘data wrangling’ is the process of mapping raw data into a readable format and we demonstrate its value while establishing how time-consuming it can be. We explain how to handle errors and outliers in your project and break down the use of ‘scaling’ with Python, R or Azure ML. This course is useful for anyone in scientific research in general or data science in particular.</p><a href=\"https://alison.com/resume/courses/1664\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1664\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Acquisition and Programming Language for Data Science","description":"In this module you will be introduced to the Data flow in Azure ML, you will learn about batch and real time processing. You will learn about different types of joins you can use on your data. You will learn about R and Python programing languages and what they can do for a data science project.","topics":["Data Acquisition and Programming Language for Data Science - Learning Outcomes","Data Acquisition and Flow","R and Python in Azure ML","R in Azure AL","Python in Azure ML","Data Acquisition and Programming Language for Data Science - Lesson Summary"]},{"name":"Module","details":"Data Sampling and Preparation","description":"In this module you will be introduced to Data sampling and Preparation. You will learn about continuous and categorical variables. You will learn what quantization is and can do for your data. You will learn about Data munging and how it’s the most time-consuming part of a data science project. You will learn about handling errors and outliners in your project. You will learn about scaling using either python, R or Azure ML module for scaling.","topics":["Data Sampling and Preparation - Learning Outcomes","Data Sampling and Quantization","Missing and Repeated Values","Outliers and Errors","Visualizing and Handling Outliers in Scripts","Scaling Data","Data Sampling and Preparation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Data Science - Working with Data - Course Assessment"]}]}