{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1663","title":"Data Analytics - Mining and Analysis of Big Data","totalEnrolled":"28,485","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to analyse big data using mining and clustering techniques, in this free online big data analytics course.","description":"This free online Big Data Analytics course from Alison will teach you how to mine and analyse big data. This process of studying and evaluating data is widely used in business and commercial industries and even in the government sector. With the help of this course, you will also learn how to create clustering data models which in turn can help you make more informed decisions. Make this a part of your business practice now!","courseOutcomes":["Define association rule mining...","Explain mining frequent patterns and...","List when association rules can be a...","Define the apriori algorithm...","Define association rule mining","Explain mining frequent patterns and rules","List when association rules can be applied","Define the apriori algorithm","List the four V’s of big data","Explain why social media data can be hard to disambiguate","Distinguish between clustering and classification","Explain why clustering is used","List the different types of clustering","Define K-Means clustering","Explain k-meloids","Define what stochastic multi-choice problems are","Explain the n-arm bandit problem","Describe some solutions for the multi-arm bandit problem","Define association rule mining...","Explain mining frequent patterns and...","List when association rules can be a...","Define the apriori algorithm...","Define association rule mining","Explain mining frequent patterns and rules","List when association rules can be applied","Define the apriori algorithm","List the four V’s of big data","Explain why social media data can be hard to disambiguate","Distinguish between clustering and classification","Explain why clustering is used","List the different types of clustering","Define K-Means clustering","Explain k-meloids","Define what stochastic multi-choice problems are","Explain the n-arm bandit problem","Describe some solutions for the multi-arm bandit problem"],"courseDescription":"<p>In this online data analysis course Data Analytics - Mining and Analysis of Big Data you will be introduced to the concept of big data and to a number of techniques that are used to analyse and interpret big data.</p><p>The course starts off with introducing you to big data and lists the four V’s of big data. You will learn about associative rule mining, and about when association can be applied and the patterns that arise in mining.</p><p>In the second module, you will learn about clustering analysis. You will examine the difference between clustering and classification and the different types of clustering. You will also learn about K-means clustering and K-meloids.</p><p>In the last module, you will learn about online and active learning, learn about experimentation and the difference between an online and offline context of creating data. You will be introduced to the n-arm bandit problem and how to find solutions for the multi-arm bandit problem.</p><p>This free online course will be of great interest to professionals involved in data science and data analysis and any learner who wants to learn more about analysing big data using mining and clustering techniques.</p><a href=\"https://alison.com/resume/courses/1663\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1663\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Associative Rule Mining","description":"This module introduces associative rule mining. You will learn about frequent patterns and rules in mining and be able to list when association rules can be applied. You will also learn about the apriori algorithm.","topics":["Introduction to Associative Rule Mining Learning Outcomes","Association Rule Mining","Association Rule Mining (cont'd)","Introduction to Associative Rule Mining Lesson Summary"]},{"name":"Module","details":"Introduction to Big Data","description":"In this module you will learn about big data. You will learn about the four V’s of big data and why social media data can be hard to disambiguate.","topics":["Introduction to Big Data Learning Outcomes","Big Data , A small introduction","Big Data , A small introduction(cont'd)","Introduction to Big Data Lesson Summary"]},{"name":"Module","details":"Introduction to Clustering Analysis","description":"In this module you will learn about clustering analysis. This module will teach you about why clustering is used and the different types of clustering. You will also learn about K-means and K-meloids.","topics":["Introduction to Clustering Analysis Learning Outcomes","Clustering Analysis","Clustering Analysis(cont'd)","Introduction to Clustering Analysis Lesson Summary"]},{"name":"Module","details":"Experimentation and Active Learning","description":"In this module you will learn about experimentation and active learning and creating data in an online and offline context. You will learn about online learning and the n-arm bandit problem.","topics":["Experimentation and Active Learning : Learning Outcomes","Introduction to Experimentation and Active Learning","Introduction to Experimentation and Active Learning(cont'd)","An Introduction to Online Learning - Reinforcement Learning","An Introduction to Online Learning - Reinforcement Learning(cont'd)","Experimentation and Active Learning : Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Data Analytics - Mining and Analysis of Big Data - Course Assessment"]}]}