{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2433","title":"Data Analytics: Regression Models","totalEnrolled":"1,236","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online takes you through the details the techniques and frameworks used in regression modelling and analysis","description":"Regression analysis is used to model the relationship between a response variable and one or more predictor variables. Estimation is a key factor used in regression analysis. This free online course focuses on maximum likelihood estimation as a probabilistic framework for predicting the probability distribution and parameters that describe observed data. By the end of this course, you will become familiar with the techniques used in regression.","courseOutcomes":["Discuss the intuition behind the max...","Explain the graph of the natural log...","Describe the estimation of Poisson a...","Discuss the python demo for estimati...","Discuss the intuition behind the maximum likelihood estimation theory","Explain the graph of the natural logarithm of the likelihood","Describe the estimation of Poisson and exponential distribution parameter","Discuss the python demo for estimation of population parameters for regression equation","Explain the graphical illustration of likelihood contribution","Describe how to build the logistic regression model and equation","Discuss the intuition behind the maximum likelihood estimation theory","Explain the graph of the natural logarithm of the likelihood","Describe the estimation of Poisson and exponential distribution parameter","Discuss the python demo for estimation of population parameters for regression equation","Describe the relationship between the odds ratio and the coefficients of independent variables","Discuss the intuition behind the max...","Explain the graph of the natural log...","Describe the estimation of Poisson a...","Discuss the python demo for estimati...","Discuss the intuition behind the maximum likelihood estimation theory","Explain the graph of the natural logarithm of the likelihood","Describe the estimation of Poisson and exponential distribution parameter","Discuss the python demo for estimation of population parameters for regression equation","Explain the graphical illustration of likelihood contribution","Describe how to build the logistic regression model and equation","Discuss the intuition behind the maximum likelihood estimation theory","Explain the graph of the natural logarithm of the likelihood","Describe the estimation of Poisson and exponential distribution parameter","Discuss the python demo for estimation of population parameters for regression equation","Describe the relationship between the odds ratio and the coefficients of independent variables"],"courseDescription":"<p>Regression models analysis is a predictive modelling technique used for determining the relationship between dependent and independent variables. This free online course on Alison describes the point and interval estimation as well as the differences between these estimations, including how point estimations uses a single value while interval estimation uses a range of numbers to get information from the population. You will be introduced to the different types of residual analysis.</p><p>This course describes how the Python code is used for the scatter plot diagram and for the regression equation. You will learn about the importance of assumptions on error terms. You will also learn about the concept of the assumed regression model and the differences between simple and multiple regression. You will also be introduced to the assumed regression model and how it is not an adequate representation.</p><p>Lastly, this course explains the intuition behind the maximum likelihood estimation theory. You will learn about the estimation of Poisson and exponential distribution parameters. You will study the python demo for the estimation of population parameters for the regression equation. This course also takes you through the relationship between the odds ratio and the coefficients of independent variables. If you are interested in learning how regression analysis models are used for forecasting, then this exciting course is for you.</p><a href=\"https://alison.com/resume/courses/2433\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2433\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Regression Model Analysis","description":"In this module, you will learn about point and interval estimation alongside its use in the prediction of the regression model. You will also learn about the multiple regression model and the least square methods.","topics":["Regression Model Analysis - Learning Outcomes","Estimation and Prediction of Regression Model Residual Analysis","Multiple Regression Model","Categorical Variable Regression","Regression Model Analysis - Lesson Summary"]},{"name":"Module","details":"Maximum Estimations and Regression","description":"In this module, you will be introduced to the intuition and reasoning behind the principle of maximum likelihood. You will learn about how to build the logistic regression model and the logistic regression equation.","topics":["Maximum Estimations and Regression  - Learning Outcomes","Maximum Likelihood Estimations","Logisitic Regression","Relationship between Linear and Logistic Regression Model","Maximum Estimations and Regression - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Data Analytics: Regression Models -  Assessment"]}]}