{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1631","title":"Data Analytics - Introduction to Machine Learning - Revised","totalEnrolled":"17,794","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Machine learning is the study of computer algorithms. This free course breaks down its use in modern data analytics.","description":"Machine learning is an essential part of data analytics. This course will teach you about automation as well as supervised and unsupervised learning. You will also study important methods to help find hidden information within your data. Machine learning is invaluable for the development of computer systems that are able to learn and adapt without following explicit instructions.","courseOutcomes":["Define the difference between superv...","Explain what linear regression is...","Describe when regularization can be ...","Distinguish between supervised and u...","Define the difference between supervised learning, unsupervised learning, and reinforced learning","Explain what linear regression is","Describe when regularization can be used","Distinguish between supervised and unsupervised data","Define what confidence level is","Explain how to use Excel to perform a multiple regression","Explain subset selections","Distinguish between R² and adjustment R²","Describe the K-NN approach","Define the difference between superv...","Explain what linear regression is...","Describe when regularization can be ...","Distinguish between supervised and u...","Define the difference between supervised learning, unsupervised learning, and reinforced learning","Explain what linear regression is","Describe when regularization can be used","Distinguish between supervised and unsupervised data","Define what confidence level is","Explain how to use Excel to perform a multiple regression","Explain subset selections","Distinguish between R² and adjustment R²","Describe the K-NN approach"],"courseDescription":"<p>This course combines both machine learning and data analytics. The two go hand in hand to help make data sets easier to gather and interpret. Topics included in this course are reinforced learning, correlation and linear regression. Reinforced learning is the training of machine learning models to make a sequence of decisions and linear regression is used when you want to predict the value of a variable based on the value of another variable.&nbsp;</p><p>You will be taken through a step-by-step programme to show you the most important formulae involved in multiple regression in Excel. This video-based learning means that you can go over and back to different lessons to remind yourself of little bits of information you may have forgotten. Following on from this, you will be introduced to the concept of regularisation, subset selections and how to distinguish between R&amp;sup2 and adjustment R&amp;sup2.</p><p>Data science and data analytics are diverse fields that have departments in many companies across the world. It is a field that is ever-expanding and evolving so if you want to have an indispensable skill that will get you hired in any company with a data analytics department, this course is for you.</p><a href=\"https://alison.com/resume/courses/1631\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1631\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Machine Learning","description":"In this module you will be introduced to machine learning. You will learn about supervised and unsupervised learning and the difference between them. You will also learn about regularization and liner regression.","topics":["Introduction to Machine Learning Learning Outcomes","Introduction to Machine Learning","Supervised Learning","Unsupervised Learning","Introduction to Machine Learning Lesson Summary"]},{"name":"Module","details":"Introduction to Regression","description":"In this module you will learn about different types of regression. You will learn what confidence level is and how to use both Excel and Matlab for simple and multiple regression. You will also learn about the K-NN approach in data analytics.","topics":["Introduction to Regression Learning Outcomes","Ordinary Least Squares Regression","Simple and Multiple Regression in Excel and Matlab","Regularization_Coefficient  shrinkage","Data Modelling Approaches and Algorithmic Modelling Approaches","Introduction to Regression Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Data Analytics - Introduction to Machine Learning Assessment"]}]}