{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3318","title":"Data, Databases and Mining","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how businesses can gain a competitive advantage through data with this free online course.","description":"This free online course explains the importance of data and knowledge to an organization. It describes the lifecycle of data in the wisdom hierarchy and how knowledge management can be used in business intelligence. By the end of the course, you will be able to describe the flow of data through the information ladder and its role in organizational growth. Start your learning journey on the uses of databases and data mining today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This practical course begins with definitions and explanations of organizational data, information, knowledge and wisdom. You will be taken on a brief tour through the information ladder using the Data, Information, Knowledge, Wisdom (DIKW) Pyramid, also commonly known as the information or data pyramid. This is followed by a discussion on relational databases and how to design a database. You will learn about creating table relationships within a database and database normalization to avoid redundancies. The course touches briefly on Structured Query Language (SQL) and the types of database models, such as the hierarchical database model and document-centric model. You will learn about database management systems (DBMS), their different types and their role in data management. Concepts such as big data and enterprise databases will also be covered.</p><p>Next, the course elaborates on the benefits of data warehouses, their functions in data management, the criteria of setting them up and the two approaches to data warehouse design: bottom-up and top-down. The course goes ahead to explain the concept and processes of data mining, followed by a brief discussion of how data warehousing and data mining lead to business intelligence and business analytics. Finally, the course discusses the process of knowledge management and explains how knowledge management relates to decision making and strategic management.</p><p>By taking this course, you will understanf the relationship between organizational data, information, knowledge and wisdom. The connection between data and organizational growth and development will be hihglighted. You will learn about the importance of good data and database handling practices and its impact on knowledge management, business growth and success. This course is ideal for anyone who wishes to learn more about organizational data, information and knowledge management. Start this interesting learning journey today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}