{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3298","title":"Decision Trees, Random Forests, AdaBoost & XGBoost in Python","totalEnrolled":"355","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create decision trees and master ensemble techniques in this free online Python course.","description":"This free online Python course explains decision trees, which are one of the most popular techniques used in machine learning since they are visually appealing and easy to interpret. We cover their creation and pruning, ensemble techniques and the stopping criteria for controlling the growth of decision trees. Boost your regression and classification trees knowledge and skills with this comprehensive course to increase your professional value.","courseOutcomes":["Describe the different types of stri...","Outline the components of a comprehe...","Identify the different types of deci...","Explain how to control the growth of...","Describe the different types of string functions in Python","Outline the components of a comprehensive data dictionary","Identify the different types of decision trees","Explain how to control the growth of decision trees","Unpack how to build decision trees","Discuss the three types of ensemble methods used in decision trees","Trace the steps of the data exploration process","Compare the three methods of treating outliers","Describe the measures of ‘central tendency’","Describe the different types of stri...","Outline the components of a comprehe...","Identify the different types of deci...","Explain how to control the growth of...","Describe the different types of string functions in Python","Outline the components of a comprehensive data dictionary","Identify the different types of decision trees","Explain how to control the growth of decision trees","Unpack how to build decision trees","Discuss the three types of ensemble methods used in decision trees","Trace the steps of the data exploration process","Compare the three methods of treating outliers","Describe the measures of ‘central tendency’"],"courseDescription":"<p>This course covers all the steps you should take when using decision trees in Python to solve business problems. Business analysts and data scientists widely use tree-based decision models because they are easy to interpret and make decision points clear. You can use them to present business concepts to people who might not be enthusiastic about numbers and complex mathematical models. A decision tree includes event outcomes, resource costs and utilities and displays algorithms that only contain conditional control statements. This course examines the essential directories in Python and the process of building a machine learning model.</p><p>We introduce you to the three methods of opening the Jupyter Notebook: Anaconda navigator, Anaconda prompt and Command prompt. We then demonstrate that regression trees are suitable for continuous quantitative target variables while classification trees are ideal for discrete categorical target variables. We can help understand the steps to take when building a regression tree and gain the ability to manipulate the decision tree and interpret the results more efficiently than someone who only knows the technical aspects of making decision trees with Python. Discover that the recursive binary splitting top-down approach is considered ‘greedy’. At each step of the tree-building process, the best split is made at that particular step rather than looking ahead and picking a split that will lead to a better tree in some future action. This course discusses missing value treatment in Python and dummy variable creation.</p><p>Next, we explain that, when running the code in Python, you need to specify the stopping criteria for the decision tree to control the tree length and avoid the overfitting problem. We unpack how to control the decision tree’s growth and provide insight into the three main prediction models based on ‘bagging’, random forest and boosting techniques. We then illustrate how decision trees closely mirror human decision-making more closely than other regression and classification approaches as they can easily handle qualitative predictors without the need to create dummy variables. Finally, the course demonstrates how to evaluate a model’s performance in Python by plotting a decision tree and utilizing data analysis and ensemble techniques. This course suits executives or anyone seeking the practical guidance of Python’s decision trees to solve complicated dilemmas. This ability to use data science to solve real-world problems can only enhance your professional status.</p><a href=\"https://alison.com/resume/courses/3298\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3298\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Machine Learning and Decision Trees","description":"In this module on Machine Learning and Decision Trees, you will learn that parentheses are always recommended when one is using multiple arithmetic operators in Python. You will also learn about the steps in the decision tree building process.","topics":["Machine Learning and Decision Trees - Learning Outcomes","Setting Up Python","Diverse Libraries in Python","Machine Learning","Simple Decision Trees","Creation and Pruning of Decision Trees","Simple Classification Tree","Machine Learning and Decision Trees - Lesson Summary"]},{"name":"Module","details":"Ensemble Techniques and Data Analysis","description":"In this module on Ensemble Techniques and Data Analysis, you will learn about the three types of ensemble methods used in decision trees. You will also learn about examples of grid search parameters and random forest parameters.","topics":["Ensemble Techniques and Data Analysis - Learning Outcomes","Bagging and Random Forest Techniques","Boosting Ensemble Technique","Data Pre-processing","Outlier Treatment in Python","Data Analysis","Ensemble Techniques and Data Analysis - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Decision Trees, Random Forests, AdaBoost & XGBoost in Python - Course Assessment"]}]}