{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3614","title":"Designing Animated PowerPoint Slides","totalEnrolled":"3,466","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online PowerPoint Slide Design and Animation course will teach you how to create, design and animate slides.","description":"This free online PowerPoint Slide Design & Animation course will equip you with the skills required to create and animate impactful presentations like a professional. Microsoft PowerPoint is a slide creation and animation tool. This course entails the design and animation aspects of slides. By taking this course, you will have detailed knowledge and skills to create slides, animate them, apply transitions and export them.","courseOutcomes":["Explain how the Microsoft PowerPoint...","Recall the procedures to change the ...","Identify the importance of using out...","List some basic shortcuts used in Po...","Explain how the Microsoft PowerPoint application is used to create slides","Recall the procedures to change the dimensions of a PowerPoint slide","Identify the importance of using outstanding photos for slide designs in PowerPoint","List some basic shortcuts used in PowerPoint for ease of work","Explain how to convert pixels to inches using the internet","Discuss how animations improve the overall quality of slides","Distinguish between a transition effect and an animation effect","Distinguish between the different categories of animations and list the types under each category","Define a transition as it applies in PowerPoint and state where it is used","Recall the steps involveD in animating texts, shapes, animating, and an entire scene","Describe how to make texts and photo animations","Outline the importance of reviewing the slides or videos before exporting","Explain how the Microsoft PowerPoint...","Recall the procedures to change the ...","Identify the importance of using out...","List some basic shortcuts used in Po...","Explain how the Microsoft PowerPoint application is used to create slides","Recall the procedures to change the dimensions of a PowerPoint slide","Identify the importance of using outstanding photos for slide designs in PowerPoint","List some basic shortcuts used in PowerPoint for ease of work","Explain how to convert pixels to inches using the internet","Discuss how animations improve the overall quality of slides","Distinguish between a transition effect and an animation effect","Distinguish between the different categories of animations and list the types under each category","Define a transition as it applies in PowerPoint and state where it is used","Recall the steps involveD in animating texts, shapes, animating, and an entire scene","Describe how to make texts and photo animations","Outline the importance of reviewing the slides or videos before exporting"],"courseDescription":"<p>This free online PowerPoint Slide Design &amp; Animation course on Alison.com will help you become a professional at creating and animating presentation slides using Microsoft Powerpoint application. Microsoft PowerPoint is the most popular software application used widely to create slides for presentation purposes. This free online course aims to equip you with the skills required to design and animate professional presentation slides. You will start by learning how to design slides and templates, this covers how to change the dimensions of a PowerPoint slide. You will also learn how to pick a theme and topic for your slide as well as how to source high-quality photos online and setting the right font. You will learn how to create templates for your theme, next you will learn how to make photo showcases, this includes double photo showcase and text-oriented showcase, finally, you will learn how to make a triple Instagram stories slide in PowerPoint.</p><p>Microsoft PowerPoint is a powerful tool not only used for slides creation but is also use to create tutorial videos for learning purposes, as a digital portfolio and animation maker, in this free online course, you will also learn how to make and apply animations to your slides using PowerPoint. You will learn also how to use PowerPoint to animate an entire slide scene and how to make multiple animations on a circle, as well as how to build an animation upon an existing one. You will learn how to create animations with pictures and how to make a circle spin within your design. Next, you will be introduced to some advanced animation techniques, this includes the walk cycle animation, you will also learn some transition effects and how to apply them to your slides, finally you'll learn how to export your slides, including how to set the slide duration and how to review the slides using the slide sorter.</p><p>Microsoft PowerPoint, usually just called PowerPoint and abbreviated as PPT, is a commercial presentation program developed by Microsoft Corporation. It is part of the Microsoft Office suite desktop package and it uses a graphical approach to present information in the form of slide shows that is usually accompanied by oral delivery of the topic. PowerPoint is regarded as the most useful, creative way to create and present visual aids, presenters often spend countless hours trying to use PowerPoint to develop slides. PowerPoint is used in our daily life at schools education purposes and at all levels of business, this free online course on Alison.com has been built to help you become a professional at using PowerPoint to create and animate slides for presentation purposes, by taking this free online course you will learn how to deliver quality information to your audience during presentations like business meetings and gatherings and at school, so what are you waiting for? Take this course now and acquire a nice skill today.</p><a href=\"https://alison.com/resume/courses/3614\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3614\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Slide And Template Design","description":"In this module, you will be introduced to slide design in PowerPoint, this entails how to set slide dimensions and select the right color scheme, theme, and topic. You will learn how to source quality pictures for the slides. You will also learn how to make various slide showcases and triple Instagram stories slides using PowerPoint application.","topics":["Slide And Template Design - Learning outcomes","Slide Dimensions And Color Scheme","Theme And Slide Template Design","Slide And Template Design - Lesson Summary"]},{"name":"Module","details":"Animation And Exporting Videos","description":"In this module, you will be introduced to animations and exporting the slides, this will include how to create animations and transitions as well as how to apply them to your slides, you will also be introduced to some advanced animation techniques and learn how to review your slides using the slides sorting before exporting them.","topics":["Animation And Exporting Videos - Learning Outcomes","Animating the Scene","Slide Transition and Exporting Videos","Advanced Animation Techniques","Animation And Exporting Videos - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Designing Animated PowerPoint Slides  - Course assessment"]}]}