{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4410","title":"Designing using Sketch Application","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you the skills needed to design a web app and create IOS applications using Sketch.","description":"This ‘Designing Using Sketch Application’ course will equip you with the skills and knowledge required to design web applications with Sketch . We explain how to download and set up Sketch on a Mac and how to create and design basic shapes. By taking this course, you will learn how to create illustrations using the vector tool and design icons. You will also learn how to create a basic design system and also create a web app.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Sketch is a vector graphics editor used for macOS. We have designed this course to teach you the knowledge and techniques needed to design using the Sketch application. We begin by showing you how to download and set up Sketch on a Mac operating system. We give an overview of the Sketch interface, which will explore how to execute vital actions when designing using the various tools on the toolbar. Next, you will learn how to use the ‘zoom’ tool and how to create an artboard. We teach you how to save files and toggle on the Sketch autosave feature. The benefits of grouping layers are outlined, which include well-organised design and faster workflow. Investigate how to use the vertical and horizontal rulers to divide layers. Discover the types of Boolean operations used in Sketch, which includes union operation, difference, subtract and intersection operations. Examine the ‘opacity’ and ‘blending’ modes and learn how to use masks, alignment and distribution.</p><p>In this design course, you will learn the uses of the ‘vector’ tool in Sketch, which include drawing all kinds of lines and creating any type of shape. Become familiar with the uses of the ‘pencil’ tool before being shown how to create illustrations using the ‘vector’ tool. Next, you will learn some very useful keyboard shortcuts to help improve your workflow in typography. Recognise how to align texts to the centre, right and bottom. Develop a basic design system to improve team communication and speed up workflow. Acquire fonts and icon packs and learn to form symbols and smart resizing methods in Sketch. Finally, you will learn how to add plugins in Sketch to enhance productivity and improve workflow. Lastly, memorise how to export various types of assets in Sketch.</p><p>Sketch is primarily used for designing the UI and UX of mobile apps and the web. Sketch has some added features for prototyping and collaborating with clients. This course teaches you how to set up Sketch and also gives a detailed overview of its interface. By taking this course, you will learn the basics of designing in Sketch, which includes creating artboards, copying styles and designing illustrations using the ‘vector’ tool, after which you will learn how to design a web application and an IOS app. So what are you waiting for? Take this course today and improve your design skills!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}