{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5015","title":"Designing Cryptocurrencies With JavaScript","totalEnrolled":"304","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to design live blockchain transactions in cryptocurrency with JavaScript.","description":"This short course will teach you how to design a lightweight cryptocurrency with JavaScript. We will explain the critical components and the architecture of the blockchain action by action. Learn to develop a genesis block hash, ‘Proof of Work’ (PoW), transaction wallet, airdrops and rewards for minting new coins. The course explores adopting open-source technologies to build fast and secure decentralized systems. Enroll now!","courseOutcomes":["Describe how blockchain works, inclu...","Recall the JavaScript framework, lib...","Define a blockchain class with block...","Discuss the proof element and design...","Describe how blockchain works, including its data validation and security features","Recall the JavaScript framework, libraries, and code snippets for blockchain design","Define a blockchain class with block linking and chain validation functionalities","Discuss the proof element and design a mini cryptocurrency with Proof of Work (PoW)","Explain block validation and its significance in blockchain design","Recognize the features of a crypto wallet and the properties of blockchain transactions","Describe how blockchain works, inclu...","Recall the JavaScript framework, lib...","Define a blockchain class with block...","Discuss the proof element and design...","Describe how blockchain works, including its data validation and security features","Recall the JavaScript framework, libraries, and code snippets for blockchain design","Define a blockchain class with block linking and chain validation functionalities","Discuss the proof element and design a mini cryptocurrency with Proof of Work (PoW)","Explain block validation and its significance in blockchain design","Recognize the features of a crypto wallet and the properties of blockchain transactions"],"courseDescription":"<p>Software engineering and development consistently change over time. One of the most disruptive phases involves the distributed nature of blockchain technology and peer-to-peer architecture. Blockchain and its associated technologies, theories, architecture and implementation are impacting everyone and everything in the information technology space and will continue to do so. This course is brought to you by Brett Hooper, a software engineering guru, technical evangelist and instructor par excellence who has worked with top organizations, including Fortune 100 companies, Silicon Valley startups and the US military.</p><p>The foundation of blockchain, which supports all cryptocurrency implementations, is what we will discuss, design and program. Using the familiar scripting language JavaScript, we will delve into the critical concepts that fit together to formulate the core of the blockchain system. In addition, we will present the associated ‘token’ transactions and explain how they join together and work in the live blockchain implementation. Learn to design your project via an integrated development environment (IDE) that allows you to access a virtual server in the cloud.</p><p>Furthermore, learn how to install and use the JavaScript framework and library that provide the cryptographic utility for data encryption. Included are topics that cover transaction assembling, transaction data validation, block linking, chain validation and ‘Proof of Work’ (PoW). We will also explore coin minting, block validation, creating wallet and blockchain transactions and real-life transactional activity simulation. The course will sharpen your understanding of open-source technologies so that you can build functional blockchain-based applications with JavaScript. Start learning now!</p><a href=\"https://alison.com/resume/courses/5015\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5015\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Blockchain Concepts and Components","description":"In this module, we will teach you how to build a lightweight cryptocurrency. We will consider the fundamental concepts of blockchain technology and implement the most vital components by creating a home-rolled crypto project. Learn how to create JavaScript classes that take on transactions, organise them into blocks, and pay coin rewards to miners.","topics":["Blockchain Concepts and Components - Learning Outcomes","The Basics of Cryptocurrency","Building the Crypto Blockchain","Bringing Cryptocurrency to Life","Blockchain Concepts and Components - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Designing Cryptocurrencies With JavaScript - Course Assessment"]}]}