{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5153","title":"Web Application Development using hapiJS","totalEnrolled":"276","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to build scalable web apps with the hapiJS Javascript framework in this free online web development course.","description":"The open-source hapijs Javascript framework is used by developers to create dependable and scalable web applications. Application programming interface servers, HTTP-proxy programs and webpages are frequently created using hapi. hapiJS has many special capabilities that let programmers create strong, effective and scalable apps. This course shows you step by step how to use hapiJS to create safe online applications and interactive webpages.","courseOutcomes":["Outline the features of hapiJS...","Recognise when to use and not use ha...","Identify the basics of hapijs ...","Describe how to design the API point...","Outline the features of hapiJS","Recognise when to use and not use hapi when building apps","Identify the basics of hapijs","Describe how to design the API point for our ‘Social Bookmarks’ app","Explain how to create endpoints in your app using static data","Describe how to debug any Node.js application using Node Inspector","Recall the use of lout for generating documentation in hapi","Discuss how to utilise client-side caching using caching headers","Distinguish between client-side caching from server-side caching with catbox","Define ‘third-party authentication’ and explain how it works","Analyse how to secure your application and make it bulletproof","Discuss how to deploy your application on the Heroku cloud","Outline the features of hapiJS...","Recognise when to use and not use ha...","Identify the basics of hapijs ...","Describe how to design the API point...","Outline the features of hapiJS","Recognise when to use and not use hapi when building apps","Identify the basics of hapijs","Describe how to design the API point for our ‘Social Bookmarks’ app","Explain how to create endpoints in your app using static data","Describe how to debug any Node.js application using Node Inspector","Recall the use of lout for generating documentation in hapi","Discuss how to utilise client-side caching using caching headers","Distinguish between client-side caching from server-side caching with catbox","Define ‘third-party authentication’ and explain how it works","Analyse how to secure your application and make it bulletproof","Discuss how to deploy your application on the Heroku cloud"],"courseDescription":"<p>The foundation of the code used in this course is built on a sample project we create called ‘Social Bookmarks’. Practice is the only surefire method to become an expert at something. This web and app development course explains what hapi is, where it comes from and when to use it depending on the project you are working on. We outline the specifications you need to develop our social bookmarking application before establishing its environment.</p><p>Developers have to make a lot of planning and architectural choices when building an application programming interface (API) and we guide you towards the right ones to help you build up your own API project. We then show you how to create endpoints using static data and how to test them using Postman. Nodemon is a utility that restarts your server automatically when it notices any changes to your source code. The course demonstrates how to use the node-inspector to debug any node application and the hapi tv plugin for request debugging.</p><p>What distinguishes server-side caching from client-side caching? We spend some time comparing them and explain how to use ‘cookies’. The course then explores the development of real-time apps using nes and RethinkDB and third-party authentication implemented with bell. Finally, we explain how to secure your app and defend it from CSRF attacks with Crumb. We also show you how to deploy our app to the cloud using Heroku. This course provides the skills you need to build apps with hapi’s built-in support for input validation, caching, authentication and other key features for developing online applications and services. hapi is an easy-to-use configuration-essential framework. This course benefits coding beginners and veterans as hapiJS offers a dynamic and secure Javascript environment for web and app development.</p><a href=\"https://alison.com/resume/courses/5153\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5153\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Basics of hapiJS","description":"In this module, you will learn about the origin of hapi, its basics, usage and when to use and not use it as a developer. We will walk you through step by step creating a sample project called social bookmarks. Then you will proceed to design and set up the API of the sample project as well as the website server and how to validate with joi.","topics":["The Basics of hapiJS - Learning Outcomes","Introduction to hapiJS","API Design using hapiJS","Website Project Overview","The Basics of hapiJS - Lesson Summary"]},{"name":"Module","details":"Advanced hapiJS Concepts","description":"This module will introduce you to more advanced concepts like nodemon, how to debug with node-inspector and how to utilise the hapi tv plugin to request debugging. You will also learn about caching and working with cookies, third-party authentication with bell, API versioning, app security and cloud deployment on Heroku and much more.","topics":["Advanced hapiJS Concepts - Learning Outcomes","Coding with Nodemon","Caching and Cookies","App Security","Advanced hapiJS Concepts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Web Application Development using hapiJS  - Course Assessment"]}]}