{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4688","title":"DevOps Integration with Jenkins Pipelines","totalEnrolled":"554","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about DevOps integration with Jenkins Pipelines and its components in this free online course on Alison.com.","description":"Are you looking to develop high-quality software using DevOps integration tools? Or are you perhaps trying to shift from manual integration towards automation for applications? If you answered ‘yes’, then welcome aboard. This online course provides you with an in-depth look into the world of configuration and operation of the Jenkins platform. So do not waste any more time and enrol now to take your learning journey further today!","courseOutcomes":["Define the terms ‘continuous integra...","Explain the process of installing an...","Describe the Jenkins interface and t...","Discuss the process of installing th...","Define the terms ‘continuous integration’ and ‘continuous development’ in the context of software development","Explain the process of installing and configuring Jenkins on your device","Describe the Jenkins interface and the process of creating pipeline jobs","Discuss the process of installing the repository management software Artifactory and explore its functions","Explain how to create and review a Java API project using the Gradle automation tool","Explain how to build a CI and CD pipeline using the Maven project management and comprehension tool","Describe how to manage the relational database schema in","Jenkins using the management system called Sqitch","Analyse how to set up the appropriate security configurations for the Jenkins server","Explain how to add ‘slave’ nodes to the Jenkins infrastructure through its scaling feature","Define the terms ‘continuous integra...","Explain the process of installing an...","Describe the Jenkins interface and t...","Discuss the process of installing th...","Define the terms ‘continuous integration’ and ‘continuous development’ in the context of software development","Explain the process of installing and configuring Jenkins on your device","Describe the Jenkins interface and the process of creating pipeline jobs","Discuss the process of installing the repository management software Artifactory and explore its functions","Explain how to create and review a Java API project using the Gradle automation tool","Explain how to build a CI and CD pipeline using the Maven project management and comprehension tool","Describe how to manage the relational database schema in","Jenkins using the management system called Sqitch","Analyse how to set up the appropriate security configurations for the Jenkins server","Explain how to add ‘slave’ nodes to the Jenkins infrastructure through its scaling feature"],"courseDescription":"<p>Explore the Jenkins platform with this online course on DevOps integration that will teach you how to use it to shorten the software development lifecycle while maintaining quality. The course starts by introducing you to the Jenkins platform. Then we discuss the key issues that led to the shift from manual to automated integration. Next, we will explain the Jenkins platform's key architecture and its main features and functions. Finally, we provide a detailed overview of installing the Jenkins platform on your computer and examine the proper configuration settings.</p><p>Don't know where to start with the Jenkins platform? The following section dives into creating jobs and pipelines on Jenkins. Video demonstrations ensure that these concepts become crystal clear, from project names to building triggers and executing shell commands. Next, we supply a synopsis of installing the popular tool Artifactory and explain it in detail. Flexibility is critical while creating software. That is where the use of tools is important. Finally, we demonstrate Gradle, an automation tool known for its flexibility in developing software. Creating CI and CD pipelines while using Artifactory and Gradle will be demonstrated.</p><p>The next section of the course will look at some tools that can help with DevOps in the DevOps lifecycle management build phase. Another vital tool needed to manage change is Sqitch. We will illustrate the proper use of all these tools with the creation of CI and CD pipelines to ensure that the Jenkins platform functions and features are clearly understood. Another crucial component of the Jenkins server is security. We will analyse the ways to set up security protocols within Jenkins. Finally, we will walk you through how to scale the Jenkins configurations. Managing time is crucial in today's fast-paced and rapidly changing environments. As the world shifts to faster and better technologies, staying up to date with these changes is paramount. So do not waste any more time. Enrol in this online course on Alison.com and understand the Jenkins platform in depth.</p><a href=\"https://alison.com/resume/courses/4688\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4688\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Installation and Configuration of Jenkins","description":"This module takes the learner through the process of installing and configuring the Jenkins platform. An introduction of what Jenkins is will be provided to the learner. Key features along with the installation process will also be discussed. Tools like Gradle and artifactory will be analyzed with demos for the learners' understanding.","topics":["Installation and Configuration of Jenkins - Learning Outcomes","Course Overview","Introduction to Jenkins","Installation Process of Jenkins","Getting Started with Jenkins","Managing Jenkins Jobs","Installing and Exploring Artifactory","CI and CD Pipelines with Gradle and Artifactory","Installation and Configuration of Jenkins - Lesson Summary"]},{"name":"Module","details":"Operation of Jenkins Platform","description":"This module looks at the operational aspects of the Jenkins platform. New tools such as Maven and Sqitch will be discussed along with a demonstration of how to build CI and CD pipelines. Configuration for the security of the Jenkins server will be analyzed for the learner. Adding Jenkins nodes to the cluster will also be demonstrated.","topics":["Operation of Jenkins Platform - Learning Outcomes","Review Java Web Application Project","Manage Relational Database Schema","Securing Jenkins","Jenkins Scaling","Operation of Jenkins Platform - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["DevOps Integration with Jenkins Pipelines - Course assessment"]}]}