{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4791","title":"Digital Forensics Examiner","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to conduct computer forensic examinations and presentations.","description":"Easy access to computers has made internet fraud, digital insecurity and cyberattacks common. This course is designed to help you investigate, analyse and present digital forensic incidents based on the evidence collected through digital media. You will also study computer investigative theories and concepts, digital evidence protocols, computer forensics incidents, forensic presentations and much more. So sign up today and start learning.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A digital forensic examiner acquires, accesses and analyses digital data and computer evidence. This course teaches you the methodologies for conducting any computer forensic examination and will help you learn to sort through digital evidence while conducting investigations seamlessly. Study the origins of digital forensic science and the differences between criminal and civil incidents. We will also take you through the steps involved in incident handling and the fundamentals of investigative theories and concepts.</p><p>Next, we will explore the prerequisites of digital investigation and risk assessments. We will review the processes of collecting electronic evidence and forensic data analysis. This section will also explain procedures for digital acquisition, evidence authentication and the features of digital analysis tools. Further, learn to examine the components of computer disks and storage devices. We will outline the forensic examination cardinal rules, Alpha 5 and the 20 essential steps of forensic investigation. We will also discuss digital evidence protocols and presentations such as hearsays, authenticity and alterations.</p><p>As a digital forensic examiner, there is a need to establish a computer forensic laboratory to implement various procedures and protocols and ensure the smooth running of operations. The conclusive section will teach you all you need to know about setting up digital forensic laboratories, coordinating regular proficiency testing and auditing laboratory operations. You will also discover the various forensic processing techniques, principles of eDiscovery and electronic storage of information materials. This course adopts real-life examples and case studies to help you understand the concepts more quickly. If you are interested in digital forensics, then this course is just right for you. Enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}