{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3598","title":"Diploma in VMware vSphere 6.0","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the virtualization, configuration, and monitoring of VMware vSphere 6.0 from this free online IT course.","description":"Stand out in your IT admin career with the help of this free course on VMware vSphere 6.0! This course analyzes the functions of hypervisors in a virtual machine and shows you how to integrate the ESXi Active Directory. Explore ways to export virtual machines to open virtualization format (OVF) and the functions of the distributed resource scheduler (DRS) cluster. Start this course today and upgrade your senior solutions engineering skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Having a hard time understanding the virtualization processes in VMware vSphere 6.0? Are you an IT administrator wanting to upskill yourself or prepare for the certification exam? This free online course provides an easy-to-understand guide to the virtualization processes in VMware 6.0. It also highlights the various updates made on previous versions of VMware. You will learn about the software-defined data centre (SDDC) along with how it simplifies data management in VMware 6.0. Explore the functions of type 1 and type 2 hypervisors (ESXi hosts) and the minimum physical hardware requirements for their installation. You will also evaluate different versions of VMware ESXi 6.0. This course analyzes the functions of the VMware horizon flex in providing flexibility while maintaining security and compliance. It illustrates VMware Workstation Pro 12 as a hosted hypervisor that runs on x64 versions of Windows and Linux. You will also study the functionality of VMware Fusion 8.</p><p>Ever wondered how the DCUI (direct console user interface) is used to locally configure ESXi 6.0 and how pre-conversion is carried out in the configuration of VMware vCenter Converter 6.0? This course succinctly describes the local configuration of ESXi 6.0 using DCUI. Next, analyze the differences between virtual machines (VM) and physical hardware as well as how to set up ESXi account security configuration. This course explains the pre-conversion process in the configuration of VMware vCenter Converter as well as how to automatically start-up, shut down along with the ways to enable VM startup and shut down the Virtual Machine in VMware 6.0. Get to contrast VM and physical hardware as well as the different types of storage reports that can be collected. You will then examine how these storage reports can be exported using the .csv format.</p><p>Finally, this course exposes you to the functions of snapshots in virtual machines. Update your knowledge of the installation process of the ESXi standalone patch. By taking this course, you learn about the new updates made to the vSphere Replication (VR) version 6.0. You will also be able to explain how the ESXi upgrade is carried out using Update Manager 6.0 and how to use the Web Client to upgrade VMware Tools. Upon the completion of this course, you will be able to identify the features of VMware Site Recovery Manager (SRM). Learn about the processes involved in the configuration of HA (high-availability) clusters as well as the virtualization of Microsoft clusters in VMware 6.0. This course also covers the architecture of the Site Recovery Manager in VMware 6.0. It is targeted at computer engineering students, IT enthusiasts and senior solutions engineering professionals interested in VMware configuration. Begin this course today and upgrade your VMware vSphere 6.0 expertise.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}