{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3407","title":"Diploma in Peer to Peer Networking","totalEnrolled":"751","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the fundamentals of peer-to-peer (P2P) networking and routing dynamics with this free online computer course.","description":"This course explains how different elements communicate with each other within a network. You will learn the essentials of peer-to-peer communication, creating secure data communication using advanced encryption and how nodes authenticate themselves through private and public keys. Illustrations will help demonstrate how nodes route their traffic to the correct users.","courseOutcomes":["Identify the different elements of a...","Explain how network certificates are...","Discuss the function of leaf, root a...","Describe the purpose and functionali...","Identify the different elements of an IP network","Explain how network certificates are used and verified","Discuss the function of leaf, root and core nodes","Describe the purpose and functionality of a distributed hash table (DHT)","State the type of messages sent in DHT networks","Explain the process of static and dynamic partitioning of a node ID space","Compute node IDs in the octal and hexadecimal number systems","Explain the process of how a new node enters a network","Explain how routing tables are updated in Kademlia and Pastry","Describe how routing tables are managed in a multi-layer DHT network","Identify the different elements of a...","Explain how network certificates are...","Discuss the function of leaf, root a...","Describe the purpose and functionali...","Identify the different elements of an IP network","Explain how network certificates are used and verified","Discuss the function of leaf, root and core nodes","Describe the purpose and functionality of a distributed hash table (DHT)","State the type of messages sent in DHT networks","Explain the process of static and dynamic partitioning of a node ID space","Compute node IDs in the octal and hexadecimal number systems","Explain the process of how a new node enters a network","Explain how routing tables are updated in Kademlia and Pastry","Describe how routing tables are managed in a multi-layer DHT network"],"courseDescription":"<p>This course on peer-to-peer (P2P) networking explains how nodes in a network communicate and pass data between themselves by creating secure communication channels. It introduces peer-to-peer networking basics by defining a server’s functions in a network environment and how resources and services are shared in this network. Common servers discussed are the IMAP (internet message access protocol) and SMTP (simple mail transfer protocol) servers used in the sending and receiving of email in both public and private settings. The material then explains how secure communication channels are set up via the process of user and server authentication. This is done using private and public keys, which a certificate authority gives. This certified certificate ensures the network element’s authenticity and safeguards a network from malicious hackers. The course also covers how peer-to-peer communication provides such services as telephony via SIP, domain name system (DNS) services, and DHCP (dynamic host configuration protocol) services.</p><p>Nodes identify and communicate with one another through the use of routing tables. One is a distributed hash table (DHT) used in peer-to-peer networking. These tables are populated using various algorithms, from simple ones to complex variants. The more complex the variant, the more secure the network will be. Would you like to design your own P2P network? This course will give you the proper foundation to achieve this goal. Pastry, Kademlia, and Tapestry protocols function in their approach to update the networks’ routing tables will be demonstrated. Extensive examples and illustrations are given in a step-by-step process so that you fully understand the structure and function of the protocols mentioned above. The course ends with a description of how these tables, presented in two dimensions for ease of understanding, can be expounded to any number of dimensions. This feature allows for multiple services to be provided to the end-user.</p><p>P2P networking is a distributed application design that divides tasks between peers. Peers are similarly privileged and are equal participants in the network. Peers make a share of their resources (such as processing power, disk storage or network bandwidth) directly available to other network members, without the need for central management of services by servers. Peers in a network are both consumers and suppliers of resources. This contrasts with the traditional client-server model, in which the consumption and supply of resources are separated. P2P systems look beyond the era of peers doing similar things while sharing resources. They are looking for dissimilar peers that can bring in exclusive resources and capabilities to a simulated community thus empowering them to engage in superior tasks beyond those that can be done by individual peers and beneficial to all the peers. P2P systems have inspired new structures and attitudes in many areas of human interaction and society. Do you want to be part of this exciting technology? Start this course today, and give your technology career a leap forward!</p><a href=\"https://alison.com/resume/courses/3407\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3407\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"An Introduction to Peer to Peer Networking","description":"In this module, you will learn about the fundamentals of Peer-to-Peer networking, VoIP telephony and how secure IP channels are set up. You will also be introduced to Distributed Hash Tables (DHT) and how routing tables are populated.","topics":["An Introduction to Peer to Peer Networking - Learning Outcomes","Introduction to Peer to Peer Networks","Peer to Peer Network in Telephony","Building DHT Networks","An Introduction to Peer to Peer Networking - Lesson Summary"]},{"name":"Module","details":"Logarithmic Partitioning and Messaging in DHT networks","description":"In this module, you will learn about Logarithmic Partitioning and Index Entry Authenticity. You will also learn about the different messages sent in DHT networks and how the partitioning of node IDs occur.","topics":["Logarithmic Partitioning and Messaging in DHT networks - Learning Outcomes","Logarithmic Partitioning","Implementation of Voice over Internet","Types of Messages in DHT Networks","Static and Dynamic Partitioning of Node ID Space","Logarithmic Partitioning and Messaging in DHT networks - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"This assessment will determine your knowledge and understanding of the course section entitled - Introduction to Peer to Peer Networks, Logarithmic Partitioning and Messaging in DHT networks","topics":["Diploma in Peer to Peer Networking - First Assessment"]},{"name":"Module","details":"PASTRY and Kadmelia Protocols","description":"In this module, you will be introduced to the PASTRY and Kadmelia Protocols. Extensive examples will be given on how these protocols work in a computer network and how the routing tables are populated.","topics":["PASTRY and Kadmelia Protocols - Learning Outcomes","PASTRY Protocol","Understanding the PASTRY Protocol","Kademlia","PASTRY and Kadmelia Protocols - Lesson Summary"]},{"name":"Module","details":"Tapestry and Multi-Layer DHT","description":"In this module, you will learn about the evolution of Kademlia and how it is applied to current networking processes. You will also be introduced to the Tapestry protocol, the Multi-dimensional Distributed Hash Table and how routing management occurs for a Multiple Service platform.","topics":["Tapestry and Multi-Layer DHT - Learning Outcomes","Tapestry: An Evolution of Kademlia","Understanding the Tapestry Protocol","Multi-dimensional Distributed Hash Table: Mapping of Peers","Multi-Layer DHT: A Design for Multiple Services","Tapestry and Multi-Layer DHT - Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"This assessment will determine your knowledge and understanding of the course section entitled - Understanding the PASTRY and Tapestry in Networking.","topics":["Diploma in Peer to Peer Networking - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Peer to Peer Networking - Course Assessment"]}]}