{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1506","title":"Diploma in Visual Basic Programming - Revised","totalEnrolled":"9,186","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the core concepts of Visual Basic and how to develop programs that can be used as front-ends for databases.","description":"This free online Visual Basic certification course is designed to teach you the information you need to start using Visual Basic. As demand for software developers rapidly increases, development skills become more and more valuable. Visual Basic is one of the most important programming tools in the world, and understanding it can be an essential to your skills and knowledge as a programmer. Learn Visual Basic today with this free online course.","courseOutcomes":["Select a custom installation for Vis...","Define the syntax of visual basic....","Explain how code files are organised...","Define what an iteration statement i...","Select a custom installation for Visual Studio 2015.","Define the syntax of visual basic.","Explain how code files are organised into projects and solutions.","Define what an iteration statement is.","Describe how to set a break point in your line of code.","Define and call simple methods.","Explain the different between the ‘do while' and 'while' iteration statement.","Explain how to add and subtract values from dates.","Explain how to use the existing .NET framework class library efficiently.","Define what happens when there are no more references to an object.","Describe how to change the default namespace for.","Select a custom installation for Vis...","Define the syntax of visual basic....","Explain how code files are organised...","Define what an iteration statement i...","Select a custom installation for Visual Studio 2015.","Define the syntax of visual basic.","Explain how code files are organised into projects and solutions.","Define what an iteration statement is.","Describe how to set a break point in your line of code.","Define and call simple methods.","Explain the different between the ‘do while' and 'while' iteration statement.","Explain how to add and subtract values from dates.","Explain how to use the existing .NET framework class library efficiently.","Define what happens when there are no more references to an object.","Describe how to change the default namespace for."],"courseDescription":"<p>This course will first cover the installation process of Visual Studio and help you select the correct options for your first Visual Basic program. You will study the different code terms, data types, variables, and statements that you can use, as well as the different syntax elements, operands, operators, strings, and iteration statements. You will also learn how to display the date and time in different formats for the end user to see.</p><p>Next, you will study the nature of classes, methods, scopes, and modifiers. The course will also cover Namespace, the .NET framework class library, and collections, as well as teach you the difference between generic and non-generic collections. You will also look into Language Integrated Query (LINQ) and enumerations including their functions in this programming language. Finally, you will study the 'Try Catch' and 'End Try' block code and learn when to use them while writing code.</p><p>Building software applications is a skill that one needs to develop constantly. This free online Diploma in Visual Basic Programming contains video tutorials that will ensure you clearly learn the different ways to write your code using Visual Basic. This is a great skills that will really boost your computer programming career. Check out the course today, and start learning how to build really engaging and useful applications in no time at all.</p><a href=\"https://alison.com/resume/courses/1506\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1506\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Starting a New Project in Visual Basic","description":"In this module, you will learn about installing Visual Studio on your computer. This module will talk you through the multiple options available for installing visual studio and will help you to select the correct options to ensure you can create the best applications from your code. You will be introduced to the basics of creating your first visual basics program and you will learn how visual basic works.","topics":["Starting a New Project in Visual Basic - Learning Outcomes","Course Introduction","Installing Visual Studio","Creating your First Visual Basic Program","Understanding your First Visual Basic Program","Starting a New Project in Visual Basic - Lesson Summary"]},{"name":"Module","details":"Writing Code with Visual Basic","description":"Learn how to write code and learn about different code terms that can create different functions for the end user of your application. You will learn about data types and variables and how they each can affect the outcome of your application. Study the different statements that can be used in your visual basic code.","topics":["Writing Code with Visual Basic - Learning Outcomes","Working with Code Files, Projects and Solutions","Understanding Data Types and Variables","Branching with the If... Then... Else Decision Statement","Writing Code with Visual Basic - Lesson Summary"]},{"name":"Module","details":"Statements, Arrays and Methods","description":"This module will teach you about different syntax elements of Visual Basic. You will learn about operands and operators as well as how expressions are used in the programming language. You will also learn how to set a breakpoint in your line of code and teach you about arrays and their uses. Defining methods will also be discussed.","topics":["Statements, Arrays and Methods - Learning Outcomes","Operations, Expressions and Statements","For ... Next Iteration Statement","Understanding Arrays","Defining and Calling Methods","Statements, Arrays and Methods - Lesson Summary"]},{"name":"Module","details":"Strings, Dates and Time","description":"This module will introduce you to strings and iteration statements. You will learn about how each of these function in the Visual Basic programming language. You will be taught how to format strings fro display and you you will also learn how to display the date and time in different formats for the end user to see.","topics":["Strings, Dates and Time - Learning Outcomes","While Iteration Statement","Working with Strings","Working with Dates and Times","Strings, Dates and Time - Lesson Summary"]},{"name":"Module","details":"Diploma in Visual Basic Programming - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Visual Basic Programming - First Assessment"]},{"name":"Module","details":"Classes, Scope and Modifiers","description":"In this module, you will be introduced to classes, the nature of classes and how to create an instance of a class. You will also learn about methods, scopes, and modifiers. The purpose of these features is to add a more advanced look to the end product of your application for the end user.","topics":["Classes, Scope and Modifiers - Learning Outcomes","Understanding Classes","More about Classes and Methods","Understanding Scope and Accessibility Modifiers","Classes, Scope and Modifiers - Lesson Summary"]},{"name":"Module","details":"Working with Namespaces","description":"This module will show you how to work with Namespaces. You will learn how to change the default namespace for your project. You will also learn about the .NET framework class library and references associated with the .NET framework class library. This module will also teach you the difference between the debug and release version of your application.","topics":["Working with Namespaces - Learning Outcomes","Understanding Namespaces and Working with the .Net Class Library","Getting Familiar with the My Namespace","Creating and Adding References to Assemblies","Working with Namespaces - Lesson Summary"]},{"name":"Module","details":"Collections, Linqs and Enumerations","description":"This module will show how to work with collections. You will learn the difference between generic and no-generic collections and how to use each of them in your code. You will also learn about LINQ and the types of LINQ used in Visual Basic. Finally, you will be taught about Enumerations and their functions in the programming language.","topics":["Collections, Linqs and Enumerations - Learning Outcomes","Working with Collections","Working with LINQ","Enumerations and the Select Case Decision Statement","Collections, Linqs and Enumerations - Lesson Summary"]},{"name":"Module","details":"Event-Driven Programming and Handling Exceptions","description":"This module will teach you about gracefully handling exceptions that occur within your application. You will be informed on event-driven programming and how to take control of adding and removing event handlers to specific events. Importantly, you will learn about the Try Catch' and 'End Try' block code and when to use it when you are writing your code.","topics":["Event-Driven Programming and Handling Exceptions - Learning Outcomes","Gracefully Handling Exceptions","Understanding Events And Event-Driven Programming","Where To Go From Here","Event-Driven Programming and Handling Exceptions - Lesson Summary"]},{"name":"Module","details":"Diploma in Visual Basic Programming - Second Assessment","description":"You must score 80% or more in order to pass this assessment.","topics":["Diploma in Visual Basic Programming - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Visual Basic Programming - Final Assessment"]}]}