{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3753","title":"Diploma in VMware Ultimate Bootcamp vSphere 5.5","totalEnrolled":"192","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the new vSphere 5.5 product, managing VMs, vCenter server and VM monitoring with this free online course.","description":"Stand out in the IT crowd by taking this free online course on VMware Ultimate Bootcamp vSphere 5.5. We will study virtualization and VMware's product line. You will also learn about the various components of VMware virtualization, the new vSphere 5.5 product, and explore how to manage virtual machines. The course will also show you how to configure networking for VMware vSphere. Sign up today and take your IT career skills to the next level!","courseOutcomes":["Identify vCloud suite 5.5 Add-ons...","Discuss the various reasons for virt...","Define virtual infrastructure and vi...","Discuss how to import virtual applia...","Identify vCloud suite 5.5 Add-ons","Discuss the various reasons for virtualization","Define virtual infrastructure and virtual machine","Discuss how to import virtual appliances using the OVF or OVA format","Recall how to convert an existing VM into a template and convert the template to a VM","Recall how to extend a VMDK file using a disk path","State some of the requirements needed to set up a fault-tolerant VM","Distinguish Microsoft clustering from VMware clustering","Recall how to use a VDP to backup and restore a VM","Identify vCloud suite 5.5 Add-ons...","Discuss the various reasons for virt...","Define virtual infrastructure and vi...","Discuss how to import virtual applia...","Identify vCloud suite 5.5 Add-ons","Discuss the various reasons for virtualization","Define virtual infrastructure and virtual machine","Discuss how to import virtual appliances using the OVF or OVA format","Recall how to convert an existing VM into a template and convert the template to a VM","Recall how to extend a VMDK file using a disk path","State some of the requirements needed to set up a fault-tolerant VM","Distinguish Microsoft clustering from VMware clustering","Recall how to use a VDP to backup and restore a VM"],"courseDescription":"<p>Are you new to virtualization and VMware's product line? Would you like to keep up with high demands when it comes to storage and processing? Then look no further than this free online course in VMware Ultimate Bootcamp vSphere 5.5. It is an excellent course put together to take you through the storage options available in vSphere. We also highlight the various updates and new features of VMware as a virtualization platform. You will learn about resource manipulation, automated administration using PowerCLI, and VM creation. We will show you how to configure your host to use and manage different types of storage. Learn more about the solid-state disk (SSD), its unique capabilities and its benefits. We will analyze how to optimize the resources in VMware vSphere 5.5, describe vSphere storage API for storage awareness (VASA), create VM storage profiles, and apply VM storage profiles to VMs. This course is designed to augment the recovery capabilities of the vSphere platform by providing a built-in ability to replicate a running virtual machine to another location continually. We'll also teach you about vSphere data protection, its installation process, and other data protection advanced products.</p><p>Have you ever wondered how to create multiple virtual machines (VM) and manage VMs or how to configure virtual machines with various virtual disks? This course will take you through all that. You will study how an ESXi virtual machine uses a virtual disk to store its operating system, program files, and other data associated with its activities. Next, we will analyze the various vNIC types and illustrate how to create a VMDK stub file when corrupt or missing. We'll identify the post-conversion steps on how to set new IPs or new vNIC. Are you trying to understand how to make a list of things for planning the upgrade of your virtual machines? This course will take you through how to create and deploy multiple VMs from a template. Understand what vSphere is and how it functions in your virtualization environment to help you keep up with high processing and storage demands. You will learn about VMware converter 5.5 and the four steps for hot cloning in a converter.</p><p>Every virtual machine needs a network interface card (vNIC), called Vmware. It essentially is a network interface card that can connect and participate in a network. Do you want to learn about the security model used by vCenter in ESXi, Center, and ESXi permissions and how they work? Then, sign up for this course today! After completing this course, you will know how to use active directory authentication when logging on locally to the ESXi host. Also, you will learn how to join the ESXi host to the active directory. You will also be able to configure the ESXi firewall via the vSphere client. Virtualization products are now an essential part of many companies. This course exposes you to the features of vSphere that make virtualization a great technology, how cost-efficient it is, and the different resources needed in mastering this technology. Upon completion, you will also know how to manipulate all available features in VMware 5.5 to achieve your desired result. This course is perfect for students, IT professionals, researchers, and anyone interested in VMware's product line. Register for this course today and start your next learning journey.</p><a href=\"https://alison.com/resume/courses/3753\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3753\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Virtualization Overview","description":"Learn about VM training physical setup and network IP setup from this module. Identify the lab terms used in VM training. Get to analyze VMware virtualization and system centre virtual machine manager 2012 R2. Also, you will get to compare type 1 and type 2 hypervisors in this module.","topics":["Virtualization Overview - Learning Outcomes","Introduction and Methodology","VMware Virtualization","Other VMware & 3rd Party Virtualization Technologies","Virtualization Overview - Lesson Summary","Virtualization Overview - Assessment"]},{"name":"Module","details":"Planning and Installing ESXi","description":"Learn about the installation process of the ESXi 5.5. Get to analyze the troubleshooting process of hostd and ESXI CIM management agents. Also, you will get to explore the core management tools called CIM embedded in the hypervisor and how to boot ESXi from a SAN LUN.","topics":["Planning and Installing ESXi - Learning Outcomes","Planning the ESXi Deployment","vSphere 5.x Deployment Guidelines","vSphere Hypervisor (ESXi) Installation","Configuring Hostname Resolution and NTP","Troubleshooting ESXi","Planning and Installing ESXi - Lesson Summary","Planning and Installing ESXi - Assessment"]},{"name":"Module","details":"Management Tools Overview","description":"Explore the different third-party tools available to VMware’s product. Get to analyze the series of products available for managing VMware infrastructure and compare some Windows commands to Linux commands. Also, you will explore how to troubleshoot the vSphere client or the VIC.","topics":["Management Tools Overview - Learning Outcomes","Third-Party Tools for Management - Overview","Management Tools for EXSi","Linux Command Review","Troubleshooting vSphere/VIC","Management Tools Overview - Lesson Summary","Management Tools Overview - Assessment"]},{"name":"Module","details":"vCenter Server","description":"Get to identify what the vCenter server is and its limitations. Analyze vSphere from its versions and the three licensing types. Also, learn about the fling, which is the vCenter mobile access (vCMA), created by VMware labs, and troubleshoot the vCenter server in the database.","topics":["vCenter Server - Learning Outcomes","Licensing Model","Installation of vCenter Server","vSphere Web Client","vCenter Server Inventory","Managing vCenter Server","Planning vCenter Server Deployment","Troubleshooting the vCenter Server","vCenter Server - Lesson Summary","vCenter Server - Assessment"]},{"name":"Module","details":"Networking Terms","description":"You will identify the different networking concepts as well as how to create and modify virtual networks. Also, study how to create and manage virtual networking in this module. Then, you will analyze the private VLAN support and how to edit the dvSwitch port.","topics":["Networking Terms - Learning Outcomes","Creating and Modifying Virtual Networks","vSphere Distributed Switches","Creating and Modifying Networking","Networking Terms - Lesson Summary","Networking Terms - Assessment"]},{"name":"Module","details":"Configuring Storage","description":"You will study storage APIs and a virtual machine file system (VMFS-5) in this module. This module provides an overview of the internet small computers systems interface (iSCSi) and how to troubleshoot iSCSi software initiator. Also, you will get to describe the process for configuring an NFS datastore; through the web client and through the CLI.","topics":["Configuring Storage - Learning Outcomes","Storage Concept","ISCSI Storage (GUI & Command Line)","Fibre Channel Storage","VMFS Datastores (GUI & Command Line)","NAS Storage and NFS Datastores (GUI & Command Line)","Raw Device Mapping (RDM)","Solid State Disks (SSD)","Storage & Management Solutions","Configuring Storage - Lesson Summary","Configuring Storage - Assessment"]},{"name":"Module","details":"Diploma in VMware Ultimate Bootcamp vSphere 5.5 - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["First Assessment"]},{"name":"Module","details":"VM Creation, Configuration, and Snapshots","description":"Get to explore different methods of creating multiple virtual machines (VM) and how to deploy a VM from the template. This module will enable you to identify the customization specification manager and VMware converter 5.5. Also, explore the process for managing VMs and how to use raw device mapping (RDM).","topics":["VM Creation, Configuration, and Snapshots - Learning Outcomes","Creating a VM","Create Multiple VMs, Templates & Clones","Virtual Appliances","Configuration and Use of vApps","VMware Converter (P2V – V2V)","Managing VMs","Virtual Machine Startup/Shutdown","Virtual Machine Snapshots","Virtual Machine Troubleshooting & Best Practices","VM Creation, Configuration, and Snapshots - Lesson Summary","VM Creation, Configuration, and Snapshots - Assessment"]},{"name":"Module","details":"Security and Permissions","description":"You will get to explore the process of controlling user access and passwords in ESXi from this module. This module describes the process for joining the ESXi host to the active directory. Also, get to explore data encryption and encryption of the communication pathways.","topics":["Security and Permissions - Learning Outcomes","Controlling User Access and Passwords","ESXi Active Directory (AD) Integration","Managing Firewalls & Certificates","vCloud VMsafe and vShield","Security and Permissions - Lesson Summary","Security and Permissions - Assessment"]},{"name":"Module","details":"Server and VM Monitoring","description":"Get to analyze the transparent memory page sharing (TPS) technology in this module. You will discuss virtual CPUs, the sources that cause latency in virtualization and the best practices for VM resources. Also, this module illustrates alarms in vCenter from their functions and how to manipulate the alarm settings.","topics":["Server and VM Monitoring - Learning Outcomes","Optimizing Resources","Resources Pools","Latency Sensitive Applications","Performance Monitoring","Configuring Alarms","ESXi & vCenter Logs","Server and VM Monitoring  - Lesson Summary","Server and VM Monitoring - Assessment"]},{"name":"Module","details":"Advanced ESXi and vCenter Server Management","description":"You will be introduced to storage VMotion migration and the reasons for storage VMotion in this module. Get to explore the distributed resource scheduler (DRS) and its uses. Also, you will be able to identify the different types of storage capabilities and how to manage storage capabilities.","topics":["Advanced ESXi and vCenter Server Management - Learning Outcomes","Storage Views & Topology Maps","Storage VMotion","Configuring VMotion","Enhanced VMotion","Distributed Resource Scheduler (DRS) Cluster","Profile Driven Storage, Datastore Clusters & Storage DRS (SDRS)","DRS Cluster Monitoring","Host Profiles","Linked Mode Group of vCenter Servers","VSphere Storage Appliance (VSA)","VMware Virtual SAN (VSAN)","Advanced ESXi and vCenter Server Management  - Lesson Summary","Advanced ESXi and vCenter Server Management - Assessment"]},{"name":"Module","details":"Patching and Upgrading ESXi","description":"You will be introduced to the methods of installing a stand-alone patch in this module. Get to discuss the update manager vSphere client plug-in, update manager baselines, and patch repository. Also, analyze the methodology for upgrades when working with vCenter or vSphere.","topics":["Patching and Upgrading ESXi - Learning Outcomes","Patching ESXi Standalone Hosts","Patching the vCenter Environment","Upgrades and Migrations","Patching and Upgrading ESXi - Lesson Summary","Patching and Upgrading ESXi - Assessment"]},{"name":"Module","details":"Disaster Recovery and Backup","description":"Get to analyze vSphere replication version 5.5 as well as how to set up, configure and run a recovery on the vSphere replication version 5.5. In this module, you will discuss VMware site recovery manager (SRM), VM fault tolerance and VMware data protection.","topics":["Disaster Recovery and Backup - Learning Outcomes","vSphere Replication 5.5","Site Recovery Manager (SRM)","High Availability (HA)","VM Fault Tolerance","Microsoft Clustering","Backup Strategies","VMware Data Protection","Third Party Backups","Disaster Recovery and Backup - Lesson Summary","Disaster Recovery and Backup - Assessment"]},{"name":"Module","details":"Diploma in VMware Ultimate Bootcamp vSphere 5.5 - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in VMware Ultimate Bootcamp vSphere 5.5 - Final Assessment"]}]}