{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2328","title":"Diploma in Fundamentals of Artificial Intelligence","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on Alison takes you through the rudiments and fundamentals of artificial intelligence.","description":"This free online course will be of great interest to students and individuals who have requisite background knowledge of computer programming and science. The course describes how artificial intelligence is used to tackle complex real world problems like speech recognition and machine translations. By the end of this course, you will be able to use artificial intelligence techniques to solve computational problems using real life scenarios.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p><span style=\"font-weight: 400;\">This course begins by explaining the thoughts and ideas that have influenced the growth of artificial intelligence. You will learn about the definition of artificial intelligence and the different dimensions of artificial intelligence. You will learn about the differences between artificial intelligence, programming and general computational paradigms. You will also learn about production systems and how they capture the essence of artificial intelligence systems.</span></p><p><span style=\"font-weight: 400;\">The course then explains the meaning and types of various search techniques used in solving problems. You will learn about how heuristic functions are formulated. You will learn about the integral role games play in the development of artificial intelligence. You will also learn about how knowledge representation in reasoning forms the backbone of any intelligent behaviour through computational means.</span></p><p><span style=\"font-weight: 400;\">The course then explains resolution as an important rule of inference used in well formed formulas in knowledge representations. You will be introduced to planning in its abstract form, and how it can be used in problem solving. You will also learn how machine learning addresses the fundamental question of how to build computer programs that could learn automatically from experience.</span></p><p><span style=\"font-weight: 400;\">Prerequisites; Learners will need good knowledge and ability in programming in order to study this course.</span></p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}