{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3726","title":"Diploma in Google Suite - Gmail, Google Apps and Google Docs","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Get an in-depth look at Gmail, Apps Script and Google Docs with this free online Google Suite course.","description":"Improve your skills on Google Suite in this free online course, which covers Gmail, Apps Script and its IDE, as well as Google Docs. We’ll be taking an inside look at the tools and tips that are vital for maximizing your productivity. And we will be providing you with expert knowledge on all the essential features available to you within these apps.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>With Google Suite, Google provides an all-inclusive selection of apps catering for every need. In this free online course, we will be exploring the ins and outs of Gmail, Google Docs and Google Apps Script and its IDE. These three apps are considered by many as mainstays for users looking to benefit from Google’s cloud-based services. While Gmail and Google Docs are the most common Google apps, Google Apps Script is a more advanced tool that provides code-writing and execution functionality. With this course, you will get what you need to start coding immediately using Apps Script, even if you are new to coding. We will walk you through the basics, starting by explaining the main operational unit of Apps Script. We will then explore what you can do with the app. We then display the process of writing code in Apps Script using Classes and Methods. To provide examples of this, we will create a Google Docs document and send a Gmail email from within Apps Script’s IDE by writing and executing specific lines of code. We also cover debugging, which is essential to successful code execution, and navigating the Apps Script IDE menus. In addition to covering the basics, you will also learn advanced Apps Script features that will take your learned coding skills up a level. These include detailing the processes involved in creating and deploying Libraries and Web Apps and connecting APIs to your scripts.</p><p>Google Docs has powerful word processing capabilities, and by the end of this course, you will handle it like a pro. We will start by covering basic and advanced Docs features, providing you with a thorough detailing of each. These include displays of basic and advanced formatting options and the association between Google Drive and Docs. We’ll also provide an in-depth explanation of the crucial collaboration and sharing options available within the app. We will also show you the ropes with the essential tools to increase your productivity in Google Docs. Furthermore, this course offers an extensive guide on Google’s email service – Gmail. We will train you in various Gmail features and provide tips to maximize your productivity. We cover what the settings menus offer in terms of configurations and tweaks, including the Conversation View and Undo Send settings. The course also details how you can apply Labels and Filters in Gmail and the methods for sending large files from your Gmail. We also cover using the app in Offline mode, so you can learn how to access your Gmail even when there is no internet connection.&nbsp;</p><p>By the end of this course, you will have acquired a specialized skillset in Google Docs, Gmail and Google Apps Script that will improve your efficiency and possibly open more doors in your career. The in-depth focus of this course will be advancing skills you may have thought could not be developed any further. The course is video-based, so you will be getting demos that you can then apply in your day-to-day work. And best of all is that this course is free! So enrol now to advance your skills and learn new ones in the Google Suite group of apps.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}