{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3078","title":"Diploma in Engineering Drawing and Computer Graphics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore engineering drawing, graphic design and computer graphics with this free online technical drawing course.","description":"This free online course introduces you to technical drawing and engineering construction. We explain how engineers use ‘dimensioning’ and other techniques to accurately draw and design projects in all technical fields. This course is for aspiring engineers or anyone looking to break into the exciting world of computer graphics. While we tackle a range of mathematical problems, this course demonstrates their value on the screen and on the streets.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course teaches you technical and graphic drawing for all modes of engineering. We begin with a brief overview of the course and its fundamentals and brief you on the equipment required to participate in course examples that involve constructions and graphic drawing. We then lay out the basics of engineering drawing, beginning with drawing sheet layouts and dimensions. We discuss the specified ‘dimensioning’ units that are used as standard practice and analyze the correct formats of ‘dimensioning’ objects and constructions. We then evaluate its techniques that use angles and discuss the special issues that it raises. The course compares different features of dimensions and their different acceptable levels of tolerance with regards to the construction of designed products.</p><p>We then examine the fundamentals of geometric constructions, which forms the foundation of all technical drawing and thus of all engineering. We teach you how to illustrate shapes such as arcs and circles and how to draw constructions effectively and accurately. We demonstrate the methods used to bisect a line at a perpendicular angle and how to bisect and trisect angles without the use of measurements. We then show you how to segment a line into equal parts without measurements and how to construct multiple shapes including polygons. The course then breaks down how to create a circle where the circumference runs through three different points and how to draw tangents. We then compare the multitude of tangent constructions from the common tangent to the interior and exterior tangents of multiple circle variations. These constructions and techniques are used in all engineering sectors for meticulous technical designs. They represent fundamental knowledge that allow for more complex future designs.&nbsp;</p><p>The course then addresses conic sections and the wide variety of techniques and formats used to create accurate constructions. Conic sections, also called ‘conics’, are classified as any curve produced by the intersection of a plane and a right circular cone. Depending on the angle of the plane relative to the cone, the intersection can either produce a circle, an ellipse, a hyperbola or a parabola. This module will cover all four of these intersection variants and the different methods used to construct their four shapes: the ‘focus-directrix’, ‘concentric circle’, ‘oblong’ and ‘arcs’ methods, which are used in different forms to construct the four shapes of the intersections. The lesser-known ‘rectangular’ method is also covered but is not as effective in constructing all four shapes. This section reinforces tangents but presents variants of the original techniques. We examine the tangent constructions that lead to new special curves: spirals, cycloids and helixes. This diploma course suits engineering or technological enthusiasts who want to hone their technical drawing skills, which form the basis of a career building objects both in the physical and digital worlds.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}