{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4463","title":"Diploma in Application Development Using PHP and MySQL","totalEnrolled":"5,162","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online coding and development course teaches you how to create high-functioning apps using MySQL and PHP.","description":"Application development entails a series of coding steps, all of which must be error-free in order for the app to be well-developed and run at peak performance. This course teaches you how to set up a coding environment for developing applications with MySQL and PHP. Using this course you should be able to create great apps that function well and are easy to develop, maintain and upgrade whenever needed. You'll learn how to code the right way!","courseOutcomes":["Create a PHP coding environment on W...","Apply codes using the echo command i...","Recognize the various ways to do com...","Recall the various commands to open,...","Create a PHP coding environment on Windows, Mac, and Linux operating systems","Apply codes using the echo command in PHP","Recognize the various ways to do comments in PHP","Recall the various commands to open, read and close a file in PHP","Create a frontend HTML upload form in PHP","State how to limit file type and size in PHP","Distinguish between MySQL, MySQLi, and PDO","Explain why MySQL is not recommended for new projects","State the function of the WHERE and LIKE properties","Identify the codes for implementing a constructor in a program","Distinguish between a constructor and a destructor","Distinguish between public, private, and protected","Create a PHP coding environment on W...","Apply codes using the echo command i...","Recognize the various ways to do com...","Recall the various commands to open,...","Create a PHP coding environment on Windows, Mac, and Linux operating systems","Apply codes using the echo command in PHP","Recognize the various ways to do comments in PHP","Recall the various commands to open, read and close a file in PHP","Create a frontend HTML upload form in PHP","State how to limit file type and size in PHP","Distinguish between MySQL, MySQLi, and PDO","Explain why MySQL is not recommended for new projects","State the function of the WHERE and LIKE properties","Identify the codes for implementing a constructor in a program","Distinguish between a constructor and a destructor","Distinguish between public, private, and protected"],"courseDescription":"<p>Applications can make people's lives easier, boost business growth, and provide entertainment. We have designed this course for anyone interested in learning the science of application development. We begin by showing you how to set up the PHP coding environment on Windows, Mac, and Linux operating systems. Then we explain how to use the online code testing environment, which is a convenient alternative to the desktop environment for testing and debugging. We explore the PHP fundamentals, including basic file syntax, printing with the echo command, commenting out codes, constants, arrays and control structures. PHP control structures consist of implementing the if, if/else, and other statements, and using the switch statement, loops, break and continue statements in a script. You'll also learn how to pass function arguments and how functions return values.</p><p>This course teaches you the differences between GET and POST, when to use them, required fields and how to display error messages. Discover how to validate user names, emails, URLs and keep user data in a form. Study file handling in PHP, where you will learn how to interact with files using various functions such as fopen to open a file, fclose to close a file, and fwrite to write to a file. We clarify the difference between MySQL, MySQLi, and PDO and how to manipulate data using queries, use the WHERE property to specify the data to be sent and received, and implement JOINS in a database. Finally, you will learn about extensible markup language and how to pass XML string and files. You will also learn how to stop an SQL injection, group, and transport using XML, examine object-oriented programming and handle errors.</p><p>PHP is primarily a scripting language that you primarily use in Web development whereas MySQL is a relational database management system based on SQL, and you use it for Web databases. We have created this course to provide you with the knowledge and skills needed to develop MySQL and PHP applications. If you want to improve your skills as an app developer, this course will teach you how to set up the PHP coding environment, print codes, make comments, trigger an exception, and handle errors in a script.</p><a href=\"https://alison.com/resume/courses/4463\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4463\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, PHP Basics and Control Structures","description":"In this module, you will learn how to setup PHP coding environment on windows, Mac, and Linux OS, you will be introduced to PHP basic file syntax and you will learn how to combine HTML and PHP codes and also how to print out codes using the echo command, you will learn how to implement the IF and SWITCH statements.","topics":["Introduction, Basics and Control Structures - Learning Outcomes","Introduction and setting up","Basics of PHP","PHP Control Structures","Introduction, Basics and Control Structures - Lesson Summary"]},{"name":"Module","details":"PHP Functions, Forms and File Handling","description":"In this module, you will learn how to pass arguments into functions, call returning values from a function, and about variable scope. You will also learn the difference between GET and POST, how to validate from data, and how to display error messages. You will learn how to read files using the read file function.","topics":["PHP Functions, Forms and File Handling - Learning Outcomes","PHP Functions","The PHP Forms","PHP File Handling","PHP Functions, Forms and File Handling - Lesson Summary"]},{"name":"Module","details":"MySQL, XML, AJAX and Emails","description":"In this module, you will learn how to create and connect a database using MySQL, update the database using the update query, access element properties using SimpleXML, parse an XML string and file, Get node values, Get attributes, load data using AJAX frontend and backend, and set up PHP mailer.","topics":["MySQL, XML, AJAX and Emails - Learning Outcomes","Introduction to MySQL","SQL Database Manipulation","Extensible Markup Language (XML)","AJAX and Emails","MySQL, XML, AJAX and Emails - Lesson Summary"]},{"name":"Module","details":"Object Oriented Programming Concepts","description":"In this module, you will be introduced to object-oriented programming and you will be shown how to implement a basic class with variables, create a function, implement constructors, destructors, and override functions, you will learn how to implement the die function in a PHP script, validate an IPV6 address, and how to include and require files.","topics":["Object Oriented Programming Concepts - Learning Outcomes","Object Oriented Programming","Error Handling","Advanced PHP Features","Object Oriented Programming Concepts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Application Development Using PHP and MySQL - Course assessment"]}]}