{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1480","title":"Diploma in Computer Networking - Revised","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the security architecture and protocols used to keep networks safe in this free online diploma course.","description":"This diploma course introduces you to the architecture and protocols used in network security. We explain the structure and function of local area networks (LANs) and wide area networks (WANs) and examine key devices like hubs, switches and routers. These allow for efficient communication through a network and this course teaches you everything you need to know to keep that data safe from prying eyes, an invaluable skill in the Information Age.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This diploma course discusses the basics of networking and local area networks. We lay out network terminology and explain serial data transfer and internet protocol (IP) addresses as we examine the most common types of network. We study the ‘open systems interconnection’ (OSI) model to illustrate how its layers guide the flow of network traffic. We cover wired and wireless networks and the tools used to manage and troubleshoot them.</p><p>Dynamic host configuration protocol (DHCP) is a client/server protocol that enables configured client computers to obtain IP addresses automatically. We outline what information can be obtained from IP addresses using DHCP and the benefits of doing so. We then investigate ‘discovery, offer, request, acknowledge’ (DORA) discovery and ‘automatic private IP addressing’ (APIPA), which is a service for assigning unique IP addresses to small office or home networks without deploying the DHCP service.</p><p>Setting up a network can help a business make the most of its computer systems and equipment. It is a fast and reliable way of sharing information and resources. This course provides a deep understanding of the different types of LANs and WANs found in networks and the protocols used to secure communications and preserve network security. This diploma course suits anyone working in the field of information technology so sign up to polish your computer skills and take the next step in your career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}