{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4494","title":"Diploma in Adobe XD: UI/UX Design Masterclass","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create functional, user-friendly websites and mobile apps with Adobe XD in this free online diploma course.","description":"The user experience (UX) is one of the most important aspects of any company's online presence. It's no surprise then that companies are devoting more time and resources to improving the UX. In this free online course, you will learn how to use Adobe XD to create a sample bank website with a feature-rich user interface (UI) and UX design. By completing this course, you will become a pro at creating user-friendly web and mobile apps. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Adobe XD (also known as ‘Adobe Experience Design’) is a vector-based user experience design tool developed and published by Adobe Inc. for web and mobile apps. It's accessible for macOS and Windows, but there are also iOS and Android versions to enable you to preview the results of your work as you go. Website wireframing and click-through prototypes are both possible with Adobe XD. The advantages of Adobe XD for UI and UX include interoperability, content-aware layout and prototyping capabilities. Other vital features of the tool include voice design, responsive design and content animation. This course is designed specially by a professional designer with over ten years of experience in UI/UX design to enable you to become an expert in product design and creation. You will study the most basic UI/UX design concepts. The instructor will gradually show you some intermediate and advanced techniques for creating responsive websites compatible with desktop and mobile devices.</p><p>Further, you will explore how to install Adobe XD and discover how to access the available user options for desktop, mobile and web apps. Explore the Adobe XD artboard and use its custom dimensions features to design your products. Additionally, a walkthrough of the tabs in the app will assess the four different types of tab bars used in the application. Learn about shapes and icons as well as the tools used for modifying various objects on the Adobe XD artboard. You will also see how to work with text and learn two ways of applying it in product design. The topic on the design process will emphasise why you should start a project from the design brief. Then, to help you further digest the subject, a sample of the design brief will be presented.</p><p>Finally, you will learn about audience research and why the process is crucial in UI/UX design. Likewise, you will examine some paper wireframing resources, the three basic styles of paper wireframes and the key factors that affect product wireframes. Learn how to create website architecture using the flowchart element and review the systems for creating components from shapes and objects. You will also be taught the techniques for optimising the images to be used for your UI/UX designs. What is business imagery? Why is imagery such an essential model? These questions and other vital UI/UX design questions will all be addressed. By completing this course, you will learn to create engaging user interface designs, functional websites and feature-rich mobile apps with Adobe XD. So why wait? Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}