{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3509","title":"Diploma in VMware Ultimate Bootcamp vSphere 5","totalEnrolled":"344","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course helps you to work efficiently in real-world troubleshooting and installation of VMware 5.0.","description":"VMware vSphere 5.0 is the industry-leading virtualization technology platform accelerating the shift to cloud computing for existing Data Centers. This free online course discusses the fundamental tools and techniques required to plan, install and administer a VMware environment including Disaster Recovery and Backup. This VMware course will refine your overall skills in administering virtual environments, specifically the VMware vSphere 5.0.","courseOutcomes":["Describe the foundational terms and ...","Explain how to install, configure, a...","Explain the steps involved in using ...","Distinguish between hardware vs. sof...","Describe the foundational terms and concepts concerning virtualization","Explain how to install, configure, and support ESXi Server 5 and vCenter 5","Explain the steps involved in using Port Mirroring","Distinguish between hardware vs. software initiators","Discuss the new and exciting features of VMware vSphere 5.0","State the processes involved in ESXi Firewall Configuration via vSphere Client","Distinguish between CPU Resource Settings and Memory Resource Settings","List the requirements of common resources on source and destination ESX/ESXi hosts","Explain the networking terms in creating and modifying virtual networks","Describe the networking CLI commands","Describe the foundational terms and ...","Explain how to install, configure, a...","Explain the steps involved in using ...","Distinguish between hardware vs. sof...","Describe the foundational terms and concepts concerning virtualization","Explain how to install, configure, and support ESXi Server 5 and vCenter 5","Explain the steps involved in using Port Mirroring","Distinguish between hardware vs. software initiators","Discuss the new and exciting features of VMware vSphere 5.0","State the processes involved in ESXi Firewall Configuration via vSphere Client","Distinguish between CPU Resource Settings and Memory Resource Settings","List the requirements of common resources on source and destination ESX/ESXi hosts","Explain the networking terms in creating and modifying virtual networks","Describe the networking CLI commands"],"courseDescription":"<p>VMware vSphere 5 Ultimate Bootcamp is a free online course that offers training on advanced virtualization concepts and the VMware vSphere 5 product suite. VMware vSphere 5.0 is the industry-leading virtualization technology platform accelerating the shift to cloud-computing for existing Data Centers. The objective is simple: teach you how to use the platform and perform tasks efficiently and effectively, starting with the installation of the product and then real-world troubleshooting issues. The focus of this VMware training course is to learn and harness the power of VMware and master the entire concept of virtualization. It also analyzes other 3rd party tools as well as technologies that will enhance VMware capabilities and increase your virtualization expertise. This VMware course combines several popular VMware vSphere classes into one accelerated-learning Bootcamp with content and concepts from multiple VMware classes. These range from Install, Configure, Manage, What’s New, Manage for Performance, and Troubleshooting.&nbsp;</p><p>The Ultimate Bootcamp maximizes your training experience with learning based on real-world scenarios and throughout the course, you will learn how to use tools to administer the VMware environment. You will also learn about planning the ESXi deployment, deployment guidelines, vSphere Hypervisor installation, Configuring Hostname resolution and NTP, and Troubleshooting ESXi. The final section of this course covers topics like Network Configuration, Configuring Storage, Virtual Machine Creation, Configuration, and Snapshots. The right Network Configuration is essential to supporting the flow of traffic through a network and can also support and enhance network security as well as improve network stability. Some other concepts related to VM Creation are discussed, such as how to create Multiple VMs, Templates &amp; Clones, Virtual Appliances, and VMware Converter. The purpose of Virtual Machine Creation is to provide a platform-independent programming environment and the content then focuses on the basic terminology of the accounts, and access controls and security of Local Linux Systems. Command Line Interface (CLI) tools in a Linux System for basic security access controls, as well as basic files to support user and group accounts is comprehensively addressed and you will finish off by learning about Patching and Upgrading ESXi, Disaster Recovery and Backup and Virtual Machine Monitoring.</p><p>This course is designed for System Administrators, Engineers, and Operators responsible for the setup, support, and troubleshooting of ESXi 5 Server and/or vCenter 5. Enrolling for this VMware Ultimate Bootcamp vSphere 5 can level-up your expertise in administering virtual environments from VMware vSphere 5.0 and a whole new world of career prospects.</p><a href=\"https://alison.com/resume/courses/3509\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3509\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"VMWare vSphere and Virtualization Overview","description":"In this module, you will learn about VMWare vSphere and an overview of virtualization. Discuss the reasons for virtualizing (e.g cost savings), how VMware virtualization compares to traditional PC deployments and common pain points in PC Server.","topics":["VMWare vSphere and Virtualization Overview - Learning Outcomes","Learn IT! Do IT! Know IT!","Virtualization Overview","VMWare vSphere and Virtualization Overview - Lesson Summary","VMWare vSphere and Virtualization Overview - Assessment"]},{"name":"Module","details":"Planning and Installing ESXi","description":"In this module, you will learn about planning and installing ESXi. Get to study ESXi compatibility requirements and ESXi deployment. Also, you will study the different options for deploying VMware ESXi.","topics":["Planning and Installing ESXi - Learning Outcomes","Planning the ESXi Deployment","vSphere 5.x Deployment Guidelines","vSphere Hypervisor (ESXi) Installation","Configuring Hostname Resolution and NTP","Troubleshooting ESXi","Planning and Installing ESXi - Lesson Summary","Planning and Installing ESXi Assessment"]},{"name":"Module","details":"Using Tools to Administer a VMware Environment","description":"In this module, you will learn about Using Tools to Administer a VMware Environment. Get started by discussing how 3rd Party Tools help in managing our environment, how ESXi relies on remote utilities instead of a service console, and the basic Linux Commands.","topics":["Using Tools to Administer a VMware Environment - Learning Outcomes","Overview of 3rd Party Tools","ESXi Management","Linux Command Review","Using Tools to Administer a VMware Environment - Lesson Summary","Using Tools to Administer a VMware Environment Assessment"]},{"name":"Module","details":"vCenter Server 5 and Licensing","description":"In this module, you will learn about vCenter Server 5 and Licensing.Learn about the licensing of the vSphere Infrastructure, the vCenter server as well as the specific licensing model available to it, how to install the vCenter Server and the vCenter Server Inventory.","topics":["vCenter Server 5 and Licensing - Learning Outcomes","vSphere Infrastructure - Licensing","vCenter Server Installation","vCenter Server Inventory","Managing vCenter Server","Planning vCenter Server Deployment","Troubleshooting vCenter Server and Database","vCenter Server 5 and Licensing - Lesson Summary","vCenter Server 5 and Licensing Assessment"]},{"name":"Module","details":"Network Configuration","description":"In this module, you will learn how to configure networks. Network configuration is the process of assigning network settings, policies, flows, and controls. Learn also how to create and modify virtual networks using CLI as well as vSphere Distributed Virtual Switches.","topics":["Configuring Networking - Learning Outcomes","Creating and Modifying Virtual Networks","vSphere Distributed Virtual Switches","Creating and Modifying Virtual Networks Using CLI","Configuring Networking - Lesson Summary","Configuring Networking Assessment"]},{"name":"Module","details":"Configuring Storage","description":"In this module, you will learn about configuring storage. Get to study the basic storage terms and how the Internet Small Computers Systems Interface provides access to storage across a TCP/IP network. Also, you will learn about the Virtual Machine File System volumes.","topics":["Configuring Storage - Learning Outcomes","Storage Concepts","iSCSI Storage (GUI & Command Line)","Fibre Channel Storage","VMFS Datastores (GUI & Command Line)","NAS Storage and NFS Datastores (GUI & Command Line)","Raw Device Mapping (RDM)","Configuring Storage - Lesson Summary","Configuring Storage Assessment"]},{"name":"Module","details":"Diploma in VMware Ultimate Bootcamp vSphere 5 - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["First Assessment"]},{"name":"Module","details":"VM Creation, Configuration, and Snapshots","description":"In this module, you will learn about VM Creation, Configuration, and Snapshots. It starts by explaining Virtual Appliances and how to make good use of them. Learn about Virtual Machine Startup/Shutdown.","topics":["VM Creation, Configuration, and Snapshots - Learning Outcomes","Creating a Virtual Machine","Create Multiple VMs, Templates & Clones","Virtual Appliances","VMware Converter (P2V – V2V)","Managing Virtual Machines","Virtual Machine Startup/Shutdown","Virtual Machine Snapshots","vSphere Web Client","Virtual Machine Troubleshooting & Best Practices","VM Creation, Configuration, and Snapshots - Lesson Summary","VM Creation, Configuration, and Snapshots Assessment"]},{"name":"Module","details":"Security and Permissions","description":"In this module, you will learn about Security and Permissions from how permissions are granted by pairing a group with a role assigned to an inventory object. Learn also how UNIX can use multiple authentication protocols.","topics":["Security and Permissions - Learning Outcomes","Controlling User Access and Passwords","ESXi Active Directory (AD) Integration","Managing Firewalls","Secure Shell (SSH) Access","The root Account","VMsafe and vShield","Security and Permissions - Lesson Summary","Security and Permissions Assessment"]},{"name":"Module","details":"Server and VM Monitoring","description":"In this module, you will learn about Server and VM Monitoring. It explains how VMkernel dynamically deduplicates VMs’ memory pages to physical memory. Learn also that Transparent Memory Compression only happens when a host is under memory pressure.","topics":["Server and VM Monitoring - Learning Outcomes","Optimizing Resources","Performance Monitoring","Configuring Alarms","ESXi and vCenter Logs","Server and VM Monitoring - Lesson Summary","Server and VM Monitoring Assessment"]},{"name":"Module","details":"Advanced ESXi and vCenter Server Management","description":"In this module, you will learn about Advanced ESXi and vCenter Server Management. It explains Storage Views and Topology Maps and how they are useful for vMotion. Learn also that Storage vMotion requires ESXi 5 supports NFS.","topics":["Advanced ESXi and vCenter Server Management - Learning Outcomes","Storage Views & Topology Maps","Storage vMotion","Configuring vMotion","Distributed Resource Scheduler (DRS) Cluster","Datastore Clusters & Storage DRS (SDRS)","Resource Pools and Monitoring","Host Profiles","Linked Mode Group of vCenter Servers","vSphere Storage Appliance (VSA)","Advanced ESXi and vCenter Server Management - Lesson Summary","Advanced ESXi and vCenter Server Management Assessment"]},{"name":"Module","details":"Patching and Upgrading ESXi","description":"In this module, you will learn about Patching and Upgrading ESXi. It explains the process in the Update Manager vSphere Client Plugin. Learn how it runs processes when upgrading vCenter 4.1 to 5.0.","topics":["Patching and Upgrading ESXi - Learning Outcomes","Patching ESXi Standalone Hosts","Patching with Update Manager","Upgrades and Migrations","Patching and Upgrading ESXi - Lesson Summary","Patching and Upgrading ESXi Assessment"]},{"name":"Module","details":"Disaster Recovery and Backup","description":"In this module, you will learn about Disaster Recovery and Backup. You will discuss the VMware Site Recovery Manager (SRM) and its new features. The module also outlines how network problems can create Host Isolation conditions.","topics":["Disaster Recovery and Backup - Learning Outcomes","Site Recovery Manager (SRM)","High Availability (HA)","Virtual Machine Fault Tolerance","Microsoft Clustering","Backup Strategies","VMware Data Recovery","Third Party Backups","Disaster Recovery and Backup - Lesson Summary","Disaster Recovery and Backup Assessment"]},{"name":"Module","details":"Diploma in VMware Ultimate Bootcamp vSphere 5 - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in VMware Ultimate Bootcamp vSphere 5 - Final Assessment"]}]}