{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3326","title":"Diploma in Building and Installation of Embedded Systems","totalEnrolled":"1,582","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the intricacies of building electronic projects with the use of embedded systems in this free online course.","description":"This free online course discusses the digital interfacing of the MSP430 microcontrollers as well as the building and installation of embedded systems. You will learn how to download and install software for the MSP430 microcontroller, and how to plan and build electronic projects. This course will teach you the relevant skills required to manipulate, plan and build projects using an embedded system.","courseOutcomes":["Identify the types of clock sources ...","Explain the concept of Interrupts...","Estimate the average values of pulse...","Describe the features of the timer c...","Identify the types of clock sources in MSP430 microcontrollers","Explain the concept of Interrupts","Estimate the average values of pulse width modulation signals in an MSP430 microcontroller","Describe the features of the timer capture mode","Explain how to generate random numbers with an MSP430 microcontroller","List the aims and objectives of an electronic project","State the types of programmable logic devices","Identify the types of clock sources ...","Explain the concept of Interrupts...","Estimate the average values of pulse...","Describe the features of the timer c...","Identify the types of clock sources in MSP430 microcontrollers","Explain the concept of Interrupts","Estimate the average values of pulse width modulation signals in an MSP430 microcontroller","Describe the features of the timer capture mode","Explain how to generate random numbers with an MSP430 microcontroller","List the aims and objectives of an electronic project","State the types of programmable logic devices"],"courseDescription":"<p>An embedded system is a microprocessor-based computer hardware system designed to perform a particular function. In this course, you will learn how to build and install one of the most popular applications of the embedded system – the microcontroller. The course begins by showing you how to download and install the most important software for the MSP430 microcontroller (Git and Code Composer Studio [CCS]). Git is a free and open-source distributed version control system designed to handle small or large files with speed and efficiency. CCS is an integrated development environment used to develop applications for Texas Instruments embedded processors and microcontrollers, such as the MSP430 microcontrollers. You will study how to import existing projects from the Git-cloned path to CCS. The structure of the embedded C programming code will be discussed. You will also consider how to connect the MSP430 LunchBox to a computer and write programs to manipulate the bits and pins of the microcontroller. The digital inputs and output registers, their attributes as well as the configurations of the pull-up and pull-down resistors will be discussed. You will be imparted on the functions of a switch and observe how to interface an MSP430 microcontroller with a switch. Thereafter, you will be introduced to the most important parts of the ecosystem for a microcontroller to function efficiently. The clock and time sources, and their module, types and registers will be scrutinized. Also, you will be introduced to the concept of Interrupts, a mechanism that gives a sense of multitasking. The classification, sources and registers of Interrupts will be highlighted.</p><p>Next, you will study some of the important features of embedded systems, which include their ability to count and measure time and events, create analog waveforms using digital controls, their ability to read external analog voltages, and more. The Timer_A module, which is common with the MSP430 microcontroller and its mechanisms, will be covered. You will study how the timer operates in MSP430 microcontrollers, and with the MSP430G2553 microcontroller as an example the components and sources of a timer in the device will be clarified. Then, the various methods of generating pulse width modulation (PWM) signal as well as the software and hardware approaches to generating analog voltages with PWM signals will be examined. You will learn how to read external analog voltages with the analog-to-digital converter. Information like temperature, pressure, distance or light intensity are all continuous in nature and so there is a need to convert those continuous parameters (voltage) into discreet numbers and values. You will study how the microcontroller can generate random numbers with a random number generator. The two types of random number generators, the true hardware random number generator and the pseudo-random number generator, will be highlighted. The three kinds of communication protocols available in MSP430, including their advantages and disadvantages, will be highlighted. You will also be taught how to use a timer for capturing external or internal events.</p><p>The significance of the external hardware components of embedded computers will be discussed in the last section of the course. You will also be given a comprehensive run-through on all aspects to consider when building an electronic project. Though this course is about building an electronics project, it should also be seen as a larger framework for planning to create an entire project. You will be taken through the “ten commandments” of building an electronic project, including the requirements, aims, objectives and deliveries of the project, and visualization. The four types of circuit prototyping methods (the breadboard, zeroboard, manhattan style and the custom printed circuit board), their strengths and weaknesses, and their respective tools for prototyping will be emphasized. The ten steps involved in cutting and preparing a custom printed circuit board fabrication using the toner transfer method, which is the fastest way of making custom printed circuit boards, will be explained. Also, you will learn about the finite state machine and datapath. Also, the planning, testing and implementation of an electronics project will be illustrated in a wirelessly powered art installation using an MSP430 microcontroller. Studying the processes involved in building and installing an embedded system will empower you to plan, build and implement a complete system project with the use of important hardware components in the embedded systems. So, why wait? Start your learning journey today.</p><a href=\"https://alison.com/resume/courses/3326\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3326\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Digital Inputs and Outputs of MSP430","description":"In this module, you will be introduced to the digital input and output devices of the MSP430 microcontroller. You will be shown how to download and install appropriate software such as GIT and Code Composer Studio for the MSP430 on your desktop or laptop computer. The structure of the embedded C programming language will be explained, as well as how to connect a laptop or desktop computer to the MSP430 lunchbox. Lastly, the concept of the clock and reset in the MSP430 will be covered.","topics":["Learning Outcomes - Digital Inputs and Outputs of MSP430","Introduction to GIT, CCS Installation and Embedded C","MSP430 Digital Inputs and Outputs","MSP430 Digital Input and Output: Switch Interfacing","MSP430 Clock System and Reset","Lesson Summary - Digital Inputs and Outputs of MSP430"]},{"name":"Module","details":"Introduction to Interrupts in MSP430","description":"In this module, you will be introduced to the concept of Interrupts. An interrupt is a mechanism that gives a feeling of multitasking. The classification, as well as sources of Interrupts, will be explained in this module. Registers of the Interrupt will be introduced and you will also study the variables of Interrupts. Lastly, you will learn how to connect additional input and output devices to the MSP430 microcontroller for human interaction.","topics":["Learning Outcomes - Introduction to Interrupts in MSP430","Interrupts in MSP430","Interrupts in MSP430 Roundup","Interfacing Seven Segment Displays with MSP430","Interfacing Liquid Crystal Displays(LCD)","Lesson Summary - Introduction to Interrupts in MSP430"]},{"name":"Module","details":"Introduction To Timers in MSP430","description":"In this module, you will be introduced to Timers in MSP430. The Timer_A module, which is common with the MSP430 microcontroller and its components will be discussed. The Pulse Width Modulation (PWM) signal, one method of generating analog voltages will be introduced. You will consider both the software and hardware approaches to generating PWM signals in this module. Lastly, you will also learn the ability to read external analog voltages using an Analog to Digital Converter (ADC).","topics":["Learning Outcomes - Introduction To Timers In MSP430","MSP430 Timer Module: Introduction and Timer Capture","Pulse Width Modulation using Timer Capture","Analog to Digital Converter in the MSP430","Lesson Summary - Introduction To Timers in MSP430"]},{"name":"Module","details":"First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 1-3 of the course.","topics":["First Assessment"]},{"name":"Module","details":"Communication Protocols on MSP430","description":"In this module, you will be introduced to the various communication protocols on MSP430. You will examine how the microcontroller can generate random numbers using the Linear Feedback Shift Register (LFSR), as well as communicate with the outside world using the various MSP430 communication protocol methods. The Serial Communication Protocols and the Serial Command Systems will be highlighted. Lastly, you will study how to use a timer to capture an internal and external event in MSP430.","topics":["Learning Outcomes - Communication Protocols in MSP430","ADC and DAC using R2R Ladder and Random number generation using LFSR","Serial Communication Protocols, USCI Module in MSP430","MSP430 Timer in Capture Mode","Lesson Summary - Communication Protocols on MSP430"]},{"name":"Module","details":"Building a Printed Circuit Board","description":"In this module, you will be shown how to program a microcontroller. You will learn how to create a mechanism where multiple activities are taking place in a microcontroller using Multiplexing and Interrupts. The requirements, aims, and objectives to consider when starting a project will be highlighted. Also, the methods, merits, as well as demerits of the methods of circuit prototyping will be examined. Lastly, you will learn how to cut and prepare a custom circuit board.","topics":["Learning Outcomes - Building a Printed Circuit Board","Coding Ninja","Building an Electronics Project","Circuit Prototyping Techniques","Lesson Summary - Building a Printed Circuit Board"]},{"name":"Module","details":"Single Purpose Computers and Project Demonstration","description":"In this module, you will learn about the Finite State Machine (FSM) and Datapath, which represent all the functional elements that process data under the control of the FSM. Then, you will study how to write a problem statement and the types of Programmable Logic Devices. Lastly, you will be taught how to plan, test, and implement an MSP430 microcontroller project in a wirelessly powered art installation project.","topics":["Learning Outcomes - Single Purpose Computers and Project Demonstration","Single Purpose Computers","Single Purpose Computers Roundup","Project Demonstration","Lesson Summary - Single Purpose Computers and Project Demonstration"]},{"name":"Module","details":"Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 4-6 of the course.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Diploma in Building and Installation of Embedded Systems"]}]}