{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4750","title":"Diploma in Microsoft Windows 11 Operating System","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to enjoy a simplified and more highly secured experience with Microsoft Windows 11 in this free online course.","description":"Windows 11, dubbed the ‘next-generation Windows’, is a free upgrade for compatible Windows 10 PCs. This course takes you on a tour of the beautiful world of Windows 11. One by one, you'll meet all the new features provided by this redesigned operating system and become familiar with all of its capabilities. You'll then head to OneDrive, where you'll find Word, Excel, PowerPoint and other apps that you may use right from the app launcher.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Microsoft Windows is the platform used by more than a billion people worldwide to create, socialise, educate and work. This course is ideal for those who wish to master the most recent version of Windows to its fullest capabilities. You'll first learn how to upgrade your Windows for free and then you'll discover its stunning interface and all the improvements it brings. After that, you'll learn how to customise the desktop and manage apps. You'll go to 'settings' and explore several options and functions before finding the best ways to keep your Windows secure, including running antivirus software and updating Windows drivers.</p><p>The course then introduces a crucial part of Windows 11, Microsoft OneDrive, a cloud service that allows you to store and share your photo and files with others safely. You'll explore the app launcher and the applications used through OneDrive, such as Microsoft Word, Excel, PowerPoint, Outlook and OneNote. You'll learn how to create files, spreadsheets, presentations and notes and save them to OneDrive. Finally, we will demonstrate Microsoft Forms and how to construct forms surveys, using Outlook for emailing and collaborating.</p><p>This course provides tips and tricks for improving your digital security and online privacy. You'll begin by creating strong and complex passwords using the LastPass extension and enable two-factor authentication (2 FA) for data and privacy security. Installing Security Software and Folder Guard is among the best suggestions for device security. This course teaches you all you need to know to use Windows 11 as an expert and enjoy every minute you spend in front of a computer.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}