{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3208","title":"Diploma in SQL 2014 Developer : T-SQL and .NET Code","totalEnrolled":"2,259","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamentals of using the T-SQL and .NET code in SQL 2014 Developer with this free online course.","description":"This free online course will introduce you to the basics of T-SQL and .NET codes with respect to SQL 2014 Developer. SQL Server 2014 delivers mission-critical performance across all workloads with in-memory built-in, faster insights from any data with familiar tools, and a platform for hybrid cloud enabling organizations to easily build, deploy and manage solutions that span on-premises and cloud-based capabilities.","courseOutcomes":["Summarize views and how to create th...","List the different tools for creatin...","Explain how to create stored procedu...","Analyze how to test and debug a stor...","Summarize views and how to create them","List the different tools for creating a view","Explain how to create stored procedures","Analyze how to test and debug a stored procedure","Outline the differences between an inline function and multi-statement","Identify how to create a trigger","Discuss transactions in SQL","Compare and contrast between the scalar function and user-defined function","Summarize SQL's common language runtime","Summarize views and how to create th...","List the different tools for creatin...","Explain how to create stored procedu...","Analyze how to test and debug a stor...","Summarize views and how to create them","List the different tools for creating a view","Explain how to create stored procedures","Analyze how to test and debug a stored procedure","Outline the differences between an inline function and multi-statement","Identify how to create a trigger","Discuss transactions in SQL","Compare and contrast between the scalar function and user-defined function","Summarize SQL's common language runtime"],"courseDescription":"<p>SQL Server is one of the most powerful data platforms in the world and the .NET Framework is one of the most popular software frameworks for developing software that runs primarily on Microsoft Windows. Imagine what you can do if you combine these two technologies. The possibilities are endless. SQL Server 2014 Developer Edition offers the full feature set of SQL Server 2014 Enterprise Edition and allows you to build almost any kind of data solution on top of SQL Server. Firstly, you will be introduced to how data is structured in a relational database. Views are a special version of tables in SQL; they provide a virtual table environment for various complex operations. You will learn how to use views, the tools for creating views, how to update data using a view as well as the types of views in SQL. Then you will learn about stored procedures, the syntax for creating them and how to return data from a stored procedure.</p><p>Every programmer has been through the agony of finding bugs/errors in their code and ended up with the challenge of debugging it and making the code error-free. But the question here is what does debugging really stand for and how can it fix the code? You will learn how to properly test and debug a stored procedure and explore the rich support that debugging has in language development tools such as Visual Studio. An SQL trigger is a database object which fires when an event occurs in a database. For example, if you want to increase the number of blogs in the Reports table when a new record is inserted in the Blogs table, we can create a trigger on the Blogs table and update the Reports table by increasing the blog count to 1. You will learn more on this this and how to use a trigger in this course.</p><p>Lastly, you will be introduced to the different types of functions and how they are properly implemented in our codes. Then you will learn about how transactions in your application interact with SQL Server, by starting and ending transactions at points then enforcing the logical consistency of the data relative to any business rules that may apply. You will also learn about explicit functions. An explicit transaction wraps up all the rows in a transactional batch and commits them as a single unit of work. If an error occurs on any row, all of the rows roll back. Error handling in SQL Server gives us control over the Transact-SQL code. For example, when things go wrong, we get a chance to do something about it and possibly make it right again. You will learn how to use the try/catch error handling and the fundamentals of SQL's common language runtime. This course is a must for coders, programmers and developers or anyone involved in data solutions who wants to learn more about Microsoft SQL Server Developer.</p><a href=\"https://alison.com/resume/courses/3208\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3208\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Views","description":"In this module, you will be introduced to Views in SQL 2014 Developer. Next, you will learn about the tools that are used for creating Views and how they are used. You will also learn about how to create views that select data from other views, how to update data using a view and common table expressions in the context of views. Lastly, you will learn about Columns and Indexed views","topics":["Views - Learning Outcomes","Introduction to Views","Tools for Creating Views","View Examples","Updating Data Using a View","Columns and Indexed Views","Views - Lesson Summary","Views - Assessment"]},{"name":"Module","details":"Stored Procedures","description":"In this module, you will learn about Stored Procedures, the syntax for creating them as well as their features in SQL. Next, you will learn about how to create Stored Procedures and how parameters let you write generalize code that works in a variety of situations. You will also learn how to return data from a stored procedure and declare multiple variables at the same time in a single statement","topics":["Stored Procedures - Learning Outcomes","Introduction to Stored Procedures","Creating Stored Procedures","Returning Data From","Stored Procedures - Lesson Summary","Stored Procedure - Assessment"]},{"name":"Module","details":"Working with Stored Procedures","description":"In this module, You will be introduced to Testing and Debugging Stored Procedures. You will learn about the rich support that debugging has in language development tools such as Visual Studio and how to use the debugging tool in Management Studio. You will also how to execute with Result Sets as well as how to create Triggers and the different types of Triggers in SQL Server.","topics":["Working with Stored Procedures - Learning Outcomes","Testing and Debugging Stored Procedures","Execute with Result Sets","Creating Triggers","Working with Stored Procedures - Lesson Summary","Working with Stored Procedures - Assessment"]},{"name":"Module","details":"Functions","description":"In this module, you will be introduced to Overview and Scalar Functions. Next, you will learn about the Inline Table-Valued Function and the Multi-Statement Table-Valued Function. You will learn about the syntax of these functions as well as how they are implemented. Then you will learn about Views and Stored Procedures in SQL","topics":["Functions - Learning Outcomes","Overview and Scalar Functions","Inline Table-Valued Functions","Multi-Statement","Views and Stored Procedures","Functions - Lesson Summary","Functions - Assessment"]},{"name":"Module","details":"Transactions","description":"In this module, you will learn about Transaction Concepts and how they are used in applications that interact with SQL Server. Next, you will learn about Application Transactions and the guidelines you can use to create efficient transaction applications. You will also learn about creating explicit transactions as well as structured error handling in SQL","topics":["Transactions - Learning Outcomes","Transaction Concepts","Applications and Transactions","Creating Explicit Transactions","Structured Error Handling","Transactions - Lesson Summary","Transactions - Assessment"]},{"name":"Module","details":"Common Language Runtime","description":"In this module, you will be introduced to the Common Language Runtime (CLR) in SQL. Next, you will learn how to write and deploy SQL CLR applications and run them within SQL Server. The module further analyzes the SQL Data types, their similarities as well as their differences. Then you will learn about the three layers of security involved in accessing external resources and SQLCLR Permission Sets","topics":["Common Language Runtime - Learning Outcomes","Introduction to SQLCLR","Writing SQL CLR Code","Using SQL CLR Code","SQL CLR Code Modules","SQL CLR Security","Common Language Runtime - Lesson Summary","Common Language Runtime - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in SQL 2014 Developer P1: T-SQL and .NET Code - Course assessment"]}]}