{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4263","title":"Diploma in a Beginner's Guide to Photoshop","totalEnrolled":"6,359","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to use Adobe Photoshop to help you become an effective graphic designer.","description":"Master Adobe Photoshop and polish your graphic design skills with this free online diploma course that doesn’t require any prior experience with programming, photography or design. We start with the basics and work our way to Photoshop’s more advanced features step by step. The course delves into ‘secret’ hacks and techniques used by professionals to help you to join their ranks. Sign up to add this valuable skill to your portfolio.","courseOutcomes":["Analyze Photoshop’s interface...","Describe the program’s documents ...","List common tools and utilities in P...","Explain the concept of ‘layers’ and ...","Analyze Photoshop’s interface","Describe the program’s documents","List common tools and utilities in Photoshop","Explain the concept of ‘layers’ and ‘mask’ functions","Compare Photoshop's various selection tools","Define ‘smart objects’","Distinguish between adjustment layers and filters","Discuss camera raw, 3D, video and Creative Cloud features in Photoshop","Analyze Photoshop’s interface...","Describe the program’s documents ...","List common tools and utilities in P...","Explain the concept of ‘layers’ and ...","Analyze Photoshop’s interface","Describe the program’s documents","List common tools and utilities in Photoshop","Explain the concept of ‘layers’ and ‘mask’ functions","Compare Photoshop's various selection tools","Define ‘smart objects’","Distinguish between adjustment layers and filters","Discuss camera raw, 3D, video and Creative Cloud features in Photoshop"],"courseDescription":"<p>This course lays out the fundamentals of Adobe Photoshop before exploring its more complex features. We aim to keep things simple and take you from novice to expert step by step. Even if you're just getting started, you'll be amazed at how simple but powerful Photoshop can be, which is why it remains one of the world’s most popular programs with a wide range of uses. Whether you're trying to jumpstart your creative career or add a new skill to your toolkit, now is the time to sign up for this course. We begin with an introduction to the program and move through Photoshop’s interface until you can employ its sophisticated transforming, wrapping and image-editing features.</p><p>The course then explores ways to help you work more efficiently in Photoshop, starting with keyboard shortcuts that you can customize along with the program’s interface. We then examine the important concept of ‘layers’ in Photoshop before moving on to more powerful tools and features: warping, compositing, retouching image adjustments and colour-correction filters, adding text and vector shapes, camera, raw footage and even video in 3D. We demonstrate the use of such features to make you an expert as you tackle more advanced projects. Ideally, you should have Photoshop on your computer while taking this course so you can follow all the examples and mini-projects we provide while you learn.</p><p>We guide you through Photoshop's popular techniques for retouching portrait photography via frequency separation as we tackle various creative projects to demonstrate how to use advanced features like masking, painting, blending and compositing multiple images and much more. This course covers all the features you need to master to become a capable graphic designer. We then investigate Photoshop documents and explain how to create and navigate them while providing tips and tricks to allow you to open them faster. We conclude the course with an overview of digital images, which you require before diving into advanced image editing. Photoshop is used industry-wide because of its versatility and power to shape the visual world, so sign up for this diploma course to enrich your resume and skills.</p><a href=\"https://alison.com/resume/courses/4263\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4263\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Photoshop","description":"Adobe Photoshop is a graphics editing tool (also known as image editing software) that lets you create and manipulate visual images on your computer. In this module, we'll begin with the basics we'll walk you through Photoshop's interface, you get to work with Photoshop documents, and you will understand what digital images are.","topics":["Learning Outcomes","Understanding Photoshop's Interface","Working with Photoshop Documents","Understanding Digital Images","Lesson Summary"]},{"name":"Module","details":"Utilities and Tools","description":"In this module, we'll learn about some of the most common utilities you'll need to know in Photoshop. We'll learn how to use rulers and guides, we'll see them in action as we walk through a mini project to slice up multiple images and export them. We'll also learn how to use grid-snapping tools.","topics":["Learning Outcomes","Common Utilities in Photoshop","Layers and Masks","Mastering Photoshop's Selection Tools","Lesson Summary"]},{"name":"Module","details":"Smart Objects, Retouching and Compositing","description":"In this module, we introduce you to smart objects. We'll start by explaining what smart objects are and why it's beneficial to use them. From there, you'll learn how to create them and how to edit them. And lastly, you'll learn how to open images as smart objects.","topics":["Learning Outcomes","Working with Smart Objects","Transforming, Straightening and Warping","Retouching, Compositing and Editing Tools","Lesson Summary"]},{"name":"Module","details":"Adjustment Layers and Filters","description":"In this module, we'll learn about Photoshops Sky Replacement feature. This tool is intended to replace blown-out or unappealing skies from images with more sharp and appropriate alternatives, as well as make tweaks to the rest of the image to give it a more authentic feel.","topics":["Learning Outcomes","Adjustment Layers","Working with Filters","Working with Type and Vector Shapes","Lesson Summary"]},{"name":"Module","details":"Camera Raw, 3D and Video","description":"In this module, we cover the core fundamentals of working in-camera Raw. We'll start by understanding why raw images are so important. Then we'll jump into Photoshop to see the special interface that Photoshop has for editing raw images. From there, we'll learn how Photoshop saves our Raw edits and how to apply the Camera Raw filter to images.","topics":["Learning Outcomes","Working with Camera Raw","Video and 3D in Photoshop","Creative Cloud Features","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in a Beginner's Guide to Photoshop - Course Assessment"]}]}