{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3683","title":"Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech Ult. Bootcamp","totalEnrolled":"435","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the multiple vCenter upgrade requirements, as well as vSphere firewall management.","description":"This free online course on VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech teaches you about the core of VMTraining's data centre and ESXi host licensing model. You will learn about the three modes of Extended Virtual Graphic Processing Unit (vGPU). Study how to manage ESXi firewalls, VSAN cluster configuration, as well as Virtual NIC drivers. We'll also cover the specifications of the vCenter Virtual Appliance (vCSA). Upskill yourself now!","courseOutcomes":["Outline the components of VMTraining...","Explain the working system of VMTrai...","List the components of the VM hardwa...","Distinguish between clones and templ...","Outline the components of VMTraining's datacenter","Explain the working system of VMTraining's Network IP Setup","List the components of the VM hardware","Distinguish between clones and templates","Describe the features of the different storage APIs in vSphere","Identify the functions, new features and components of vSphere Storage Appliance (VSA)","Explain the Virtual SAN cluster configuration","Outline how to configure ESXi firewall via the vSphere web client","Outline the components of VMTraining...","Explain the working system of VMTrai...","List the components of the VM hardwa...","Distinguish between clones and templ...","Outline the components of VMTraining's datacenter","Explain the working system of VMTraining's Network IP Setup","List the components of the VM hardware","Distinguish between clones and templates","Describe the features of the different storage APIs in vSphere","Identify the functions, new features and components of vSphere Storage Appliance (VSA)","Explain the Virtual SAN cluster configuration","Outline how to configure ESXi firewall via the vSphere web client"],"courseDescription":"<p>Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade &amp; New Tech Ult. Bootcamp is a free online course that has been specifically designed to introduce you to vCenter upgrade requirements and vSphere firewall management processes. This course highlights the requirements for the Certified Virtualization Expert (CVE) exam. Did you know that there are three modes of Extended Virtual Graphic Processing Unit (vGPU)? Prepare yourself to learn about the concepts and features of vGPU. You will be introduced to the goals, as well as functions of Software-Defined Datacenter (SDDC). We'll take you through the multiple types of Virtual NIC drivers (vNics), as well as the functions of VMware converters and post-conversion steps. Clones, along with templates, are key concepts to understand in this course. The course will introduce you to their differences. The update manager is an important tool in vCenter. Completing this course will expand your knowledge on how to upgrade hosts using the update manager.</p><p>We'll go on to explain the different virtual switch types in version 5.x, and you will learn about the features and functions of vSphere Distributed Virtual Switches (VDS). Are you aware that there are different storage APIs in vSphere? Prepare yourself to learn about their various functions. The Cisco Discovery Protocol is also an important concept to understand, and you will learn how to manage its capabilities. We will also guide you through the two types of storage capabilities. Multipathing with iSCSI software is necessary, and we'll look at the two ways to discover iSCSI targets. We'll explain the architecture of fibre channels, as well as how to scan fibre channels LUNs. There are new updates in Virtual Machine File System (VMFS-5) version 5.5. Once you've completed this course, you will be able to explain its advantages, along with the disadvantages of upgrading an existing volume from VMFS-3 to VMFS-5.</p><p>Furthermore, we'll expand your knowledge on the relationship between Network Attached Storage (NAS) and ESXi. You will learn about the importance of vSphere's Storage API for Storage Awareness (VASA). We'll highlight the functions of vSphere 5.x ESXi image builder CLI. For better understanding, you must learn about the management of the ESXi host and vCenter Server. There are different functions of VMware's Site Recovery Manager (SRM). You will learn about the architecture and recovery process of VMware's Site Recovery Manager (SRM). Approaching the end of the course material, you will learn about the requirements of the vSphere web client and managing ESXi firewalls. This course will be of great interest to students, researchers, and anyone interested in understanding VMware vSphere 4.x/5.x to 5.5 Upgrade &amp; New Tech Ult. Bootcamp. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3683\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3683\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"vCenter Training and Requirements","description":"To start, this module will introduce you to the functions and goals of the Software-Defined Datacenter (SDDC). You will also be introduced to how to use the update manager to upgrades hosts, as well as the two processes involved in upgrading virtual machines.","topics":["vCenter Training and Requirements - Learning Outcomes","Introduction to VMTraining","Overview of vSphere 5.x New Technology","Upgrades and Migrations to vSphere 5.5","vCenter Training and Requirements - Lesson Summary","vSphere Training and Requirements - Assessment"]},{"name":"Module","details":"vCenter Server Management","description":"To start, this module will introduce you to the enhancements in VM hardware and functions of host profiles. You will also be introduced to the functions, as well as specifications of the vCenter Virtual Appliance (vCSA).","topics":["vCenter Server Management - Learning Outcomes","Virtual Machine Enhancements","Host Deployment Options","vCenter Server Management","vCenter Server Management - Lesson Summary","vCenter Server Management - Assessment"]},{"name":"Module","details":"Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech Ult. Bootcamp - First Assessment","description":"In order to pass this assessment, you will need to score 80 per cent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech Bootcamp - First Assessment"]},{"name":"Module","details":"Virtual Switches and Storage Concepts","description":"To start, this module will introduce you to the new features and functions of vSphere Distributed Switch (vDS) in version 5.0, as well as 5.1. You will also be introduced to the properties and architecture of fibre channels","topics":["Virtual Switches and Storage Concepts - Learning Outcomes","vSphere Distributed Switch (vDS)","Storage Concepts","Network Attached and Profile Driven Storage","Virtual Switches and Storage Concepts - Lesson Summary","Virtual Switches and Storage Concepts - Assessment"]},{"name":"Module","details":"Virtual SAN and Security Enhancements","description":"To start, this module will introduce you to the features and installation steps of vSphere Data Protection (VDP) 5.5. You will also be introduced to steps on configuring a virtual flash host swap, as well as read-cache.","topics":["Virtual SAN and Security Enhancements - Learning Outcomes","vSphere Data Protection and Replication","Virtual Flash and Virtual SAN","Security Enhancements","Virtual SAN and Security Enhancements - Lesson Summary","Virtual SAN and Security Enhancements - Assessment"]},{"name":"Module","details":"Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech Ult. Bootcamp - Second Assessment","description":"In order to pass this assessment, you will need to score 80 per cent or above. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech Bootcamp - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in VMware vSphere 4.x/5.x to 5.5 Upgrade & New Tech Bootcamp - Course Assessment"]}]}