{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1641","title":"Diploma in E-Commerce Web Development","totalEnrolled":"54,370","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to build an e-commerce website from scratch using PHP and SQL with this free online web development course.","description":"This diploma course teaches you how to develop a website to successfully drive e-commerce. We explain how to build an e-commerce website from scratch using HTML, CSS, Javascript, PHP and SQL. We then show you how to develop advanced e-commerce functionalities to display products online, using simple and effective CSS, PHP and SQL code in any development environment. This course can also help small businesses widen their customer base and grow.","courseOutcomes":["Demonstrate how to create an e-comme...","Display featured products correctly ...","Break down how ‘product detail modal...","Describe how the ‘init.php file’ is ...","Demonstrate how to create an e-commerce website from scratch, using PHP and the Bootstrap framework","Display featured products correctly on a web page using Bootstrap","Break down how ‘product detail modals’ are programmed to be dynamic","Describe how the ‘init.php file’ is used to connect the website to the database","Explain how SQL variables are written to connect to a database","Outline how the ‘checkout modal’ is created and connected to the payment gateway","Discuss how the 'Update Cart' and 'Add to Cart' functions are written in PHP and jQuery","Describe how to select ‘live’ or ‘test’ mode on the ‘Stripe’ website.","Demonstrate how to create an e-comme...","Display featured products correctly ...","Break down how ‘product detail modal...","Describe how the ‘init.php file’ is ...","Demonstrate how to create an e-commerce website from scratch, using PHP and the Bootstrap framework","Display featured products correctly on a web page using Bootstrap","Break down how ‘product detail modals’ are programmed to be dynamic","Describe how the ‘init.php file’ is used to connect the website to the database","Explain how SQL variables are written to connect to a database","Outline how the ‘checkout modal’ is created and connected to the payment gateway","Discuss how the 'Update Cart' and 'Add to Cart' functions are written in PHP and jQuery","Describe how to select ‘live’ or ‘test’ mode on the ‘Stripe’ website."],"courseDescription":"<p>This course explains how to use the PHP programming language to create a functioning e-commerce website from scratch. We introduce you to PHP and the Bootstrap CSS framework to enable you to market and sell products online. We also show you how to employ the open-source Atom editor, a powerful colour-coded interface that indicates whether code is correctly written. The course takes you through various web-development practices, including how to create drop-down menus (with classes, I.D.s and anchor tags), how to insert comments in ‘.php’ files, how to insert background and product images and how to use CSS to change the style and colour of web page elements.</p><p>We also demonstrate how to establish an SQL database using phpMyAdmin and how to create and customize product tables. Importantly, we show you how to link products in the database with the website until updating the 'back-end' also updates the website. The course breaks down how to add the ‘Shopping Cart’ feature to your website and how to configure the database using the payment gateway 'Stripe'.</p><p>This course suits anyone who is interested in web development or works in information technology (IT) and would like to polish their programming skills. E-commerce development is essential to many IT departments so mastering this skill can boost your career prospects. Small businesses rely on the internet to drive sales and establish their brands and this course can also open doors for them.</p><a href=\"https://alison.com/resume/courses/1641\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1641\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to E-Commerce Web Development","description":"This module covers the following topics: Introduction to the Course; Web Server and Web Site; Bootstrap and Atom; Creating a Navigation Bar; Menus and CSS; Inserting Images and Text; Styling and Re-sizing Images. Note: each module contains a learning outcomes list and a lesson (module) summary.","topics":["Introduction to E-Commerce Web Development - Learning Outcomes","Introduction to the Course","Bootstrap and Atom","Web Server and Web Site","Creating a Navigation Bar","Menus and CSS","Inserting Images and Text","Styling and Re-sizing Images","Introduction to E-Commerce Web Development - Lesson Summary"]},{"name":"Module","details":"Using MySQL and PHP","description":"In this module you will learn about MySQL and PHP and it covers topics such as Displaying Products Correctly; Footer and Modals; Programming Modals; Image Standards and Databases; SQL for Tables; Database Categories; Linking the Database.","topics":["Using MySQL and PHP - Learning Outcomes","Displaying Products Correctly","Footer and Modals","Programming Modals","Image Standards and Databases","SQL for Tables","Database Categories","Linking the Database","Using MySQL and PHP - Lesson Summary"]},{"name":"Module","details":"Dynamic Programming","description":"In this module you will learn about dynamic programming and it covers topics such as Organizing PHP files; Removing and Referencing Code; Using Variables; Referencing Variables; Dynamic Code; Modal Programming; Modal Dynamics.","topics":["Dynamic Programming - Learning Outcomes","Organizing PHP Files","Removing and Referencing Code","Using Variables","Referencing Variables","Dynamic Code","Modal Programming","Modal Dynamics","Dynamic Programming - Lesson Summary"]},{"name":"Module","details":"Enhancing Website Functionality","description":"This module explains how to enhance website functionality and it covers the following topics: Add to Cart Button; My Cart Menu Feature; Creating a Helper File; Session Identifiers.","topics":["Enhancing Website Functionality - Learning Outcomes","Add to Cart Button","My Cart Menu Feature","Creating a Helper File","Session Identifiers","Enhancing Website Functionality - Lesson Summary"]},{"name":"Module","details":"Diploma in E-Commerce Web Development - First Assessment","description":"This assessment is a knowledge test, based on content covered in Modules 1 - 4. If you are not successful in your first attempt, you can re-take the assessment, until a successful outcome is achieved.","topics":["Diploma in E-Commerce Web Development - First Assessment"]},{"name":"Module","details":"Shopping Cart and Payment Settings","description":"In this module you will learn about Shopping Cart and Payment Settings and it covers topics such as My Cart Variables; Shopping Cart Functionality; Shopping Cart Table; Adjusting Quantity and Price; Payment Settings.","topics":["Shopping Cart and Payment Settings - Learning Outcomes","My Cart Variables","Shopping Cart Functionality","Shopping Cart Table","Adjusting Quantity and Price","Payment Settings","Shopping Cart and Payment Settings - Lesson Summary"]},{"name":"Module","details":"E-Commerce Modals","description":"This module covers the following topics: Checkout Modal Code; Form Fields; Card Payment Modal; Modal Footer; jQuery Script; Stripe Connectivity.","topics":["E-Commerce Modals - Learning Outcomes","Checkout Modal Code","Form Fields","Card Payment Modal","Modal Footer","jQuery Script","Stripe Connectivity","E-Commerce Modals - Lesson Summary"]},{"name":"Module","details":"Shopping Cart Modal","description":"In this module you will learn about Shopping Cart Modal and it covers the following topics: Footer Functions, Parser Files; Add to Cart File; Check Address File; Update Cart File.","topics":["Shopping Cart Modal - Learning Outcomes","Footer Functions","Parser Files","Add to Cart File","Check Address File","Update Cart File","Shopping Cart Modal - Lesson Summary"]},{"name":"Module","details":"E-Commerce Payment Functionality","description":"This module covers the following topics: Stripe and Composer; Shopping Cart Functionality; Testing Payment Functionality; Thank You File; Thank You File Code; Creating the Thank You Page; Error Correction and Testing.","topics":["E-Commerce Payment Functionality - Learning Outcomes","Stripe and Composer","Shopping Cart Functionality","Testing Payment Functionality","Thank You File","Thank You File Code","Creating the Thank You Page","Error Correction and Testing","E-Commerce Payment Functionality - Lesson Summary"]},{"name":"Module","details":"Diploma in E-Commerce Web Development - Second Assessment","description":"This assessment is a knowledge test, based on content covered in Modules 5 - 8. If you are not successful in your first attempt, you can re-take the assessment, until a successful outcome is achieved.","topics":["Diploma in E-Commerce Web Development - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in E-Commerce Web Development - End of Course Assessment"]}]}