{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2231","title":"Diploma in Practical Machine Learning with Tensor Flow","totalEnrolled":"3,294","courseIncludes":["9-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamentals of machine learning and the application of TensorFlow in this free online course.","description":"This free online course on practical machine learning and TensorFlow will be particularly useful for technology companies, computer engineers. It will also be useful for Artificial Intelligence professionals who deal with data processing, as well as machine learning model building. By the end of this course, you will become more familiar with the concepts of TensorFlow, machine learning models and neural networks.","courseOutcomes":["Discuss the history and development ...","Distinguish between machine learning...","Explain the importance of a neural n...","Analyze the mathematical foundations...","Discuss the history and development of Tensorflow","Distinguish between machine learning and traditional programming","Explain the importance of a neural network playground","Analyze the mathematical foundations of deep learning","Explain the process of using TensorFlow API to build a deep learning model for regression problems","Discuss image classification and visualization","Explain the methods of improving model accuracy","Discuss the history and development ...","Distinguish between machine learning...","Explain the importance of a neural n...","Analyze the mathematical foundations...","Discuss the history and development of Tensorflow","Distinguish between machine learning and traditional programming","Explain the importance of a neural network playground","Analyze the mathematical foundations of deep learning","Explain the process of using TensorFlow API to build a deep learning model for regression problems","Discuss image classification and visualization","Explain the methods of improving model accuracy"],"courseDescription":"<p>This free online course in practical machine learning with TensorFlow will begin by introducing you to the concept of machine learning and the overview of TensorFlow. You will learn about the steps in the machine learning process, logistic regression and the loss unction in machine learning. You will also be introduced to gradient descent, gradient descent variations, machine learning visualization as well as confusion matrix.</p><p>The course then introduces the concept of tensors and their relevance. You will learn about the mathematical fundamentals of deep learning. You will also learn how to build data pipelines for TensorFlow as well as text processing with TensorFlow. Next, you will be introduced to machine learning models, text classification, overfitting, underfitting, regression and the architecture of neural network model.</p><p>The course then explains the meaning of convolution neural network and transfer learning. You will also learn about the pooling, and image classification and visualization. This course explains in great detail estimator API, boosted trees as well as word embeddings and its application. This course also explains the customization of TensorFlow, writing a custom layer as well as Tensorflow distributed training.</p><a href=\"https://alison.com/resume/courses/2231\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2231\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Tensorflow","description":"In this module, you will be introduced to a brief history of TensorFlow and the purpose of its creation. You will also be introduced to the basics of machine learning and data as an important prerequisite for machine learning.","topics":["Introduction to Tensorflow - Learning Outcomes","Overview of Tensorflow","Machine Learning Refresher","Steps in Machine Learning Process","Loss Function in Machine Learning","Gradient Descent","Introduction to Tensorflow - Lesson Summary"]},{"name":"Module","details":"Machine Learning Concepts","description":"In this module, you will be introduced to variations of gradient descent that are being employed in the practical machine learning training. You will also be introduced to machine learning concepts and the mathematical foundation of deep learning.","topics":["Machine Learning Concepts - Learning Outcomes","Gradient Descent Variations","Model Selection and Evaluations","Machine Learning Visualization","Deep Learning Refresher","Introduction to Tensor","Machine Learning Concepts - Lesson Summary"]},{"name":"Module","details":"Data Pipelines and Text Processing","description":"In this module, you will be introduced to the key operations on tensors in the context of Deep Learning. You will also be introduced to data pipeline building for Tensorflow and text processing with Tensorflow.","topics":["Data Pipelines and Text Processing - Learning Outcomes","Mathematical Fundamental of Deep Learning","Building Data Pipelines for Tensorflow I","Building Data Pipelines for Tensorflow II","Building Data Pipelines for Tensorflow III","Text Processing with Tensorflow","Data Pipelines and Text Processing - Lesson Summary"]},{"name":"Module","details":"Building Machine Learning Models","description":"In this module, you will be introduced to the different methods TensorFlow API can be used to build machine learning models. You will also be introduced to the concept and importance of saving and restoring models.","topics":["Building Machine Learning Models - Learning Outcomes","Classify Image","Regression","Classify Structured Data","Text Classification","Underfitting and Overfitting","Save and Restore Models","Building Machine Learning Models - Lesson Summary"]},{"name":"Module","details":"Diploma in Practical Machine Learning with Tensor Flow - First Assessment","description":"You more sore 80% or more to pass this assessment.","topics":["Diploma in Practical Machine Learning with Tensor Flow - First Assessment"]},{"name":"Module","details":"Convolutional Neural Network","description":"In this module, you will be introduced to a new neural network architecture known as Convolutional Neural Network (CNNs). You will also be introduced to image classification and visualization as well as transfer Learning with pre-trained CNNs and TensorFlow hub.","topics":["Convolutional Neural Network - Learning Outcomes","Convolutional Neural Networks","Key Operations in CNNs","Transfer Learning with Pre-trained CNNs","Transfer Learning with Tensorflow Hub","Image Classification and Visualization","Convolutional Neural Network - Lesson Summary"]},{"name":"Module","details":"Training and Embedding","description":"In this module, you will be introduced to the method of using Estimator API to create machine learning models. You will also be introduced to boosted tree classifiers and word embedding.","topics":["Training and Embedding - Learning Outcomes","Estimator API","Logistic Regression","Boosted Trees","Introduction to Word Embeddings","Convolutional Neural Network - Lesson Summary"]},{"name":"Module","details":"Introduction to Recurrent Neural Networks","description":"In this module, you will be introduced to recurrent neural networks (RNN) and RNN architectures, You will also be introduced to the process of using LSTM models for text generation.","topics":["Introduction to Recurrent Neural Networks - Learning Outcomes","Recurrent Neural Networks","Recurrent Neural Networks II","Time Series Forecasting with RNNs","Text Generation with RNNs","Introduction to Recurrent Neural Networks - Lesson Summary"]},{"name":"Module","details":"Training and Customizing","description":"In this module, you will be introduced to Tensorflow customization. You will also be introduced to the customization Tensorflow Keras sequential API and scaling strategies for TensorFlow models.","topics":["Training and Customizing - Learning Outcomes","Tensorflow Customization","Customizing Tensorflow Keras","Tensorflow Keras Concepts","Tensorflow Distributed Training","Training and Customizing - Lesson Summary"]},{"name":"Module","details":"Diploma in Practical Machine Learning with Tensor Flow - Second Assessment","description":"You more sore 80% or more to pass this assessment.","topics":["Diploma in Practical Machine Learning with Tensor Flow - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Practical Machine Learning with Tensor Flow - Final Assessment"]}]}