{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4005","title":"Diploma in Photo Editing","totalEnrolled":"7,525","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online photography course will teach you all the skills necessary to professionally edit and enhance photos.","description":"Hone your photography and editing proficiencies and learn the tips and tricks needed to create amazing images using Adobe Lightroom and Adobe Photoshop. This free online photography tutorial will equip you with advanced editing skills such as how to organize and export images with folders and subfolders, create presets along with technical editing techniques such as exposure blending, advanced object removal, and blending moments in time.","courseOutcomes":["Distinguish between a folder and a s...","State the importance of creating a p...","Explain the purpose of rating photos...","State the functions of Adobe Lightro...","Distinguish between a folder and a subfolder","State the importance of creating a photo catalog in Lightroom","Explain the purpose of rating photos in Adobe Lightroom","State the functions of Adobe Lightroom histogram","Identify various local adjustment tools in Adobe Lightroom and state their functions","Distinguish between a landscape and a cityscape image","Recall various shortcuts used in Adobe Lightroom","Recall the steps to creating presets in Adobe Lightroom","Recall the process of creating sun flare effects","State the image format and settings for exporting web design images","Discuss how to export presets","Distinguish between a folder and a s...","State the importance of creating a p...","Explain the purpose of rating photos...","State the functions of Adobe Lightro...","Distinguish between a folder and a subfolder","State the importance of creating a photo catalog in Lightroom","Explain the purpose of rating photos in Adobe Lightroom","State the functions of Adobe Lightroom histogram","Identify various local adjustment tools in Adobe Lightroom and state their functions","Distinguish between a landscape and a cityscape image","Recall various shortcuts used in Adobe Lightroom","Recall the steps to creating presets in Adobe Lightroom","Recall the process of creating sun flare effects","State the image format and settings for exporting web design images","Discuss how to export presets"],"courseDescription":"<p>Explore your photography range by taking this free online Diploma in Photo Editing and use it to level-up your abilities. This photography certificate takes you through from the very basic to more advanced enhancement techniques used in Adobe Lightroom and Adobe Photoshop and some of what you will learn includes the types of editing that can be done on portrait and landscape images, the import process and method to create catalogues and subfolders. You then move on to some technical aspects of setting tone curves, saturation, and luminance. Organizing your images in a logical way helps a lot when you are busy with many images and is particularly useful when you need to refer to a certain set of images for future projects and you will be taught how to use the image rating methods to group certain images together. Specific types of images need different kinds of editing techniques and some of what you will learn includes editing landscape, cityscape, lowlight and sunset images.&nbsp;&nbsp;</p><p>The following section of this free online photography class includes a Adobe Lightroom tutorial on creating presets in the software and how to manage them as well. There are many other effects that will further enhance your images including the dodge, burn, and Orton effect and these are all comprehensively covered. Ensuring that your images are fit-for-purpose is very important to ensure the correct specifications and quality and you will learn how to export different formats for use on social media, web design, and printing purposes. The next bit of content includes Adobe Photoshop tutorials where advanced skills will be taught that covers focus blending and exposure blending, and object removal using the lasso tool, spot healing brush and clone stamp brush.</p><p>You do not often get the perfect shot every time while you are out and about with your camera, however, Adobe Lightroom and Adobe Photoshop are there to add some post-production tools for you to take your near-perfect images and turn them into masterpieces. This is of course in addition to the powerful sorting and organizing features offered by these platforms to ensure efficiency when processing your images. Enrolling in this course can really assist you in getting the most out of your images and make you an all-round better photographer whether you are just starting out in your career or keen on doing it as a part-time hobby.</p><a href=\"https://alison.com/resume/courses/4005\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4005\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Adobe Lightroom","description":"In this module, you will be shown an overview of editing different types of photos in lightroom, this includes landscape images, cityscape, lowlight images, etc. You will learn how to set up the editing scene in lightroom, this includes how to import images, create folders, subfolders, and catalogs to aid a faster work rate.","topics":["Introduction to Adobe Lightroom - Learning Outcomes","Adobe Lightroom Overview","Advanced Organizing","Introduction to Adobe Lightroom - Lesson Summary"]},{"name":"Module","details":"Image Adjustment and Effects","description":"In this module, you will learn the functions of a histogram in Lightroom, you will be shown how to make quick edits with the local adjustment tools and how to set tone curves, you will also learn how to sharpen images and reduce the quantity of grain in an image, and also how to use the free transform tool to manipulate images.","topics":["Image Adjustment and Effects - Learning Outcomes","Histogram and Image Adjustment","Effects and Transformations","Image Adjustment and Effects - Lesson Summary"]},{"name":"Module","details":"Image Editing in Lightroom","description":"In this module, you will learn how to edit landscape images and cityscape images, you will learn the functions of shadow slider, and exposure and highlight sliders, and you will also learn how to edit other types of images which includes portrait images, lowlight, small sensor images, etc.","topics":["Image Editing in Lightroom - Learning Outcomes","Landscape, Cityscape and Lighting","Milkyway, Waterfall and Sunrise","Travel Portraits and HDR Panoramic","Image Editing in Lightroom - Lesson Summary"]},{"name":"Module","details":"Advanced Editing using Lightroom","description":"In this module, you will learn how to enhance images with the clone and heal tools, you will be shown how to import and manage your own presets, you will also learn how to make dreamy landscapes, how to create sun flare effects, and the functions of the graduated filter tool in Adobe Lightroom.","topics":["Advanced Editing using Lightroom - Learning Outcomes","Cloning, Dodge and Burn Effects","Orton Effect and Sunflare","Advanced Editing using Lightroom - Lesson Summary"]},{"name":"Module","details":"Image Exporting and Advanced Photoshop","description":"In this module, you will learn how to export your images for web design, social media, and printing, you will also learn about focus and exposure blending in photoshop, you will be shown some advanced techniques for removing objects.","topics":["Exporting and Advanced Photoshop - Learning Outcomes","Exporting Images","Advanced Photoshop","Exporting and Advanced Photoshop - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Photo Editing - Course assessment"]}]}