{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3284","title":"Diploma in Convolutional Neural Networks in Computer Vision","totalEnrolled":"563","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free course, learn about the application of convolutional neural networks to various computer vision tasks.","description":"Convolutional neural networks form the crux of most sophisticated computer vision applications such as auto-tagging on Facebook and facial security features. Are you curious to learn about the software behind popular technologies such as Siri and Google Translate? This free online course will satisfy your curiosity by explaining the features of neural networks in processing sequences such as text, sound, videos and images.","courseOutcomes":["Outline the role of convolutional ne...","Discuss the application of backpropa...","Identify the various CNN architectur...","Describe the methods for interpretin...","Outline the role of convolutional neural networks (CNNs) in analyzing images","Discuss the application of backpropagation in CNNs","Identify the various CNN architectures used for image classification","Describe the methods for interpreting and understanding the applications of CNNs","Explain the features of CNNs in image classification","Identify the prospects of the various features for discriminative localization","Describe the methods of identifying and locating objects within an image","Explain the process of splitting an image into different regions","Summarize the process of segmenting images using CNNs","Explain the role of recurrent neural networks (RNNs) in modeling sequence data","Define what exploding and vanishing gradient problems are in RNNs","Describe the methods of processing videos using CNNs and RNNs","Outline the role of convolutional ne...","Discuss the application of backpropa...","Identify the various CNN architectur...","Describe the methods for interpretin...","Outline the role of convolutional neural networks (CNNs) in analyzing images","Discuss the application of backpropagation in CNNs","Identify the various CNN architectures used for image classification","Describe the methods for interpreting and understanding the applications of CNNs","Explain the features of CNNs in image classification","Identify the prospects of the various features for discriminative localization","Describe the methods of identifying and locating objects within an image","Explain the process of splitting an image into different regions","Summarize the process of segmenting images using CNNs","Explain the role of recurrent neural networks (RNNs) in modeling sequence data","Define what exploding and vanishing gradient problems are in RNNs","Describe the methods of processing videos using CNNs and RNNs"],"courseDescription":"<p>Convolutional neural networks (CNNs) is one of the most significant breakthroughs in computer vision. The course introduces the fundamental operations and parameters of convolution. You will discover the significance of CNNs in overcoming the feedforward network’s challenges in filtering visual imagery. Following this, the application of the backpropagation algorithm across the various layers of CNNs is explained. In addition to this, the various functions of CNN architectures for extending the support beyond residual neural networks are described. The multiple approaches for understanding and visualizing CNNs are discussed. You will investigate the procedure for visualizing layer activations, retrieving images that maximally activate a neuron, and occluding parts of the image. This course explains the methods for interpreting and understanding CNN applications in analyzing images, and the prospects of the various features for discriminative localization.</p><p>Next, the course explains how to improve visual explanations for deep convolutional networks using gradient-weighted class activation maps. You will discover how deep lift and integrated gradients methods overcome saturating gradients and the necessity for using the XRAI method for better interpretability in terms of visual coherence. Following this, you will be taught how object detection was performed in the pre-deep learning era and how basic CNNs can be adapted to object detection. In addition to this, the segmentation of images using CNN architectures is explained. This process will include the linking of each pixel in an image to a class label using semantic image segmentation techniques. The concept of understanding and processing tasks for face recognition and verification are disclosed. You will explore some of the recent efforts that have used CNNs to perform face recognition tasks such as identification and verification.</p><p>Finally, you will determine how recurrent neural networks (RNNs) can perform the same task from the output of previous data, which will include the process of training RNNs using the backpropagation algorithm. The process of solving the vanishing gradient problem using changes in the architecture of an RNN is explained. You will discover how the vanishing gradient problem gave rise to the development of popular models such as gated recurrent units and long short-term memory. Finally, you will be taught about the method of processing videos using convolutional and recurrent neural networks. This is an enlightening course that will interest those studying computer science or those interested in these topics. Why wait? Sign up today and start learning about a class of artificial neural networks that have become dominant in various computer vision tasks.</p><a href=\"https://alison.com/resume/courses/3284\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3284\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Convolutional Neural Networks","description":"This module illustrates the connection between convolution and neural networks by considering the task of image classification. You will discover how the computer can perform image classification by looking for low-level features such as edges and curves and then building up to more abstract concepts through a series of convolutional layers.","topics":["Introduction to Convolutional Neural Networks – Learning Outcomes","An Overview of Convolutional Neural Networks","Backpropagation in Convolutional Neural Networks","CNN Architectures for Image Classification","Recent CNN Architectures","Fine-Tuning in CNN","Introduction to Convolutional Neural Networks – Lesson Summary"]},{"name":"Module","details":"Visualization and Understanding CNN's","description":"This module illustrates several approaches for understanding and visualizing convolutional neural networks in predicting models. You will discover how CNN using deep learning techniques outperformed the other methods in analysing images and interpreting and understanding the applications of convolutional neural networks in analysing images.","topics":["Visualization and Understanding CNN's – Learning Outcomes","Methods of CNN Visualization","Understanding the Methods of CNN","Class Attribution Map Methods","Recent Methods for Explaining CNN's","Beyond Explaining CNN's","Visualization and Understanding CNN's – Lesson Summary"]},{"name":"Module","details":"First Course Assessment","description":"","topics":["First Course Assessment"]},{"name":"Module","details":"Object Detection and Segmentation using CNN's","description":"This module explains the process of identifying parts of the image and understanding what object they belong to. You will discover the process of estimating the body’s configuration from a single monocular image and the method of identifying unexpected items or events in images that differ from the pattern.","topics":["Object Detection and Segmentation using CNN's– Learning Outcomes","CNN's for Object Detection","Dense Sampling Methods","CNN's for Segmentation","CNN's for Human Understanding: Faces","CNN's for Human Understanding: Human Pose and Crowd","CNN's for Other Image Tasks","Object Detection and Segmentation using CNN's– Lesson Summary"]},{"name":"Module","details":"Recurrent Neural Networks","description":"This module illustrates the underlying principle of recurrent neural networks saving the output of a particular layer and feeding this back to the input to predict the output of the layer. You will explore how recurrent neural networks can perform the same task from the output of the previous data of a series of sequence data.","topics":["Recurrent Neural Networks – Learning Outcomes","Introduction to Recurrent Neural Networks","Backpropagation in RNN's","Gated Recurrent Units and Long Short-Term Memory","Video Understanding using CNN’s and RNN’s","Recurrent Neural Networks – Lesson Summary"]},{"name":"Module","details":"Second Course Assessment","description":"","topics":["Second Course Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Convolutional Neural Networks in Computer Vision - Course Assessment"]}]}