{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1693","title":"Diploma in iOS 12 and Swift 4 Basics","totalEnrolled":"2,388","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about iOS12 and Swift 4 programming basics to develop iOS applications.","description":"This free online iOS 12 and Swift 4 diploma course will teach you everything you need to know about setting up an iOS development environment. In this course you will learn the basics of programming in Swift 4 and work with Version and Git. You will also learn how to create adaptive designs that can be used on different devices, work with the auto layout to create interface designs for iPhone and iPad, and more.","courseOutcomes":["Describe how to install the iOS deve...","Write effective Swift 4 code for iOS...","Describe how to implement version co...","Explain about the design application...","Describe how to install the iOS development environment, and Xcode","Write effective Swift 4 code for iOS app development","Describe how to implement version control with Git","Explain about the design application interfaces with Interface builder","Practice building a fully functional iOS 12 app","Describe how to install the iOS deve...","Write effective Swift 4 code for iOS...","Describe how to implement version co...","Explain about the design application...","Describe how to install the iOS development environment, and Xcode","Write effective Swift 4 code for iOS app development","Describe how to implement version control with Git","Explain about the design application interfaces with Interface builder","Practice building a fully functional iOS 12 app"],"courseDescription":"<p>The course Diploma in iOS 12 and Swift 4 Basics provides a comprehensive introduction into the development of iOS applications. This free online course begins by showing you how to setup the iOS development environment Xcode. The course then provides an introduction into programming with the Swift 4 programming language covering topics such as variables, data types, functions and object oriented programming.</p><p>The course also provides a foundation for working with Version and Git, learn to implement version control in your projects for efficient development. This course finishes by teaching the basics of interface design in iOS, workign with IBOutlets, IBActions and autolayout. This course then uses all the topics covered to build your first fully functional iOS application.</p><p>If you are considering iOS app development as a career, or you are a professional looking to improve your skills, then this course is the one for you. Start the course today and by the end of the week you will have learned the basics of interface design in iOS and built your first fully functional iOS application.</p><a href=\"https://alison.com/resume/courses/1693\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1693\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started With iOS 12","description":"This module covers setting up and installing Xcode, an integrated development environment for building iOS applications. In this module you will learn the about the different versions of Xcode, how to install the Xcode dark theme and the basics of working with sound, UI and Graphics in building your first app.","topics":["Getting Started With iOS 12 - Learning Outcomes","Installing Xcode & understanding Xcode versions","How to get Xcode in dark theme mode","Building your very first iOS app","Building the Hustle App - Graphics, UI, and Sound","Getting Started With iOS 12 - Lesson Summary"]},{"name":"Module","details":"Intro to Swift Programming - Variables, Operators and Data Types","description":"This module covers the basics of programming for iOS in Swift 4. This module provides the fundamentals for understanding how programming languages work and how to program for iOS devices. This module covers data types, variables, operators, functions and more. This course will take you from a complete beginner to having fundamental knowledge of the basics of Swift.","topics":["Intro to Programming & Swift 4 Basics - Learning Outcomes","Variables, operators, & how computers work","Strings","Numbers","Functions","Booleans & conditional logic","Constants & logical operators","Intro to Programming & Swift 4 Basics - Lesson Summary"]},{"name":"Module","details":"Intro to Swift Programming - Arrays, Loops and OOP","description":"This module covers the basics of programming for iOS in Swift 4. This module provides the fundamentals for understanding how programming languages work and how to program for iOS devices. This module covers arrays, loops, dictionaries, optionals and the basics of object-oriented programming. This course will build on your fundamental knowledge of Swift and introduce more difficult programming concepts.","topics":["Intro to Programming & Swift 4 Basics - Learning Outcomes","Arrays","Loops","Dictionaries","Object oriented programming","Inheritance","Polymorphism","Optionals","Intro to Programming & Swift 4 Basics - Lesson Summary"]},{"name":"Module","details":"Git & Version Control","description":"This module covers the version control and its important role in iOS development. Version control is a category of software tools that help a software team manage changes to source code over time. In this module you will be introduced to Git and Github, systems used to track the changes to projects during development. This module will explain how to implement version control in your own projects and the basics features of Git.","topics":["Git & Version Control - Learning Outcomes","Git & Version control - the fun way","Terminal Basics - Changing directories","Terminal Basics - Copying and Renaming files","Terminal Basics - Creating directories & files","Terminal Basics - Deleting files & directories","Git Basics","Setting up Github","Working with Local & Remote Repositories","Handling Git Merge Conflicts","Git & Version Control - Lesson Summary"]},{"name":"Module","details":"Diploma in iOS 12 and Swift 4 Basics - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in iOS 12 and Swift 4 Basics - First Assessment"]},{"name":"Module","details":"Swoosh App- Intro to Interface Builder & Auto Layout in Xcode 10","description":"This module covers creating the Swoosh app. This topic covers the process of building interfaces for iOS applications. In this module you will learn how to work with interface builder and auto layout. This module introduces concepts such as frames, segues and stack views. In this module you will learn how to work with IBActions and pass data between view controllers.","topics":["Swoosh App- Intro to Interface Builder & Auto Layout - Learning Outcomes","Swoosh - Creating the Welcome Screen","Swoosh - Working with Frames","Swoosh - Intro to auto layout (support multiple screen sizes)","Swoosh - Working with stack views","Swoosh - Intro to segues (changing screens)","Swoosh - Refactoring in Xcode 9","Swoosh - Debugging setValueforUndefinedKey","Swoosh - Programmatic segues","Swoosh - IBActions (handling events) & data models","Swoosh - Passing data between view controllers","Swoosh App- Intro to Interface Builder & Auto Layout - Lesson Summary"]},{"name":"Module","details":"Profile App- Digging Deeper With Auto Layout","description":"This module covers building interfaces in more depth. In this module you will dig deeper with some of the tools and concepts explored in the previous module. This module outlines how to create adaptive designs that can be used on multiple different devices of varying sizes. This module demonstrates working with auto layout to create interface designs for iPhone and iPad.","topics":["Profile App- Digging Deeper With Auto Layout - Learning Outcomes","Dev Profile - Auto layout for iPhones","Dev Profile - Auto layout for iPads (size classes)","Profile App- Digging Deeper With Auto Layout - Lesson Summary"]},{"name":"Module","details":"Window Shopper App- Your First Fully Functional iOS 12 App","description":"This module covers creating your first fully functional iOS 12 app. This module covers how to begin a project and working on the user interface. In this module you will learn how to create the Window shopper app. This app will cover concepts such as custom text fields, IBDesignables, unit testing data, custom drawing with drawRect and writing algorithms.","topics":["Window Shopper App- Your First Fully Functional iOS 12 App - Learning Outcomes","Window Shopper - Custom text fields","Window Shopper - Input accessory views & IBDesignable","Window Shopper - Unit testing our data","Window Shopper - Calculation algorithm","Window Shopper - Custom drawing with drawRect","Window Shopper App- Your First Fully Functional iOS 12 App - Lesson Summary"]},{"name":"Module","details":"Diploma in iOS 12 and Swift 4 Basics - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in iOS 12 and Swift 4 Basics - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in iOS 12 and Swift 4 Basics - Final Assessment"]}]}