{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3243","title":"Diploma in Engineering Graphics and Software","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master isometric projections and learn how to generate computer graphics with Solidworks in this free online course.","description":"This free online course provides a brief overview of the use of computer graphics to create isometric projections and sectional views before tackling SolidWorks and assembly drawing. This course is ideal for anyone looking to deepen their knowledge of engineering, technical drawing and graphic design. We explore some complex topics step by step to help you refine your expertise.","courseOutcomes":["Discuss sections and sectional views...","Distinguish between the different ty...","Classify axonometric projections...","Describe wireframe models...","Discuss sections and sectional views","Distinguish between the different types of sectional views","Classify axonometric projections","Describe wireframe models","Analyse surface models","List interpolation methods","Explain CAD Software","Understand and use SolidWorks","Outline the construction of objects within the SolidWorks platform","Discuss sections and sectional views...","Distinguish between the different ty...","Classify axonometric projections...","Describe wireframe models...","Discuss sections and sectional views","Distinguish between the different types of sectional views","Classify axonometric projections","Describe wireframe models","Analyse surface models","List interpolation methods","Explain CAD Software","Understand and use SolidWorks","Outline the construction of objects within the SolidWorks platform"],"courseDescription":"<p>Acquire advanced technical skills needed to construct sketches confidently in this exciting graphic engineering course. We examine three-dimensional (3D) geometric assemblies and drawings and the software used to create them. SolidWorks is a program used for technical drawing and engineering, design, architecture and even video games. This course will teach you the complexities and benefits of computer-aided design software. We begin by studying cutting planes and sections as we investigate different sectional views, delving into full, half, rib and web, aligned, broken-out and removed sectional views as you discover their characteristics and distinguishing features. We then move onto graphical projections, including&nbsp; axonometric projections like isometric projections and short iterations of dimetric and trimetric projections.</p><p>We then cover the electronic design of wireframe and surface models and compare their characteristics and advantages. This means diving deeper into surface models, studying the interpolation methods used for surface construction. Then comes computer-aided design software (CAD) and SolidWorks, which we explain in detail. This course requires manual drawing and the workload increases with the complexity of the subject matter.</p><p>We begin small with simple shape and object construction before moving on to surface modelling and sketching in both two and three dimensions. We then demonstrate how to construct three-dimensional geometric shapes and more advanced assembly drawings. From there, you learn more nuts and bolts and begin to work on reference planes. This means mastering the top, side and front reference planes’ adjustments before encountering more advanced concepts of assembly drawing and SolidWorks. Finally, we unpack mechanical design and product assembly until you can build a single-cylinder engine. This free online technical drawing course is for those who want to deepen their knowledge of graphic design or engineering and want a challenge. Sign up to enhance your skills and boost your career.</p><a href=\"https://alison.com/resume/courses/3243\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3243\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Sections and Sectional Views","description":"In this module, you will discuss sections and sectional views in graphic design. You will learn to distinguish between the different types of sectional views and how to classify them.","topics":["Sections and Sectional Views - Learning Outcomes","Introduction to Sections and Sectional Views","Full and Half Sections","Types of Sections","Sections and Sectional Views - Lesson Summary"]},{"name":"Module","details":"Isometric Projections","description":"In this module, Isometric Projections, you will define axonometric projections within graphical projections. This will include the fundamentals of isometric projections and isometric lines, axes and scales.","topics":["Isometric Projections - Learning Outcomes","Lines and Scales","Examples of Isometric Projections","Axonometric Projections","Isometric Projections - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"","topics":["First Assessment"]},{"name":"Module","details":"Computer Graphics","description":"In this module, Computer Graphics, you will have an overview of Computer Graphics and compare wireframe models to surface models. You will then classify and analyse the different interpolation methods used for surface construction, and you will have a brief introduction to CAD Software.","topics":["Computer Graphics - Learning Outcomes","Introduction to Computer Graphics","Models and Methods","Curves and Surfaces","Software and Solidworks","Computer Graphics - Lesson Summary"]},{"name":"Module","details":"SolidWorks","description":"In this module, SolidWorks, you will learn SolidWorks' fundamentals, which includes manual drawing, surface modelling within the platform and 2D and 3D sketching using SolidWorks. You will also discuss assembly drawing and the construction of 3D geometrics.","topics":["Solidworks - Learning Outcomes","Manual Drawing in Solidworks","Construction and Modelling","Sketches","Construction and Assembly","Nuts, Bolts and Metric 10","Reference Planes","Solidworks - Lesson Summary"]},{"name":"Module","details":"Assembly Drawing","description":"In this module, Assembly Drawing, you will learn advanced concepts in SolidWorks and assembly drawing. You will also begin the mechanical design and product assembly and learn advanced methods and features of SolidWorks. You will end the topic off by learning the different mates and their applications.","topics":["Assembly Drawing - Learning Outcomes","Advanced Concepts","Assembly Process","Products and Engines","Advanced Methods and Features","Mechanical Mates","Assembly Drawing - Lesson Summary"]},{"name":"Module","details":"Second Assessment","description":"","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Engineering Graphics and Software - Final Assessment"]}]}