{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5117","title":"Diploma in 3D Game Development With Unity Engine","totalEnrolled":"3,788","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains how to build interactive next-generation 3D games with the Unity game engine.","description":"If your life's goal is to start a gaming company or build an exciting career as a game developer or CG animator, this course sets you on the right path. We explore beginner and intermediate concepts to help you create beautiful games with Unity 3D. Learn to set up scenes, manipulate and remodel objects, rig, animate, test and compile your games. By taking the course, you'll acquire the skills required to become a proficient game developer.","courseOutcomes":["Explain the basic structure and user...","Outline the procedures used to remod...","Select the appropriate Mecanim anima...","Explain how functions, variables, Mo...","Explain the basic structure and user interface of the Unity game engine","Outline the procedures used to remodel, rig, animate and import 3D assets in Unity","Select the appropriate Mecanim animation and Shuriken particle systems for game design projects","Explain how functions, variables, MonoBehaviour members and conditionals control game objects","Compare the three GUI systems used for creating 3D mobile games in Unity","Outline enums, delegates, events and coroutines used in scripting languages for 3D games","Identify the use of prefabs and skybox materials in 3D game engines","Outline the steps required to test and compile 3D games in the Unity engine","Explain the basic structure and user...","Outline the procedures used to remod...","Select the appropriate Mecanim anima...","Explain how functions, variables, Mo...","Explain the basic structure and user interface of the Unity game engine","Outline the procedures used to remodel, rig, animate and import 3D assets in Unity","Select the appropriate Mecanim animation and Shuriken particle systems for game design projects","Explain how functions, variables, MonoBehaviour members and conditionals control game objects","Compare the three GUI systems used for creating 3D mobile games in Unity","Outline enums, delegates, events and coroutines used in scripting languages for 3D games","Identify the use of prefabs and skybox materials in 3D game engines","Outline the steps required to test and compile 3D games in the Unity engine"],"courseDescription":"<p>Did you know that some of today’s most popular 3D games like ‘Ori and the Blind Forest’, ‘Call of Duty’ (mobile), ‘Cuphead’ and ‘Pokemon Go’ are built with the Unity game engine? If you want to join the fun of designing computer games using Unity, this course is for you. Unity allows you to create high-quality 3D games with animated characters and interactive features. It also helps you to deploy your games on multiple platforms to connect with passionate gamers.</p><p>In this course, you will study everything you need to know to create desktop, mobile and 3D game designs with Unity. First, we explore why you need a game engine to build a game. Next, we identify keyboard shortcuts to navigate the Unity interface and examine the tools used to manipulate objects. We will also show you insider game hacking techniques that can be employed to create your first game in less than ten minutes. You will learn how to remodel, rig, animate and import 3D assets into the Unity game engine.</p><p>Finally, we examine concepts like UV mapping, level design, Mecanim animation, finite state machines (FSM) and animator controllers. We provide video demonstrations that explain how to use Unity’s built-in integrated development environment (IDE) to create functions, declare methods and assign values to variables. Other topics contain light and shadow mapping, rotation techniques, mipmaps and more. Take this exciting course today and learn to develop next-generation 3D games and stunning video graphic effects.</p><a href=\"https://alison.com/resume/courses/5117\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5117\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Game Assets Design with Unity Engine","description":"In this module, you will learn the core models for game development. We will review the structure, interface, and benefits of the Unity game engine. Study object manipulation, rigging, modelling, and best practices to create classes and functions for your games. We will also cover light and shadow, the shuriken particle system, and Unity dynamics.","topics":["Game Assets Design with the Unity Engine - Learning Outcomes","Unity 3D and Game Hacking Basics","Introduction to Unity Scripting","Understanding Light and Shadow","The Shuriken Particle System","Unity Dynamics and 3D Engine Fundamentals","Game Assets Design with the Unity Engine - Lesson Summary"]},{"name":"Module","details":"Models for Mobile and 3D Game Development","description":"This module examines models for mobile and 3D game design. See how to create textures, Mecanim animation, and light mapping. Learn to use multiple cameras, enums, delegates, and events to spice up your game. You will also learn to create coroutines, prefabs, Skybox materials and new scenes.","topics":["Models for Mobile and 3D Game Development - Learning Outcomes","Fundamentals of Mobile Game Design","Additional Mobile Game Design Concepts","Concluding Mobile Game Design","Understanding 3D Game Development","Models for Mobile and 3D Game Design - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in 3D Game Development With Unity Engine - Course Assessment"]}]}