{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4194","title":"Diploma in Cascading Style Sheets using HTML","totalEnrolled":"1,289","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, master the processes of building a professional one-page website using HTML, CSS and jQuery.","description":"To be a successful web developer, you must have a quality understanding of HTML and CSS in web design. This course demonstrates the techniques of using HTML, CSS and media queries to build a responsive and distinctive website. You will discover the best practices to create an eye-catching website for personal or business use. You will also learn ways of optimising your website to improve its performance.","courseOutcomes":["Recognise the basic structure of an ...","Add headings, images and links to HT...","Create and style the sections of an ...","Outline the best practices you shoul...","Recognise the basic structure of an HTML page","Add headings, images and links to HTML pages","Create and style the sections of an HTML web page","Outline the best practices you should follow when selecting colours, fonts and icons in your web design","State the basic steps in designing a professional website","Create the various sections of a one-page website","Create a responsive website with media queries","Add animation and sticky navigation to your website using jQuery","Summarise the methods of optimising your website’s performance","List the basic steps in launching a website","Recognise the basic structure of an ...","Add headings, images and links to HT...","Create and style the sections of an ...","Outline the best practices you shoul...","Recognise the basic structure of an HTML page","Add headings, images and links to HTML pages","Create and style the sections of an HTML web page","Outline the best practices you should follow when selecting colours, fonts and icons in your web design","State the basic steps in designing a professional website","Create the various sections of a one-page website","Create a responsive website with media queries","Add animation and sticky navigation to your website using jQuery","Summarise the methods of optimising your website’s performance","List the basic steps in launching a website"],"courseDescription":"<p>Building websites involves having an adequate understanding of key computer languages. When you grasp the operation of these languages, you will use them to create and style a unique website. This course has been designed to teach you the basics of these languages and the process of using them to build a professional one-page website. First, you will learn about the potentials and opportunities of the web developer marketplace. Next, you will discover the types of web developers out there and the primary skills you need to become a successful web developer. Did you know that HTML is responsible for the content displayed on a website? This course will show you the structure of HTML, including how you can use it to implement features such as headers, images and links. You will also see how to use CSS in styling your HTML pages and learn to choose the right images, colours and fonts for your web design.</p><p>The course then demonstrates the best approach to designing a professional website by building a functional site for a fictional company. You will first learn the steps of building a professional website and the setup you need to make a one-pager. Next, you will study the processes of designing the site's header and its other unique features. You will learn how to create and style the various sections of the website to meet the needs of the fictional company. When you build a website, it tends to appear differently in different browsers so you must make it look the same in all browsers by making it responsive. You will also see how to use jQuery to add animation and effects. The course guides you on the techniques used to improve the performance of your website. You will identify the process of launching your website, and learn how to to build a powerful network and leverage freelance sites to boost your web development career.</p><p>If you design your website correctly, your audience will remain engaged, and it will designate your brand as a unique one. So, it is essential that you properly design your site to portray the aims of the company. This course explains the practical steps on the best practices to follow when building your page. You will also discover the responsibilities of web developers and how you can connect with company recruiters to acquire development jobs. This course guides you on the process of creating and styling a one-page website using HTML, CSS, media query and jQuery. You will also grasp how web browsers process their HTML and CSS codes before rendering the website. If you are starting your career in web development, this course gives you an indispensable guide to boost your career.&nbsp;</p><a href=\"https://alison.com/resume/courses/4194\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4194\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"CSS Using HTML - Course Introduction","description":"This module, CSS Using HTML - Course Introduction, discusses the potentials and opportunities in the web developer marketplace, including the major skills needed and types of available web developers.","topics":["CSS Using HTML - Course Introduction - Learning Outcomes","Web Developer Marketplace and Opportunities","Major Skills of Successful Web Developers","Types of Web Developers","CSS Using HTML - Course Introduction - Lesson Summary"]},{"name":"Module","details":"Introduction to HTML","description":"This module, Introduction to HTML, discusses the basic structures and elements of HTML, including how to insert headings, paragraphs, and images in HTML web pages.","topics":["Introduction to HTML - Learning Outcomes","Definition and Structure of HTML","Adding Headings and Paragraphs in HTML","Adding Images in HTML","Introduction to HTML - Lesson Summary"]},{"name":"Module","details":"Styling with CSS","description":"This topic, Styling with CSS, demonstrates the importance of CSS in web design, including the application of CSS selector and CSS box models in web design.","topics":["Styling with CSS - Learning Outcomes","Introduction to CSS","Basics of CSS Box Model","Application of CSS Box Model","Styling with CSS- Lesson Summary"]},{"name":"Module","details":"Basics of Web Design","description":"This topic, Basics of Web Design, will guide you on the best practices to employ when selecting images, fonts, and colours for your web design. You will also discover the impact of whitespaces in web design.","topics":["Basics of Web Design - Learning Outcomes","Selecting Fonts and Icons in Web Design","Choosing Colours in Web Design","Images and Whitespaces in Web Design","Basics of Web Design - Lesson Summary"]},{"name":"Module","details":"Diploma in Cascading Style Sheets using HTML - First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 1-4 of the following course: - Diploma in Cascading Style Sheets using HTML You need to score 80% or more to pass.","topics":["Diploma in Cascading Style Sheets using HTML - First Assessment"]},{"name":"Module","details":"Building a Professional Website","description":"This module, Building a Professional Website, teaches the appropriate approach to designing and styling a website's various sections using HTML and CSS.","topics":["Building a Professional Website - Learning Outcomes","Building a Professional Website - Introduction","Building a Website’s Header","Building ‘About Us’ and Portfolio Pages","Building a Service and Testimonial Page","Building a Website’s Contact Form and Footer","Building a Professional Website - Lesson Summary"]},{"name":"Module","details":"Building a Responsive and Animated Website","description":"In this module, Building a Responsive and Animated Website, you will master the methodology of using media queries to make your website responsive and utilising jQuery to apply animations and effects on your webpage.","topics":["Building a Responsive and Animated Website - Learning Outcomes","Creating Responsive Websites using Media Queries","Setting Browser Compatibility for a Website","Adding Animation and Effects to Websites using jQuery","Building a Responsive and Animated Website - Lesson Summary"]},{"name":"Module","details":"Website Optimisation and Launching","description":"This module, Website Optimisation and Launching, shows you the techniques of optimising and launching a website and how web browsers render the HTML and CSS codes of a website.","topics":["Website Optimisation and Launching - Learning Outcomes","Optimising a Website’s Performance","Steps in Launching a Website","Basic Principles of CSS","Website Optimisation and Launching - Lesson Summary"]},{"name":"Module","details":"Web Developer Career","description":"This module, Web Developer Career, discusses how you can kickstart or improve your career in web development by personal branding, building a solid network, and acquiring clients from freelance platforms.","topics":["Web Developer Career - Learning Outcomes","Starting a Web Developer Career","Starting to Freelance as a Web Developer","Networking and Branding as a Web Developer","Web Developer Career - Lesson Summary"]},{"name":"Module","details":"Diploma in Cascading Style Sheets using HTML - Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 5-8 of the following course: - Diploma in Cascading Style Sheets using HTML You need to score 80% or more to pass.","topics":["Diploma in Cascading Style Sheets using HTML - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Cascading Style Sheets using HTML - Final Course Assessment"]}]}