{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4097","title":"Diploma in Cascading Style Sheets with NPM and Sass","totalEnrolled":"417","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn why many developers are using Sass and the pros and cons of using this service in this free online course.","description":"This is an expert course on cascading style sheets (CSS) using NPM and Sass. You will learn about NPM and the pros of using this service. In addition, this course goes into detail on how Sass works with NPM to provide a seamless coding experience. Have you ever wondered how to add images to web pages or what layout style is best for your website? This course will explore the possible solutions to these questions.","courseOutcomes":["Plan your CSS strategy...","List how to approach CSS coding...","Do data validation...","Create a background image slider for...","Plan your CSS strategy","List how to approach CSS coding","Do data validation","Create a background image slider for a header","Explain what the rem unit is","List ways in which images can become more responsive","Indicate what Node.js is","Install and set up Sass and NPM","Distinguish between Sass syntaxes and SCSS syntaxes","Recall the different web page layouts","Build a fluid grid from scratch","Distinguish between mobile-first and desktop-first design","Plan your CSS strategy...","List how to approach CSS coding...","Do data validation...","Create a background image slider for...","Plan your CSS strategy","List how to approach CSS coding","Do data validation","Create a background image slider for a header","Explain what the rem unit is","List ways in which images can become more responsive","Indicate what Node.js is","Install and set up Sass and NPM","Distinguish between Sass syntaxes and SCSS syntaxes","Recall the different web page layouts","Build a fluid grid from scratch","Distinguish between mobile-first and desktop-first design"],"courseDescription":"<p>If you are a web developer or a coding student fascinated by web page design, this course is suitable for your needs. It is unique and, despite being in-depth, is easy to understand. You will learn tips and tricks used to increase your efficiency when coding. It also provides step-by-step instructions on how to create a web page from scratch. The material explains why many developers use Sass and describes the advantages and disadvantages of using this service. In response, you will see why independent web designer Ethan Marcotte found it necessary to invent the idiom 'responsive web design'. The course describes how this breakthrough is beneficial to web development today.</p><p>The next section introduces you to different ways of making images responsive and optimized. You will learn why a CDN (content delivery network) can handle more traffic and endure hardware breakdowns better than many original servers. Next, we will expose you to different website designs and help you understand how they are modified to fit your device screens. You will study their pros and cons, if any, and ascertain the main reasons why you design a website to cater to each device. Finally, explore the different file types used to assist with the coding of your website and see how these files significantly influence the result of your design.</p><p>Finally, this course enlightens you about the advancements made in web development over the years. While many improvements have been made, it is also evident that more needs to be done. Sass is an excellent means for website developers who want to enhance their web design with fundamental programming functions. The installation is straightforward, and the Sass language and syntax are quick to study. In addition, the diverse programming functions create more realistic stylesheets. This course will explore all the areas of Sass and NPM to help you grasp how they work. Are you ready to start your career in website development? Then don’t wait any longer: enrol in this free course today.</p><a href=\"https://alison.com/resume/courses/4097\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4097\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Intro to SASS and NPM","description":"This module will introduce you to SASS and NPM, their functions, and the different tasks you can do. Additionally, you will explore how to locate and utilize the command prompt on your computer.","topics":["Intro to SASS and NPM - Learning Outcomes","SASS Basic Principles","Command Line Basics","What is NPM?","Intro to SASS and NPM - Lesson Summary"]},{"name":"Module","details":"Good CSS Practices","description":"This module will introduce you to the 7-1 pattern architecture, the major CSS layouts, and the BEM model. Additionally, you will learn which CSS layout is most common and the different Scss files that each 7-1 pattern architecture contains.","topics":["Good CSS Practices - Learning Outcomes","How to Plan out your CSS","The BEM Model","An Ideal Folder and File Structure for a CSS Project","Different Types of Layouts","Good CSS Practices - Lesson Summary"]},{"name":"Module","details":"Diploma in Cascading Style Sheets with NPM and Sass - First Assessment","description":"This module enables you to review your learning so you can determine your knowledge and understanding of Modules 1 to 2 in the following course; Diploma in Cascading Style Sheets with NPM and Sass.","topics":["Diploma in Cascading Style Sheets with NPM and Sass - First Assessment"]},{"name":"Module","details":"Building a Country Club Website (Lakeview) with SASS and new CSS properties","description":"This module will teach you how to create a button for a header, create a contact form, a testimonial section, and an 'about us' section for a web page.","topics":["Building a Country Club Website (Lakeview)  - Learning Outcomes","Lakeview Project Overview","Creating Buttons for Your Header","Creating a Fluid Grid from Scratch","Creating the Contact Us, About Us and Testimonial Sections","Building a Country Club Website (Lakeview)  - Lesson Summary"]},{"name":"Module","details":"Advanced Responsive Design","description":"This module will introduce you to CDN and how they work, the different ways to make images responsive, how to calculate them, and how to distinguish between the mobile-first and desktop-first approaches.","topics":["Advanced Responsive Design - Learning Outcomes","Mobile First vs Desktop First Design","Media Queries with SASS","Making Images Responsive and Optimized","Density Switching Using CDN","Using Feature Queries for Browser Support","Advanced Responsive Design - Lesson Summary"]},{"name":"Module","details":"Diploma in Cascading Style Sheets with NPM and Sass - Second Assessment","description":"This module enables you to review your learning so you can determine your knowledge and understanding of Modules 3 to 4 in the following course; Diploma in Cascading Style Sheets with NPM and Sass.","topics":["Diploma in Cascading Style Sheets with NPM and Sass - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Cascading Style Sheets with NPM and Sass - Final Assessment"]}]}