{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3884","title":"DOM – Interactive Website Game using JavaScript","totalEnrolled":"332","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use the Document Object Model and JavaScript to create interactive web games in this free online course.","description":"The Document Object Model (DOM) allows you to manipulate website elements, and create new ones without changing its HTML code. In this free online JavaScript game development course, you will be introduced to DOM and learn how to use JavaScript to create webpage elements, move elements and create animations that make websites engaging and responsive along with the process involved in developing an interactive website game using JavaScript.","courseOutcomes":["Explain the Document Object Model...","List the tools needed for web develo...","Describe the process of styling web ...","Describe the process of manipulating...","Explain the Document Object Model","List the tools needed for web development","Describe the process of styling web elements with JavaScript","Describe the process of manipulating element position with the Document Object Model (DOM)","Explain the use of the Animation Frame in creating animations on a website","Identify different JavaScript methods and their purpose","Recall the process of generating new elements using the Document Object Model","Explain how JavaScript can be used to detect element collision","Describe the process of setting random positions with JavaScript","Explain how JavaScript is used to move new webpage elements","Explain the Document Object Model...","List the tools needed for web develo...","Describe the process of styling web ...","Describe the process of manipulating...","Explain the Document Object Model","List the tools needed for web development","Describe the process of styling web elements with JavaScript","Describe the process of manipulating element position with the Document Object Model (DOM)","Explain the use of the Animation Frame in creating animations on a website","Identify different JavaScript methods and their purpose","Recall the process of generating new elements using the Document Object Model","Explain how JavaScript can be used to detect element collision","Describe the process of setting random positions with JavaScript","Explain how JavaScript is used to move new webpage elements"],"courseDescription":"<p>This JavaScript course will introduce you to Document Object Model, and how it could be used to make very responsive websites. The course begins with a demonstration of how to set up the developer tools that would be used in developing the game, followed by an explanation of the Document Object Model. It then goes on to demonstrate how JavaScript could be used to manipulate element style and position. This half of the course concludes by demonstrating how to use the DOM to create responsive animations for your web game.</p><p>The second half of the course demonstrates how to use the DOM to set random positions and create new webpage elements for the web game. The game development course content then demonstrates how JavaScript is used to make game elements move across the webpage, and how collisions among different game elements can be detected and used to create gameplay and keep score. The course concludes by demonstrating how to make visual and gameplay refinements on a website game.</p><p>This course covers the process of using the Document Object Model to create a very interactive web game. You will be exposed to very vital knowledge needed to create interactive, visually appealing, and highly responsive web pages. If you are in web design, software programming would just like to take on a fun, rewarding, short game project, then enrol in this game design certificate and learn to create a fully functional and responsive website game in just three hours.</p><a href=\"https://alison.com/resume/courses/3884\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3884\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting Up, Element Manipulation & Animation Frame","description":"In this module, you will be introduced to the Document Object Model (DOM) and how JavaScript is used to manipulate element style and position. You will also learn how to set up tools for web development and create responsive animations for a website game.","topics":["Setting Up, Element Manipulation & Animation Frame – Learning Outcomes","Setting up, DOM & Element Style Manipulation","Moving Elements and Creating Animations","Setting Up, Element Manipulation & Animation Frame – Lesson Summary"]},{"name":"Module","details":"Moving New Elements & Element Collision","description":"In this module, you will be introduced to how the Document Object Model (DOM) is used to create elements on a webpage, set random positions, and detect element collision; in order to create a web game.","topics":["Moving New Elements & Element Collision – Learning Outcomes","Creating Elements and Moving New Elements","Element Collision Detection and Game Review","Moving New Elements & Element Collision – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["DOM –Interactive Website Game using JavaScript– Course assessment"]}]}