{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3259","title":"Embedded Systems: Project Development","totalEnrolled":"1,086","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will give you a comprehensive run-through on planning and building an electronic project.","description":"Do you desire to plan and build an electronic project using the MSP430 microcontroller? This course focuses on the \"ten commandments\" for creating an electronic project, as well as the methods of circuit prototyping. In addition, we illustrate how to implement a wirelessly powered art installation project. This course is essential for anyone who wants to build a complete project using an embedded system for any application.","courseOutcomes":["Distinguish between a breadboard and...","Recognize the wireless power transfe...","Select a suitable method of circuit ...","List the ten commandments of buildin...","Distinguish between a breadboard and a zeroboard","Recognize the wireless power transfer methods","Select a suitable method of circuit prototyping for your project","List the ten commandments of building an electronic project","Explain the Gantt Chart","Discuss how to plan and implement an electronics project","State the relationship between the finite state machine and datapath","Distinguish between a breadboard and...","Recognize the wireless power transfe...","Select a suitable method of circuit ...","List the ten commandments of buildin...","Distinguish between a breadboard and a zeroboard","Recognize the wireless power transfer methods","Select a suitable method of circuit prototyping for your project","List the ten commandments of building an electronic project","Explain the Gantt Chart","Discuss how to plan and implement an electronics project","State the relationship between the finite state machine and datapath"],"courseDescription":"<p>Can a microcontroller perform tasks like calculating the logarithm or exponent of numbers? In the introductory section of this course, you will learn how this is possible by reading information from the outside world, processing it with a more complex mathematical operation, and seeing the result of those operations using the MSP430 microcontroller. Then, study how to create a mechanism where multiple activities occur in the microcontroller and deal with it through multiplexing and interrupts. Next, we will introduce you to sequential programming, where the final values of the variables in a program depend on the order you execute the statements. After that, we will discuss planning and implementing an electronics project. Electronics today use embedded computers, and although it uses programming, it also requires a body. This section will prepare you for all the aspects to consider when building an electronic project. While this is about building electronic projects, one should see it in a larger planning context to create an entire project. So, you will observe all the required issues when thinking of building an electronic project.</p><p>The course will take you through the \"ten commandments\" of building an electronics project. First and foremost are the requirements, aims, objectives, and deliveries of the project you intend to embark on. Then you will learn visualization, followed by the schematic, circuit fabrication, power supply, circuit soldering, system wiring after soldering, testing, enclosures, and finally, the documentation of the entire project. Next, examine the circuit prototyping methods and the four types of circuit prototyping methods: the breadboard, zeroboard, manhattan style, and the custom printed circuit board. We will highlight their strengths, weaknesses, and respective prototyping tools. After that, we explain the ten steps involved in cutting and preparing a custom PCB fabrication using the toner transfer method, which is the fastest way of making custom PCBs. Explore one of the three ways of implementing embedded computers, which is single-purpose computers. Finally, you will discover the finite state machine (FSM), a computational model machine used to create sequences, the two types3t, Moore and Mealy machine, and the VHDL Code system.</p><p>The final section of the course will discuss the datapath, which represents all the functional elements that process data under the control of FSMs. We will analyze the relationship between FSMs and datapath and the datapath elements. You will then incorporate those ideas into a single-purpose computer that will play a dual dice game. You will be taught how to write the requirements, problem statements, and the elements of datapath and states required in the finite state machine of the game. We will introduce the programmable logic devices of two types; the complex programmable logic device (CPLD) and the field programmable gate array (FPGA). We will show you how to plan, test, and implement an electronics project to create a wirelessly powered art installation using an MSP430 microcontroller. Become skilful in the wireless power transfer methods and the microcontroller circuits used for the project. Learning how to build an electronics project and demonstrating it from its concept to its realization will empower you to build a complete system project using the embedded systems. So why wait? Start learning today!</p><a href=\"https://alison.com/resume/courses/3259\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3259\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building a Printed Circuit Board","description":"In this module, you will be shown how to program a microcontroller. You will learn how to create a mechanism where multiple activities are taking place in a microcontroller using Multiplexing and Interrupts. The requirements, aims, and objectives to consider when starting a project will be highlighted. Also, the methods, merits, as well as demerits of the methods of circuit prototyping will be examined. Lastly, you will learn how to cut and prepare a custom circuit board.","topics":["Learning Outcomes - Building a Printed Circuit Board","Coding Ninja","Building an Electronics Project","Circuit Prototyping Techniques","Lesson Summary - Building a Printed Circuit Board"]},{"name":"Module","details":"Single Purpose Computers and Project Demonstration","description":"In this module, you will learn about the Finite State Machine (FSM) and Datapath, which represent all the functional elements that process data under the control of the FSM. Then, you will study how to write a problem statement and the types of Programmable Logic Devices. Lastly, you will be taught how to plan, test, and implement an MSP430 microcontroller project in a wirelessly powered art installation project.","topics":["Learning Outcomes - Single Purpose Computers and Project Demonstration","Single Purpose Computers","Single Purpose Computers Roundup","Project Demonstration","Lesson Summary - Single Purpose Computers and Project Demonstration"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Embedded Systems: Project Development"]}]}