{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3258","title":"MSP430 Microcontrollers: Time and Event Measurement","totalEnrolled":"317","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the major functions of a timer and other components of the MSP430 microcontroller in this free online course.","description":"This course discusses most of the essential features of embedded systems such as the MSP430, such as counting and measuring time and events, creating analog waveforms using digital controls, and reading external analog voltages. Enroll today to acquire insight into the functionalities of the timer, pulse width modulation signals, analog-digital converters, and communication protocols in the MSP430 microcontroller.","courseOutcomes":["List the major components of Timer_A...","Discuss the various timer modes...","Explain pulse width modulation (PWM)...","Compare the software and hardware ap...","List the major components of Timer_A","Discuss the various timer modes","Explain pulse width modulation (PWM) signals","Compare the software and hardware approaches to using a timer","Discuss the types of analog to digital converters (ADC)","Explain how random numbers are generated in MSP430 microcontrollers","Identify the various communication protocols in MSP430","Describe the features of the timer capture mode","List the major components of Timer_A...","Discuss the various timer modes...","Explain pulse width modulation (PWM)...","Compare the software and hardware ap...","List the major components of Timer_A","Discuss the various timer modes","Explain pulse width modulation (PWM) signals","Compare the software and hardware approaches to using a timer","Discuss the types of analog to digital converters (ADC)","Explain how random numbers are generated in MSP430 microcontrollers","Identify the various communication protocols in MSP430","Describe the features of the timer capture mode"],"courseDescription":"<p>This course introduces you to time and events measurements of embedded systems. It begins with an overview of TIMER_A, the primary timer module found in the MSP430 microcontrollers. With the MSP430G2553 as an example, we explain the primary components and sources of the timer. Then, with a practice sample code, you will run a program to illustrate what you can achieve with a timer. The four modes of a timer - Stop, Up, Continuous, and Up/Down - will be examined. We then discuss the various methods of generating pulse width modulation (PWM) signals, and the software and hardware approaches to generate analog voltages with PWM signals.</p><p>Next, learn to read external analog voltages with the analog to digital converter (ADC). The material highlights the sample and hold circuit and the encoding processes of the ADC. Examine the types of ADCs from the most common (the successive approximation register type ADC used by MSP430 microcontrollers) to the fastest (the flash type ADC). We demonstrate three sample codes on initializing ADCs in this section. Then, study how the microcontrollers can generate random numbers, which is a crucial aspect of embedded systems. A random number generator produces a sequence of numbers or symbols in a way that you cannot reasonably predict. You will investigate the two types of random number generators: the true hardware random number generators (HRNG) and the pseudo-random number generator (PRNG).</p><p>Furthermore, you will discover how a microcontroller can communicate by sending and serially receiving data using the various MSP430 communication protocol methods. We clarify the three such protocols available in MSP430 and their merits and demerits. Learn how to use a timer to capture internal and external events; this is called the MSP430 timer in a capture mode. We then further discuss the Timer_A Registers of the MSP430 microcontroller. We introduce the TA clock, an external pin of the MSP430. This pin will be clocking, incrementing, and setting the timer in a counter mode. Learning about the timer, event measurements, and MSP430 communication protocols will help you gain skills and understand most internal features of the MSP430 microcontroller.</p><a href=\"https://alison.com/resume/courses/3258\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3258\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction To Timers in MSP430","description":"In this module, you will be introduced to Timers in MSP430. The Timer_A module, which is common with the MSP430 microcontroller and its components will be discussed. The Pulse Width Modulation (PWM) signal, one method of generating analog voltages will be introduced. You will consider both the software and hardware approaches to generating PWM signals in this module. Lastly, you will also learn the ability to read external analog voltages using an Analog to Digital Converter (ADC).","topics":["Learning Outcomes - Introduction To Timers In MSP430","MSP430 Timer Module: Introduction and Timer Capture","Pulse Width Modulation using Timer Capture","Analog to Digital Converter in the MSP430","Lesson Summary - Introduction To Timers in MSP430"]},{"name":"Module","details":"Communication Protocols on MSP430","description":"In this module, you will be introduced to the various communication protocols on MSP430. You will examine how the microcontroller can generate random numbers using the Linear Feedback Shift Register (LFSR), as well as communicate with the outside world using the various MSP430 communication protocol methods. The Serial Communication Protocols and the Serial Command Systems will be highlighted. Lastly, you will study how to use a timer to capture an internal and external event in MSP430.","topics":["Learning Outcomes - Communication Protocols in MSP430","ADC and DAC using R2R Ladder and Random number generation using LFSR","Serial Communication Protocols, USCI Module in MSP430","MSP430 Timer in Capture Mode","Lesson Summary - Communication Protocols on MSP430"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - MSP430 Microcontrollers: Time and Event Measurement"]}]}