{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4951","title":"Enterprise Blockchain Training For Solution Engineers","totalEnrolled":"305","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop the skills to solve blockchain-related problems and offer value to your clients with this free online course.","description":"Blockchain is already improving business operations in various industries, including banking and finance, agriculture, supply chain management, government, healthcare and education. This course will teach you about the fundamental concepts of blockchain and skill sets for designing and implementing smart contracts. In addition, you will learn about various blockchain platforms such as Quorum, Ripple, Ethereum, Hyperledger and more.","courseOutcomes":["Compare enterprise blockchains based...","Analyse and compare the advantages a...","Recognise how to use the Saas applic...","Recall how to perform a proof of con...","Compare enterprise blockchains based on their transaction speed, value and transparency","Analyse and compare the advantages and disadvantages of Quorum, R3 Corda and Ripple blockchains","Recognise how to use the Saas application of IBM to create a blockchain network","Recall how to perform a proof of concept","Discuss how blockchain creates value for customers","Distinguish between cryptocurrency and blockchains","Identify the components of a blockchain","Distinguish between public and private blockchains","Discuss the use cases around blockchains","Compare enterprise blockchains based...","Analyse and compare the advantages a...","Recognise how to use the Saas applic...","Recall how to perform a proof of con...","Compare enterprise blockchains based on their transaction speed, value and transparency","Analyse and compare the advantages and disadvantages of Quorum, R3 Corda and Ripple blockchains","Recognise how to use the Saas application of IBM to create a blockchain network","Recall how to perform a proof of concept","Discuss how blockchain creates value for customers","Distinguish between cryptocurrency and blockchains","Identify the components of a blockchain","Distinguish between public and private blockchains","Discuss the use cases around blockchains"],"courseDescription":"<p>Blockchain is a kind of technology that is revolutionising how we do business. Blockchain is incredibly safe, traceable, and dependable, thanks to its decentralised network and simplified operations. Blockchain facilitates the transfer of financial transaction records (referred to as ‘blocks’) among numerous computers, which cannot be altered, destroyed or deleted. In this course, we'll explain many terminologies used in blockchain technology and break down the technical side of it into easily understandable parts. We introduce you to blockchain technology and some of the best practices and concepts in the blockchain industry. Then, you'll learn about 'Request for Proposals (RFPs)', their benefits and why they are important for solution engineers. Moving on, we discuss some approaches to how blockchain creates value for customers and how to calculate the return on investment on blockchain projects.</p><p>As a sales engineer focused on driving revenue to your enterprise, it is crucial to know how to sell blockchain-related services. As a result, knowing some of the cost considerations while working with your customer base or enterprise is vital. Identify potential costs associated with a blockchain and some criteria clients look for when attempting to integrate blockchain technology into their businesses. After that, we'll compare the differences between cryptocurrencies and blockchain, including some of the common technicalities of blockchain. You will learn about its key components and functions, including some enterprise blockchains such as Ethereum, R3 Corda and more. You'll analyse how blockchain uses a consensus algorithm for mining cryptocurrencies and the differences between permission and permissionless blockchains.&nbsp;</p><p>Next, we'll explore trusted and trustless blockchains and highlight their advantages and disadvantages. You will study the specifics of some enterprise blockchains and learn about hashing and its importance to blockchain technology. We'll provide you with resources that will help you gain better insights into blockchain terminologies and show you how to use the Saas application of IBM to create a blockchain network. This video-based course is ideal for presales engineers, post-sales engineers, systems/solutions engineers, enterprise engineers and anyone interested in knowing how the blockchain works. Learners need basic networking and database knowledge as well as technical sales experience. Blockchains are essential to understand because they eliminate the need for a trusted authority or centralised server to manage flaws in digital cash transactions. Wait no longer and click on the ‘enrol’ button to start immediately!</p><a href=\"https://alison.com/resume/courses/4951\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4951\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Solution Engineering and the Blockchain","description":"In this module, you’ll be introduced to blockchain technology, its terminologies, best practices and benefits. We’ll explain the concept of ‘Request for Proposals’, ‘Proof of Concept’, ‘Return of Investment’ and more. You’ll learn about the components of a blockchain such as ledgers, nodes and more.","topics":["Solution Engineering and the Blockchain - Learning Outcomes","Introduction to Blockchain","Blockchain Terminologies - Part 1","Blockchain Terminologies - Part 2","Solution Engineering and the Blockchain - Lesson Summary"]},{"name":"Module","details":"Enterprise Blockchain","description":"In this module, we’ll examine and compare the various types of enterprise blockchains such as hyperledger, Quorum, Ripple, R3 Corda and more. You’ll learn about hashing and its importance to blockchain technology. We’ll introduce you to websites and applications that will help you gain more insights into the blockchain industry.","topics":["Enterprise Blockchain - Learning Outcomes","Enterprise Blockchain Platforms","Blockchain Demos and Resources","Use Case Studies","Enterprise Blockchain - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Enterprise Blockchain Training For Solution Engineers"]}]}