{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3125","title":"Essential OneNote Basics","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online notetaking software course teaches you how to use OneNote to manage information effectively.","description":"This free online course on productivity tools provides a comprehensive introduction to the basics of Microsoft OneNote and offers a step-by-step guide to getting started with a notebook. You will learn how to create, save, share, close and even delete a notebook. This course equips you with a useful skill that can help manage your information and enhance workplace productivity.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In today’s information-driven world, it is worth mastering effective management of data through technology. Microsoft OneNote is an all-in-one notetaking, information-gathering and multi-user collaboration tool. It supports notes, drawings, handwriting, screen clipping, audio, video and other types of content. This course on the basics of OneNote is useful for beginners and benefits those upgrading from a previous version of the program. We guide you through a step-by-step account of working with OneNote which, like all other Microsoft applications, is accessible in different versions. We explain these versions and how to access them and answer questions like: Can I work with OneNote on any device? Which version is most suitable for me if I want to work on a desktop? Can I work on OneNote in touch mode?</p><p>Imagine if you could file the minutes of a team meeting, the presentation that was shown in that meeting, a worksheet with relevant data for your next project, all the links of useful websites to complete a project, the emails related to the project and even the audio recording of a client detailing their specific requirement… all in one single folder. That would be an effective and productive way to manage information related to a specific project and OneNote has all these functionalities and more. We explore its exciting new features and interface, starting with the creation of a notebook with sections as we explain how assigning colourful tabs to those sections can establish a meaningful and easy-to-navigate reservoir of information relevant to a project. We walk you through all the steps required to demonstrate the functions and features of the key tabs in the OneNote ‘ribbon’.</p><p>We then explore toolbars and the 'Insert' tab to show you how to customize the quick access toolbar with a simple demonstration delivered via screen sharing. All other functions are similarly covered, which provides a hands-on learning experience. We investigate how to capture a screen clipping and add it to your notes or how to print anything on your computer directly to OneNote. The course focuses on the functions and utilities found under the 'Insert' tab as you see how OneNote adds images, online pictures, online videos, links, files and even equations and symbols to a page. Mastery of OneNote is a handy professional skill and this course helps anyone who wants easy access to shareable notes, be they working professionals or freelancers and gig workers who collaborate on multiple projects. Knowledge drives the Information Age and OneNote streamlines data to give you a clear edge.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}