{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2279","title":"Ethical Hacking; Basic Concepts of Networking","totalEnrolled":"11,197","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the basic concepts of networking in this free online course.","description":"This free online Ethical Hacking basic concepts of networking course can be of great help to learners who are willing to learn the basics of networking and ethical hacking. This course gives you information regarding the basic concepts of networking and introduces you to ethical hacking, IP addressing and routing. By the end of the course, you will be ready to face the challenging world of ethical hacking as an eager learner.","courseOutcomes":["Compare ethical hacking and penetrat...","Outline the different ways through w...","Discuss the roles of security and pe...","Explain the types of computer networ...","Compare ethical hacking and penetration testing","Outline the different ways through which entry into a system can be gained","Discuss the roles of security and penetration testers","Explain the types of computer networks","Distinguish between the circuit switching and packet switching mode of data transfer","Explain the basic functions of TCP, UDP and IP","Explain the transparent and non-transparent IP fragmentation","Outline the five defined IP addresses","Analyze the basic functionalities and roles of TCP","Analyze the functionalities and roles of UDP","Explain the applications of IP subnets and IP masks","Compare ethical hacking and penetrat...","Outline the different ways through w...","Discuss the roles of security and pe...","Explain the types of computer networ...","Compare ethical hacking and penetration testing","Outline the different ways through which entry into a system can be gained","Discuss the roles of security and penetration testers","Explain the types of computer networks","Distinguish between the circuit switching and packet switching mode of data transfer","Explain the basic functions of TCP, UDP and IP","Explain the transparent and non-transparent IP fragmentation","Outline the five defined IP addresses","Analyze the basic functionalities and roles of TCP","Analyze the functionalities and roles of UDP","Explain the applications of IP subnets and IP masks"],"courseDescription":"<p>This course will begin by introducing you to ethical hacking. You will learn about the differences between penetration testing and ethical hacking. You will learn about the roles of an ethical hacker and terminologies used in ethical hacking. You will also learn the different ways through which an ethical hacker can gain access to a system.</p><p>The course then explains the different types of computer networks, the difference between circuit switching and packet switching mode of data transfer. You will learn about datagrams and layered network architecture. Next, you will learn about the TCP/IP stack along with the basic functions of TCP, UDP and IP. You will also learn about IP Datagrams and IP Header fields.</p><p>Finally, you will learn about IP addressing and routing. You will learn about IP packet fragmentation and the types of fragmentation. You will also learn the roles of TCP, UDP and IP subnetting in the context of networking. You will learn about IP subnetworks, also called subnets and gain significant knowledge on IP masks, how they are used along with methods of creating subnetworks - VLSM and CIDR. Start this course today, and learn insightful skills in networking and ethical hacking.</p><a href=\"https://alison.com/resume/courses/2279\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2279\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ethical Hacking and Basic Concepts of Networking","description":"In this module, you will learn about ethical hacking and basic concepts of networking. You will learn the roles of an ethical hacker and penetration testing methodologies. You will also learn about the layers of the OSI model and TCP/IP.","topics":["Ethical Hacking and Basic Concepts of Networking - Learning Outcomes","Introduction to Ethical Hacking","Basic Concepts of Networking","Datagram Approach and Layered Network Structure","Introduction to TCP/IP Protocol Stack","IP Datagrams and Header Fields","Ethical Hacking and Basic Concepts of Networking - Lesson Summary"]},{"name":"Module","details":"IP Addressing and Routing","description":"In this module, you will learn about IP packet fragmentation, types of fragmentation, and IP addressing and routing You will also learn the roles of TCP, UDP and IP subnetting in the context of networking.","topics":["IP Addressing and Routing - Learning Outcomes","IP Addressing and Routing - Part I","Basic IP Addressing and Address Classes","TCP, UDP and Port Numbers","TCP Header Fields and Connection Establishment","IP Subnetting","IP Addressing and Routing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ethical Hacking; Basic Concepts of Networking - Course Assessment"]}]}