{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2741","title":"Excel Visualizations Charts and Graphs","totalEnrolled":"6,304","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how and when to use Charts and Visualizations in Excel Free Online Course","description":"In this free online course, you will improve your charting and visualization skills in Excel. You will learn to master the common and lesser well-known charts available in your spreadsheets. Excel is not only an awesome tool for storing data and carrying out calculations, but it is also an amazing visualization tool and we are here to show you how it all works. In this course, you will learn to create stunning useful Excel charts.","courseOutcomes":["Explain the use of the different cha...","Identify and format chart elements...","Summarize data with common charts...","Summarize data with less common char...","Explain the use of the different chart types in Excel","Identify and format chart elements","Summarize data with common charts","Summarize data with less common charts","Recognize the differences between good and bad chart design","Explain the use of the different cha...","Identify and format chart elements...","Summarize data with common charts...","Summarize data with less common char...","Explain the use of the different chart types in Excel","Identify and format chart elements","Summarize data with common charts","Summarize data with less common charts","Recognize the differences between good and bad chart design"],"courseDescription":"<p>We will start this course by looking at the basics of charting in Excel. Then we will explore the many ways to insert charts. You will learn about the options available in the charting elements. Then we will explore the basic formatting options and we will look at good and bad chart design and layouts. Once we acquire the skills to insert and work with charts in Excel, we can move on to the different charts available in Excel and their uses.</p><p>There are many charts available in Excel.&nbsp; Each chart is useful for telling a different story or working with different data types. In this free online course, we will take a deep dive into creating the most used charts in Excel. Charts such as line charts, pies charts, and column charts. We will also further explore formatting options and designs.</p><p>We will then finish this course by looking at less common charts in Excel. Charts such as radar charts, waterfall charts, sunbursts, sparklines, and combination charts. In addition to this, you will learn to create a variety of stock charts and a dashboard using stock images. By the end of this free course, you will be comfortable selecting, inserting, formatting, and working with all charts in Excel.</p><a href=\"https://alison.com/resume/courses/2741\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2741\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Charts in Excel and Chart design principles","description":"In this module, you will learn the various ways you can insert charts in Excel. You will learn how to format charts and use chart elements. You will learn about good and bad chart design and you will also learn how and when to use charts such as Line charts, Bar charts, Column charts, and other common charts that are used in Excel every day.","topics":["Learning Goals","Inserting charts in Excel","Principles of Visualizations","Working with the most common charts in Excel","Lesson Summary"]},{"name":"Module","details":"Working with less common charts in Excel","description":"Now that you have mastered the most common charts in Excel, it is time to up your game and learn to master the less common charts in Excel. Excel has a lot of charts and it is important to understand how and when to use the less common charts. Charts such as Bubble charts, stock image charts, waterfall charts, stock charts and much more","topics":["Learning Goals","Working with less common charts in Excel","Sparkline's, dashboards and More","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment - Excel Visualizations Charts and Graphs free online course"]}]}