{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5353","title":"Excel's Data Tools and Management for Beginners","totalEnrolled":"2,494","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Excel’s data management tools in this free online course and master formatting styles and shortcuts.","description":"This Microsoft Excel tutorial explains how to use the program’s basic features and data management tools. We show you how to create spreadsheets, format cells and apply multiple types of borders before exploring Excel's keyboard and mouse shortcuts and different copying options. We then explore the program’s various data tools and flash-fill features. Sign up to master the basics of using Excel for spreadsheets, data management and visualisation.","courseOutcomes":["Explain how Excel’s spell check syst...","Describe how to format cells and the...","Discuss the way numbers behave in Ex...","Outline useful keyboard shortcuts fo...","Explain how Excel’s spell check system","Describe how to format cells and the use of multiple styles of border","Discuss the way numbers behave in Excel and how to change that behaviour","Outline useful keyboard shortcuts for editing data in Excel","Summarise how to group multiple worksheets in Excel","Outline how to make navigation easier by using mouse and keyboard shortcuts","Explain how to use data validation rules to prevent the inclusion of bad data","Outline the features of custom data validation errors and alerts","Describe how to separate text in a column and remove duplicates","Explain how to split data of a fixed width","Summarise the features of ‘flash fill’ in Excel data","Discuss how to use ‘goal seek’ for simple what-if analysis","Outline different data types and data tables for multiple input data","Explain how Excel’s spell check syst...","Describe how to format cells and the...","Discuss the way numbers behave in Ex...","Outline useful keyboard shortcuts fo...","Explain how Excel’s spell check system","Describe how to format cells and the use of multiple styles of border","Discuss the way numbers behave in Excel and how to change that behaviour","Outline useful keyboard shortcuts for editing data in Excel","Summarise how to group multiple worksheets in Excel","Outline how to make navigation easier by using mouse and keyboard shortcuts","Explain how to use data validation rules to prevent the inclusion of bad data","Outline the features of custom data validation errors and alerts","Describe how to separate text in a column and remove duplicates","Explain how to split data of a fixed width","Summarise the features of ‘flash fill’ in Excel data","Discuss how to use ‘goal seek’ for simple what-if analysis","Outline different data types and data tables for multiple input data"],"courseDescription":"<p>This Microsoft Excel tutorial lays out the basics of the program’s data management capabilities. We first explain how to create a spreadsheet and make basic formatting decisions such as text colours and border style. We then show you how to use Excel’s document writing system to check for spelling errors. The course takes you through basic skills like applying different formats to numbers and currencies.</p><p>The course then teaches you how to use Excel’s productivity tools and keyboard shortcuts. We discuss how to edit, move characters and remove errors with the keyboard. We show you how to navigate spreadsheets more efficiently with mouse shortcuts and how to make the most of the program’s auto-fill feature as you add different types of data. The course demonstrates how to optimise data entry with options like copying cells, filling series and others. We explore some more advanced functions like grouping worksheets to make changes to multiple sheets simultaneously. We explain how to remove duplicate data from Excel using the ‘remove duplicate’ tool.</p><p>We then examine Excel data validation and explain the validation rule that specifies what type of data can be entered into a cell. We show you how to split cell contents into two or more columns. The course explores Excel’s ‘flash fill’ feature that automatically fills our entries when it recognises patterns in the data. We examine the data table and demonstrate how to experiment with different input values to see how they affect formulas. Microsoft Excel is a popular and powerful spreadsheet program used in almost every field so learning how to use it can strengthen your CV and ability to manage data. Sign up for this Excel tutorial to advance your career.</p><a href=\"https://alison.com/resume/courses/5353\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5353\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Excel for Beginners","description":"In this module, we will be introduced to the basic features of Excel for beginners. We will learn about how to create spreadsheets, format cells, and apply multiple styles of borders. In addition, we will also explore helpful keyboard and mouse shortcuts as well as different copying options in excel.","topics":["Excel for Beginners - Learning Outcomes","Introduction to Excel Data","Creating your First Spreadsheet","Formatting Cells","Keyboard Shortcuts","Auto filling","Mouse Shortcuts","Grouping Worksheets","Pasting Options","Excel for Beginners - Lesson Summary"]},{"name":"Module","details":"Excel Data Management Tools","description":"In this module, we will learn about excel data validation tools to prevent errors. Next, we will explore how to remove duplicate data and the incredible flash-fill features. In addition, we will also discuss data types and data tables for multiple input variables.","topics":["Excel Data Management Tools - Learning Outcomes","Introduction to Data Tools and Management","Drop Down Lists","Splitting Data into Different Columns","Splitting Data of a Fixed Width","The Flash Fill Tool","Goal Seek to Reach Your Results","Data Tables to Test Multiples Values","The New Rich Data Types","Excel Data Management Tools - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Excel's Data Tools and Management for Beginners - Course Assessment"]}]}