{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3343","title":"Exploring SQL Server 2016: Intermediate","totalEnrolled":"1,462","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course on SSAS SSRS explains the use of encrypted data and other improved features of SQL Server 2016.","description":"SQL Server 2016 is different from working with the initial versions of SQL Server. The 2016 version has improved features such as data masking, always encrypted data, row-level security and other functions created to enhance the quality of your work. This course provides knowledge for working with the SSAS SSISDB catalogue, SSRS and other features. If you are a DBA or a generalist interested in SQL, you will benefit by completing this course.","courseOutcomes":["Identify the restrictions in row-lev...","Discuss encryption of data using ‘Al...","Recall and create a virtual machine ...","Explain the concept of ‘data masking...","Identify the restrictions in row-level security","Discuss encryption of data using ‘Always Encrypted’","Recall and create a virtual machine in the Cloud","Explain the concept of ‘data masking’","Discuss the bi-directional filtering solves the many to many relationships","Outline how the providers can use commands and metadata with XML methods","Describe the workflow for creating key performance indicators in the SQL reporting services 2016","Recall and Install the R-studio for the use of R- scripting language","Identify some of the problems solved by the master data service (MDS)","Outline the requirements for using the master data services (MDS)","Identify the restrictions in row-lev...","Discuss encryption of data using ‘Al...","Recall and create a virtual machine ...","Explain the concept of ‘data masking...","Identify the restrictions in row-level security","Discuss encryption of data using ‘Always Encrypted’","Recall and create a virtual machine in the Cloud","Explain the concept of ‘data masking’","Discuss the bi-directional filtering solves the many to many relationships","Outline how the providers can use commands and metadata with XML methods","Describe the workflow for creating key performance indicators in the SQL reporting services 2016","Recall and Install the R-studio for the use of R- scripting language","Identify some of the problems solved by the master data service (MDS)","Outline the requirements for using the master data services (MDS)"],"courseDescription":"<p>Microsoft SQL Server is a relational database management system developed by Microsoft. It is highly flexible and can run on laptops and even a high-powered cloud server. Since the release of the SQL server 1.0, the SQL server has kept evolving. While its core function is its relational database management system, the SQL server has become far more than that. This ‘Exploring SQL Server 2016 intermediate course’ has been specially prepared to take you through various new features and enhancements to the data platform. These include delivery breakthrough performance, advanced and richer security, integrated reporting and analytics capabilities. Understanding these features and using each to suit your desired outcomes is essential. This course will introduce you to row-level security and its functionalities. You will learn how to filter and block the data access and the restrictions of the row-level security. Analyse the dynamic masking function and illustrate how to define ‘data masking’ within the structure of a table to protect data from unauthorised access.</p><p>The course will teach you to integrate the R-script into SQL server and management studio and the syntax for inputs and outputs in the R- language. Investigate the stretch database and work with Microsoft Azure to create a virtual machine in the cloud. This course defines master data management (MDM) and explains the master data services (MDS) in detail. It covers the installation process of the MDS in MS Excel, how it works and how to develop the MDS. You will also learn about the requirements for using the MDS and the problems the MDS addresses. Creating report designs starts with embedding things in a web application. To successfully design easy-to-read reports, you will need a detailed knowledge of the improvements in the SQL Server 2016 reporting services (SSRS) covered in this course. You will learn about the key performance indicators (KPIs) and the workflow for creating them.</p><p>Furthermore, this course explores bi-directional filtering and display folders, heap fragmentation and memory location under the SQL server analysis service (SSAS). Did you know that it is possible to find and display the name of a column in which an error occurred? The course explores the SSISDB catalogue and how to debug errors in the SQL server. It illustrates the creation of a catalogue, its configuration and how to deploy packages and projects in SQL Server 2016. However, the package can fail after deploying a package in SQL Server 2016. By completing this course, we will show you how to revert to the previous deployment in the catalogue. Explore how to protect sensitive data using the ‘Always Encrypted’ value and configure the ‘Always Encrypted’ value for individual database columns containing the sensitive data to be encrypted. The learning content in this course is fundamental for any student, researcher, analyst, IT business developer or anyone with interest in creating programs in SQL Server 2016. So register for this course and start your learning.</p><a href=\"https://alison.com/resume/courses/3343\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3343\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Security and Availability","description":"In this module, you will be introduced to working with some of the new features of SQL server 2016. It explores row-level security, dynamic masking and always encryption. You will learn about the version of replication, how to work with Microsoft Azure, as well as how to create virtual machines in the cloud.","topics":["Security and Availability - Learning Outcomes","Row Level Security","Always Encrypted","Data Masking","Clusters and Replication","Stretch Database","Security and Availability - Lesson Summary","Security and Availability - Assessment"]},{"name":"Module","details":"Integrated Services Catalogs (SSIS)","description":"In this module, you will be introduced to working with the SSISDB catalogue in SQL server 2016. You will learn how to create a catalogue, set up the catalogue environment and deploy packages and projects. This module covers the new database roles in SSISDB, the data source v3 and v4 protocol and other expanded features on the SQL server 2016.","topics":["Integrated Services Catalog (SSIS) - Learning Outcomes","Integrated Services Catalog (SSIS) I","Integrated Services Catalog (SSIS) II","Integrated Services Catalogs - Lesson Summary","Integrated Services Catalog (SSIS) - Assessment"]},{"name":"Module","details":"SSAS and SSRS","description":"This module explores the features of the analysis services (SSAS) and reporting services (SSRS) in SQL server 2016. It analyzes the Tabular model scripting language and the DBBC command. You will also learn about the DAX function.","topics":["SSAS and SSRS - Learning Outcomes","Analysis Services (SSAS) I","Analysis Services (SSAS) II","Reporting Services (SSRS)","SSAS and SSRS - Lesson Summary","SSAS and SSRS - Assessment"]},{"name":"Module","details":"Advanced Integration","description":"In this module, you will be taken through the installation process for the R- studio for the R- language. This module explores the improvements of the master data services ( MDS) in SQL server 2016.","topics":["Advanced Integration - Learning Outcomes","R - Language","Master Data Service","Advanced Integration - Lesson Summary","Advanced Integration - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Exploring SQL Server 2016: Intermediate - Final Assessment"]}]}