{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4408","title":"Figma Design Basics and Features","totalEnrolled":"5,205","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will equip you with the knowledge and basic skills needed to design vector graphics using Figma.","description":"This ‘Figma Design Basics and Features’ course has been designed to teach you the essential skills and techniques required to create vector graphics and app prototypes. This course teaches you how to develop basic shapes in Figma, make comments, share Figma files and export your designs. Explore some advanced Figma features, which include some keyboard shortcuts and how to design an IOS prototype app. Enrol today!","courseOutcomes":["List the various types of drawing to...","Recall some shortcuts used in Figma...","Explain the functions of the ‘scale’...","Distinguish between the various type...","List the various types of drawing tools in Figma","Recall some shortcuts used in Figma","Explain the functions of the ‘scale’ tool in Figma","Distinguish between the various types of Boolean operators","State the various methods of loading images into Figma","Identify the function of the ‘component’ tool in Figma","Distinguish between the various types of image formats used in Figma","Recall the procedures for creating a dashboard in Figma","Explain the function of the ‘content reel’ tool in Figma","List the various types of drawing to...","Recall some shortcuts used in Figma...","Explain the functions of the ‘scale’...","Distinguish between the various type...","List the various types of drawing tools in Figma","Recall some shortcuts used in Figma","Explain the functions of the ‘scale’ tool in Figma","Distinguish between the various types of Boolean operators","State the various methods of loading images into Figma","Identify the function of the ‘component’ tool in Figma","Distinguish between the various types of image formats used in Figma","Recall the procedures for creating a dashboard in Figma","Explain the function of the ‘content reel’ tool in Figma"],"courseDescription":"<p>We have developed this course to help graphic designers quickly design, build and export files for wireframing and prototyping using the Figma design application. First, we teach you how to create a Figma account and set up a Figma application on a Windows machine or Mac operating system. You will learn how to make your first Figma design and how the function of a page in Figma allows you to organise multiple screens and parts of the project in organised folders. We demonstrate how to tweak the dimension of any frame to your desired taste. Create different objects using the ‘shape’ tool and move and pan around the design environment using the ‘hand’ tool, zooming in and out with ease. We clarify the importance of ‘comments’ and how to make them in Figma. You will also learn to share a file, copy and paste objects and elements and arrange layers using the ‘alignment’ tool.</p><p>We will then introduce you to Boolean operations, their functions and types. Next, we will show you how to add and create a specific visual effect using blending modes. Understand how to maintain a particular consistency and efficiency in the design using components. There are different types of image formats, which include JPG and SVG. Explore these and learn how to preview interactions by creating links between frames and elements within frames using prototypes. Finally, you will learn about plugins and how to add them to the design. We will teach you about version control and give you some keyboard shortcuts to speed up your work. Finally, you will know how to create a prototype iOS application using UI kits.</p><p>Figma is an advanced web-based and desktop graphic design application that offers amazing modern-day collaborative work on wireframing user interface/user experience (UI/UX) prototyping. It is a robust application that enables you to create outstanding UX designs that are user-friendly and professional. By taking this course, you will acquire the basic knowledge required to use Figma to create basic shapes, share files, create typography and design a prototype iOS application using UI kits. So why are you waiting? Take this course and improve your graphic design skills today!</p><a href=\"https://alison.com/resume/courses/4408\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4408\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Figma Interface and Features","description":"In this module, you will be introduced to the Figma interface and features, you will learn how to install Figma on windows, Mac OS, how to create basic shapes, make comments and share Figma files, you will be shown how to scale, resize elements and edit shapes and you will learn about typography and blending modes.","topics":["Introduction to Figma Interface and Features - Learning Outcomes","Introduction to Figma Interface","Figma Features and Tools","Introduction to Figma Interface and Features - Lesson Summary"]},{"name":"Module","details":"Figma Components and Advanced Features","description":"In this module, you will learn components that are used to create and manage designs in Figma and also how to export files make prototypes which includes designing the dashboard, side menu, you will be shown how to design the IOS app using UI kit and you will learn about version control, auto-layout feature and how to design the landing page.","topics":["Figma Components and Advanced Features - Learning Outcomes","Figma Components","Figma Advanced Features","Figma Components and Advanced Features - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Figma Design Basics and Features - Course assessment"]}]}