{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4104","title":"Foundations of Network Security","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the vulnerabilities of network systems and see what is required to keep them safe in this free online course.","description":"A network system unaware of potential threats and with no plans for recovery is a system that is seconds from collapse. This course outlines network risks, techniques that increase resilience, and the steps to perform recovery and evidence collection. Learn about the different kinds of attacks before examining the various solutions at your disposal. Build on your previous monitoring tools skills and know what actions to take.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>New network threats are constantly evolving. As a result, a network professional must unceasingly learn about and adapt to new developments. This course provides a comprehensive overview of various threats and potential solutions. It begins by illustrating areas of risk, especially the policies, procedures, and solutions to ensure recovery and business continuity in the event of an attack. In addition, you will learn about the various kinds of threats, including ones unique to wireless infrastructure and those that are non-technical. You will also explore how to reduce your vulnerabilities or 'attack surface'.</p><p>The next part delves into methods to make a network a smaller target, including the deliberation of a sometimes overlooked aspect, physical security. You will study several anti-malware options to protect against viruses and malware. Furthermore, you will comprehend the role of switch ports in improving safety. Following that, discover the numerous unneeded services that can be disabled or removed to decrease overall susceptibility. Furthermore, the instructor illustrates the role of firewalls and how they have evolved in terms of features and capability. Finally, be prepared if an attack does occur. You will understand how to identify, document, and recover digital evidence.</p><p>Above all, you will be one step closer to having the necessary skills of a network professional. The course is a must for anyone seriously interested in the field. Network Security is not an option but a necessity and businesses rely on professionals to keep their operations moving smoothly. By understanding how to reduce vulnerability in a network system, you will be on your way to becoming indispensable to a business.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}