{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4003","title":"Fully Dynamic Pacman Game using JavaScript","totalEnrolled":"504","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Get coding and learn to create a fully dynamic Pacman game using JavaScript with this free online programming course.","description":"Explore the diverse world of JavaScript and learn how to create a fully dynamic Pacman game from scratch using JavaScript. This free online JavaScript course will teach you the methods required to dynamically generate the Pacman game boards, dynamically adjust screen sizes to automatically fit the client-screen, along with step-by-step demonstrations on how to apply the various JavaScript Functions, HTML Classes, and CSS Styling Properties.","courseOutcomes":["Explain how to create and design ass...","Describe how to build a game board u...","Explain the method for adding moveme...","Describe the method for keeping scor...","Explain how to create and design assets for a game using CSS and HTML","Describe how to build a game board using CSS Grid in JavaScript","Explain the method for adding movement patterns for items using Math Random in JavaScript","Describe the method for keeping score and tracking lives in a game using JavaScript","Describe the method for adding Game Over and Game Win conditions, and resetting the game","Explain the method for generating game boards dynamically in JavaScript","Identify how to test a game for bugs and make sure the code works as expected","Explain how to create and design ass...","Describe how to build a game board u...","Explain the method for adding moveme...","Describe the method for keeping scor...","Explain how to create and design assets for a game using CSS and HTML","Describe how to build a game board using CSS Grid in JavaScript","Explain the method for adding movement patterns for items using Math Random in JavaScript","Describe the method for keeping score and tracking lives in a game using JavaScript","Describe the method for adding Game Over and Game Win conditions, and resetting the game","Explain the method for generating game boards dynamically in JavaScript","Identify how to test a game for bugs and make sure the code works as expected"],"courseDescription":"<p>Game development is a great, fun skill to have in your portfolio and this JavaScript online course will show you exactly how to use this programming language and JavaScript DOM Manipulation to create an interactive, functioning Pacman game. The main setup consists of the HTML file as the basic shell of the project, a CSS Style Sheet, and the JavaScript file. The game code is also logged out in the Google Chrome browser using DevTools. The first module of this course includes instructions on how to create the main assets that are needed for the Pacman Game. The module also provides demonstrations on how to use the JavaScript Query Selector to select the Pacman game elements, and how to create the Pacman game board and append items to it. Some other key content included in this section are methods for adding movement animations to the game and the use of JavaScript’s Math Random function to add logic to the Pacman ghosts’ movement.</p><a href=\"https://alison.com/resume/courses/4003\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4003\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting up, Game board and Movement","description":"In this module, you will learn about the components that are needed for creating the Pacman Game using JavaScript. You will also learn how to create a Game Board using CSS Grid and append items to it. This module also describes how you can use the Math Random function to add an intelligence factor to the movement of items contained within a game.","topics":["Setting up, Game board and Movement - Learning Outcomes","Game Set-up and CSS","Game Board and Animation Frame","Movement Parameters and Tweaks","Setting up, Game board and Movement - Lesson Summary"]},{"name":"Module","details":"Game Scores, Levels and Review","description":"In this module, you will learn how to set up the Game States, and how to create the Game Win conditions. You will also learn how to set up the Player PowerUp function, and use the Math Random function to generate the Pacman Game Board dynamically. This module also includes the testing and final review of the source code.","topics":["Game Scores, Levels and Review - Learning Outcomes","Game Scores and States","Player and Game Levels","Game Test and Review","Game Scores, Levels and Review - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fully Dynamic Pacman Game using JavaScript - Course Assessment"]}]}