{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4255","title":"Basics of Computer-Aided Design","totalEnrolled":"3,673","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the step-by-step basics of CAD to create 2D and 3D objects with this free online course.","description":"Computer-aided design (CAD) helps engineers, architects, and construction managers to create a design in two and three dimensions, visualizing the construction and replacing the manual drawing. This course introduces you to the general features of CAD, the user interface and some tools for modifying shapes in two dimensions. Discover the advantages of using CAD in product design by enroling for free. Optional certification available.","courseOutcomes":["Identify the general features of fre...","Explain some of the basic elements u...","State the advantages of using free C...","Outline the tools for modifying shap...","Identify the general features of free computer-aided design programs","Explain some of the basic elements used in two-dimenionsal shapes","State the advantages of using free CAD in product design","Outline the tools for modifying shape in two dimensions","Explain geometry and modelling in CAD","Lists the constraints found in CAD systems","Discuss the concept of 'workbench'","Recall the kinematic mechanism and mechatronics simulation","Identify the general features of fre...","Explain some of the basic elements u...","State the advantages of using free C...","Outline the tools for modifying shap...","Identify the general features of free computer-aided design programs","Explain some of the basic elements used in two-dimenionsal shapes","State the advantages of using free CAD in product design","Outline the tools for modifying shape in two dimensions","Explain geometry and modelling in CAD","Lists the constraints found in CAD systems","Discuss the concept of 'workbench'","Recall the kinematic mechanism and mechatronics simulation"],"courseDescription":"<p>Before the advancement in technology, architects and civil engineers used to sketch blueprints by hand, which consumed a lot of time and made editing difficult. Today, they use computer-aided design (CAD) to produce 2D or 3D blueprints and floor plans to visualize how the building, bridges, car or aircraft parts will look before any work commences. Have you ever wondered what components go into construction or car manufacturing? This exciting course teaches you practical skills to design 2D and 3D plans, develop technical drawings and gain a good understanding of solid and fluid mechanic terms and laws. Discover the general features of CAD, advantages of using CAD in product design and a step-by-step guide on 3D wireframe modelling.</p><p>Next, you will learn to manipulate objects to modify their visual appearance and use mouse gestures to control and view drawings. Then, study the features of several workbenches for drawing, parts and ray tracing to create and modify existing objects. Acquire the skills to perform extrusion and rotation operations, then delve deeper into defining the length of extrusion and the various types of bounds. Discover several types of blend like chamfer, rounding and variable-radius rounding, and the commands used in transforming geometry. Learn to apply constraints to your assemblies and examine the characteristics of the mechatronics simulation of a vending machine.</p><p>CAD involves the use of computers to help architects and engineers in the development, modification and optimization of designs. It enables engineers to make more accurate representations and visualize their imaginations in 3D drawings. CAD gives you the ability to view objects from any angle and test them by simulating real-world conditions. Today, CAD touches various areas of everyday life, from industrial products and the aerospace, electronics, and manufacturing industries. This course helps you acquire the skills you need to fast track your career in this rewarding field.</p><a href=\"https://alison.com/resume/courses/4255\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4255\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Computer-Aided Design","description":"In this module, you will learn the general features of Free Computer-Aided Design (CAD), how to use CAD in the product design process and gain practical skills to produce 2D and 3D plans and technical drawings.","topics":["Fundamentals of Computer-Aided Design - Learning Outcomes","Introduction to CAD Design","Basics for CAD Design","Geometry and Modelling","Blending Operations in CAD and Parameters in Civil Drawings","Assemblies in CAD Design, Extrusion and Rotations","Fundamentals of Computer-Aided Design - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Computer-Aided Design - Course Assessment"]}]}