{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3588","title":"Fundamentals of HTML","totalEnrolled":"7,384","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the fundamentals of HTML as well as the major updates made in HTML from this free online course.","description":"This free online course on the fundamentals of HTML will give you a comprehensive guide on the major updates available in HTML version 5 (HTML5). You will learn how to download, install, and customize ComodoreEdit, which is the free editing software in HTML5. Other key themes in this HTML course are learning about the new semantic elements along with differences between the placeholder attribute and the value attribute in HTML.","courseOutcomes":["Define HTML...","Explain the major improvements in th...","Discuss the processes involved in do...","Differentiate between the inline ele...","Define HTML","Explain the major improvements in the latest version of HTML","Discuss the processes involved in downloading and installing Komodo, the free editing software in HTML5","Differentiate between the inline element and block-level elements in HTML","Explain how to navigate back to the top of the page on a website after having read some texts and scrolling down on the webpage","Discuss the processes involved in the creation of tables and forms in HTML","Differentiate between the placeholder attribute and the value attribute in HTML","Analyze the differences between the GET method and the POST method of form elements in HTML","Discuss the functions of the meter element and progress element in HTML5","Explain the possibility of playing audio and video directly in the browser without the use of any third-party plug-ins","Define HTML...","Explain the major improvements in th...","Discuss the processes involved in do...","Differentiate between the inline ele...","Define HTML","Explain the major improvements in the latest version of HTML","Discuss the processes involved in downloading and installing Komodo, the free editing software in HTML5","Differentiate between the inline element and block-level elements in HTML","Explain how to navigate back to the top of the page on a website after having read some texts and scrolling down on the webpage","Discuss the processes involved in the creation of tables and forms in HTML","Differentiate between the placeholder attribute and the value attribute in HTML","Analyze the differences between the GET method and the POST method of form elements in HTML","Discuss the functions of the meter element and progress element in HTML5","Explain the possibility of playing audio and video directly in the browser without the use of any third-party plug-ins"],"courseDescription":"<p>HTML is invaluable as a coding language and being adept with its features and framework is a great skill to have for aspiring coding professionals and those in the industry alike. This free online course on the fundamentals of HTML will begin by introducing you to the meaning of HTML as the basis of all things “internet”. The course highlights the major updates made in the latest version of HTML, which is HTML5, to help you understand how HTML works. You will then learn about the processes of downloading and installing Google Chrome and the free editing software known as Komodo Edit, along with the process of navigating the HTML directory.&nbsp;&nbsp;</p><p>Have you ever wondered how the Document Object Model (DOM) works on a browser? This course is designed to teach you how to have a structured representation of your document loaded into the browser and also how to set up a custom appearance that differentiates your text editor from others. Have you ever noticed that your tags close themselves when you create an opening tag? This HTML course will explain the feature of this coding environment called the Commodore, which is responsible for the self-closing tag environment. You will also learn how to validate your HTML files using the World Wide Web Consortium, otherwise known as the W3C. Finally, the course material analyzes how viewers can navigate back to the top of the page after scrolling to the bottom of the page without having to scroll back and lastly, you will learn about the importance of images in HTML and be able to explain the difference between the placeholder attribute and the value attribute in HTML.&nbsp;</p><p>This course is targeted at students or professionals in software development, IT enthusiasts and anyone interested in learning about the HTML coding language. Enrolling in this course could open a world of possibilities in your programming career by giving you the necessary knowledge about this fundamental coding language and its vast applications.</p><a href=\"https://alison.com/resume/courses/3588\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3588\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to HTML","description":"This module will introduce you to the concept of HTML as well as the improvements made in HTML5. You will learn how to get a browser for HTML by downloading Google Chrome, how to download and install Komodo (a free editing software) along with setting up its environment.","topics":["Introduction to HTML - Learning Outcomes","What Is HTML?","What is HTML5?","Getting the Browser and Setting Up the Editor","The Basics of HTML","Self Closing Tags - Environment and Validation","Introduction to HTML - Lesson Summary"]},{"name":"Module","details":"Block Level and Inline Elements","description":"In this module, you will be introduced to the functions of block-level elements in HTML. You will learn about the difference between inline elements and block-level elements group, how to define important text using the opening and closing strong tags, as well as how to navigate back to the top of the page after reading some texts on a web page.","topics":["Block Level and Inline Elements - Learning Outcomes","Block Level Elements","Line Break and Spacing","Span - Text Modifier and Anchor","Linking to the Top of a Page and Images","Block Level and Inline Elements - Lesson Summary"]},{"name":"Module","details":"Tables and Forms","description":"In this module, you will be introduced to the components of a table as well as how to create a form using the form element in HTML. You will learn about the differences between the placeholder attribute and the value attribute, along with the functions of the GET and POST methods in HTML.","topics":["Tables and Forms - Learning Outcomes","Tables and Forms Basic","Placeholder vs Value, and Select Element","HTML5 Inputs and Attributes","Action Attribute, GET and POST","Submit Button and Creating Booking Forms","Tables and Forms - Lesson Summary"]},{"name":"Module","details":"Semantic HTML5 Elements","description":"In this module, you will be introduced to the new elements added to HTML5. You will learn about the meaning of semantic elements in HTML, how to use structural elements in HTML5, the functions of the meter element and progress element, and the improvements made on the multimedia elements in HTML5.","topics":["Semantic HTML5 Elements - Learning Outcomes","New Elements in HTML5","HTML5 Semantic Elements","Meter and Progress Elements","Multimedia in HTML5","Semantic HTML5 Elements - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of HTML - Course Assessment"]}]}