{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4267","title":"Fundamentals of Blockchain and Bitcoin","totalEnrolled":"4,081","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the guiding principles and inner workings of Blockchain and Bitcoin in this free online cryptocurrency course.","description":"In this course, you learn about the fundamental concepts of Blockchain (the financial services company) and Bitcoin (the protocol for trading the bitcoin currency). Study the factors that affect the use of Blockchain - such as its decentralization and distribution - as well as the ins and outs of Blockchain technology. You will also unpack the importance of Bitcoin cryptocurrency, and the elements needed to use it, such as wallets, exchanges.","courseOutcomes":["Define ‘Blockchain’...","Distinguish between the concepts of ...","Explain the structure of a block in ...","Outline the purposes of hashes and l...","Define ‘Blockchain’","Distinguish between the concepts of decentralisation and distribution","Explain the structure of a block in Blockchain","Outline the purposes of hashes and ledgers","Discuss the advantages of using Blockchain over other databases","Explain the concept of cryptography","Outline the advantages of using Bitcoin over fiat currencies","Describe the process of creating new bitcoins","Distinguish between Bitcoin wallets and exchanges","Outline the factors that could affect the price of Bitcoin","Distinguish between Bitcoin and Bitcoin Cash","Distinguish between hard and soft forks","Define ‘Blockchain’...","Distinguish between the concepts of ...","Explain the structure of a block in ...","Outline the purposes of hashes and l...","Define ‘Blockchain’","Distinguish between the concepts of decentralisation and distribution","Explain the structure of a block in Blockchain","Outline the purposes of hashes and ledgers","Discuss the advantages of using Blockchain over other databases","Explain the concept of cryptography","Outline the advantages of using Bitcoin over fiat currencies","Describe the process of creating new bitcoins","Distinguish between Bitcoin wallets and exchanges","Outline the factors that could affect the price of Bitcoin","Distinguish between Bitcoin and Bitcoin Cash","Distinguish between hard and soft forks"],"courseDescription":"<p>This short course covers Bitcoin and Blockchain technology. It begins with a detailed introduction to Blockchain by explaining its most important features: decentralization and distribution. It goes on to uncover some of the inner workings of the technology, and relevant elements like hashes, blocks, Merkle trees, and ledgers. The first half contains a brief history of Blockchain, an overview of its advantages, and an introduction to cryptography (the study of securing communications) and cryptocurrencies.</p><p>The second half begins with an in-depth explanation of Bitcoin and a comparison with regular/fiat currencies. This is followed by an outline of the advantages and disadvantages of the currency, as well as an explanation of the mining/creation process. It explains how to use Bitcoin, the factors that determine its price, and services like wallets and exchanges that facilitate its use. The course concludes by distinguishing between Bitcoin and Bitcoin Cash, explaining the limitations of the verification system, and steps proposed to remedy those problems.</p><p>Bitcoin, similar cryptocurrencies, and Blockchain are becoming increasingly popular as their advantages over fiat currencies (declared by governments to be legal tender and not linked to commodities like gold) become better understood. The course explains how to get started with Bitcoin, and other cryptocurrencies. Start now and gain useful understanding of Blockchain and Bitcoin in three hours.</p><a href=\"https://alison.com/resume/courses/4267\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4267\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Blockchain Technology","description":"In this module, you will learn the features, advantages, disadvantages, and applications of blockchain technology. You will learn about decentralized and distributed systems, the structure of a block, and how they are combined to form a blockchain. You will also learn about hashes, Merkle Trees, and other concepts employed in blockchain technology.","topics":["Introduction to Blockchain Technology – Learning Outcomes","Blockchain Technology","Blockchain Structure and Features","History of Blockchain and Cryptocurrencies","Introduction to Blockchain Technology – Lesson Summary"]},{"name":"Module","details":"Bitcoin Cryptocurrency","description":"This module covers Bitcoin Cryptocurrency in detail. You will learn how Bitcoin compares to fiat currencies, the merits and demerits of the currency, and how new Bitcoins are mined. You will also learn about Bitcoin Wallets and Exchanges, how prices are determined, and how you could get started with using Bitcoin.","topics":["Bitcoin Cryptocurrency – Learning Outcomes","Introduction to Bitcoin","Bitcoin Wallets and Exchanges","Uses and Applications of Bitcoin","Bitcoin Cryptocurrency – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Blockchain and Bitcoin – Course assessment"]}]}