{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1703","title":"Fundamentals of Human-Computer Information Retrieval","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about human-computer information retrieval techniques with this information technology course.","description":"In this free online course in Human-Computer Information Retrieval you can learn the fundamental characteristics of the vast quantities of data and information which appear on the web every day. This course will help you understand the different forms of data, and how modern search engines combine human computer interaction (HCI) studies with complex information retrieval methods to facilitate the convenient navigation of online spaces.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Integrating human and system interaction is the main design challenge in human-computer information retrieval. This course will first teach you different information retrieval techniques. You will study the surrogate query for a Google search in the query space and the different data that can be found on the Web. You will also look into the evaluation metrics that measure the effectiveness of matching document representations to query representations. You will also learn that the World Wide Web is a sample in information retrieval in the document space.<br><br>You will then study the rules that humans obey as outlined in the Human-Computer Communication model. You will look into the Matching Algorithm which matches queries in the Query Space to the appropriate information in the document space. You will look into the spaces where all possible information is stored and asked. You will also learn that in information retrieval, the precision metric is the proportion of all documents that get marked as relevant. This course will also cover the temporal data that can be found on the Web.<br><br>Data and information can be multilingual and dynamic and are being constantly updated and modified. This course will teach you how companies like Google spend millions of dollars trying to continuously improve human-computer information retrieval methods so that the information obtained from a search is relevant. By the end of this course, you will have learned a great deal about this important area in web development and information technology.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}