{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3703","title":"Fundamentals of Google Apps Script And IDE","totalEnrolled":"670","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Obtain valuable skills and knowledge in Google Apps Script and its IDE and start coding with this free online course.","description":"In this course, you will learn about Google Apps Script and what it has to offer in terms of features and coding functionality. This course covers everything, from introducing you to Apps Script and IDE to Deploying Libraries, connecting APIs, and outputting Web App content. You will get at an in-depth look at the new and improved Google Apps Script editor or IDE so you can power up your apps and get more out of Apps Script.","courseOutcomes":["Recognize Google's Developers web ad...","Indicate the purpose of Functions in...","Identify the method for creating Doc...","Outline methods for Debugging and se...","Recognize Google's Developers web address for information about Apps Script","Indicate the purpose of Functions in Google Apps Script","Identify the method for creating Docs and sending emails using Apps Script","Outline methods for Debugging and setting Breakpoints in Google Apps Script","Recognize methods for creating and Deploying Libraries within Google Apps Script","Outline the method for Deploying Web App content within Google Apps Script","Describe the way to add API Services to Scripts","Recognize Google's Developers web ad...","Indicate the purpose of Functions in...","Identify the method for creating Doc...","Outline methods for Debugging and se...","Recognize Google's Developers web address for information about Apps Script","Indicate the purpose of Functions in Google Apps Script","Identify the method for creating Docs and sending emails using Apps Script","Outline methods for Debugging and setting Breakpoints in Google Apps Script","Recognize methods for creating and Deploying Libraries within Google Apps Script","Outline the method for Deploying Web App content within Google Apps Script","Describe the way to add API Services to Scripts"],"courseDescription":"<p>Google Apps Script is a rapid application development platform that, along with its IDE, is packed with useful features that simplify code-writing and execution. This course, Fundamentals of Google Apps Script and Integrated Development Environment (IDE), teaches how to write functional code using the platform. First, we will introduce you to Google Apps Script and the basic functionality you need to get started, such as accessing and creating new Scripts. Then, you will be guided through Google's Developers</p><p>website, as it is the go-to place for information relating to Apps Script. It</p><p>includes Code Samples, Troubleshooting Guides, Support Documentation, and other information that will guide you through coding using Apps Script. After that, the course teaches how to run functions in Apps Script using Services and Methods to achieve your tasks. We create a Docs document and send a Gmail email to give you a demo of these processes.</p><p>Moving on, we introduce you to Apps Script's editor, also known as the IDE. We will provide you with valuable information concerning the available options within it and crucial guidance that will allow you to optimize your code-writing and execution experience. One of the important options that get covered in the course is Debugging. The course will guide you on using IDE's built-in Debugging tool, adding Breakpoints to debug your Script code. You will then learn how to use Variables when writing code in the IDE and distinguish the different states of Variables. This will enable you to make proper use of them when writing your code. After that, we will guide you on navigating Apps Script's left side menu and the options available within it, such as adding Triggers, accessing Executions and Project Settings. Then, we teach you how to add Files to Apps Script, access Libraries, and add Services to your Projects. We then move on to Library and Web App Deployments, guiding you on the processes. And finally, you will learn about features available within the IDE's right-click menu and Command Palette.</p><p>Google Apps Script is a cloud-based platform, so you don't need to install anything on your computer. That makes the coding process more straightforward. And the updated IDE has provided added advantages with its easier-to-read code and advanced Debugging functionality. So overall, the platform offers powerful code-writing and execution capabilities. And these are encapsulated in a simple user interface that makes coding available to anyone willing to learn it. This course comes in to bridge that knowledge gap enabling you to get coding in no time. And with its three-hour maximum study duration, it makes for an indispensable knowledge base for code-writing and execution. It is also video-based, so you will be getting live demos to apply within Apps Script's IDE. So, enrol in this free online course and gain valuable knowledge in Google Apps Script and IDE.</p><a href=\"https://alison.com/resume/courses/3703\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3703\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Google Apps Script","description":"In this module, you will be introduced to Google Apps Script, the ways in which you can access it, and get guided on writing your first script. You will also learn about Google's Developers website and how it provides information relating to Apps Script.","topics":["Introduction to Google Apps Script - Learning Outcomes","Getting Started","Writing your First Script","Introduction to Google Apps Script - Lesson Summary"]},{"name":"Module","details":"Google Apps Script IDE","description":"In this module, you will learn how to use the Debugging tool and add Breakpoints in Google Apps Script. You will also learn to add Files, access and deploy Libraries, output Web App content, and connect APIs to your Scripts.","topics":["Google Apps Script IDE - Learning Outcomes","Apps Script IDE Overview","Apps Script Libraries, Services and Features","Google Apps Script IDE - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of Google Apps Script and IDE - Course Assessment"]}]}