{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3964","title":"Basics of Power Query","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to extract and transform data using Power Query for Microsoft Excel with this free online course.","description":"Power Query is a free add-in tool in Microsoft Excel 2010 and 2013 for Windows, and it has been fully integrated into the 2016 version too. This free online Microsoft Excel tutorial focuses on Power Query's core functions, like data extraction, transformation, and reshaping. You will discover new ways to process data by learning how to connect multiple data sources and perform transformations within the data before creating reports.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you tired of spending all day sorting through a huge number of worksheets to organize a significant amount of data? Would you prefer a superpower to make your job easier? You are in the right place if you have said yes to these two questions. This advanced Microsoft Excel course takes you through how Power Query, like Power Pivot and Power View, is part of the Power BI Suite. It begins by explaining the data manipulation techniques and the methods of fixing specific problems in the query table, such as changing the headers' names, filtering out null values, condensing three columns into one, removing a column, and saving the new file.</p><p>The next section of this Power BI training discusses the concept of M code and many Power Query features with their functionality, including Choose Column, Keep Rows, Remove Alternate Rows, Split Column, Merge Queries, Transform, Move, Format and others. Efficiency is crucial when working with large amounts of complex data and using some shorthand tips and codes included in the course instead of the usual tabs will allow you to speed up your work. Continuing with the efficiency theme, you will be taught how to quickly and easily know which functions to use without writing any code by using the Column from Example feature and the steps to give feedback to Microsoft about a range of topics.</p><p>The final part of the Power BI certification explains the details of merging data from multiple tables with different formats into a single sheet. The course discusses different files from external sources and how to import them into Power Query. Your learning concludes by comprehensively covering the procedure for constructing a relationship between two tables so that you can look up data and get matching results as well as how to combine multiple data from the same folder. This Power BI tutorial is perfect for anyone working with large sets of data in data science, data analytics or engineering and need to combine, interpret or process the data in different ways. What would usually take hours to do manually will take you no time by unlocking the features of Power BI’s Power Query function. Enrol in this in-depth course and discover the many dynamic data transformation tools in one convenient location.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}