{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3084","title":"Basics of JavaScript","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about various JavaScript tags, operators, arrays, how to create objects and elements in this free online course.","description":"If you have ever wondered what makes Javascript such a popular coding language, then this Fundamentals of JavaScript free online course offers a very comprehensive answer. Explore what JavaScript is all about, why it’s a go-to programming language for so many developers, and all the intricacies you need to know such as script tags and how they are used, the types of variables and operators, how objects are created and how to style them as well.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>It’s widely reported that of the nearly-2 billion websites in the world, 95% of them use JavaScript. JavaScript’s versatility on both the client-side and server-side allows you to create interactive web pages and this free online Fundamentals of JavaScript course provides a comprehensive guide to using this text-based programming language. You will learn all about Javascript tags; how to create and implement them as well how boxes are created and the uses of the three different kinds of dialogue boxes. This Javascript tutorial then explains how consoles work and how they are used to log information as part of the JavaScript development process, as well as allow you to interact with a web page by carrying out JavaScript expressions within the page's context. Variables and operators are also covered along with how code commenting works.</p><p>In the next part of this free online course, you will study arrays, array data types in JavaScript and how to add items to an array - this also includes learning about array prototype and how to loop over an array. Objects in Javascript follows your study on arrays and you’ll comprehensively analyze how objects are designed on a simple object-based paradigm, created and defined, and how the interval method executes a specified function multiple times at a set time interval. Specific objects such as date and time, creating and clearing intervals and how to implement callbacks completes this section of your studies. The final part of the content details some more advanced aspects of Javascript. You will learn how to create Document Object Model (DOM) elements, and how to add and remove elements within JavaScript code. Query selectors are explained and you will be able to distinguish between query selectors and query selectorAll, event handlers and how they are used to prompt messages, the methods used to set event handlers.&nbsp;</p><p>JavaScript is a critical part of modern programming and learning these skills can open many doors for you and your career. If you are new to coding and are curious about the fundamental functions of JavaScript or do have coding experience but have not expanded your knowledge to include JavaScript, then enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}