{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4691","title":"Basics of iOS App Development","totalEnrolled":"848","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to develop and publish mobile applications on Apple's iOS platform in this free online course.","description":"Mobile applications are an integral part of the mobile experience and are the most popular channel for accessing the internet. Apps on Apple's iOS have proven to be the most profitable of all mobile platforms. However, designing and publishing them on the platform can be daunting and discouraging. In this course, you will learn the entire process of developing and testing iOS apps and publishing them on the App Store.","courseOutcomes":["Outline the steps involved in settin...","Explain the function of an app ‘dele...","Discuss the importance of a storyboa...","Distinguish between the text field a...","Outline the steps involved in setting up an iOS development project","Explain the function of an app ‘delegate’","Discuss the importance of a storyboard","Distinguish between the text field and ‘text view’ control","Identify common controls used in developing iOS apps","Summarise the function of a ‘table’ view","Distinguish between a ‘table’ view and a ‘collection’ view","Define ‘geocoding’ and ‘reverse geocoding’","Explain the relationship between location accuracy and battery drain","Outline the process for using SQLite in an iOS application","Summarise the process involved in publishing an app on the App Store","Recall the need for a provisioning profile in testing iOS apps","Outline the steps involved in settin...","Explain the function of an app ‘dele...","Discuss the importance of a storyboa...","Distinguish between the text field a...","Outline the steps involved in setting up an iOS development project","Explain the function of an app ‘delegate’","Discuss the importance of a storyboard","Distinguish between the text field and ‘text view’ control","Identify common controls used in developing iOS apps","Summarise the function of a ‘table’ view","Distinguish between a ‘table’ view and a ‘collection’ view","Define ‘geocoding’ and ‘reverse geocoding’","Explain the relationship between location accuracy and battery drain","Outline the process for using SQLite in an iOS application","Summarise the process involved in publishing an app on the App Store","Recall the need for a provisioning profile in testing iOS apps"],"courseDescription":"<p>Almost all internet interactions on mobile occur by using apps and more people are accessing the internet utilising this method than ever before. As a result, more and more mobile apps are being developed and published daily. Despite being a minority in the mobile market, applications published on Apple’s iOS platform earn more revenue than competing platforms. However, this comes with a challenge for developers as they must navigate proprietary services, software and numerous rules before submitting their apps for approval.</p><p>This course will take you through the entire process that you must follow to successfully develop an iOS app and publish it on the App Store. You will first learn to register as an Apple developer, a prerequisite for publishing apps on the platform and the process for setting up an app development project. Next, you will learn to add and modify essential user interface elements like labels, buttons, sliders and text fields. Finally, you will also discover the process for incorporating alarms and reminders into your app.</p><p>Then you will learn how objects like the tab bar and navigation controller can add and connect views in your application. Explore social media integration and discover how to post directly from your application on social media. Study the important development aspects like working with databases, servers and iCloud in detail and expose you to the crucial process of publishing and managing your app on the App Store. Start today and learn to develop and publish iOS apps from start to finish in under four hours!</p><a href=\"https://alison.com/resume/courses/4691\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4691\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Building the User Interface","description":"In this module, you will be introduced to the tools needed for App development for the iOS platform as well as important prerequisites like the Apple Developer registration. You will also learn to set up a project and use various controls to build the user interface of your iOS application.","topics":["Introduction and Building the User Interface – Learning Outcomes","Introduction to iOS App Development","Storyboard and Building App Controls","Progress View, Page Controls, User Alerts and Messages","Introduction and Building the User Interface – Lesson Summary"]},{"name":"Module","details":"Table View, Navigation and Controls","description":"Table and collection views organise content into lists and grids and are used in a lot of iOS applications. In this module, you will learn to create and modify table views, and add indexes for easy navigation. You will also learn to add and connect pages in your app, and how to create alerts, incorporate web content and pass data across pages.","topics":["Table View, Navigation and Controls –Learning Outcomes","Creating a Table View","Navigation Controller","Tab Bar Controller, Alerts and Messages","Table View, Navigation and Controls –Lesson Summary"]},{"name":"Module","details":"iOS Features and Working with Data","description":"In this module, you will learn to use important features that involve location and data. You will learn about geocoding, reverse geocoding, and getting a user's location. You will also learn to post on Twitter and Facebook, directly from your app. Finally you will learn to work with JSON, SQLite, iCloud and how to publish your app on the App Store.","topics":["iOS Features and Working with Data – Learning Outcomes","iOS Features and Working with Location","Working with Data","Publishing Your App","iOS Features and Working with Data – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Fundamentals of iOS App Development – Course assessment"]}]}