{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5306","title":"Getting Started with QuickBooks Desktop 2022","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use QuickBooks Desktop 2022 to handle accounts and finances in this free online bookkeeping course.","description":"This bookkeeping course explains how to use the advanced features of QuickBooks 2022. We show you how to set up company profiles in QuickBooks and adjust settings to meet your business needs. We then explore the process of creating and managing customers, vendors, payments and deposits and discuss how to assign different roles to each user. Sign up to learn how to use QuickBooks to handle your accounting and business administration needs.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This QuickBooks Desktop 2022 tutorial explores QuickBooks' features that allow for faster performance while facilitating bill payments and web accessibility for tracking revenue. We compare the program’s desktop and online versions and discuss which is easier to use. We begin by showing you how to set up your own QuickBooks Desktop ‘company’ files. Our tutorial then demonstrates how the ‘interview’ feature can be used step by step to create and edit a company profile. We also discuss how to back up the ‘company’ file and move QuickBooks Desktop data onto the online platform.</p><p>The course explains how ‘preferences’ can make working with QuickBooks easier and more efficient. We teach you how to set up permissions and roles for different QuickBooks users. We also cover how to set up equity and sub-accounts and use charts of accounts. Would you like to know how to estimate, receive and invoice payments for customers and jobs with QuickBooks? We discuss this in detail and demonstrate how to save and manage customer information with the new QuickBooks ‘customer groups’ feature. Our tutorial shows you how to generate invoices from estimates and create customer estimates and credit memos. We investigate how to create statements and use the ‘income tracker’.</p><p>Finally, the course discusses how to use QuickBooks to work with vendors and handle information related to them. We explain how to pay bills using QuickBooks Desktop and show you how to upload and review vendor bills. Would you like to know more about the program’s ‘accounts payable’ functions and the payment of bills? We go over some options for paying bills. We outline how vendor credits work and analyse the ‘inventory’ and ‘purchase order’ systems. QuickBooks offers a powerful tool to professional accountants or business owners who would like the most advanced and flexible bookkeeping software for their company. Sign up for this QuickBooks tutorial to learn how to use the program to manage your finances and run your business.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}