{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2631","title":"GIS Data Quality and Geographic Positioning System","totalEnrolled":"3,512","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about data quality in geographic information system and global positioning system in this free online course.","description":"This free online course will help you to gain an understanding of data quality in geographic information systems. You will be introduced to data assessment techniques, and the errors they may have. This will bring you up to speed with the aspects considered for data accuracy, the factors affecting spatial data quality, and the sources of error in spatial data. You will then learn about the map display and the global navigation satellite systems.","courseOutcomes":["Evaluate the errors and uncertaintie...","Identify the possible sources of err...","List the most important measures of ...","Compare the aspects considered for d...","Evaluate the errors and uncertainties in the geographic information system","Identify the possible sources of errors in the geographic information system","List the most important measures of data quality in GIS","Compare the aspects considered for data accuracy in GIS","Discuss how positional accuracy can be measured in GIS","List the factors that affect the quality of spatial data in GIS","Analyze the history of the global positioning system in GIS","Identify the working principles of the global positioning system","Identify the different segments that can be seen in a GPS and how these segments are designed and operated","Define waypoint in relation to the global positioning system","List the global positioning system satellite signals","Explain the meaning of a differential global positioning system","Evaluate the errors and uncertaintie...","Identify the possible sources of err...","List the most important measures of ...","Compare the aspects considered for d...","Evaluate the errors and uncertainties in the geographic information system","Identify the possible sources of errors in the geographic information system","List the most important measures of data quality in GIS","Compare the aspects considered for data accuracy in GIS","Discuss how positional accuracy can be measured in GIS","List the factors that affect the quality of spatial data in GIS","Analyze the history of the global positioning system in GIS","Identify the working principles of the global positioning system","Identify the different segments that can be seen in a GPS and how these segments are designed and operated","Define waypoint in relation to the global positioning system","List the global positioning system satellite signals","Explain the meaning of a differential global positioning system"],"courseDescription":"<p>This course will begin by introducing you to data quality, the different data measures available, data assessment techniques, and the errors they may have. You will learn about the various aspects considered for data accuracy, the factors affecting spatial data quality, and the sources of error in spatial data. You will also learn about map display and visualization in GIS. This will lead you to the different transformations that occur in the process, and how to edit data in terms of getting useful data.&nbsp;</p><p>Next, you will become familiar with how you can transform information into conveyable images. You will gain an understanding of map graphic symbols, the symbols that you can use for different types of maps, and certain styles through which you select your map symbols. This will further lead you to the global positioning system. You will be introduced to the history of the global positioning system, the working principles, GPS satellite signals, and errors in GPS. You will also be brought up to speed with the global navigation satellite system and an introduction to QGIS.&nbsp;</p><p>Lastly, you will be introduced to global navigation satellite systems and applications. You will gain knowledge about the different systems available, how these systems have evolved, and the control facilities that exist. This will then lead you to the brief history of QGIS, installation of QGIS software; how to download QGIS software from the internet, and install a different plug-in. You will also gain additional knowledge of the interface for QGIS and the various functionalities of QGIS.&nbsp;</p><a href=\"https://alison.com/resume/courses/2631\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2631\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"GIS Data Quality","description":"This module explores data quality, the different data measures, data assessment techniques, and errors that they may have. You will learn about the aspects considered for data accuracy, the factors affecting spatial data quality, and the sources of error in spatial data. You will also learn about map display and visualization in GIS.","topics":["GIS Data Quality- Learning Outcomes","Data Quality and Measures","Positional Accuracy and Source of Errors","Classification Accuracy and Pixel Errors","Spatial Data Editing and Transformations","Map Display and Visualization in GIS","GIS Data Quality - Lesson Summary"]},{"name":"Module","details":"Global Positioning System","description":"This module explores the global positioning system. You will learn about the history of the global positioning system, the working principles, GPS satellite signals, and errors in GPS. You will also learn about the global navigation satellite system and an introduction to QGIS.","topics":["Global Positioning System- Learning Outcomes","Introduction to GPS","GPS: Working and Signals","GPS Errors and DGPS","GNSS and Applications","Introduction to QGIS","Global Positioning System- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["GIS Data Quality and Geographic Positioning System - Course Assessment"]}]}