{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4472","title":"Git Fundamentals","totalEnrolled":"1,734","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about Git and how to use it to save and manage different versions of your code with this free online course.","description":"The most widely used version control system by developers is Git. Git keeps track of the changes you make to files or groups of files so you can see what you've done and go back to previous versions if you need to. In this course, you will discover why Git is one of the best tools for version control. We will show you its concepts and how to use Git to save and manage different versions of your projects with speed and efficiency.","courseOutcomes":["Analyze how to track any file using ...","Explain the distributed version cont...","Relate the distributed version contr...","Recall how to commit a source code i...","Analyze how to track any file using the Git init command","Explain the distributed version control system (DVC)","Relate the distributed version control system with file management and changes","Recall how to commit a source code into the local repository","List and Identify different local and remote commands of Git","Discuss the concept of Git branching and its advantages","Summarize how to review a pull request and merge it in the master branch","Recognize how to use different Git undo commands","Describe how Git works internally and how it stores its data","Analyze how to track any file using ...","Explain the distributed version cont...","Relate the distributed version contr...","Recall how to commit a source code i...","Analyze how to track any file using the Git init command","Explain the distributed version control system (DVC)","Relate the distributed version control system with file management and changes","Recall how to commit a source code into the local repository","List and Identify different local and remote commands of Git","Discuss the concept of Git branching and its advantages","Summarize how to review a pull request and merge it in the master branch","Recognize how to use different Git undo commands","Describe how Git works internally and how it stores its data"],"courseDescription":"<p>Are you a software developer? Have you ever returned to your project after a long time, and everything seems strange to you? Git is a distributed version-controlled system that makes it easy for anyone who codes to track changes in a file or set of files. The primary use of this system is to manage and keep track of your source code during software development. Whenever you develop a software application, there is often a requirement to track down the source code to review new changes and revert to any previous versions if required. Git is an open-source tool backed by a strong community that periodically improves this tool. In this course, you will learn about the workflow of Git, its commands and how to integrate it with an IDE like Eclipse. We will start with the installation of Git on both Windows and Mac operating systems. After that, we will teach you how to track your project using the Git init command.&nbsp;</p><p>Do you need to roll back to a previous version of your source code for some reason? A rollback encourages trial and error when writing codes and allows you to develop better solutions for your project. With the version control functionality of Git, you will be able to revert to any version of your source code. This course will introduce you to the Distribution Version Control System(DVS), including how to commit your code in the local repository. The distribution version control system also makes it possible for each contributor to have an entire project history. Should the remote server be lost, contributors will still have a full copy of the project. What about a hard drive failure? No problem, Git will also back up the full copy of the project in the remote server. Explore how to push your local Git repository to Git remote repository, including some basic commands to interact with the local and remote repository such as Git clone, Git pull, Git fetch and Git checkout.</p><p>A significant feature of Git is Git branching. Git lets you branch out from the initial codebase, makes it easier to work with other developers and gives you flexibility in your workflow. Git branching enables you to fix bugs in your code and encapsulate your changes. Investigate Git branching concepts such as creating branches, merging new branches, deleting branches and more. Study the most important Git commands such as Git undo, Git stash, Git rm and many more. Pull requests are a way to discuss changes before merging them into your codebase. We will show you how to make pull requests and review a file as a contributor to a project. In addition, you will gain insights into how to resolve a Git conflict and how Git works internally. We have designed this course for web developers, app developers and learners who wish to begin a career in software development. Git is by far the most widely used version control system, both for personal and professional purposes. So regardless of whether you write code independently or work as a contributor in a team, Git will be useful for you. So without further ado, get started today!</p><p>A very important feature of Git is Git branching. Git lets you branch out from the initial codebase. This makes it easier to work with other developers, and also gives you a lot of flexibility in your workflow. Git branching enables us to fix bugs in our code and encapsulate our changes. Learners will explore Git branching concepts such as creating branches, merging new branches, deleting branches and more. Learners will study the most important Git commands such as Git undo, Git stash, Git rm and many more. Pull requests are a way to discuss changes before merging them into your codebase. We will show you how to make pull requests and review a file as a contributor in a project. In addition, you will gain insights into how to resolve a git conflict and how Git works internally. This course is designed for web developers, app developers and learners who wish to begin a career in software development. Git is by far the most widely used version control system, both for personal and professional purposes. So regardless of whether you write code independently, or work as a contributor in a team, Git will be useful for you. So without further ado, get started today!</p><a href=\"https://alison.com/resume/courses/4472\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4472\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Git","description":"In this module, you will be introduced to Git, its concepts and commands. We will teach you how to install Git in any operating system and integrate it with an IDE like eclipse. You will be shown how to track changes in a file and commit it to a repository using Git commit as well as how to review a pull request and merge it in the master branch.","topics":["Introduction to Git - Learning Outcomes","Git Installation","Git Commands","Git Branching","Introduction to Git - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - GIT Fundamentals"]}]}