{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3678","title":"Gmail - Maximize your Email Productivity","totalEnrolled":"2,371","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn various features and emailing tips that will maximize your productivity using Gmail with this free online course.","description":"In this course, you will learn various Gmail features, including using Google Drive to send large files and applying labels to messages and creating filters around them. Scheduling emails to automatically send and Granting Access to your account are also covered in this course. You will be getting general productivity tips as well. These serve to boost your efficiency further and enable you to achieve more with Gmail in less time.","courseOutcomes":["Outline the methods to modify the Va...","Recognize functions of Schedule Send...","Identify Conversation View, Offline ...","Recognize the benefits of using Goog...","Outline the methods to modify the Vacation Responder","Recognize functions of Schedule Send, Undo Send and Send Cancellation Period","Identify Conversation View, Offline Mode and Snooze","Recognize the benefits of using Google Drive to send files","List Gmail Label and Filter options","Summarize methods for using Templates in Gmail","Distinguish different Search parameters","Outline the uses of Aliases","Identify how to Grant Access to your Gmail account","Recognize Email Tips to increase your productivity and work more effectively","Outline the methods to modify the Va...","Recognize functions of Schedule Send...","Identify Conversation View, Offline ...","Recognize the benefits of using Goog...","Outline the methods to modify the Vacation Responder","Recognize functions of Schedule Send, Undo Send and Send Cancellation Period","Identify Conversation View, Offline Mode and Snooze","Recognize the benefits of using Google Drive to send files","List Gmail Label and Filter options","Summarize methods for using Templates in Gmail","Distinguish different Search parameters","Outline the uses of Aliases","Identify how to Grant Access to your Gmail account","Recognize Email Tips to increase your productivity and work more effectively"],"courseDescription":"<p>Gmail is Google’s email client. It provides users with the option to create accounts that are free and include 15 gigabytes of storage. Gmail also packs in features that are beneficial to everyone. This course looks at those features, giving you the specifics on each. We start by looking at some basic ones like how you can access Gmail’s Settings. Then, we look at Email Signatures in Gmail. We also</p><p>look at Desktop Notifications, helping you decide whether you would better benefit from having them on or off. After that, we explain how Vacation Responder works, guiding you on its available options. From there, we move on to a helpful feature that is Schedule Send. This is an interesting one that can be quite beneficial to some users. We also look at Undo Send and the Undo Send Cancellation Period and show you how to modify it to your preference.</p><p>Then, we look at Gmail’s Conversation View feature and present you with the benefits of having it set to on or off so you can decide on it, according to your needs. Moving on, we show you how you can add attachments and photos to your emails, emphasizing the added benefits of using Google Drive for this purpose. We proceed to another feature that some users make good use of, and that is Offline Mode.</p><p>After covering a multitude of features, the course moves on to adding Labels and creating Filters. These two features can, sometimes, work hand-in-hand, helping you stay better organized within your Inbox. Of course, we will give you all the information you need to use them and the benefits to you from using each. Gmail’s Email Search also has extensive features, including the search parameters that help you target specific emails when conducting your searches. These and other Search options are detailed within the material. We also show you how to use Canned Responses, also known as Templates. Email Aliases are handy in specific scenarios, and Grant Access allows you to delegate your account. And, having reviewed many of Gmail’s features, we then present you with our Productivity Tips. You can consider those as the links that bind it all together. And, after the Productivity Tips, we move on to our General Email Tips. These ones you can consider as the reinforcements that ensure you have received all the information you need to maximize your productivity in Gmail and work more effectively and efficiently.&nbsp;</p><p>It comes as no surprise that Gmail has undoubtedly held the top spot as the number one email client worldwide for some time now. With its simple, easy-to-use interface, there is no real competition when it comes to email. And creating a Google account is a simplified and smooth process that takes no longer than a couple of minutes. You have the perfect tool that everyone can take advantage of. This course gives you an in-depth view of Gmail. We delve into all of its features and giving you valuable tips that will transform you from a regular Gmail user into a super-user. It is also a video-based course where you will be getting live demos. And did we mention that the course is free? So, do not get left out! Enrol now for this online course and get all the crucial Gmail know-how and tips that are sure to maximize your productivity.</p><a href=\"https://alison.com/resume/courses/3678\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3678\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Gmail Settings and Emailing Features","description":"In this module, you will learn many features that are crucial to becoming a skilled Gmail operator. These include applying Labels to your messages and creating filters around them. You will also be guided on the Undo, Send, and Cancellation period Gmail features. Using Google Drive to send large files in Gmail gets covered as well.","topics":["Gmail Settings and Emailing Features - Learning Outcomes","Gmail Settings, Sending Emails and Conversations","Email Features, Gmail Labels and Message Filters","Gmail Settings and Emailing Features - Lesson Summary"]},{"name":"Module","details":"Gmail Productivity and General Tips","description":"This module presents you with general email tips that allow you to be more effective working with Gmail. We will also present productivity tips that go over key points that provide for an optimized Gmail experience. Conducting email Searches, using Aliases, and creating Canned Responses are covered by the material as well.","topics":["Gmail Productivity and General Tips - Learning Outcomes","Efficiency and Productivity Tips","Access Control, Shortcuts and General Tips","Gmail Productivity and General Tips - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Gmail - Maximize your Email Productivity - Course Assessment"]}]}