{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4681","title":"Gmail Calendar for Business Masterclass","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to use Google Calendar to manage your everyday tasks and activities.","description":"Meetings are essential in any business and scheduling sessions can pose a challenge for many. If you have a personal Gmail account, you have Google Calendar. It is the most versatile of online calendars and makes setting up your schedule of daily activities simple. However, there's a lot more to Google Calendar worth exploring. This course shows you how to get the most out of Google Calendar and improves your life with efficient time management.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>With many time management tools on the web, do you find it challenging to organise your daily tasks and manage your time? In this course, you will learn how to use the Google Calendar for free to plan your busy schedule. Google Calendar is one of Google's free tools. It is a user-friendly application that comes with a Gmail account. It is a potent time management tool and you will find that managing a schedule has never been so convenient. With Google Calendar, you can quickly schedule meetings and events, send invitations, share your plans with your team members and get reminders about upcoming activities so you know what's happening next. But this is just a fraction of its functions as there is far more to Google Calendar. In this course, Teddy Burriss will delve into the different Google Calendar features and tips and tricks you can use.</p><p>We will first introduce you to the calendar's absolute basics, including how to view and access the calendar with your Google account. Then we will walk you through the steps of creating calendars and setting them up to meet your needs. Do you know that you can set up separate personal and work calendars and share your work availability with the public or a specific person while keeping your individual plans private? We will show you how to share your schedule with others and create multiple calendars that you and your team can access. Google Calendar, by default, can automatically add an event taken from your private email. We will show you how to configure Google Calendar to stop adding events from your personal email. Upon that, you will learn how to update an existing event, delete and restore events and search your calendar. We will also guide you on integrating Google Calendar with other services like Calendly and Zoom and demonstrate how to use their features to schedule your meeting without a time conflict.&nbsp;</p><p>Setting up meetings for an event that happens every week simultaneously can be frustrating, but there is a solution, thanks to Google Calendar. Teddy Burriss demonstrates adding event locations that you can also see on the map. He guides you by adding events with a start and stop time, options for an ‘all-day event’ and ‘recurring’ events for a particular day, whether weekly or monthly, simultaneously or across multiple time zones. Learn to manage your time effectively and be organised and productive without hassle. Take this course and become a calendar genius. All you need is a Google account. If you do not have one, set it up and explore the different features of this versatile calendar and make your personal and business life easier to handle. Enrol and start this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}