{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4348","title":"Gmail: From Distraction to Productivity","totalEnrolled":"358","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about Gmail and its associated applications and become more productive and organised in this free online course.","description":"Gmail is a secure and easy way to use email services. But are you making the most of it? While Gmail has a simple interface, it has many settings and options that most people don't know about. Would you like to learn about some of these essential functions? How about making choices that lead to less distraction and more productivity? Enrol and gain the basics of productivity using Gmail and associated insights like how best to send an email.","courseOutcomes":["Recall how to add a profile picture ...","Classify emails from a particular ad...","Explain the steps to add/insert a si...","Outline the steps to enable or disab...","Recall how to add a profile picture using the Gmail interface","Classify emails from a particular address as important","Explain the steps to add/insert a signature","Outline the steps to enable or disable the ‘conversation’ view","Identify some of the settings you can control under Gmail settings and the ‘General’ tab.","Indicate where to go in the Gmail interface to add add-ons","List the two critical elements of being productive when answering emails","Describe the qualities of a good password","Summarise how to add the LastPass Chrome extension","Recall how to add a profile picture ...","Classify emails from a particular ad...","Explain the steps to add/insert a si...","Outline the steps to enable or disab...","Recall how to add a profile picture using the Gmail interface","Classify emails from a particular address as important","Explain the steps to add/insert a signature","Outline the steps to enable or disable the ‘conversation’ view","Identify some of the settings you can control under Gmail settings and the ‘General’ tab.","Indicate where to go in the Gmail interface to add add-ons","List the two critical elements of being productive when answering emails","Describe the qualities of a good password","Summarise how to add the LastPass Chrome extension"],"courseDescription":"<p>Gmail is a popular email service. Even if you haven't heard of or used it before, this course gives a step-by-step procedure to teach you how to register. It begins by illustrating the basics of using email: composing an email, managing the signature and using spell check. After that, you will find out how to create a Google account, set up a profile picture and quickly tour the Gmail interface. Next, explore the core options, the main toolbar and inbox settings before looking at some quick locations for the theme, reading range or conversation view. The first section concludes with Gmail productivity strategies, including using advanced search, creating filters and utilising associated Google applications.</p><p>The next part starts by introducing Google settings. Whether your goal is to create a signature or autoreply, manage notifications or your account, it is all inside Google settings. At this time, you will pick up email best practices. You will discover secret strategies to make email communication fun and distraction-free. Lastly, you cannot overlook security. You will know the vital aspects of good password creation and how to use the LastPass app to increase security further.</p><p>After completing the course, you will never use an email service the same way again. You will know about settings and other possibilities that very few have seen, let alone utilised. By mastering Gmail and the tips to make email a productive endeavour, you will be on your way to more success in your personal and business ventures!</p><a href=\"https://alison.com/resume/courses/4348\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4348\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics to Productivity","description":"This module will take you from the basics of Gmail (signing up for an account, writing emails, inbox settings) to looking at features inside of Gmail and other google products that result in productivity.","topics":["Basics to Productivity - Learning Outcomes","You Can Master Gmail","Basics of Gmail","Sending an Email And Managing It","Quick Settings of Gmail","Gmail Productive Strategy","Other Productive Google Applications","Basics to Productivity - Lesson Summary"]},{"name":"Module","details":"Advanced Settings and Email Best Practices","description":"This module will introduce you to more advanced Gmail settings, such as creating an auto-reply, forwarding, signature creation, and other management tips.","topics":["Advanced Settings and Email Best Practices - Learning Outcomes","Google Setting Complete Guide","Email Best Practices","Security is Everything","LastPass Security","Advanced Settings and Email Best Practices - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Gmail: From Distraction to Productivity"]}]}