{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3561","title":"Google Sheets for Home and Business","totalEnrolled":"3,718","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the use of Google spreadsheets for statistical analysis and data visualizations in this free online course.","description":"In this free online course, learn how to create, view, and edit Google spreadsheets. Study how to perform basic and advanced tasks with Google spreadsheets, including data formatting and modifications, arithmetic and stats operations, as well as the capabilities for data analysis, information customization, and data visualization. The tasks to be taught will range from beginner to advanced levels for a wider reach to ensure proficiency.","courseOutcomes":["Describe the procedures for formatti...","Indicate the basic formulas used for...","Order input data by using the sortin...","Explain basic data analysis, essenti...","Describe the procedures for formatting texts and fixing errors in Google Sheets","Indicate the basic formulas used for mathematical operations in Google Sheets","Order input data by using the sorting, filtering and ranking tools","Explain basic data analysis, essential formatting, and conditional formatting techniques","Analyze data via advanced functions and multi-tab formulas","Relate the concatenation and vertical lookup functions used for processing data","Translate data into graphs, charts, and pivot tables for visualization","Indicate the applications of Google Sheets by creating a home or work budget","Describe the procedures for formatti...","Indicate the basic formulas used for...","Order input data by using the sortin...","Explain basic data analysis, essenti...","Describe the procedures for formatting texts and fixing errors in Google Sheets","Indicate the basic formulas used for mathematical operations in Google Sheets","Order input data by using the sorting, filtering and ranking tools","Explain basic data analysis, essential formatting, and conditional formatting techniques","Analyze data via advanced functions and multi-tab formulas","Relate the concatenation and vertical lookup functions used for processing data","Translate data into graphs, charts, and pivot tables for visualization","Indicate the applications of Google Sheets by creating a home or work budget"],"courseDescription":"<p>Google Sheets is a free, web-based spreadsheet that is provided by the giant internet technology company Google LLC. It is a great tool for spreadsheet operations because it is not difficult to use, comes with hundreds of handy functions, and is easy to share with your collaborators or partners. An exciting feature of the tool is that it gives users the ability to organize information and distil insights from otherwise incongruous data. What is even more exciting is that the tool is available to be used at no cost, i.e., free of charge. In this free online Google Sheets course, you will start by learning how to open a Google account and verify your information so that you can gain access to the Google Sheets tool. Explore the options for creating a new document, and how great the autosave features of the application are, which saves you from unforeseen data losses. You will see how you can create new folders and use the drag-and-drop feature to arrange your files and also how you can navigate between sheets, and customize file options in the template gallery.</p><p>Next, the vital functions of the various menu buttons and icons will be explained. The systems for row and column selection, as well as the cross-sectional techniques for cell labelling, will be described. The topic on beginner formatting will examine the menu contents, text wrapping and formatting techniques, as well as the procedures for modifying the properties of cells, rows and columns. The functions of the format painter and alternating colour tools will also be analyzed. The following bit of content covers the procedures for working with numbers, and the primary operations of the five commonly used formulas (SUM, AVERAGE, COUNT, MAX, MIN) will be taught. Discover the methods for sorting, filtering, and ranking data, as well as the magical effects of the fill handle (also known as the magic blue dot in the bottom right corner). Basic data validation techniques will cover the procedures for validating lists from a range, lists of items, numbers, custom formulas, as well as the information to show for invalid data entries. In addition, some essential formatting and analysis tricks, and the systems for conditional formatting, including the “paste special” method will be demonstrated. The topic on creating multi-tab formulas will examine how to manipulate information via a critical evaluation study of a sample real estate investment data. Finally, important functions like the Count, CountA, CounfIF, Rounding, and SumIF functions will be identified and the use of the SPLIT, CONCATENATE, VLookup, and alternative concatenation functions, that enable you to analyse data with greater precision will be comprehensively covered. The procedures for outputting and visualizing your data via graphs, charts and pivot tables will be explained, and you will be taught how you can create a sample budget. How can the number of values or variables in a dataset be determined? What functions can be used to search and return the value of a specified cell? The solution to these questions will be provided in this course via a step-by-step demonstration of the procedures. This course will dig deep into the obscure nooks and crannies of Google spreadsheets to uncover some of its most useful and important features. The application has many advanced functions, options, and shortcuts, which will make you more productive.&nbsp;</p><p>Whether you are a newbie, or you already have a basic understanding of spreadsheets, but you want to dig deeper and learn more advanced features and functionalities of Google Sheets, this course is the one for you. Enrolling in this course includes covering beginner operations to super advanced functions of spreadsheets, so that you can become a data crunching master.</p><a href=\"https://alison.com/resume/courses/3561\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3561\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basic Functions of Google Sheets","description":"In this module, learn how to create new documents from scratch or via the default templates in the gallery. A simple walkthrough of Google sheets, including how to organize your spreadsheets in Google Drive, will be presented. Then, you will discern how to work with numbers and basic functions.","topics":["Basic Functions of Google Sheets - Learning Outcomes","Introduction","Beginner Formatting","Working With Information: Basics","Essential Formatting and Analysis Tricks","Basic Functions of Google Sheets - Lesson Summary"]},{"name":"Module","details":"Application of Google Sheets","description":"In this module, study the methods for creating and using multi-tab formulas, and vital functions like the Count, CountA, SumIf, etc. The concatenation and vertical lookup functions will be explained. Discern how to visualize your data via charts, graphs and pivot tables. Then, the real-world applications of Google sheets will be demonstrated.","topics":["Application of Google Sheets - Learning Outcomes","Intermediate Google Sheets","Real Life Application of Google Sheets","Application of Google Sheets- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Google Sheets for Home and Business - Course Assessment"]}]}