{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3673","title":"Gradient and Collision Animation - Adobe After Effects","totalEnrolled":"2,970","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create professional animation for your projects in Adobe After Effects in this free online course.","description":"This free online course will teach you everything you need to create breathtaking, awesome animations in Adobe After Effects. You will learn the basics, step-by-step procedures for creating cool animation for your projects. We will show you how to work in a 3D space and show you the ropes to all the necessary tools in After Effects. This course is a point for the convergence of skills and creativity and provides you with a platform for enhancing","courseOutcomes":["Explain how to load the workspace in...","Describe how to create gradients in ...","Discuss how to create gradients, usi...","Explain how to create and animate Co...","Explain how to load the workspace in Adobe After Effects","Describe how to create gradients in After Effects","Discuss how to create gradients, using shapes and animating them","Explain how to create and animate Comic Book Titles with scrolling transition","State how to render your Comic Book Titles animation using both Adobe After Effects and Adobe Media Encoder","Discuss how to create animated Collision Intro Titles","State how to apply a 3D rocky texture to your text","Explain how to load the workspace in...","Describe how to create gradients in ...","Discuss how to create gradients, usi...","Explain how to create and animate Co...","Explain how to load the workspace in Adobe After Effects","Describe how to create gradients in After Effects","Discuss how to create gradients, using shapes and animating them","Explain how to create and animate Comic Book Titles with scrolling transition","State how to render your Comic Book Titles animation using both Adobe After Effects and Adobe Media Encoder","Discuss how to create animated Collision Intro Titles","State how to apply a 3D rocky texture to your text"],"courseDescription":"<p>In this free online course, you will learn how to integrate variance in your gradient and collision animation. Adobe After Effects provides you with the capacity to add diversity and uniqueness to your work. This course covers three major hands-on practical projects with a comprehensive video tutorial. We start by giving you a brief introduction to the animated gradient background in After Effects. First, you will learn how to load the workspace, and then we will show you how to set up and pick a colour palette from Adobe colour. You will also learn how to create a colour scheme from an image and how to apply this colour scheme to your gradient background animation. The course covers how to use shapes to create gradients and explains how to use the stopwatch to add a keyframe to produce animation for your gradient layer. You will learn how to create a comic book title animation and all the necessary skills required and bring the most out of useful tools and shortcut keys needed to arrive at the expected result. The comic book title animation is created from a gallery of pictures and runs on a 3D space. We will show you how to use the available tools to design, position, pattern, blend compositions to give a beautiful flow. We’ll explain how to open photos to be used for the animation in Photoshop. You will learn how to add effects and crop the pictures to the right size for the final video. You will also learn how to animate and import the videos in sequence.</p><p>The course then proceeds to explain how to create animated collisions into titles. This project follows the basic principles for the comic book animation, so it begins with creating a new composition on which the animation is built. Here, you will learn how to create a natural rock texture for the background. Then you will use the typing tool to write whatever name you decide for your project. Familiarising with the layers and tools on the timeline will be a great leap to getting the job done. The course covers how to drag the rock textures in the project and then into the composition. Then you will also learn how to use the effect control panel to adjust the features of the text created. We’ll show you how to light up the animated text with various lights with different effects. In addition to this, we will guide you through the steps to transform your animation into 3D. You will be able to manipulate the layers in a 3D space. To animate the text, you will learn how to use key tools on the timeline and the graph editor to achieve that. To add more fascinating effects to the text animation, you will learn how to add the wiggle from the effect layer.</p><p>This course is ideal for Illustrators, Designers and anyone who has a keen interest in creating animation and learning new skills. And you do not necessarily need prior knowledge or experience to take this course as the video tutorial are very comprehensive. By taking this course, you will learn how to bring your creativity to its full potential while having fun. Why wait? Start this course today and learn valuable skills that will help you to animate like a professional.</p><a href=\"https://alison.com/resume/courses/3673\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3673\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Animated Gradient Background","description":"In this module, you will learn how to create animated gradients to use in your project. You will learn how to load the workspace from the Window tab and begin to animate. You will learn how to choose your own color schemes from Adobe colors and apply these colors to your animation.","topics":["Animated Gradient Background - Learning Outcomes","Introduction and Using Color Schemes","Creating Animated Gradients","Animated Gradient Background - Lesson Summary"]},{"name":"Module","details":"Animated Comic Book Titles","description":"In this module you will learn how to create awesome Comic Book Titles with scrolling transition. You will also learn how to crop your photos to the right size for your animation and you will be able to transform your photos into a classic, comic book pop art-style cartoon in Adobe Photoshop and Adobe After Effects.","topics":["Animated Comic Book Titles - Learning Outcomes","Comic Book Titles Basics","Comic Book Titles Final Touches","Animated Comic Book Titles - Lesson Summary"]},{"name":"Module","details":"Animated Collision Intro Titles","description":"In this module, you are going to be equipped with all the necessary tools and skills you need to know about creating animated Collision Intro Titles in Adobe After Effects. You will learn how to create new compositions for your animation and how to apply a natural rocky texture and animate your text.","topics":["Animated Collision Intro Titles - Learning Outcomes","Creating 3D Rocky Text","Animating The Collision Text","Animated Collision Intro Titles - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Gradient and Collision Animation - Adobe After Effects - Course assessment"]}]}