{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3574","title":"Guide to Security for Linux Systems","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course about cyber security, learn about the protocols and breaches involved in Linux security.","description":"Guide to Security for Linux Systems is a free online course that will introduce you to the parameters and policies that will help you fulfil your responsibility in IT cyber security, of ensuring that your systems are fully secured. You will gain an understanding of the steps needed when securing all operating systems, the different types of security breaches you may encounter, and the tools and software you can use to ensure a safe Linux system.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you an IT professional in the corporate environment enthusiastic about becoming an expert at Linux Security? This free online cyber security certification will introduce you to the principles and steps you will need to ensure that your system is secure from any potential harm. Gain insight into the fact that although Linux is an open-source operating system whose code is easily read by users, it is regarded as more secure when compared to other operating systems. You will implement an internal security protocol and an external protocol if your machine is serving outside services such as HTTP and FTP. In a corporate environment, you will likely be working with different servers, databases, and applications and as a result, you will find out how crucial it is to learn how to secure all the operating systems in this type of tiered environment. Discover that the key priority in Linux security which includes the protection of data, system resources, and application workflows.</p><p>At first, the course will introduce you to the different ways the security of your Linux machine can be breached, which will help you take the appropriate steps to protect your system. You will learn the command that is used to set the parameters around the password without making changes to the user account along with the minimum number of days required between password changes and the maximum number of days the password is valid. These steps will go a long way in ensuring that you reduce the vulnerability of your system. What is the value of setting up a password policy in a corporate environment? This cyber security training will clarify this common question and show you how to use any of the three main files to set the password policy. You will be able to include essential best practices in your password policy, such as preventing users from reusing old passwords and setting the minimum password length. Next, you will learn how to disable Secure Shell (SSH) access for a specific user and disable root login in your machine, after which the process of monitoring the number of users who have not been logged into the system for a long time and how to manually lock or disable those accounts and discussed. Disabling inactive accounts ensures that accounts which may not have been responsibly removed are not available to attackers and section sets up learning about another layer of security, which involves setting the file ownership rights and permissions that users and groups in your Linux system can have. Finally, you will study the process of changing file ownership rights, “message of the day”, “one service per server”, and user account creation.&nbsp;</p><p>Cyber security is a booming market given our reliance on data in the modern world. Network security is of utmost importance because of the value that data and especially user- and BigData has, so this security certification is perfect for those professionals in system administration, Linux security or IT infrastructure.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}