{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3138","title":"Hadoop: Intermediate","totalEnrolled":"379","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the major changes and services within the Hadoop framework with this free online Hadoop course.","description":"This free online Hadoop Intermediate course introduces you to one of the most significant changes made in Hadoop, the introduction of YARN. YARN stands for Yet Another Resource Negotiator and this Advanced Hadoop course provides practical knowledge and hands-on training in defining some Spark applications relevant to programming. Topics covered include YARN, NiFi, HBase, MapReduce and Creating HBase Applications.","courseOutcomes":["Explain how YARN fits within the Had...","Describe how YARN works with HDFS to...","Distinguish between Tez and Spark...","List the functionality task of a pro...","Explain how YARN fits within the Hadoop ecosystem and why it is such an important technology","Describe how YARN works with HDFS to provide a more complete parallel environment for applications","Distinguish between Tez and Spark","List the functionality task of a processor","Outline how to start the NiFi service within Hadoop","Discuss HBase components","Outline the uses of Combiner","Define Combiner","Explain the HBase shell","Discuss HBase Memstore","Outline the limitations of HBase","Explain how YARN fits within the Had...","Describe how YARN works with HDFS to...","Distinguish between Tez and Spark...","List the functionality task of a pro...","Explain how YARN fits within the Hadoop ecosystem and why it is such an important technology","Describe how YARN works with HDFS to provide a more complete parallel environment for applications","Distinguish between Tez and Spark","List the functionality task of a processor","Outline how to start the NiFi service within Hadoop","Discuss HBase components","Outline the uses of Combiner","Define Combiner","Explain the HBase shell","Discuss HBase Memstore","Outline the limitations of HBase"],"courseDescription":"<p>Hadoop Intermediate is a free online course that offers you a comprehensive guide to understanding how YARN improves the multiprocessing capability of Hadoop. This Advanced Hadoop course explains how Hadoop works with the Hadoop Distributed File System (HDFS) in order to provide a more complete parallel environment for applications. The content explains some of the terms that are related to MapReduce, HBase, Tez, Spark’s shell and NiFi and more about Hadoop’s most significant changes in recent years known as Yet Another Resource Negotiator (YARN). With the help of YARN, Hadoop can easily maintain a multi-tenant environment, with better security controls and better availability. In this Hadoop course, discover that NiFi enables real-time visual establishment of dataflows and how you can use the HBase Shell from the command line interface to communicate with HBase.</p><p>The following section of this course will teach you about Hadoop ecosystem newcomers, Tez and Spark. Tez improves efficiency for certain kinds of functions over MapReduce while Spark expands Hadoop's development capabilities by adding a number of new languages such as Python, and the Apache application base. Next up you will analyze the Spark shell and how to run a series of commands in the scala language. You will discover some additional tools for ETL such as Flume, Linux and NiFi. Flume provides a way to perform real-time capture as well as streaming data and Linux provides a number of command utilities for data capturing, transformation and storage. Nifi on the other hand is a generic workflow load tool recently introduced and designed to make it easier to perform ETL operations over a wide variety of data sources and types. This course explores the functionality of some workflow tasks often referred to as processors. The final part of this course gets you going on how to start the NiFi service within Hadoop and explains how to file up a NiFi workflow together with the various processors or tasks needed to build a full workflow process. The course demonstrates all the components of the ETL process and how NiFi can play a significant role in the development of ETL processes within Hadoop. HBase is the next theme covered and you will analyze how to start the HBase shell, its architecture, various commands, design practices and the role it plays in delivering fast robust processing within Hadoop.&nbsp;</p><p>Hadoop is a great BigData solution that can benefit many professions because it is flexible, scalable and fast. As an IT professional you could enrol in this Hadoop Intermediate course to easily learn MapReduce programming as well as many others. If you have a bit of BigData experience or are comfortable with the basics of Hadoop, then this course is your best next step.</p><a href=\"https://alison.com/resume/courses/3138\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3138\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"YARN","description":"This module describes the concepts of how YARN fits into the Hadoop framework and how it improves the multiprocessing capability of Hadoop. The module provides practical knowledge and hands-on experience in defining as well as implementing some spark applications.","topics":["YARN - Learning Outcomes","YARN Basics","YARN Services","Tez and Spark","Spark Shell","Flume and NiFi","YARN - Lesson Summary","YARN  | First Assessment"]},{"name":"Module","details":"NiFi","description":"This module describes the concepts of getting NiFi up and running on a node work Hadoop sandbox. The module illustrates with hands-on practical examples, how to use and file up a NiFi workflow can list and the various processors or task we will need to build a full workflow process. The module comprises four subtopics that explicitly explains concepts related to NiFi.","topics":["NiFi - Learning Outcomes","Installing NiFi","NiFi Components","NiFi Workflow","Configuring NiFi Workflow","NiFi - Lesson Summary","NiFi | Second Assessment"]},{"name":"Module","details":"HBase and MapReduce","description":"This module describes the concepts of MapReduce Combiner. It provides practical knowledge and hands-on experience in defining as well as implementing HBase basics. This module comprises of seven subtopics that explicitly explains concepts related to HBase architecture and components.","topics":["HBase and MapReduce -  Learning Outcomes","MapReduce Combiner","MapReduce Combiner Demo","HBase Basics","HBase Shell Intro","HBase Lifecycle Architecture","HBase Lifecycle Services","HBase and MapReduce - Lesson Summary","HBase and MapReduce | Third Assessment"]},{"name":"Module","details":"Creating a HBase App","description":"This module describes the concepts of the Common HBase design pattern. It provides practical knowledge and hands-on experience in defining as well as implementing HBase design pattern in HBase applications. This module comprises seven subtopics that explicitly explains concepts related to creating an application in Java.","topics":["Creating a HBase App -  Learning Outcomes","Creating HBase App","Creating HBase App Continued","Creating a HBase App  - Lesson Summary","Creating a HBase App | Fourth Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Hadoop: Intermediate - End of Course Assessment"]}]}