{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3094","title":"Hadoop: Fundamentals","totalEnrolled":"723","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the history of the BigData ecosystem Hadoop, its components, architecture and uses in this free online course.","description":"This free online course introduces you to basic concepts of Hadoop using Hortonworks Hadoop Sandbox. It provides practical knowledge and hands-on experience in defining as well as implementing Hadoop architecture in Hadoop Distributed File System (HDFS). Topics to be covered include BigData sources, Hadoop's Ecosystem, Hadoop Architecture, Hadoop ETL (Extract, Transform, Load process), data delivery and also the uses of Hadoop ETL tools.","courseOutcomes":["Define PuTTY...","Explain Volume, Velocity and Variety...","List the data components used by Had...","Discuss the basic concept of Hadoop ...","Define PuTTY","Explain Volume, Velocity and Variety in terms of BigData","List the data components used by Hadoop","Discuss the basic concept of Hadoop architecture","Summarize Velocity, Variety and Volume in terms of BigData","Summarize the history of Hadoop","Explain the abbreviation B.A.S.H.","Summarize the challenges of BigData","List the major users of Hadoop","Discuss the motivation for HDFS","Define BigData","Differentiate between NameNode and DataNode","Define PuTTY...","Explain Volume, Velocity and Variety...","List the data components used by Had...","Discuss the basic concept of Hadoop ...","Define PuTTY","Explain Volume, Velocity and Variety in terms of BigData","List the data components used by Hadoop","Discuss the basic concept of Hadoop architecture","Summarize Velocity, Variety and Volume in terms of BigData","Summarize the history of Hadoop","Explain the abbreviation B.A.S.H.","Summarize the challenges of BigData","List the major users of Hadoop","Discuss the motivation for HDFS","Define BigData","Differentiate between NameNode and DataNode"],"courseDescription":"<p>Hadoop Fundamentals is a free online course that offers you a comprehensive guide to understanding the various concepts of Hadoop, its history and BigData sources. It defines some of the terms that are related to BigData - the goal being to turn data into information, and information into insight. The Hadoop Sandbox provides a working cluster and utilities like PuTTY (data console), which allows you to interact with the cluster in order to run jobs, perform file system operations and demonstrate the capabilities of Hadoop. This BigData course introduces the concept of BigData, some components of the Hadoop Architecture and motivation for HDFS (Hadoop Distributed File System) in the first module. Then the uses of Hadoop ETL tools and the MapReduce concept is covered in the second module with several sub-topics that cover how to deal with problem solving in Hadoop. In this course, you will explore how the term “BigData” is used to describe the exponential growth and availability of both structured and unstructured data, and how critical capturing and managing a lot of data can be especially when it arrives from multiple sources.</p><p>Next in this Hadoop course you will learn about some components of Hadoop architecture, how they fit within the Hadoop framework and the expression of this architecture in HDFS and MapReduce. Here, you will gain an understanding of hadoop architectural design, as it requires various design considerations in terms of computing power, networking and storage. This section of the course explains how Hadoop offers a scalable, flexible and reliable distributed computing big data framework for a cluster of systems with storage capacity and local computing power by leveraging commodity hardware. The last section of this free online course teaches you about the entire Hadoop ecosystem which includes each stage of BigData processing such as Flume and Sqoop, HDFS together with HBase, Spark, MapReduce, Pig, Hive, and Impala. All of these components and much more, play a critical role in using Hadoop and you will learn all about their interdependency and usage.</p><p>This course is perfect for you if you want to learn more about how BigData works, the Hadoop system and architecture or are a data processor or analyst looking to grow your skills. Enrolling is just a quick click away to open a new world of BigData and the fundamentals of Hadoop open-source software.</p><a href=\"https://alison.com/resume/courses/3094\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3094\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Hadoop Architecture","description":"This module describes the concepts of Hadoop using Hortonworks Hadoop Sandbox. It provides practical knowledge and hands-on experience in defining as well as implementing Hadoop architecture in HDFS. This module comprises of seven subtopics that explicitly explains concepts related to BigData, Data delivery, HDFS and the members of Hadoop ecosystem","topics":["Hadoop Architecture - Learning Outcomes","Prerequisites of Hadoop","Introduction to Hadoop","History of Hadoop","Hadoop Architecture","Hadoop Ecosystem","Data Delivery and Hadoop Sandbox","HDFS Basics","Hadoop Architecture - Lesson Summary","Hadoop Architecture Assessment"]},{"name":"Module","details":"ETL and MapReduce","description":"This module describes the concepts of ETL tools, the various sources of BigData. It illustrates with hands on practical examples, how to use Hadoop's ETL tools to ingest them into the cluster and how to compile as well as run a MapReduce application using Hadoop.","topics":["ETL and MapReduce - Learning Outcomes","Big Data Source and ETL","ETL Demo","Understanding MapReduce","MapReduce Demo","Developing MapReduce","Schedule MapReduce","ETL and MapReduce - Lesson Summary","ETL and MapReduce Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Hadoop Fundamentals | Final Assessment"]}]}