{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4713","title":"How to Handle and Use Lead Metal","totalEnrolled":"117","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides you with an understanding of handling, using and working safely with lead metal.","description":"Lead is a valuable and common metal but is also highly hazardous. As the number one environmental pollutant, it is a silent killer attacking us every day. It is one of the biggest health threats to people and a significant challenge to health and safety experts worldwide. This course is a master class that will train you in the best practices and measures to recognise, evaluate, control and minimise the lead hazards in your life and workplace.","courseOutcomes":["Describe the characteristics of lead...","Identify all the sources of lead exp...","Summarise the biochemical and toxico...","Discuss in detail what lead poisonin...","Describe the characteristics of lead, its application and the health hazards associated with lead exposure","Identify all the sources of lead exposure","Summarise the biochemical and toxicological effects of lead on humans","Discuss in detail what lead poisoning is and the measures to prevent it","Describe lead paint and explain how to deal with its potential health effects","Recognise all the effective preventive and protective measures against lead in the workplace","Define all the laws and regulations to prevent or control exposure to lead in the workplace","Describe the characteristics of lead...","Identify all the sources of lead exp...","Summarise the biochemical and toxico...","Discuss in detail what lead poisonin...","Describe the characteristics of lead, its application and the health hazards associated with lead exposure","Identify all the sources of lead exposure","Summarise the biochemical and toxicological effects of lead on humans","Discuss in detail what lead poisoning is and the measures to prevent it","Describe lead paint and explain how to deal with its potential health effects","Recognise all the effective preventive and protective measures against lead in the workplace","Define all the laws and regulations to prevent or control exposure to lead in the workplace"],"courseDescription":"<p>Lead is a naturally occurring metal that has been around and used for centuries, both in domestic and industrial products. Although it is useful, it is a severe health and safety hazard. Indestructible and non-biodegradable, it is considered a 'silent killer' as the health effects of lead exposure are serious. Because lead is so potentially dangerous, the only way to tackle this menace is to be aware of the dangers of lead poisoning and take precautionary measures to reduce its effects. The World Health Organisation (WHO) has also specified the permissible limit of lead in food, water, air, soil and items we use in our everyday activities. According to the U.S. Occupational Health and Safety (OSHA) standard for the general industry, lead awareness training is mandatory for any worker exposed to harmful levels of lead on the job. This course explores making the workplace safe and preventing dangerous lead exposure from affecting employees' health. Study the best practices, techniques and industry measures to identify and prevent hazardous lead exposures and reduce lead-related occurrences.</p><p>The course will first introduce you to the risks associated with lead exposure, lead-related occurrences, the applicable laws and how you can avoid risks. Then, you will become aware of the related health and safety laws that comply with primary industry Environment Health and Safety (EHS) norms and regulations laid out by OSHA. The lessons are presented in a simple video-based format with interactive images and content. All the topics culminate in engaging formative questions followed by a final assessment to test your learning and preparedness at the end of the course.</p><p>Lead is a well-recognised toxicant acknowledged as a grave health hazard. This course is perfect for you if you are a construction worker, carpenter, builder, painter, decorator, plumber or anybody who encounters lead at work. It is best suited for employers or employees who wish to make themselves or their workplace safe. However, it also caters to the requirements of individuals, independent workers, contractors or anybody whose work conditions expose them to lead or lead-containing materials and who wants a deeper understanding of safe handling practices when using lead metal. So join the course now and become lead-wise.</p><a href=\"https://alison.com/resume/courses/4713\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4713\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Exposure to Lead","description":"In this module, you will understand what lead metal is, its sources and how lead can enter the body. The lessons will then help you recognize the dangers of lead paints, the symptoms and treatment of lead poisoning, biochemical and toxicological effects, related health problems on the human body and the employer's role in making the workplace safe.","topics":["Introduction and Exposure to Lead – Learning Outcomes","Exposure to Lead","Biochemical Effects and Lead Poisoning","Lead Paint and Your Health","Introduction and Exposure to Lead  - Lesson Summary"]},{"name":"Module","details":"Lead Poisoning and Preventative Measures","description":"With this module, learn about the preventive and protective measures you can take to fight lead exposure in the workplace and effective practices against fighting the lead menace at home. You will then get familiar with all the stipulated laws, regulations, certifications and requirements related to workplace safety and employer's responsibilities.","topics":["Lead Poisoning and Preventative Measures- Learning Outcomes","Preventive Measures for Lead Toxicity in Workplace","Prevent Lead Poisoning at Home","Lead and the Law","Lead Poisoning and Preventative Measures - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["How to Handle and Use Lead Metal - Course Assessment"]}]}