{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1630","title":"How To Use A 3D Printer","totalEnrolled":"7,784","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about using the hardware and software technology behind 3D printing and its applications.","description":"This free online course on How To Use A 3D Printer will teach every professional in the areas of engineering, design, and manufacturing about 3D printing technology and its applications. Many manufacturing industries now use 3D printing hardware and software technology to manufacture their products. With the help of this course, you will learn how to build a three-dimensional object from a computer-aided design model so make sure to check it out!","courseOutcomes":["Describe how to set up and use the P...","Describe the features of 3D Builder ...","Explain the importance of 3D model r...","Describe the types of 3D objects tha...","Describe how to set up and use the Printrbot Simple 3D printer","Describe the features of 3D Builder software and how it can be used for 3D printing","Explain the importance of 3D model repair","Describe the types of 3D objects that can be printed","Describe how to set up and use the P...","Describe the features of 3D Builder ...","Explain the importance of 3D model r...","Describe the types of 3D objects tha...","Describe how to set up and use the Printrbot Simple 3D printer","Describe the features of 3D Builder software and how it can be used for 3D printing","Explain the importance of 3D model repair","Describe the types of 3D objects that can be printed"],"courseDescription":"<p>3D printing is becoming an increasingly important technology in many manufacturing industries and the course How To Use A 3D Printer introduces you to the hardware and software technology involved in 3D printing.</p><p>The course begins by introducing you to the hardware used in 3D printing. You will learn about the different plastic filaments that are used and you will pick up tips on how to feed the plastic filament into the 3D printer for optimal performance. The course then teaches you about the different components of a 3D printer such as the extruder nozzle and contact sensor and their functions. You'll also learn how to set up and calibrate a 3D printer so that the object is printed correctly on the printer base plate. Finally, the course introduces you to the different 3D print software that can be used to design 3D objects and the importance of using 3D model repair to eliminate errors in the design that can cause defects in the printed object.&nbsp;</p><p>This free online course will be of great interest to professionals in the areas of engineering, design and manufacturing who would like to learn more about 3D printing and its applications. It will also be of interest to all learners who would like to learn more about 3D printing and the future applications of this exciting technology.</p><a href=\"https://alison.com/resume/courses/1630\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1630\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to 3D Printing","description":"In this module you will learn how to set up and use the Printrbot Metal Simple 3D printer. You will also learn about the features of 3D Builder software and how it can be used for 3D printing. You will learn about the importance of 3D model repair and the types of 3D objects that can be printed.","topics":["Introduction to 3D Printing Learning Outcomes","3D Printing Overview","3D Printing Hardware","3D Printing Software","3D Builder","3D Model Repair","End-to-End 3D Printing","Design for 3D Printing","3D Printing Opportunities","Introduction to 3D Printing Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["How To Use A 3D Printer Assessment"]}]}