{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3437","title":"Diploma in HP LoadRunner","totalEnrolled":"296","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches how to test applications and measure performance under load testing with HP LoadRunner.","description":"LoadRunner from Micro Focus is a software testing tool. This course will teach you about HP LoadRunner and its features. We will discuss the web tours sample application, parameterisation and checkpoints in detail. We will study the Virtual User Generator (VuGen) and explain why you use it in conjunction with HP LoadRunner. Along with this, you will explore controller functions, analysis and the correlations available.","courseOutcomes":["Explain the method used for download...","Outline the downloading method of we...","Recall how to record the sample appl...","Outline the different steps involved...","Explain the method used for downloading HP LoadRunner","Outline the downloading method of web tours sample application","Recall how to record the sample application by using VuGen","Outline the different steps involved in parameterisation and its benefits","Explain the features of the controller in HP LoadRunner","Summarise how to use an analysis tool for analysing all the results from the controller","Describe the use of service level agreement in LoadRunner","Explain what is ‘correlation’ in performance testing","Discuss different types of correlation in performance testing","Summarise the difference between file type and table type parameters","Identify the role of parameterisation settings in LoadRunner","Explain the method used for download...","Outline the downloading method of we...","Recall how to record the sample appl...","Outline the different steps involved...","Explain the method used for downloading HP LoadRunner","Outline the downloading method of web tours sample application","Recall how to record the sample application by using VuGen","Outline the different steps involved in parameterisation and its benefits","Explain the features of the controller in HP LoadRunner","Summarise how to use an analysis tool for analysing all the results from the controller","Describe the use of service level agreement in LoadRunner","Explain what is ‘correlation’ in performance testing","Discuss different types of correlation in performance testing","Summarise the difference between file type and table type parameters","Identify the role of parameterisation settings in LoadRunner"],"courseDescription":"<p>To start this course, you will need to download HP LoadRunner. The first section deals with downloading and running the application to ensure you are installing the correct program. We will show you how to extract the zip file and install all the required packages for this application. Next, we will introduce you to the web tours sample application and its uses, which is also a product of HP. This topic will also help you learn how this application works and how to use LoadRunner as a solution for performance testing before describing what VuGen is and why we need this to run alongside HP LoadRunner. Finally, you will explore creating your first script and recording the sample application using VuGen. This course will help you learn how to set up HTML-based and URL-based recording options in LoadRunner. We will teach you to set up script-recording settings in HP LoadRunner.</p><p>Then, we will look at transactions used to measure the time between two or more steps in recording and executing scripts. You will study the multiple ways of transaction usage in scripts and examine the concept of ‘parameterisation’ and how we use this in HP LoadRunner. You will study the different steps involved in parameterisation and its benefits. We describe the differences between the controller and VuGen. In addition to this, this course will help you learn about the functions of the controller in HP LoadRunner. We discuss how to set up run time settings and rendezvous points in detail before studying analysis tools, the third component available in LoadRunner. You will also learn about the concept of ‘correlation’, how we can use correlation and the different types of correlation available in HP LoadRunner.</p><p>The last module dives into the exciting world of ordinal values and how to use these alongside correlation. We help you understand the correlation between dynamic and ordinal values and introduce you to integer and ‘char’ values in LoadRunner. Then, you will practically investigate how to use string variables in C and LR. In addition to this, we will review the table, date and time type in parameterisation. You will look closely at where and why we use date and time parameters in LoadRunner. Finally, we will inspect the parameterisation setting, the different settings and features and its role in LoadRunner. This course is ideal for software developers who want to perform load testing for their applications or those studying in application and software development. So why wait? Start this course today.</p><a href=\"https://alison.com/resume/courses/3437\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3437\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to HP Loadrunner","description":"In this module, you will learn how to download and install HP LoadRunner on your PC or laptop. Then, we will discuss the web tours sample application, parameterization and checkpoints in detail. We will study what VuGen is and why it is needed to run alongside HP LoadRunner. This module will also help you learn different types of recording test scripts, transactions, comments, and think time in LoadRunner.","topics":["Learning Outcomes","Downloading HP LoadRunner","Introduction to VuGen","Types of Recording Scripts","Parameterization Introduction","Lesson Summary"]},{"name":"Module","details":"Controller and Analysis","description":"In this module, we will discuss the features of the controller and how to work on performance test preparation for the controller using the VuGen scripts. In addition to this, you will study how to execute test scripts, set up runtime settings and see a detailed overview of the analysis tool. We will also discuss service level agreement and how you can use SLA in LoadRunner for performing test scripts.","topics":["Learning Outcomes","Introduction to Controller","Introduction to Analysis","Analysis Overview","Lesson Summary"]},{"name":"Module","details":"Correlation and Parameterization","description":"In this module, we will discuss the correlation and parameterization in LoadRunner. You will study what correlation is in performance testing and why we need this. This module will introduce you to integer and char values in LoadRunner. We will discuss how to use string variable in C and LR. We will also discuss the different type of parameterization settings, parameter file type, table type and date/time type parameters.","topics":["Learning Outcomes","Introduction to Correlation","Correlation - Ordinal Value","Parametrization - Advanced","Parameterization Settings","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}