{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1451","title":"HTML5 Game Development Gameplay and Multiplayer Proof of Concept Course","totalEnrolled":"6,844","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to add gameplay features such as sound, magical ability, and quest systems to your computer games.","description":"This free online course in HTML5 Game Development teaches you about developing important and often underappreciated features such as plot, music, and sound effects to your games. Designing a game is about more than just creating characters and scenes, it is also about plot, adventure, interaction, and even soundscape, which play essential parts in engaging the player. This course will also cover developing a multiplayer proof of concept.","courseOutcomes":["Describe the process of adding a mag...","Describe the process of adding sound...","Describe the process of creating and...","Explain how to create an Azure Websi...","Describe the process of adding a magic system to a game","Describe the process of adding sound to a game","Describe the process of creating and adding a Quest System to Azure","Explain how to create an Azure Website","Describe building a Server with Node.js, Express and Socket.io","Explain how to connect the player to the server","Describe the process of adding a mag...","Describe the process of adding sound...","Describe the process of creating and...","Explain how to create an Azure Websi...","Describe the process of adding a magic system to a game","Describe the process of adding sound to a game","Describe the process of creating and adding a Quest System to Azure","Explain how to create an Azure Website","Describe building a Server with Node.js, Express and Socket.io","Explain how to connect the player to the server"],"courseDescription":"<p>The course begins by teaching you how to give magical abilities to your game characters. You will then learn how to load and add sound to your game as well as create a quest system that can make your games more exciting. The course will teach you how to create and set up a title and game over screen. You will also study how to configure an Azure website and a server with Node.js, Express, and Socket.IO to host your multiplayer game.<br><br>You will then learn how to edit your game application in order to include a multiplayer facility. This will enable the game to accommodate more than two players. The course will also teach you how to connect your game to the server that you've created. Finally, you will look into possible means of further expanding your game in order to make it more fun, challenging, and exciting.<br><br>Nowadays, creating an online game is becoming easier, but designing games that offer a truly rewarding game experience remains a difficult as ever. If you want to create more than just a standard forgettable game, the concepts and techniques taught in this course will be a great help. So, have a look at the course today, and start learning how to make games that utilise the engaging elements of magic, beautiful sounds, and challenging quests.</p><a href=\"https://alison.com/resume/courses/1451\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1451\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Rounding out Gameplay","description":"In this module you will learn about adding magic to your game and giving your player character the ability to use it. You will learn about setting up a title screen with buttons. You will learn about adding sound to you game and getting sound to loop. You will learn about creating a quest system in your game to give players a goal to achieve.","topics":["Rounding out Gameplay - Learning outcomes","Magic","Title Screen and Adding Sound","Adding a Quest System","Rounding out Gameplay - Lesson Summary"]},{"name":"Module","details":"Multiplayer Proof of Concept","description":"In this module you will learn about creating and configuring an Azure website. You will learn about building a server with Node.js, Express and Socket.IO to host your multiplayer game on. you will learn about connecting your player characters to the server you created. You will learn about ideas for expanding and further developing your game.","topics":["Multiplayer Proof of Concept - Learning outcomes","Creating and Confirming an Azure Website","Building a Server with Node.js, Express, and Socket.io","Connecting the Player to the Server","Where to go from Here","Multiplayer Proof of Concept - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Gameplay and Multiplayer Proof of Concept -  Course Assessment"]}]}