{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3383","title":"HTML5 and CSS3 Fundamentals","totalEnrolled":"3,683","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course delves into building a website using HTML5, using the latest standard of HTML5 and CSS3.","description":"Explore building a website using HTML5 together with the step-by-step procedure of using the most current standard of HTML5 and CSS3. This course will teach you how to use the text editor to set up different types of lists and when you can use the ‘order’ list. Are you looking to improve your skills in building websites with HTML5 streaming videos or fully utilising HTML5? Then get started with this course today!","courseOutcomes":["Explain the process of building a we...","Outline the important things that ar...","List the step-by-step procedure invo...","Identify the other kinds of text tha...","Explain the process of building a website using HTML5 from the ground up","Outline the important things that are required to build a complete website","List the step-by-step procedure involved in using the newest standard of HTML5 and CSS3","Identify the other kinds of text that can be used for formatting and different list items","Explain how to use the text editor to set up different types of lists that can be used","List the steps involved with adding HTML5 streaming videos to the site","Explain how to use HTML5 plain codes when adding HTML 5 streaming videos to a site","Identify the techniques involved in converting videos to the streaming format that are usable","Explain the process of building a we...","Outline the important things that ar...","List the step-by-step procedure invo...","Identify the other kinds of text tha...","Explain the process of building a website using HTML5 from the ground up","Outline the important things that are required to build a complete website","List the step-by-step procedure involved in using the newest standard of HTML5 and CSS3","Identify the other kinds of text that can be used for formatting and different list items","Explain how to use the text editor to set up different types of lists that can be used","List the steps involved with adding HTML5 streaming videos to the site","Explain how to use HTML5 plain codes when adding HTML 5 streaming videos to a site","Identify the techniques involved in converting videos to the streaming format that are usable"],"courseDescription":"<p>‘HTML5 and CSS3 Fundamentals’ is a course that aims to provide you with in-depth illustrations on how to build websites using HTML5 from the ground up. It is essential to understand the prerequisites to create a complete website and the step-by-step procedure of using the latest standard of HTML5 and CSS3. Before working with HTML5 and CSS3, you must understand the other kinds of text that you can use for formatting and the different usable list items. We demonstrate how you can use the text editor to set up different types of lists and when you can use the ‘order’ list. Discover how to add styles to the page design using CSS and how to add CSS styles to regulate any HTML5 tag with the use of the style attribute. Have you considered working with style property and essential value when adding styles to the page design? This course will teach you diverse styles that you can use to customise the list.</p><p>If you want to know how to change the decoration on the list, utilise the CSS property to change, add a rule for the ordered list or add the ‘UL’ tag to the old list, then this course is for you! We explain the process of linking in web page development, the tag and several variations that you can use to control what we link to. Understand how the links appear and the steps involved in using the internal link to navigate the side pages. Do you know that the site’s page layout can be effectively controlled? The course will describe the arrangement of content blocks, images and other related elements. We explain the properties measured to change the styles of the blocks, how to save changes made and work on the size of the blocks. We will clarify any challenges you may face in building and working on a website using HTML5.</p><p>The course will then work through the process involved in building tables with HTML5 and the importance of using a table during the data formatting process. Learn to use the ‘end’ tag and ‘table row’ tag to set up the ‘TR’ tag. Study the steps involved with building forms for pages, the basics required for simple form and how to use the ‘tag’ attributes. Do you know the specific functions of the ‘action’ attributes during the site creation process? We will help you master adding styles to the form, tags that will support the formatting layout and the ‘form’ element of the label. This course will explain how HTML5 streaming videos can be added to a site, how to use HTML5 plain codes and how to convert videos to the streaming format that are usable. It will fascinate students, researchers or anyone interested in the HTML5 and CSS3 fundamentals. Register for this course today!</p><a href=\"https://alison.com/resume/courses/3383\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3383\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals and Adding Styles in HTML5","description":"This module will teach you how to build a website using HTML5 from the ground up, and the things that are required to build a complete website. The module will also teach you the step-by-step procedure of using the newest standard of HTML5 and CSS3.","topics":["Fundamentals and Adding Styles in HTML5 - Learning Outcomes","Introduction to Fundamentals of HTML5","Other Kinds of Text","Adding Styles Using CSS","List Customization with Styles","Fundamentals and Adding Styles in HTML5 - Lesson Summary","Fundamentals and Adding Styles in HTML5 - Assessment"]},{"name":"Module","details":"Linking Pages and Controlling Page Layout","description":"This module will teach you the concept of linking in web page development, as well as the several variations that can be used to control what we link to and how the link will appear. You will be able learn how page layout can be controlled as well as the arrangement of content blocks, images.","topics":["Linking Pages and Controlling Page Layout - Learning Outcomes","Linking Pages Together","Controlling Page Layout","Building Tables with HTML5","Linking Pages and Controlling Page Layout - Lesson Summary","Linking Pages and Controlling Page Layout - Assessment"]},{"name":"Module","details":"Adding Styles and HTML5 Streaming Videos to Sites","description":"This module will teach you the steps involved in building forms for pages and the basics required for a simple form. You will also learn how HTML5 streaming videos can be added to a site, how to use HTML5 plain codes, as well as how to convert videos to the streaming format that are useable.","topics":["Adding Styles and HTML5 Streaming Videos to Sites - Learning Outcomes","Building Forms for Pages","Adding Styles to Form","Adding HTML5 Streaming Videos to a Site","Adding Styles and HTML5 Streaming Videos to Sites - Lesson Summary","Adding Styles and HTML5 Streaming Videos to Sites - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["HTML5 and CSS3 Fundamentals - Final Assessment"]}]}