{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3861","title":"Interactive Dashboards and Data Visualization in Excel","totalEnrolled":"1,957","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Get creative with data visualization and infographics using Microsoft Excel functions with this free online course.","description":"Do you know that over 60% of people use Excel for data exploration and chart creation because of its flexibility and ease of use? Communicating data-driven results, motivation, and detection of defects are the important components of data analysis. Learn the skills needed to produce graphs and diagrams that are effective and professional and discover how to process data to be more visually appealing with this free online Microsoft Excel tutorial.","courseOutcomes":["Explain the concept of dashboards...","Identify the functions of interactiv...","Discuss the dynamics of information–...","Explain how to set up, format and ma...","Explain the concept of dashboards","Identify the functions of interactive dashboards in MS Excel","Discuss the dynamics of information–transformation–presentation in the context of interactivity","Explain how to set up, format and maintain an interactive legend dashboard","Describe how to set up, format and maintain an interactive chart dashboard","Outline the procedure for setting up, formatting and maintaining an interactive dashboard","Describe the importance of visual perception in the process of presenting information","Outline the concept of the Gestalt laws of grouping","Identify the various tips for using special and bullet charts","Recognise the need for using data visualisation","Explain the advantages of infographics in MS Excel","Explain the concept of dashboards...","Identify the functions of interactiv...","Discuss the dynamics of information–...","Explain how to set up, format and ma...","Explain the concept of dashboards","Identify the functions of interactive dashboards in MS Excel","Discuss the dynamics of information–transformation–presentation in the context of interactivity","Explain how to set up, format and maintain an interactive legend dashboard","Describe how to set up, format and maintain an interactive chart dashboard","Outline the procedure for setting up, formatting and maintaining an interactive dashboard","Describe the importance of visual perception in the process of presenting information","Outline the concept of the Gestalt laws of grouping","Identify the various tips for using special and bullet charts","Recognise the need for using data visualisation","Explain the advantages of infographics in MS Excel"],"courseDescription":"<p>Have you ever wondered how to make a presentation that completely captivates and holds the audience's attention? Or, instead, how can you bring information closer to a user so it’s more easily comprehended? First and foremost, you must become acquainted with the fundamental concept of visual perception. This is exactly what this free online Microsoft Excel training aims to accomplish. It begins by outlining the importance of utilizing Excel and debunking some frequent misunderstandings about it. You will learn how to use Excel to organize, filter, and visualize massive volumes of data before moving on to discussing dashboards. The various elements of dashboards such as reports, data, tables, charts, and other interactive components are highlighted in this part of the Microsoft Excel certification.</p><p>The concept of visual perception is explained in the following section and brings to light the idea that what we see in the visual world enters our brain and is processed differently depending on the context. You will explore the interactions that occur between the visual world and our brain as well as the psychological reasons why some data visualization strategies work better than others. The need for applying Gestalt Principles during the process of visualizing data is comprehensively covered and you will learn why these principles play a significant role in creating graphics that effectively communicate information. This section of the Microsoft Excel course also covers what preattentive qualities are, the methods of distinguishing information from other data and the difference between data visualization and infographics.</p><p>The last section of this Microsoft Excel training course will teach you the procedure for creating customized charts which includes when and how to use dual-axis banding, area chart banding, and limit and bullet charts in data visualization. The last key theme will engage your creative side where you will learn all about the various types of infographics. This part of the course will teach you how infographics help in conveying an existing theme and how it is a key method of storytelling using data and information. You will be taught how to make a progress bar, doughnut, waffle chart, and various other data visualization tools such as the camera tool. Enrolling in this Microsoft Excel course will help you as a data analytics or data science professional in distilling complex data into more consumable information and will also be of great use if you are in business administration, finance or any related field that requires data processing.</p><a href=\"https://alison.com/resume/courses/3861\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3861\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Creating an Interactive Dashboard","description":"The impact and significance of interactive legends, charts, and dashboards in visualization are highlighted in this module. When it comes to interaction, you'll comprehend how information–transformation–presentation dynamics function.","topics":["Creating an Interactive Dashboard - Learning Outcomes","Dashboards in Excel","Creating an Interactive Legend Dashboard","Creating an Interactive Chart Dashboard","Interactive Tornado Dashboard with Drill Downs","Creating an Interactive Dashboard - Lesson Summary"]},{"name":"Module","details":"Data Visualization in Excel","description":"This module provides you with a complete set of tools for data transformation, connecting, and analysis. You will discover how to construct gorgeous interactive dashboards using different types of charts.","topics":["Data Visualization in Excel - Learning Outcomes","Data Visualization in Excel","Special and Bullet Charts","Infographics in Excel","Data Visualization in Excel - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Interactive Dashboards and Data Visualization in Excel - Course Assessment"]}]}