{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2022","title":"Introduction to Transport Layer and Network Security","totalEnrolled":"4,374","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about encryption, transport layers, network security and troubleshooting with this online networking course.","description":"Computers are ubiquitous in modern life and the best way to stay on track and ensure you aren’t being exploited is to learn about network security. This course will teach you about the ‘transport layer’ that is involved in computer networks and what it is used for. Encryption and port numbers may be terms you are vaguely familiar with but by the end of the course, you’ll be a network pro!","courseOutcomes":["Identify the concept of the transpor...","Discuss TCP and UDP on Cisco Packet ...","Identify how to troubleshoot a netwo...","Recognize different types of encrypt...","Identify the concept of the transport layer in a network","Discuss TCP and UDP on Cisco Packet Tracer","Identify how to troubleshoot a network and the challenges of troubleshooting","Recognize different types of encryption and how to code and decode using different keys","Differentiate between network security, information on data security, cyber and Internet security and certain securities that relate to the computer","Identify the concept of the transpor...","Discuss TCP and UDP on Cisco Packet ...","Identify how to troubleshoot a netwo...","Recognize different types of encrypt...","Identify the concept of the transport layer in a network","Discuss TCP and UDP on Cisco Packet Tracer","Identify how to troubleshoot a network and the challenges of troubleshooting","Recognize different types of encryption and how to code and decode using different keys","Differentiate between network security, information on data security, cyber and Internet security and certain securities that relate to the computer"],"courseDescription":"<p>This course will teach you about the two types of transport layers: the connection-oriented protocol (COP) and the connection-less protocol (CLP). Transport layer security or TLS is a way to secure information as it is carried over the Internet and without which our personal information would be available to anyone and everyone. On top of this, you’ll learn about UDP (user datagram protocol), which lets computer applications send messages, known as datagrams, to other hosts on an Internet protocol network.</p><p>The most essential part of encryption is changing information from a readable format for humans to an encrypted version using mathematical functions. This will be an essential part of this course to get to grips with along with learning how port numbers help communication flow between applications.</p><p>Other elements of computer networks that are taught in this course include routing, dynamic routing and Cisco Packet Tracer. If the words you’re reading sound familiar and foreign at the same time, don’t be daunted! Anyone can learn a new language and that’s what learning these abbreviations and functions is all about. If the idea of a tool that allows users to create network topologies and imitate modern computer networks excites you, then create your free Alison account, enrol and take it one step at a time. Build your confidence in computer networks with this course today.</p><a href=\"https://alison.com/resume/courses/2022\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2022\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Tranport Layer, TCP, UDP, Delivery Fiasco and Port Numbers","description":"In this module you will learn about transport layer, TCP, UNP, delivery fiasco and port numbers and how port numbers improves the communication between one application and the other.","topics":["Tranport Layer, TCP, UDP, Delivery Fiasco and Port Numbers - Learning Outcomes","Introduction to Tranport Layer, TCP, UDP on Cisco Packet Tracer","Delivery Fiasco and Port Numbers","Tranport Layer, TCP, UDP, Delivery Fiasco and Port Numbers - Lesson Summary"]},{"name":"Module","details":"Network Security","description":"In this module you will learn about network security, troubleshooting, secret box and encryption. On a network, authorization is divided into two parts which is the network policy of authorization and the user policy.","topics":["Network Security - Learning Outcomes","Introduction to Network Security","The Troubleshooting Approach","Secret Box and Encryption; A Case Study","Introduction to Security and CIA","Network Security - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Transport Layer and Network Security Course Assessment"]}]}