{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1528","title":"Intro to Swift 4 Programming for iOS","totalEnrolled":"1,708","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study this free online iOS app development course and learn how to program in Swift 4 to create iOS apps.","description":"This free online Swift 4 programming course will teach you about app development in Swift 4. This course, designed for complete beginners, will introduce you to the main components of Swift 4 such as data types, variables, arrays, objects, classes, and object-oriented programming. You will also study not only the theoretical basics of programming in Swift 4, but a range of practical and easy to understand examples of their application.","courseOutcomes":["Describe how to use Swift 4 to creat...","Explain how to declare variables, co...","Illustrate the use of arrays and loo...","Explain object oriented programming ...","Describe how to use Swift 4 to create basic applications","Explain how to declare variables, constants and optionals in Swift","Illustrate the use of arrays and loops to create more efficient code","Explain object oriented programming and its use in development","Define the different numeric data types and when to use them","Describe how to use Swift 4 to creat...","Explain how to declare variables, co...","Illustrate the use of arrays and loo...","Explain object oriented programming ...","Describe how to use Swift 4 to create basic applications","Explain how to declare variables, constants and optionals in Swift","Illustrate the use of arrays and loops to create more efficient code","Explain object oriented programming and its use in development","Define the different numeric data types and when to use them"],"courseDescription":"<p>This course will show you exactly how to program in Swift 4 to create iOS apps. The course provides a foundation to learners beginning iOS development by giving an overview of how programming languages work and the main components of Swift. Learners will study the core basics of Swift right up to object oriented programming design.</p><p>This course begins by covering variables and data types, and continues by exploring more complex concepts such as arrays, loops, dictionaries, objects, classes and more. In each topic, the terms and concepts are broken down and explained thoroughly. This course gives learners a comprehensive understanding of the fundamentals of Swift programming and offers a foundation to beginning their journey in iOS development.</p><p>If you’re interested in iOS app development as a future career, or if you’re an IT professional seeking to improve your iOS programming skills then this clear and simple course is the one for you. Programming in Swift 4 is key skill in iOS app development, so learning the key concepts of this programming langauge is an absolute must for any aspiring app developer. With this free course, you’ll learn these vital skills in just 3 hours. So start this course today, and by the end of the week you’ll have an excellent new skill.</p><p>&nbsp;</p><a href=\"https://alison.com/resume/courses/1528\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1528\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Intro to Programming & Swift 4 Basics - Variables, Operators and Data Types","description":"This module covers the basics of programming for iOS in Swift 4. This module provides the fundamentals for understanding how programming languages work and how to program for iOS devices. This module covers data types, variables, operators, functions and more. This course will take you from a complete beginner to having fundamental knowledge of the basics of Swift.","topics":["Variables, Operators and Data Types - Learning Outcomes","Variables, operators, & how computers work","Strings","Numbers","Functions","Booleans & conditional logic","Constants & logical operators","Variables, Operators and Data Types - Lesson Summary"]},{"name":"Module","details":"Intro to Programming & Swift 4 Basics - Arrays, Loops and OOP","description":"This module covers the basics of programming for iOS in Swift 4. This module provides the fundamentals for understanding how programming languages work and how to program for iOS devices. This module covers arrays, loops, dictionaries, optionals and the basics of object-oriented programming. This course will build on your fundamental knowledge of Swift and introduce more difficult programming concepts.","topics":["Arrays, Loops and OOP - Learning Outcomes","Arrays","Loops","Dictionaries","Object oriented programming","Inheritance","Polymorphism","Optionals","Arrays, Loops and OOP - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Programming in Swift Assessment"]}]}