{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5319","title":"Introduction to Filmora","totalEnrolled":"904","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Filmora's advanced features to create and edit videos like a professional in this free online course.","description":"Are you looking for the right video editing software? Wondershare’s Filmora is the perfect option for professional and amateur video editors. This Filmora tutorial covers everything you need to know about this amazing program, from its interface to audio design to advanced tools and effects like colour correction and grading. We explain how to create and edit videos step by step and provide examples to help you practise your new editing skills.","courseOutcomes":["Explain how to apply advanced video ...","Distinguish between colour correctio...","Discuss the key principles of video ...","Identify the smart and auto features...","Explain how to apply advanced video and audio editing techniques to your videos using Filmora","Distinguish between colour correction and colour grading","Discuss the key principles of video editing","Identify the smart and auto features of Filmora","Outline the effect of various colours on the mood of your videos","Recognise the opening interface and workspace of Filmora","Recall how to use Filmora to apply the ‘green screen’ effect to your videos","Explain how to apply advanced video ...","Distinguish between colour correctio...","Discuss the key principles of video ...","Identify the smart and auto features...","Explain how to apply advanced video and audio editing techniques to your videos using Filmora","Distinguish between colour correction and colour grading","Discuss the key principles of video editing","Identify the smart and auto features of Filmora","Outline the effect of various colours on the mood of your videos","Recognise the opening interface and workspace of Filmora","Recall how to use Filmora to apply the ‘green screen’ effect to your videos"],"courseDescription":"<p>There are several video editing programs on the market but only a handful are beginner-friendly. Wondershare’s Filmora is one of them and includes a suite of cutting-edge tools and a wide range of features to offer a comprehensive video editing software platform. It has a user-friendly interface, drag-and-drop editing capabilities and an extensive set of specialised video editing tools, making it simple to create professional-quality videos. The subject experts at Stay Curious Media Limited have designed this course to walk you through every aspect of this accessible and powerful program.</p><p>We begin by examining Filmora's opening interface and then explore its ‘preview’, ‘timeline’ and ‘media’ bar. The course then demonstrates simple actions like ‘project import’, exporting and saving files. We then compare colour correction and colour grading and show you how to use these tools to create different moods in your videos. The course explains how to use basic and advanced Filmora features like transform, compositing, lens correction, auto-enhance and more.</p><p>Adding keyframes is a great way to give your videos a professional look and feel. We show you how to use video editing tools like chroma keying (green screen) and freeze frames. The course explores some of the cutting-edge features of Filmora, such as its augmented reality (AR) stickers, AI portraits and the brand-new Boris FX and NewBlue FX plugins. Finally, we teach you how to make effective use of the program’s ‘uniform speed’ and ‘speed ramping’ tools. This course suits anyone who is interested in digital media, either as a professional or passionate amateur. Sign up for this Filmora tutorial to learn how to use this powerful program to edit videos.</p><a href=\"https://alison.com/resume/courses/5319\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5319\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Overview of Filmora","description":"This module will teach you how to use Filmora's interface and workspace. You will also study the principles of video editing, audio design and the effect of the colour theory on your video clips. Learn the differences between colour correction and colour grading, and explore some basic and advanced Filmora tools and effects.","topics":["Overview of Filmora - Learning Outcomes","Filmora Interface","Starting Filmora","Filmora Tools & Features","Filmora Effects","Overview of Filmora - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Filmora - Course Assessment"]}]}