{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5324","title":"Introduction to Digital Character Design","totalEnrolled":"1,613","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to design engaging characters for your own creative visual projects in this free online digital art course.","description":"Good character design is key to visual storytelling as audiences connect with narrative through characters they care about. This course explains how to add details that lend personality to your characters. Whether you are a graphic artist, animator or illustrator, we teach you how to create iconic characters defined by visually stimulating attributes. Master the creative tools required to sharpen your use of shape language to create digital art.","courseOutcomes":["Outline the fundamental principles a...","Recognise the importance of line exe...","Explain how to create sketches, draw...","Describe the fundamentals of shape a...","Outline the fundamental principles and key components of character design","Recognise the importance of line exercises in character arts","Explain how to create sketches, drawings and illustrations with graphic software","Describe the fundamentals of shape and form and apply them to character design","Discuss the relevance of perspective, detailing and positioning in art","Recall the techniques for colouring and shading shapes","Outline the fundamental principles a...","Recognise the importance of line exe...","Explain how to create sketches, draw...","Describe the fundamentals of shape a...","Outline the fundamental principles and key components of character design","Recognise the importance of line exercises in character arts","Explain how to create sketches, drawings and illustrations with graphic software","Describe the fundamentals of shape and form and apply them to character design","Discuss the relevance of perspective, detailing and positioning in art","Recall the techniques for colouring and shading shapes"],"courseDescription":"<p>Creating iconic characters entails more than just drawing 2D objects and stacking 3D shapes. Whether you are creating cartoon characters, comic books, manga, video games, anime or mascots, good character design and detail lends personality to your work. This art form is essential because it touches on many aspects of the creative process, including its principles, theories and the actual design process. This introductory course teaches you how to create memorable, engaging and visually stimulating characters that allow great storytelling.</p><p>We explain how to apply principles that draw on shape language, colour theory and general psychology to refine the visual attributes of a character. The course outlines the key components of character design and demonstrates how to use the tools offered by Photoshop and Clip Studio Paint. We navigate the user interface of Clip Studio Paint and show you how keyboard shortcuts can help you create object sketches and illustrations more quickly and easily.</p><p>Finally, the course explores the fundamental components of visual art, including the concepts of shape and form. We show you how you can improve your skills at drawing objects and shapes via observation studies. We also discuss vital subjects like perspective, positioning and detailing and demonstrate their practical relevance to character design. To further help you master these skills, we create robots and humanoid shapes as a practice exercise. Small details and touches can make the difference between a ‘flat’ character and one your audience cares about so sign up for this visual design course to unleash your creativity and acquire a potent new artistic skill.</p><a href=\"https://alison.com/resume/courses/5324\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5324\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Key Character Design Models and Techniques","description":"In this module, we will introduce you to character design's basic precepts and components. We will consider daily practice exercises to improve your sketching and drawing skills. Learn to use Photoshop and Clip Studio Paint for colouring and shading objects. You will also study the importance of shape, form, and perspective in character art.","topics":["Key Character Design Models and Techniques - Learning Outcomes","Shapes, Forms, and Tools in Character Design","Key Models in Character Design","Colouring and Shading Fundamentals","Key Character Design Models and Techniques - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Character Design - Course Assessment"]}]}