{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4967","title":"Introduction to Ruby Programming","totalEnrolled":"228","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Unleash your creativity in Ruby programming by mastering common Ruby objects with this free online course.","description":"Ruby programming language has an easy-to-learn syntax and flow. If you wish to learn to program easily, look no further! This course provides a detailed introduction to the basic language you need to master if you want to become a web developer. Besides being easy to learn, Ruby has many advantages. For one, it focuses on programmer productivity and the path to Rails’. Learning Ruby will give you a competitive edge as a developer.","courseOutcomes":["Outline reasons and benefits for lea...","Recognise how to install Ruby both o...","List the different editors that you ...","Discuss the various types of data in...","Outline reasons and benefits for learning Ruby programming","Recognise how to install Ruby both on Windows and Mac","List the different editors that you can work with in Ruby","Discuss the various types of data in Ruby","Identify the different kinds of assignment operators available to you in Ruby","Explain how to create classes in Ruby","Discuss how to put methods inside classes in Ruby","Define ‘class inheritance’ and compare class inheritance with class initialisers","Describe how to attach methods to existing objects","Analyse the different parameters that can be passed into methods","State how to create predicate methods and how to access global variables","Explain the uses of blocks and yield in Ruby","Outline reasons and benefits for lea...","Recognise how to install Ruby both o...","List the different editors that you ...","Discuss the various types of data in...","Outline reasons and benefits for learning Ruby programming","Recognise how to install Ruby both on Windows and Mac","List the different editors that you can work with in Ruby","Discuss the various types of data in Ruby","Identify the different kinds of assignment operators available to you in Ruby","Explain how to create classes in Ruby","Discuss how to put methods inside classes in Ruby","Define ‘class inheritance’ and compare class inheritance with class initialisers","Describe how to attach methods to existing objects","Analyse the different parameters that can be passed into methods","State how to create predicate methods and how to access global variables","Explain the uses of blocks and yield in Ruby"],"courseDescription":"<p>Choosing a programming language to study can be challenging if you are new to the field. As a newbie with so many choices, you may be unaware of the functions of each language and the reasons you might favour one over another. This course will introduce you to the Ruby programming language and assist you in determining whether it is the right option for you.</p><p>This course has two modules. First, you will learn about Ruby and its advantages over other programming languages. After that, you will discover how to install Ruby on your computer and be shown where to find various settings for the editor you wish to use when working with Ruby. Then you will create your first Ruby app. You'll analyse Ruby's different data types, operational logic, methods and classes.</p><p>In the second module, we will examine how to create classes in Ruby and add methods to them. Additionally, file I/O, lambd, and predicates will all be covered. Because Ruby's syntax is intended to be similar to the English language, you do not need to spend much time knowing what the symbols in the language signify. We have also included some projects and solutions to improve your comprehension of Ruby programming. Enrol in this course to get started today!</p><a href=\"https://alison.com/resume/courses/4967\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4967\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Data Types and Operators","description":"This module will introduce you to Ruby programming, the reasons for choosing Ruby, how to download and install Ruby either on Windows or Mac, editors and Ruby gems. You will also learn about different types of data in Ruby, operators and conditional flows as well as projects and solutions to projects that will help you understand Ruby programming.","topics":["Introduction, Data Types and Operators - Learning Outcomes","Introduction","Data Types in Ruby","Operators, Conditional and Flow Control","Introduction, Data Types and Operators - Lesson Summary"]},{"name":"Module","details":"Classes and Methods in Ruby","description":"Classes and methods in Ruby, writing predicate methods, procs, lambda expressions, and file I/O are some of the topics covered in this module. To improve your Ruby coding accuracy, the module will also give you a practical project on the subjects covered in it. The project will also come with a solution.","topics":["Classes and Methods in Ruby - Learning Outcomes","Classes and Methods","Creating Predicate Methods","Procs, Lambdas and File Io","Classes and Methods in Ruby - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Ruby Programming - Course Assessment"]}]}