{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5480","title":"Introductory Stata 2023: Graphics and Data Visualization","totalEnrolled":"1,096","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Stata to draw graphs to analyze, visualize and present data in this free online data science course.","description":"This data science course introduces you to the Stata commands that graph the distribution of a continuous variable, the frequency of a categorical variable and the relationship between two variables. We explain how to use various graphs to visualize data for different variable types. We show you how to use Stata graph options to customize markers, lines, axes, titles and legends. We also discuss how to overlay multiple plots and combine graphs.","courseOutcomes":["Describe the distribution of a conti...","Analyze the frequency or percentage ...","Discuss and visualize the relationsh...","Describe the relationship between tw...","Describe the distribution of a continuous variable using histograms, box plots and density plots","Analyze the frequency or percentage of a categorical variable using bar charts and pie charts","Discuss and visualize the relationship between two continuous variables with scatter plots, bubble plots, line plots and best-fit lines","Describe the relationship between two categorical variables with bar charts and pie charts","Discuss the relationship between one continuous and one categorical variable and use the ‘over’ or ‘by’ options","Define ‘markers’, ‘lines’, ‘axes’, ‘labels’, ‘titles’ and ‘legends’ in terms of Stata graph options","Summarize and combine multiple graphs into one graph and save and export them","Describe the distribution of a conti...","Analyze the frequency or percentage ...","Discuss and visualize the relationsh...","Describe the relationship between tw...","Describe the distribution of a continuous variable using histograms, box plots and density plots","Analyze the frequency or percentage of a categorical variable using bar charts and pie charts","Discuss and visualize the relationship between two continuous variables with scatter plots, bubble plots, line plots and best-fit lines","Describe the relationship between two categorical variables with bar charts and pie charts","Discuss the relationship between one continuous and one categorical variable and use the ‘over’ or ‘by’ options","Define ‘markers’, ‘lines’, ‘axes’, ‘labels’, ‘titles’ and ‘legends’ in terms of Stata graph options","Summarize and combine multiple graphs into one graph and save and export them"],"courseDescription":"<p>Stata provides different graphic commands for different types of data. This Stata tutorial explains how to use the program’s graph commands for data visualization and covers histograms, box plots, density plots, bar charts, pie charts, scatter plots, line plots, bubble plots and best-fit lines. We show you how to use Stata to draw graphs for a single continuous variable, a single categorical variable, two continuous variables, two categorical variables and one continuous variable and one categorical variable.</p><p>We explore the Stata graph options used to customize markers, lines, axes, labels, titles and legends. The course demonstrates how to modify various graphs’ symbols, colors, patterns and text to make them more attractive and informative, which can improve the quality of presentations and publications. We then teach you how to overlay multiple plots in a graph and combine multiple graphs into a single version.</p><p>Finally, the course explains how to save and export graphs to different formats. Graphs and data visualization effectively display variables and their relationships. Graphs are widely used in business, statistical analysis and empirical research in every academic field. Learning how to use Staka enhances your professional portfolio as data science plays a key role in many industries. Sign up for this Staka tutorial to improve your ability to analyze, visualize and present data.</p><a href=\"https://alison.com/resume/courses/5480\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5480\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Distribution of a Single Variable","description":"In this module, you will learn how to draw histograms, box plots, and density plots for a single continuous variable. You visualize the distribution of a continuous variable. You also graph bar charts and pie charts for a single categorical variable and show the frequency or percentage for each category.","topics":["Distribution of a Single Variable - Learning Outcomes","Histogram Plots for a Single Continuous Variable","Box Plots for a Single Continuous Variable","Density Plots for a Single Continuous Variable","Bar Charts for a Single Categorical Variable","Pie Charts for a Single Categorical Variable","Distribution of a Single Variable - Lesson Summary"]},{"name":"Module","details":"Relationship between Two Variables","description":"In this module, we will learn to draw scatterplots, line plots, and best-fit lines for two continuous variables. In addition, we graph bar charts and pie charts for two categorical variables. We also visualize the relationship between a continuous and categorical variable with the \"by\" or \"over\" options.","topics":["Relationship Between Two Variables - Learning Outcomes","Scatter Plots for Two Continuous Variables","Bubble Plots for Two Continuous Variables","Line Plots for Two Continuous Variables","Best Fit Lines for Two Continuous Variables","Bar Charts for Two Categorical Variables","Pie Charts for Two Categorical Variables","Graphs for a Continuous and a Categorical Variable","Relationship Between Two Variables - Lesson Summary"]},{"name":"Module","details":"Graph Options","description":"We have seen some graph options over past topics. In this module, we will systematically learn graph options for markers, lines, axes, titles, and legends.","topics":["Graph Options - Learning Outcomes","Marker Options","Line Options","Axis Options","Title, Legend, and Text Options","Overlay of Plots and Combination of Graphs","Save and Export Graphs","Graph Options - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introductory Stata 2023: Graphics and Data Visualization - Course Assessment"]}]}