{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4021","title":"Introduction to Zoho CRM","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the subtleties of enhancing customer lifetime value using Zoho CRM with this free online course.","description":"Do you work in sales and need to keep track of potential customers? Or are you a customer service staffer who wants to understand the history of a customer's dealings with your company? Or maybe a manager who wants to view reports to see how many new clients have signed up? If so, this sales and marketing course will help you build long-lasting and productive relationships with clients using Zoho customer relationship management (CRM).","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Customer relationship management (CRM) is the mix of practices, methodologies and technologies that organizations use to oversee and analyze client communications and data throughout their relationship with the client. The purpose is to develop client support and relationships, assist in client retention and drive sales growth. This course illustrates the fundamental principles of Zoho CRM. It starts by going over the basics of Zoho CRM. You will understand the significance of software in meeting the needs of companies by allowing individuals to interact with customers across multiple channels in real-time. Furthermore, we will also explain the relevance and methods of navigating Zoho CRM.</p><p>The next section demonstrates how to build a Zoho CRM for a client. You will learn how to create a mind map and set up modules for a customer using the example of ‘vicious vegans’. The feedback from the client is of inestimable importance, and you will thus learn how to add a logo and rename system fields in Zoho CRM. Following that, we will walk you through some of the fundamental and advanced aspects of CRM customization. You will discover how to add the business hours and holidays settings in the company detail section. Also, creating a custom view, setting up stage probability mapping and mapping fields from leads to accounts in Zoho CRM is explained. You will also learn how to prevent users from exporting contacts out of the CRM.</p><p>Finally, you will see how to customise layouts in Zoho CRM and what layout rules you need to follow. Then we'll showcase Zoho CRM automated processes. You will study fundamental workflows, time-based processes, custom blueprint features and webhooks. In this course, you will explore how and when to use webhooks in Zoho CRM. Master the skill of combining sales, advertising, and customer management activities into a single platform and optimise your approach, strategy, and personnel.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}