{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3098","title":"Introduction to Python","totalEnrolled":"17,937","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Expand your coding skills as you learn how to create Python programs and scripts in this free online programming course.","description":"This introductory class takes you step-by-step through the process of creating functions and scripts using Python. We explore the language’s unique syntax and identify the common mistakes made by developers, both novice and experienced. You will master Python’s operators, statements, loops, lists and dictionaries as we unpack the intricacies of this powerful and popular coding language.","courseOutcomes":["Summarize the basic history of Pytho...","Identify its core characteristics...","Define its common data types...","Indicate the data type of a value ...","Summarize the basic history of Python","Identify its core characteristics","Define its common data types","Indicate the data type of a value","List and define built-in Python functions","Recognize mathematical and comparison operators in Python syntax","Explain how to identify and fix bugs found within your code","List Python keywords used to create more complex comparison expressions","Explain the importance of basic logic when creating a web application in Python","Arrange Python code to successfully execute ‘’if/else’ and ‘elif’ statements","Compare and contrast lists and dictionaries when using Python","Describe various methods used to manipulate data found in lists and dictionaries","Summarize the basic history of Pytho...","Identify its core characteristics...","Define its common data types...","Indicate the data type of a value ...","Summarize the basic history of Python","Identify its core characteristics","Define its common data types","Indicate the data type of a value","List and define built-in Python functions","Recognize mathematical and comparison operators in Python syntax","Explain how to identify and fix bugs found within your code","List Python keywords used to create more complex comparison expressions","Explain the importance of basic logic when creating a web application in Python","Arrange Python code to successfully execute ‘’if/else’ and ‘elif’ statements","Compare and contrast lists and dictionaries when using Python","Describe various methods used to manipulate data found in lists and dictionaries"],"courseDescription":"<p>We begin with a history of this famously readable language and explain its importance in the workplace before delving into source code and the core characteristics that define Python. We go through relevant documentation and demonstrate the use of the online utility ‘Repl.it’ instead of installing Python on your local machine. The account creation walkthrough will enable you to save all your code to return to after the course. We also discuss the basic data types that you will encounter as you discover how to create and manipulate information using Python.</p><p>We introduce you to the available built-in functions and keywords, focussing on the most popular examples, before moving on to variables. This brings us to basic mathematical operations like addition, subtraction and division and comparisons like greater, lesser or equal. We go through combination operators that can be used to create more complex comparative expressions as you become proficient in Python’s debugging process to eliminate mistakes. This course teaches you how to use keywords to create readable programs, paying attention to basic logic and its effect on your applications. This leads us to the all-important ‘if/else’ statement, which you will master along with its ‘elif’ counterpart.</p><p>Finally, we wrap up with an overview of lists and dictionaries in Python and an analysis of their ability to alter data. This course offers a firm understanding of Python basics through coding lessons, demonstrations and supporting exercises. Strengthen your technical portfolio with this versatile global programming language that plays a key role in cutting-edge technologies from machine learning and A.I. to web design.</p><a href=\"https://alison.com/resume/courses/3098\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3098\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Defining Python","description":"In this module, you will be introduced to the user-friendly and comprehensible coding language Python. This will include a brief history lesson, as well as other workplaces where Python literacy could be advantageous. You will learn about the core characteristics of the language and common data types that you will experience frequently when writing Python code. The module wraps up with an opportunity for you to practice writing Python code through exercises that cover what you have learned.","topics":["Defining Python - Learning Outcomes","The Workplace Tech Divide","Introduction to Python","Basic Data Types","Defining Python - Lesson Summary"]},{"name":"Module","details":"Functions, Variables and Errors","description":"In this module, you will be introduced to variables and functions. This will include Python syntax for both, as well as variable naming conventions that are followed by developers. You will learn how to manipulate these variables using operators through functions that you can either create yourself or that are built into Python. This module also covers common errors that all developers experience when they are creating Python script and how to address and fix these errors.","topics":["Functions, Variables and Errors - Learning Outcomes","Python Built-In Functions","Variables and Functions","Errors and Debugging","Functions, Variables and Errors - Lesson Summary"]},{"name":"Module","details":"Keywords, Statements and Loops","description":"In this module, you will be introduced to keywords that are used to create more complex comparison expressions. You will then learn about basic logic which will lead to the if/else and elif statements, which you will find yourself using regularly as you continue coding using Python. The module finishes with the introduction of lists and dictionaries. You'll get the chance to create both and manipulate the data in both data structures, as well as loop through the data using the for-loop.","topics":["Keywords, Statements and Loops - Learning Outcomes","Python Keywords","If-Else Statements","Storing Complex Data","Keywords, Statements and Loops - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}