{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4172","title":"Beginner Web Development Processes and Server Setup","totalEnrolled":"2,016","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes the processes related to web development and various types of web hosting packages.","description":"The internet is a global tool used to share and gain information. If you are already familiar with using the internet, this course will take you from beginner to expert in using scripting languages to build web applications. Discover how to integrate and administer MySQL databases in a web project and learn the benefits of scaling server configurations. This course will also teach you about WAMP servers. Register now to improve your skills!","courseOutcomes":["Discuss the functions of data packet...","Describe how a router works...","List the steps involved in the web d...","Distinguish between traditional web ...","Discuss the functions of data packets","Describe how a router works","List the steps involved in the web development process","Distinguish between traditional web hosting package and cloud hosting service","List the types of web hosting solutions","State the importance of creating domain names","List the benefits of testing a server setup","Discuss the importance of a production server setup","Discuss the functions of data packet...","Describe how a router works...","List the steps involved in the web d...","Distinguish between traditional web ...","Discuss the functions of data packets","Describe how a router works","List the steps involved in the web development process","Distinguish between traditional web hosting package and cloud hosting service","List the types of web hosting solutions","State the importance of creating domain names","List the benefits of testing a server setup","Discuss the importance of a production server setup"],"courseDescription":"<p>Are you interested in starting a career in web development or dream of setting up an online business but are confused by the intricacies of the internet and hosting packages? Then this course is designed just for you. ‘Introduction to Web Development Processes and Server Setup’ has been specifically curated to take you from beginner to expert in building interactive mobile web applications and understanding more about the online world. Before you venture into the world of web development, it is imperative that you have a basic understanding of how the internet works as you will be introduced to more advanced concepts such as the functions of a data packet. Did you know that there are three elements of a data packet? Prepare yourself to learn about their functions and differences and learn the functions of hypertext transfer protocols (HTTP) and hypertext transfer protocols secure (HTTPS) protocols.</p><p>Are you aware that there are 12 steps involved in the web development process? To help you understand them extensively, this course will provide detailed information on each step. Domain name system (DNS) is also an important concept to understand in this course. You will learn about its role in translating a web address into a numerical internet protocol (IP) address. Further protocols studied will be the simple mail transfer protocol (SMTP) and you will learn how to explain its functions in email management. Local area networks (LAN) and wide area networks (WAN) play an important role in covering small and large network areas respectively while a network router facilitates the movement of data networks within both local and wide area networks. You will acquire knowledge on the uses of ports and the features and types of firewalls, which help in protecting network security.</p><p>Furthermore, you will learn about the types of web hosting solutions. There are several factors to consider when selecting your preferred hosting solution. This course will provide in-depth information about these options. You will examine the differences between traditional web hosting packages and cloud hosting services. Domain names help to build brand awareness and so it is important to become familiar with creating domain names and the processes of domain registration. Setting up a testing server prevents issues from arising on your production server. It is important to recall that some scripting languages require a testing server to function while some do not. You will be able to analyse these languages and describe their features. This course is suitable for web developers, business enthusiasts and anyone with an interest in understanding web development processes and server setup. So register for this course and start your learning journey today.</p><a href=\"https://alison.com/resume/courses/4172\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4172\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Web Development","description":"To start, you will be introduced to the elements of a data packet and the different types of protocols. You will also be introduced to the differences between LAN, as well as WAN.","topics":["Introduction to Web Development - Learning Outcomes","Introduction to Web Development","SMTP Protocol","Network Basics","Introduction to Web Development - Lesson Summary"]},{"name":"Module","details":"Web Hosting Packages","description":"To start, this module will introduce you to the differences between traditional web package, as well as cloud hosting service. You will also be introduced to the processes of creating and administering a domain name.","topics":["Web Hosting Packages - Learning Outcomes","Web Hosting Solutions","Domain Name Registration","Domain Detail Settings","Web Hosting Packages - Lesson Summary"]},{"name":"Module","details":"Testing and Production Environment","description":"To start, this module will introduce you to the benefits of testing a server setup and production server setup. You will also be introduced to the configuration of a live production server using Linode Manager.","topics":["Testing and Production Environment - Learning Outcomes","Testing Server Setup","Production Server Setup","The Command Console","Periodic Backups","Testing and Production Environment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Web Development Processes and Server Setup - Course Assessment"]}]}