{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4204","title":"Introduction to Functions of FileZilla and HTML DOM","totalEnrolled":"100","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free computer course breaks down the FileZilla interface and looks at CSS, HTML DOM and webpage development.","description":"If you are interested in learning about the features of the FileZilla interface and HTML DOM, then this programming course is for you. You will learn about the steps involved in creating a production server, the differences between ordered and unordered lists, and the three elements of CSS rules. It also teaches you about the functions of divs and DOM, along with the types of CSS position properties.","courseOutcomes":["Download FileZilla...","List the steps involved in creating ...","Outline the division of FileZilla in...","Differentiate between ordered and un...","Download FileZilla","List the steps involved in creating a production server","Outline the division of FileZilla interface","Differentiate between ordered and unordered lists","Differentiate between nested and parent tables","List the three elements of CSS rules","Indicate the functions of divs","List the types of position properties","Discuss the functions and features of DOM (document object model)","Download FileZilla...","List the steps involved in creating ...","Outline the division of FileZilla in...","Differentiate between ordered and un...","Download FileZilla","List the steps involved in creating a production server","Outline the division of FileZilla interface","Differentiate between ordered and unordered lists","Differentiate between nested and parent tables","List the three elements of CSS rules","Indicate the functions of divs","List the types of position properties","Discuss the functions and features of DOM (document object model)"],"courseDescription":"<p>This course has been specifically designed to teach you about the different elements and functions of CSS (cascading style sheets) and HTML DOM (document object model). FileZilla is an FTP (file transfer protocol) agent. You will be introduced to the step-by-step process involved in downloading FileZilla. Did you know that the interface is divided into multiple sections? You will learn about the contents and functions of each section. The differences between unordered and ordered lists will be highlighted. See how to insert images in different sections of an HTML page. Absolute references, as well as file references, play a key role when working with images and you will be able to explain their differences. Creating links in an HTML document can be challenging: on completion of this course, you will be able to create both text and image links.</p><p>HTML (HyperText Markup Language) plays an important role in the display layout of a webpage. This course explains the functions and features of HTML. The page structure of a basic HTML document will also be analyzed. Did you know that there are different types of tags? You will learn about their differences. It is necessary to understand table structures before building webpages. You will become familiar with the elements, as well types of tables, available. There are multiple attributes you can use when working with tables in HTML. Did you know that you can create an input form using HTML? This course helps you understand the processes involved in achieving this. POST and GET serve as channels for transmitting data. Discuss their functions and differences in data transmission.&nbsp;</p><p>CSS rules consist of three parts and you will become familiar with the features of each. At the end of this course, you will also be able to analyze the three types of CSS styles. Divs are another part of CSS development and you will study their function and features. There are multiple style declarations in CSS - you will learn about the features of each and the appropriate time for usage. This course will be of interest to web developers and anyone wanting to understand web development processes and server setup.</p><a href=\"https://alison.com/resume/courses/4204\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4204\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"FileZilla Interface","description":"To start, this module will introduce you to the steps involved in downloading the FileZilla interface. You will also be introduced to the functions of HTML and three types of CSS styles.","topics":["FileZilla Interface - Learning Outcomes","FileZilla Interface","Ordered and Unordered List","Introduction to HTML","FileZilla Interface - Lesson Summary"]},{"name":"Module","details":"POST and GET Methods","description":"To start, this module will introduce you to the differences between nested and parent tables. You will also be introduced to the differences between POST and GET methods.","topics":["POST and GET Methods - Learning Outcomes","Creating Tables","POST and GET Requests","Creating a HTML Page","POST and GET Methods - Lesson Summary"]},{"name":"Module","details":"Introduction to CSS Rules and DOM","description":"To start, this module will introduce you to the three elements of CSS rules and the functions of divs. You will also be introduced to the functions of DOM and DOM manipulation.","topics":["Introduction to CSS Rules and DOM - Learning Outcomes","CSS ID and Rules","Position Property","Introduction to DOM","Introduction to CSS Rules and DOM - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Functions of FileZilla and HTML DOM - Course Assessment"]}]}