{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4343","title":"Introduction to Data Structures","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, study one of the most important and basic aspects of computer science, data structures.","description":"In this free online course, you will learn about Data Structures, which is one of the most important and basic aspects of computer science. This video-based course was designed by a seasoned computer scientist with great simplicity for easy assimilation - even for beginners. If you are looking to acquire a computer science skill that is capable of solving problems from almost every area of human endeavour, this is the course for you. Enrol today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Suppose you are in charge of assigning a waiting line of customers to service desks and there are some customers with higher priority ratings than others, how would you assign these customers to the available desks? You will probably want to have the customers with higher priority taken care of first right? Let us take a hospital as a case study. Suppose you have several patients, say A to E. Patient A is in labour, B is having a fracture in the arms, C is having problems with sleeping, D is having stomach ache and E is having a fracture and aching stomach at the same time. Which of Patients A – E will you give the highest priority? Most likely patient A. Wait! How would you structure these patients and their information so that the system will automatically prioritize these patients based on the information you provided? This is where Data Structures (DS) comes in. How would you like to be able to take care of that queue efficiently – making sure the customers that need to be attended to first, are attended to first? Fortunately, computer science has made adequate provision for these and this course is lightning ready to unleash this information to you. Apart from the DS to handle queuing problem, so many other DS that handles other everyday problems are featured in this course.</p><p>This course begins by introducing you to the meaning of data structures and goes further to talk about arrays and linked Lists of data structures. Moving on, the course will expose you to some other data structures like stacks, queues and priority queues. Do you know that some data structures are similar to some others with just a little touch of advanced features? You will learn about the difference between queues, priority queues and indexed priority queues and you will see how these can be used to solve some important problems. How about having the chance to see implementation codes run live on each of the data structures discussed? This course was designed with great simplicity and it was put together by a renowned and seasoned subject matter expert. After discussing priority queues, you will learn about other data structures like Union Find, Binary Search Trees, Hash tables, Fenwick trees, Suffix arrays and more.</p><p>Are you a computer science student who is looking to acquire some of the most needed computer science skills in the world today? This course will move you multiple steps forward to achieving your dream. The course is suitable for you even if you have zero knowledge of coding as it can help you start from scratch. You will also get the chance to see a live implementation of codes.&nbsp; Are you a business person who is looking to acquire new skills that can help your business grow? This course will be of great value to you. Learning how to code your business problem away isn’t a bad idea, is it? Are you a professional who is already in the computer science field? This is a course that can boost your value in the labour market. Start this course now and watch your career grow!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}