{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1213","title":"Introduction to Angular 2","totalEnrolled":"10,812","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online Angular 2 course will teach you how to create fast, responsive web sites and web apps with Angular JS.","description":"This free online Angular 2 course will introduce you to the latest version of Angularjs, the new features in Angular 2, and the core building blocks of an Angular application. Angular JS is a structural framework developed and maintained by Google and used for developing dynamic web apps. You will learn how to combine those blocks to create easily testable and maintainable front-end applications that are fast and responsive.","courseOutcomes":["Identify what a single page applicat...","Identify the core philosophies of An...","Recognise the features of typescript...","Discuss the process of installing An...","Identify what a single page application is.","Identify the core philosophies of Angular.","Recognise the features of typescript.","Discuss the process of installing Angular.","Recognise the main building blocks of an Angular application. Identify how to create and use a component, attribute and structural directives.","Identify what interpolation is used for.","Discuss using event binding in Angular 2.","Explain how routing works in Angular 2.","Explain the purpose of observables.","Recognise how to connect the building blocks of Angular.","Identify how to create a basic task list application.","Identify what a single page applicat...","Identify the core philosophies of An...","Recognise the features of typescript...","Discuss the process of installing An...","Identify what a single page application is.","Identify the core philosophies of Angular.","Recognise the features of typescript.","Discuss the process of installing Angular.","Recognise the main building blocks of an Angular application. Identify how to create and use a component, attribute and structural directives.","Identify what interpolation is used for.","Discuss using event binding in Angular 2.","Explain how routing works in Angular 2.","Explain the purpose of observables.","Recognise how to connect the building blocks of Angular.","Identify how to create a basic task list application."],"courseDescription":"<p>This free online course will first teach you what Angular 2 is. You will learn about client side templating as well as what a single page application is. You will then learn about the core philosophies of Angular and study the differences between Angular 1 and Angular 2. You will also learn about TypeScript and what it can offer your development environment including the uses of the different types of directives found in Angular 2.<br><br>After studying the attribute directives and structural directives, you will look into data flow and providers. You will learn about interpolation and event binding, along with how to combine them for 2-way binding. You will learn what providers are used for, and you will learn how routing in Angular works for creating single page application. You will then learn how to combine all the features covered in the course to create a functional web application.<br><br>If you have finished studying the Introduction to Angular JS course as well as the JavaScript Application Programming course, then you should be ready to take this Introduction to Angular 2 course. Prior experience in Web site development and JavaScript is a must before taking this course to ensure that you won't be confused by the relevant processes and technicalities. If you're ready to go, why wait? Check out the course now and expand your knowledge in modern Web development today!</p><a href=\"https://alison.com/resume/courses/1213\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1213\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Angular 2","description":"In this module you will be introduced to Angular. You will learn about client side templating, as well as what a single page application is. You will learn about the core philosophies of Angular and the differences between Angular 1 and Angular 2. You will also learn about TypeScript and what it can offer your development environment.","topics":["Module 1 Learning Outcomes","Introducing Angular 2","Introducing single page applications","Why use (or not use) Angular","Introducing TypeScript","Demo Hello, TypeScript","The Big Picture","Demo Installing Angular 2","Module 1 Lesson Summary"]},{"name":"Module","details":"Building Blocks - Directives","description":"This module discusses directives. You will learn about the three types of directives found in Angular 2, how to create them as well as what they are used for.","topics":["Module 2 Learning Outcomes","Introducing Components","Demo Creating our First Component","Introducing Attribute Directives","Demo Using Attribute Directives","Introducing Structural Directives","Demo Using Structural Directives","Module 2 Lesson Summary"]},{"name":"Module","details":"Building Blocks - Data Flow and Providers","description":"This module discusses data flow and providers. You will learn about interpolation and event binding, along with combining them for 2-way binding. You will learn what providers are used for, and you will learn how routing works in Angular for creating single page application.","topics":["Module 3 Learning Outcomes","Introducing Data Binding and Data Flow","Demo Using Data Binding","Introducing Services","Demo Using services","Introducing Routing","Demo Using Routing","Introducing Observables and Server Data","Demo Using Observables to Retrieve Server Data","Module 3 Lesson Summary"]},{"name":"Module","details":"Connecting the Building Blocks and Creating an Angular App","description":"This module will demonstrate how to combine all the features covered in the course to create a functional web application.","topics":["Module 4 Learning Outcomes","Connecting the Building Blocks","Demo Connecting the Building Blocks","Creating an Angular App","Demo ToDo App","Review and Next Steps","Module 4 Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Angular 2 Course Assessment"]}]}