{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5323","title":"Introduction to Decentralized Finance (DeFi)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the inner workings of decentralised finance technology and cryptocurrency in this free online finance course.","description":"Are you curious about cryptocurrency and how digital finance works? This course explains the inner workings of decentralised finance (DeFi). We explore the history of DeFi and the technologies that power it. We explore the innovative infrastructure of this financial ecosystem, its key features and its operations. We also examine its risks and compare DeFi to conventional methods. Sign up to take advantage of these exciting innovations in finance.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Digital assets and cryptocurrency businesses have grown rapidly over the past few years. Institutions have begun to facilitate the purchase and sale of cryptocurrencies and custody services and are looking for new ways to participate in decentralised finance (DeFi). This course is designed by expert instructors from Stone River eLearning to help beginners take their first steps into the world of digital finance. We include course notes in our ‘Resources’ section that you can download and use to enrich the video lessons.</p><p>We begin with a brief history of digital finance and its rise in popularity. We discuss how it pursues the aim of revolutionising the world's present centralised financial infrastructure by adopting a decentralised internet-based architecture that depends on open-source protocols rather than traditional financial intermediaries. The course covers key components of DeFi, cryptocurrencies, smart contract platforms, oracles and stablecoins. We practically illustrate each concept with case studies and examples of decentralised finance projects.</p><p>The course then delves into the blockchain technology that powers DeFi. We explain transactional processing, tokenisation and non-fungible tokens (NFTs) in detail before demonstrating how lending processes with Aave work. We then explore the key features of decentralised exchanges and derivatives. Finally, the course compares the risks surrounding DeFi to its major advantages over traditional methods. Sign up for this course to learn how DeFi is changing the way money moves around the fascinating world of finance.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}