{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3917","title":"Introduction to Mobile App Development With Flutter","totalEnrolled":"10,246","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This course will show you how to build an app from scratch using the Flutter Framework for iOS & Android apps.","description":"This course will show you how to build an App from scratch and make the most of Flutter, a high-performance, intuitive app-development framework for Android and iOS. We will guide you through the theory behind Flutter and follow a practical approach throughout this course. This free online course will help you gain complete knowledge of Flutter and build apps like a professional.","courseOutcomes":["Explain how to build a functional Fl...","Summarize the basics of how to build...","Identify how to favourite and unfavo...","Discuss ways to navigate between Con...","Explain how to build a functional Flutter App that can run on Android and iOS from scratch","Summarize the basics of how to build your User Interface","Identify how to favourite and unfavorite Contacts","Discuss ways to navigate between Contact List and Contact Create Page","Describe how to load Contacts from ContactDao in ContactsModel","Describe State Management using Scold Model","State how to create your own Custom Widget","Evaluate how to manage your code effectively","Explain how to build a functional Fl...","Summarize the basics of how to build...","Identify how to favourite and unfavo...","Discuss ways to navigate between Con...","Explain how to build a functional Flutter App that can run on Android and iOS from scratch","Summarize the basics of how to build your User Interface","Identify how to favourite and unfavorite Contacts","Discuss ways to navigate between Contact List and Contact Create Page","Describe how to load Contacts from ContactDao in ContactsModel","Describe State Management using Scold Model","State how to create your own Custom Widget","Evaluate how to manage your code effectively"],"courseDescription":"<p>Flutter is the popular open-source framework created by Google for developing Android and iOS apps. Introduction to Mobile App Development Course with Flutter is a free online course that helps you discover how to use Flutter effectively. We will show you how to build a complete Contacts App from scratch and how to make the most of this high-performance, intuitive framework. You will not just study Flutter in theory, but we will build a complete realistic app throughout this course. Flutter is powered by Dart, a programming language from Google that has excellent support for asynchronous operations, which is very important for today’s IO and Data-intensive applications.&nbsp;</p><p>We will start by installing Flutter SDK on Windows and Mac OS. You will learn the basic requirements to install and run Flutter from your development environment, covering everything from operating system compatibility, disk space to tools. The successful installation of Flutter depends on these tools being available in your environment. Learn about Flutter Doctor as a tool that tells you what you have or what you have not set up correctly for the app to run and build projects. You will also learn how Flutter relies on the complete installation of Android Studio to supply its Android platform dependencies. We will show you how to write your Flutter apps in several editors. We will use an Android emulator during the development process. The Virtual Device Manager is an interface you can launch from Android Studio to help you create and manage Virtual Devices.&nbsp;</p><p>Next, we will demonstrate how to convert a Contacts Page to a Stateful Widget. A Stateless Widget is a widget that describes part of the user interface by building a constellation of other widgets. The building process continues recursively until the description of the user interface is fully concrete. In Populating the contacts to initState, the build function runs once the Widget is initialized. InitState runs once per the Widget lifetime whenever the Widget is created. It is similar to how List.Generate runs. It runs when the class is expanciated and initState runs when the class is initialized. You will also learn how Navigation works with Flutter. Router is responsible for Navigation. In Flutter data, Router is called Navigator. Navigator is an inherited Widget, very similar to how Scoped Model is an inherited Widget. Routes are straightforward because you can animate how the page arrives. Finally, we will discuss how to convert Contact objects to Map. SEMBAST is a non-SQL database. Most of the non SQL Databases uses JSON to store objects persistently on storage. JSON is a simple way to convert objects in memory to some text that you can store somewhere. By using Flutter, you will write code just once and export your apps to both the Apple AppStore and to Google Play. This course helps you build your knowledge and expertise of Flutter. Start this course today and develop your Android and iOS apps like a professional!</p><a href=\"https://alison.com/resume/courses/3917\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3917\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started With Flutter","description":"In this module, you will be introduced to Flutter. Flutter is a framework for writing cross-platform Apps for both Android and iOS. This module identifies the types of widgets, how to create a Contact App, and how to become a professional Flutter Developer.","topics":["Getting Started with Flutter - Learning Outcomes","Introduction to Flutter","Android Setup","Flutter Plugins","Flutter Project Structure","What is a Widget?","isFavorite Contact Class and User Interface","Getting Started with Flutter - Lesson Summary","Getting Started With Flutter Assessment"]},{"name":"Module","details":"State Management","description":"In this module, you will learn about State Management and ScopedModel technique. Learn also how Strings are mainly used to represent text. This module explains how Validators either return an error String or Null to check if the value is in the correct format.","topics":["State Management - Learning Outcomes","State Management","Creating an Input Form","Validating a Form","Adding and Saving New Contacts","State Management - Lesson Summary","State Management Assessment"]},{"name":"Module","details":"Creating a Note-Keeper Application","description":"In this module, you will learn about the need to navigate between Contact List and Contact Create Page. This module also explains how the Scoped Model is an inherited widget and what the Image Picker is used for.","topics":["Creating a Note-Keeper Application - Learning Outcomes","Navigation Overview","Creating Contact Edit Page","Building User Interface","Image-Picker Library","Creating a Note-Keeper Application - Lesson Summary","Creating a Note-Keeper Application Assessment"]},{"name":"Module","details":"SEMBAST Database and Contacts","description":"In this module, you will learn how most of the non-SQL Databases uses JSON to store objects persistently on storage. Learn also how the Map iterates over the whole list and gives us access to every element.","topics":["SEMBAST Database and Contacts - Learning Outcomes","SEMBAST Database","Sorting Contacts","Interacting With Contacts and ContactForm","SEMBAST Database and Contacts - Lesson Summary","SEMBAST Database and Contacts Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Mobile App Development With Flutter - Course Assessment"]}]}