{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5314","title":"Introduction to Pixel Art","totalEnrolled":"1,172","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create pixel art designs of various sizes like a professional in this free online digital art course.","description":"Pixel art created with graphic software has become popular with the growth of digital technology and video games. This course teaches you how to create pixel art, starting with lines and shapes before moving on to colouring, shading, texture and highlights. We also provide insider tips and tricks used to create pixel art images of various sizes. This course suits both amateur and professional digital artists who want to improve their skills.","courseOutcomes":["Discuss the principles, origin and h...","List the various pixel art sizes emp...","Distinguish between pixel art and ot...","Explain how to use Procreate, Asepri...","Discuss the principles, origin and history of pixel art","List the various pixel art sizes employed by most artist","Distinguish between pixel art and other digital graphic artworks","Explain how to use Procreate, Aseprite and Piskel for your pixel artworks","Outline how to draw pixelated figures and characters","Recognise the various ways to shade and colour your pixelated designs","Discuss how to convert pixelated lines and shapes to actual images","Discuss the principles, origin and h...","List the various pixel art sizes emp...","Distinguish between pixel art and ot...","Explain how to use Procreate, Asepri...","Discuss the principles, origin and history of pixel art","List the various pixel art sizes employed by most artist","Distinguish between pixel art and other digital graphic artworks","Explain how to use Procreate, Aseprite and Piskel for your pixel artworks","Outline how to draw pixelated figures and characters","Recognise the various ways to shade and colour your pixelated designs","Discuss how to convert pixelated lines and shapes to actual images"],"courseDescription":"<p>Pixel art produces fascinating images that are visually distinct from other contemporary art. This digital art style creates images by connecting tiny coloured dots (pixels). Most classic video games were created in pixelated forms, creating a strong nostalgic link between pixel art and retro games. This digital art and graphic design course is designed for beginners but is also helpful for more advanced artists who want to brush up on their basics and update their technical skills.</p><p>We begin with a brief introduction to pixel art and lay out its origins and history before comparing it to other artworks with similar features. We then explain how to draw pixelated lines and shapes before converting them to actual pictures. We also explore the colour system and show you how to shade pixelated images and add depth, tones, highlights and texture to them. The course examines three image editors (Procreate, Aseprite and Piskel) that are ideal for creating pixel art and animation.</p><p>The course goes over the various sizes of pixel art typically chosen by digital artists. We begin with 8x8-pixel images and work our way up to 100x100-pixel images. Our final section focuses on drawing pixelated swords, shields, a magic staff, guns and a knight to provide you with case studies and examples with which to practise your creative abilities. This course provides the techniques and skills required to create some outstanding pixel artwork and non-fungible tokens (NFTs) and we guide you through the process step by step from start to finish. Travel back to the lost ‘golden age of arcade games’ and learn how to create digital pixel art that captures the magic of retro gaming with your newfound graphic design skills.</p><a href=\"https://alison.com/resume/courses/5314\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5314\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Basics of Pixel Arts","description":"In this module, you will learn about pixel art and how to make basic shapes and lines. You will also explore three software used for creating pixel art and animation. The colour wheel and applying shades, highlights, and texture to your images will also be covered. Also, you will learn how to draw several pixel art images in different sizes.","topics":["The Basics of Pixel Arts - Learning Outcomes","Lines and Shapes in Pixel Art","Pixel Arts Software","Colors, Shading and Texture","Drawing Pixel Art Images","The Basics of Pixel Arts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Pixel Art - Course Assessment"]}]}