{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1640","title":"Beginner in Advanced Swift Programming for iOS","totalEnrolled":"4,348","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use advanced Swift programming for iOS development with this free online programming course.","description":"This free online iOS development course will teach you about how you can master the Swift programming language and take your iOS development skills to the next level. You will learn the basics of advanced Swift programming concepts such as enumerations, extensions, protocols, delegates, transformations and more. Start this short course today and take the first step towards writing cleaner, more professional code.","courseOutcomes":["Outline the use of extensions for ex...","Identify when to use enumerations an...","Illustrate how Swift transformations...","List and explain the different trans...","Outline the use of extensions for existing classes, structures, enumerations or protocols","Identify when to use enumerations and work with data in a type-safe way","Illustrate how Swift transformations can be used to manipulate data","List and explain the different transformation functions in Swift","Define protocols and their use in the Swift programming language","Explain what delegation is and how to pass data between view controllers","Identify when to use the mutating keyword for functions","Outline the use of extensions for ex...","Identify when to use enumerations an...","Illustrate how Swift transformations...","List and explain the different trans...","Outline the use of extensions for existing classes, structures, enumerations or protocols","Identify when to use enumerations and work with data in a type-safe way","Illustrate how Swift transformations can be used to manipulate data","List and explain the different transformation functions in Swift","Define protocols and their use in the Swift programming language","Explain what delegation is and how to pass data between view controllers","Identify when to use the mutating keyword for functions"],"courseDescription":"<p>This course is an introduction to advanced Swift programming concepts and aims to increase your knowledge of Swift for more advanced iOS development. Mastering Swift programming is a fundamental part of becoming a great iOS developer. This course provides a thorough introduction to some of the more complex topics in Swift and breaks them down with the use of examples and applications.</p><p>The course begins by introducing you to essential progamming concepts such as enumerations, extensions, Swift transformations and how to work with data in a type-safe way. Next, the course continues by outlining protocols and delegates, and how to use them to pass data between view controllers. You'll also learn how to identify when to use the mutating keyword for functions. If you're interested in becoming an iOS app developer or honing your skills as a programmer, this short course will provide a perfect introduction to some of the advanced programming topics.</p><p>If you’re interested in iOS programming as a future career, or if you’re an iOS development professional seeking to improve your skills, then this clear and simple course is the one for you. With the knowledge contained in this free course, you can begin writing cleaner code and more robust applications straight away. So start this course today, and by the end of the week you'll be a more powerful iOS developer.</p><a href=\"https://alison.com/resume/courses/1640\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1640\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Enumerations, Extensions and Swift Transformations","description":"This module acts as an introduction into some of the advanced Swift topics for iOS Development. In this module you will learn about enumerations and extensions. This module also discusses Swift transformations and gives practical examples of how to use the map, flatmap, compactmap and reduce functions to manipulate and change data structures.","topics":["Enumerations, Extensions and Swift Transformations - Learning Outcomes","Enumerations","Extensions- Part 1","Extensions- Part 2","Swift Transformations","Enumerations, Extensions and Swift Transformations - Lesson Summary"]},{"name":"Module","details":"Overview of Protocols, Delegates and Mutating Functions","description":"This module continues by covering advanced Swift programming concepts for iOS development. In this module you will learn about protocols and delegates and their uses in iOS development. This module outlines the how protocols and delegates work with a multitude of examples and applications.This topic illustrates how to create a Color Magic app, work with mutating functions and pass data between view controllers.","topics":["Protocols, Delegates and Mutating functions - Learning Outcomes","Intro to Protocols-Delegates - Numbers Example","Intro to Protocols-Delegates Part 2 - Question Generator","Protocols-Delegates - Building Color Magic App UI","Protocols-Delegates - Using the Delegate Method in Color Magic App","Protocols-Delegates - Using Mutating Functions in Types","Protocols, Delegates and Mutating functions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Advanced Swift Programming for iOS - Course Assessment"]}]}