{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2222","title":"Introduction to C and Assembly Language Programming","totalEnrolled":"3,448","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about C and Assembly Language Programming from this free online course","description":"This free online course explains what it takes to learn the basics of C and assembly language programming. The course gives some insights on the 8086 microprocessor, commonly used assembly and stack related instructions, how two variables are swapped in C and the applications of a tool called the compiler explorer. By the end of the course, you will gain enough knowledge to write your own programs in C and assembly language, so get started today.","courseOutcomes":["Explain the role of a  microprocesso...","Explain the requirements that must b...","Explain how data is moved from one r...","List the four modes of addressing le...","Explain the role of a  microprocessor","Explain the requirements that must be satisfied before a microprocessor can fetch, decode and execute commands","Explain how data is moved from one register to another register","List the four modes of addressing learned in this module","Explain how to write an assembly program to calculate the string length of some given strings","Explain the various techniques available for swapping variables with the use of temporary variables","Explain the various techniques available for swapping variables without the use of temporary variables","Explain the role of a  microprocesso...","Explain the requirements that must b...","Explain how data is moved from one r...","List the four modes of addressing le...","Explain the role of a  microprocessor","Explain the requirements that must be satisfied before a microprocessor can fetch, decode and execute commands","Explain how data is moved from one register to another register","List the four modes of addressing learned in this module","Explain how to write an assembly program to calculate the string length of some given strings","Explain the various techniques available for swapping variables with the use of temporary variables","Explain the various techniques available for swapping variables without the use of temporary variables"],"courseDescription":"<p>The course will begin by introducing you to the 8086 microprocessor architecture. You will learn about commonly used assembly language and stack related instructions, the roles of a microprocessor and the tasks carried out by a microprocessor. These tasks are: fetch, decode, and execute commands.</p><p>The course then moves on to explain the different types of compilers like GCC, Turbo C and MS Visual C compilers. You will learn about the data types used in C programming language, how to write an assembly program to evaluate an expression using repeated addition and conversion of C programs to assembly language. Next, you will learn about stack related instructions from the assembly and C programming point of view. &nbsp;</p><p>Finally, you will learn the various techniques used for swapping two variables in C using the PUSH and POP operations. You will also learn how to perform multiplication operation using repeated addition and get introduced to a powerful tool – the compiler explorer which makes it easier for programmers to debug. Start this course today, and learn valuable skills in C and Assembly language programming.</p><a href=\"https://alison.com/resume/courses/2222\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2222\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Microprocessors and Assembly Language Programming","description":"In this module, you will learn about the 8086 microprocessor and assembly language programming. The module gives a brief introduction to the 8086 processor architecture, commonly used assembly instructions. You will also learn about the use of stack and other related instructions in this module.","topics":["Introduction to Microprocessors and Assembly Language Programming - Learning Outcomes","x86 Intsruction Set","Registers in Microprocessors","Execution of Instructions in x86 Microprocessors","Arithmetic Logic Unit (ALU) Instructions","Stack Operations","Introduction to Microprocessors and Assembly Language Programming - Lesson Summary"]},{"name":"Module","details":"C Programming and Inline Assembly","description":"In this module, you will be introduced to the concepts of C programming and inline assembly. Topics covered include data types and their sizes, ALU operation, string length and multiplication using repeated addition. You will also learn how to swap two variables both in C and inline assembly in this module.","topics":["C Programming and Inline Assembly - Learning Outcomes","Inline Assembly","Compiler Output","Pointer Arithmetic at an Assembly Language Level","Swapping variables","Compiler Explorer","C Programming and Inline Assembly - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to C and Assembly Language Programming - Course assessment"]}]}