{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1207","title":"Introduction to Responsive Design using Bootstrap Framework","totalEnrolled":"8,458","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Bootstrap to create a responsive website for desktops, tablets, and mobile phones in just a few hours.","description":"This free online Bootstrap course will teach you how you can use Bootstrap to supercharge your web design in the Visual Studio development environment. Bootstrap is the most popular HTML, CSS, and JavaScript frameworks used for the development of responsive mobile-first projects today, and with good reason. In this course, you will learn about Bootstrap components and themes to your website, it's use in website development, and more!","courseOutcomes":["Describe the helpfulness of using Bo...","List the types of components found i...","Describe how to bring Bootstrap comp...","Explain the importance of a responsi...","Describe the helpfulness of using Bootstrap to upgrade/develop a website","List the types of components found in Bootstrap","Describe how to bring Bootstrap components into a website","Explain the importance of a responsive design for a website","Discuss how to use grids in Bootstrap","Describe how grids in Bootstrap are different to HTML tables","Describe the helpfulness of using Bo...","List the types of components found i...","Describe how to bring Bootstrap comp...","Explain the importance of a responsi...","Describe the helpfulness of using Bootstrap to upgrade/develop a website","List the types of components found in Bootstrap","Describe how to bring Bootstrap components into a website","Explain the importance of a responsive design for a website","Discuss how to use grids in Bootstrap","Describe how grids in Bootstrap are different to HTML tables"],"courseDescription":"<p>This free online course begins by introducing you to Bootstrap. You will study the different themes that can be used to easily reskin a website and learn what a Responsive UI is. The course will then teach you the three main groups of components in Bootstrap. You will learn how to group components for organising content in web pages and how to use Bootstrap objects such as glyphicon icons and buttons. You will also learn how to include these objects in a website.<br><br>Next, you will study the navigation components that you can include in a website such as a Navbar and Pagination. You will look into page design and layout, study the four different grids depending on screen size, and learn how to move and control the placement of content in a grid. You will also learn how to create a form for data entry, as well as understand the difference between the grids in Bootstrap to HTML tables.<br><br>This free online web design course is designed to make it much easier to learn how to create responsive websites for tablets, mobile phones, and desktop computers and laptops. However, a pre-existing knowledge of Web Page Design using HTML5 and CSS3 will help to make this learning material more accessible, so check out Alison's courses on HTML first if you need to. Otherwise, get started with the course today and bring your Bootstrap skills to the next level in no time!</p><a href=\"https://alison.com/resume/courses/1207\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1207\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Bootstrap","description":"In this module you will be introduced to Bootstrap. You will learn how Bootstrap can help with developing and maintaining your website. You will learn about the different themes you can use to reskin a website with ease. You will learn what a Responsive UI is, and about support for using Bootstrap in Visual Studio.","topics":["Module 1 Learning Outcomes","Introduction","Building Responsive UI with Bootstrap","Components and Visual Studio support","Module 1 Lesson Summary"]},{"name":"Module","details":"Bootstrap Components","description":"In this module you will be introduced to components in Bootstrap and the three main groups for components. You will learn about grouping components for organising content in webpages. You will learn about using Bootstrap objects, such as glyphicons and buttons, and how to include them in a website. You will learn about navigation components you can include in a website such as a Navbar and Pagination.","topics":["Module 2 Learning Outcomes","Intro to Components and Grouping","Objects","Navigation","Module 2 Lesson Summary"]},{"name":"Module","details":"Page Design","description":"In this module you will learn about page design and layout. You will learn how grids work and how to include them in a website. You will learn about the four different grids depending on screen size, and how to move and control placement of content in a grid. You will also learn about creating a form for data entry.","topics":["Module 3 Learning Outcomes","Bootstrap Grid Concepts","Item Placement","Controlling Visibility","Module 3 Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Responsive Design using Bootstrap Assessment"]}]}