{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4930","title":"Introduction to Google Go Programming","totalEnrolled":"642","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the fundamental concepts for developing and programming agile apps using Google Go in this free online course.","description":"Google Go programming has widely grown in use and popularity since its public release in 2009. We attribute this growth to its improved concurrency and programming productivity. It was designed and supported by Google in an attempt to accommodate multi-core processing. We will introduce you to the fundamentals of Google Go in this course. Then you will master the Go programming language and some advanced topics in Go.","courseOutcomes":["List the characteristics of Go and t...","Recognise the different libraries th...","Describe how to use the built-in edi...","Analyse the environment in Go and id...","List the characteristics of Go and the benefits of using the Go language","Recognise the different libraries that you can use in Go","Describe how to use the built-in editor in golang.org to kickstart Go","Analyse the environment in Go and identify how to declare variables and constants","Discuss the Go programming language basics","Explain how to set up the local environment in Go","Identify how to use structs in Go","Evaluate types and how to cast from one type to another","Identify how to publish and consume JSON from a web server","Explain how to create function constructors in Go","State how to provide polymorphic functionality","Describe how to do object composition","List the characteristics of Go and t...","Recognise the different libraries th...","Describe how to use the built-in edi...","Analyse the environment in Go and id...","List the characteristics of Go and the benefits of using the Go language","Recognise the different libraries that you can use in Go","Describe how to use the built-in editor in golang.org to kickstart Go","Analyse the environment in Go and identify how to declare variables and constants","Discuss the Go programming language basics","Explain how to set up the local environment in Go","Identify how to use structs in Go","Evaluate types and how to cast from one type to another","Identify how to publish and consume JSON from a web server","Explain how to create function constructors in Go","State how to provide polymorphic functionality","Describe how to do object composition"],"courseDescription":"<p>We will begin this course by teaching you why you should use Google Go and its benefits. Then, you will learn how to use the golang.org editor and declare variables and constants. In addition, you will explore the Go programming language basics, Go syntax, types, casting and how to set up your local environment, which includes installing Go locally and using the integrated development environment specifically for Go.</p><p>Discover how to use structs, including how to make them and use them in Go. You will also learn to use defer and variadic functions to carry out commands. After that, we'll look at the various Go operators and conditional statements. Additionally, you will explore arrays and slices, how to tell them apart and how to loop across arrays and dictionaries.</p><p>What does Go concurrency mean? Is there a distinction between parallelism and concurrency? We will teach you how Go handles concurrency and use the ‘Go’ keyword before your function. You will learn the basics of the Go programming language in this course. As a result, if you're searching for a more straightforward approach to learning programming and are taking this course for beginners, Google Go is the place to go. To get started, enrol in this course right away!</p><a href=\"https://alison.com/resume/courses/4930\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4930\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Go Programming and the Go Language","description":"This module will teach you the characteristics of Go, the benefits of using the Go language, imports, and the different libraries that you can use in Go. You will learn how to familiarize yourself with the built-in editor in Go, the Go programming language basics and how to declare constants and variables and use them in Go.","topics":["Introduction to Go and the Go Language - Learning Outcomes","Introduction to Go Programming","Go Programming Language Basics","Go Programming Language Data Types","Introduction to Go and the Go Language - Lesson Summary"]},{"name":"Module","details":"Advanced Concepts in GO Programming","description":"In this module, you will learn advanced topics in Go which include object composition, polymorphism, encryption, and decryption using AES. You will also learn how to read and write files using File I/O. Also, you will learn how to use the new function/constructor, how to publish and consume with JSON, and how to use multi files for your projects.","topics":["Advanced Concepts in GO Programming - Learning Outcomes","Go Language Advanced Topics","Readwrite and Jsonpublisher","Concurrency in the Go Language","Advanced Concepts in GO Programming - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Google Go Programming - Course Assessment"]}]}