{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3901","title":"Introduction to Adobe Lightroom Correctional Tools","totalEnrolled":"378","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the functions of image adjustment tools and adjustment panels on Adobe Lightroom.","description":"This free online course teaches you about the different image adjustment tools and panels in Adobe Lightroom. You will about the spot removal-, red-eye- and filter tools, as well as basic and tone curve panels. We will also study the effects of vignetting and grain on images and cluster markers and the different methods of filtering map markers. Sign up now to take your picture editing skills to the next level!","courseOutcomes":["Discuss the functions of the crop ov...","Explain the process of cloning...","State the functions of the red-eye t...","Describe the concepts of auto maskin...","Discuss the functions of the crop overlay tool","Explain the process of cloning","State the functions of the red-eye tool","Describe the concepts of auto masking","Explain how to correct the white balance of an image","Indicate the role of the hue panel","Discuss the functions of the split toning panel","Describe the effects of noise on an image","State the additional benefits of RAW files","Outline the functions of the XMP Sidecar File","Identify the capabilities of the cluster marker","Explain the different methods of filtering map markers","Discuss the functions of the crop ov...","Explain the process of cloning...","State the functions of the red-eye t...","Describe the concepts of auto maskin...","Discuss the functions of the crop overlay tool","Explain the process of cloning","State the functions of the red-eye tool","Describe the concepts of auto masking","Explain how to correct the white balance of an image","Indicate the role of the hue panel","Discuss the functions of the split toning panel","Describe the effects of noise on an image","State the additional benefits of RAW files","Outline the functions of the XMP Sidecar File","Identify the capabilities of the cluster marker","Explain the different methods of filtering map markers"],"courseDescription":"<p>This free online course has been specifically designed to teach you about the features and functions of the various image adjustment tools in Adobe Lightroom. A histogram is an important tool used to derive information about a selected image or group of images. We will show you how to interpret information in a histogram. Photo-adjustment helps with eliminating areas in an image. We will highlight the features of overexposed and underexposed areas and take you through the functions of the crop overlay tool. White circles are an essential editing feature. We will discuss how they are used when editing or adjusting images. Cloning is another vital concept to understand, and by the end of this course, you will be able to explain the process of cloning. Did you know that there are two main filter tools? Get ready to learn about their distinct features and roles. Painting is also an editing method in Lightroom, and we will explore the functions of the adjustment brush. We will also introduce you to the concepts of flow and density in relation to painting.</p><p>The red-eye and spot removal tools serve different purposes, and you will learn about the functions of both tools. White balance is the most accurate white balance is crucial, and the hue feature involves dealing with a range of colours. You will learn to identify the hue settings and their functions and explore the working principles of adjustment presets. We will also cover the functions of the split toning and basic panels in detail in this course. ISO affects the outcome of an image. Upon completion of this course, you will be able to explain how lighting conditions affect ISO sensitivity. We will teach you about the concepts of noise, as well as its effects on a photo. It is also imperative that you know about lens corrections and Lightroom's methods to correct lens aberrations. The transform panel is another correctional tool you will need to understand. Did you know that the panel consists of three correction types? You will learn about their differences and functions. Vignetting is a key process used in image editing, and you will acquire knowledge on three vignetting styles.</p><p>As identical as JPEG and RAW file working systems, RAW files have some unique features absent in JPEG. We will take you through the additional benefits and features of RAW files. RAW files need to be exported to other applications for further processing. You will also learn more about NEF and XMP Sidecar Files. It's vital to understand how to make image adjustments and metadata visible in Photoshop. One of the ways this is done is by geotagging images from maps. This course will teach you about the map module and how to sort photos with and without GPS coordinates. There are multiple types of views for maps. You will learn to change these views, along with their functions and differences. The cluster marker is another concept to understand. We will show you the different methods of filtering map markers. This course will be of great interest to students, researchers, photo enthusiasts and anyone who would like to understand basic settings and functions in Adobe Lightroom. Even professional photographers can benefit from it. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3901\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3901\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Image Adjustment Tools","description":"To start, this module will introduce you to the functions and differences between the graduated, as well as radial filter tools. You will also be introduced to the functions of the spot and red eye removal tools.","topics":["Image Adjustment Tools - Learning Outcomes","Spot Removal Tool","Filter Tools","Auto Masking","Image Adjustment Tools - Lesson Summary"]},{"name":"Module","details":"Adjustment Panels","description":"To start, this module will teach you about the basic, tone curve and transform panel. You will also be introduced to the effects of noise, vignetting and grain on an image.","topics":["Adjustment Panels - Learning Outcomes","Basic and Tone Curve Panel","Concepts of Noise","Vignetting and Grain Effect","Adjustment Panels - Lesson Summary"]},{"name":"Module","details":"The Map Module","description":"To start, this module will introduce you to the additional features and benefits of RAW files. You will also be introduced to the functions of the cluster marker, as well as the different methods of filtering map markers.","topics":["The Map Module - Learning Outcomes","Additional Benefits of RAW Files","Working With Maps","Exploring the Map Module","The Map Module - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Adobe Lightroom Correctional Tools - Course Assessment"]}]}