{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3502","title":"Beginner VMware vSphere 6.0 - Virtualization and Deployment","totalEnrolled":"819","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the virtualization and deployment processes of the VMware vSphere 6.0 in this free online course.","description":"This free online course on the virtualization and deployment of VMware vSphere 6.0 will give you a comprehensive guide on the methodology of VMware and the key features of this version of vSphere. You will learn all about the two types of the hypervisor and their functions in a virtual machine as well as how to install the vSphere hypervisor (otherwise known as the ESXi), and the fundamental differences between the Windows and Linux commands.","courseOutcomes":["Discuss in detail the methodology of...","Explain the configuration and virtua...","Identify the physical hardware requi...","Explain the vSphere 6.0 deployment g...","Discuss in detail the methodology of the VMware vSphere 6.0","Explain the configuration and virtualization processes of the VMware vSphere 6.0","Identify the physical hardware requirements for the installation of the ESXi","Explain the vSphere 6.0 deployment guidelines for VMware","Discuss the processes involved in the vSphere Hypervisor (ESXi) installation","Explain the functions of WinSCP as a 3rd party tool to administer a VMware environment","Differentiate between Windows Commands and Linux Commands","Discuss the processes of troubleshooting the vSphere Client (VIC)","Discuss the processes involved in creating and modifying virtual networks","Define some storage concepts in the virtual machine environment","Discuss the concepts of VMware Virtual SAN (VSAN), VSAN device and cluster configuration","Discuss in detail the methodology of...","Explain the configuration and virtua...","Identify the physical hardware requi...","Explain the vSphere 6.0 deployment g...","Discuss in detail the methodology of the VMware vSphere 6.0","Explain the configuration and virtualization processes of the VMware vSphere 6.0","Identify the physical hardware requirements for the installation of the ESXi","Explain the vSphere 6.0 deployment guidelines for VMware","Discuss the processes involved in the vSphere Hypervisor (ESXi) installation","Explain the functions of WinSCP as a 3rd party tool to administer a VMware environment","Differentiate between Windows Commands and Linux Commands","Discuss the processes of troubleshooting the vSphere Client (VIC)","Discuss the processes involved in creating and modifying virtual networks","Define some storage concepts in the virtual machine environment","Discuss the concepts of VMware Virtual SAN (VSAN), VSAN device and cluster configuration"],"courseDescription":"<p>Level-up your VMWare skills with this free online course on the virtualization and deployment of VMware vSphere 6.0. This in-depth course kicks off with the virtualization processes of VMware 6.0 and highlights the various updates made on the previous versions of VMware. You will then learn about the software-defined data centre (SDDC) along with how it simplifies data management along with the functions of type 1 and type 2 hypervisors (ESXi hosts) and the minimum physical hardware requirements for the installation of the ESXi hosts. Some other critical base knowledge is then covered including the different versions of VMware ESXi 6.0, functions of the VMware Horizon FLEX in providing flexibility to IT users while maintaining security and compliance, VMware Workstation Pro 12 and the functionality of the VMware Fusion 8 in VMware vSphere 6.0.</p><p>Have you ever wondered about using the direct console user interface (DCUI) to locally configure ESXi 6.0? This vSphere 6.0 course comprehensively describes this and then moves on to discuss how to work with the vSphere 6.0 ESXi image builder Command-Line Interface (CLI), the configuration process of DNS settings in VMware systems, the concept of network time protocol (NTP version 4), and how to achieve proper time synchronization. This provides an ideal platform for you to study the VMWare administrative tools, functions of the vSphere command-line interface (vCLI) in ESXi management, the Windows-based Secured Copy program (WinSCP) responsible for copying files between ESXi hosts and the processes involved in licensing vCenter Server 6.0 in VMware 6.0. The course finishes with the analysis and discussion of the various kinds of switches at your disposal including Standard Virtual Switches (vSS), vSphere Distributed Switch (vDS), 3rd party distributed switches, Cisco Nexus 1000v virtual switch, Nexus 1000v, IBM system networking distributed virtual switch 5000v and the various storage terms and their respective functions.</p><p>This VMWare vSphere 6.0 course is designed to equip you with practical knowledge of the configuration of storage in VMware 6.0 and broad themes also to be covered are being able to distinguish between the Storage Area Network (SAN) and Network Attached Storage (NAS) in vSphere, how multipathing with fibre channel works, and the characteristics of the vSphere virtual volumes (VVols). This course is aimed at students, IT researchers and -enthusiasts and professionals working with or interested in VMware administration with a specific focus on the virtualization and deployment of VMWare vSphere 6.0.</p><a href=\"https://alison.com/resume/courses/3502\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3502\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Virtualization Overview","description":"In this module, you will be introduced to the course methodology along with the expert tips that will aid your assimilation of the entire course. You will learn about the software-defined data centre (SDDC), how it simplifies your data management, and the two types of hypervisors referred to as ESXi hosts in VMware.","topics":["Introduction and Virtualization Overview - Learning Outcomes","Course Methodology","Configuration and Virtualization","Type 1 and Type 2 Hypervisors","Introduction and Virtualization Overview - Lesson Summary","Course Introduction and Virtualization Overview - Assessment"]},{"name":"Module","details":"Planning and Installing ESXi","description":"In this module, you will be introduced to the minimum physical hardware requirements for the installation of the ESXi. You will learn the factors that can affect the design and configuration of an ESXi environment, and how to locally configure the ESXi 6.0 using the direct console user interface (DUCI).","topics":["Planning and Installing ESXi - Learning Outcomes","Hardware Requirements and Configuration of VMware vSphere Hypervisor","Planning the ESXi Deployment","vSphere Hypervisor (ESXi) Installation","Configuring DNS Settings and Time Synchronization","Troubleshooting ESXi","Planning and Installing ESXi - Lesson Summary","Planning and Installing ESXi - Assessment"]},{"name":"Module","details":"Using Tools to Administer a VMware Environment","description":"In this module, you will be introduced to the various tools available to administer a VMware environment. You will learn about the Windows-based Secured Copy program (WinSCP), the function of the vSphere command-line interface (vCLI) in ESXi management, and the log files available when troubleshooting for the vSphere client.","topics":["Using Tools to Administer a VMware Environment - Learning Outcomes","Overview of Third Party Tools","ESXi Management","Common Command Line Interface Options - Linux Commands","Troubleshooting the vSphere Client","Using Tools to Administer a VMware Environment - Lesson Summary","Using Tools to Administer a VMware Environment - Assessment"]},{"name":"Module","details":"vCenter Server 6.0 Licensing and Installation","description":"In this module, you will be introduced to how vCenter server 6.0 licensing is done. You will learn about the vSphere Distributed Switch (VDS), how to create the vDS, managing scheduled tasks in the vCenter Server, and how to clear the vCenter server service (vpxd) errors.","topics":["vCenter Server 6.0 Licensing and Installation - Learning Outcomes","Licensing vCenter Server 6","Planning vCenter Server Deployment","vCenter Server Installation","vSphere Web Client","vCenter Server Inventory","Managing vCenter Server","Troubleshooting vCenter Server and Database","vCenter Server 6.0 Licensing and Installation - Lesson Summary","vCenter Server 6.0 Licensing and Installation - Assessment"]},{"name":"Module","details":"Configuring Networking in VMware","description":"In this module, you will be introduced to the definition of some networking terms. You will learn about the Standard Virtual Switches (vSS) serving as a conduit between networks, the functions of vSphere Distributed Switch (vDS) in VMware, and the different 3rd party distributed switches in VMware.","topics":["Configuring Networking in VMware - Learning Outcomes","Creating & Modifying Virtual Networks","vSphere Distributed Switches","3rd Party Distributed Switches","Configuring Networking in VMware - Lesson Summary","Configuring Networking in VMware - Assessment"]},{"name":"Module","details":"Configuring Storage in VMware","description":"In this module, you will be introduced to the different ways of configuring storage in VMware. You will learn about the difference between the Storage Area Network (SAN) and Network Attached Storage (NAS) in vSphere, how to do multipathing with fibre channel, and the characteristics of the vSphere virtual volumes (VVols).","topics":["Configuring Storage in VMware - Learning Outcomes","Storage Concepts","iSCSI Storage","Fibre Channel Storage","VMFS Datastores","NAS Storage and NFS Datastores","Raw Device Mapping (RDM)","Solid State Disks (SSD)","Storage and Management Solutions","VMware Virtual SAN (VSAN)","vSphere Virtual Volumes (VVols)","Configuring Storage in VMware - Lesson Summary","Configuring Storage in VMware - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to VMware vSphere 6.0 - Virtualization and Deployment - Course Assessment"]}]}