{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3953","title":"Beginner in Multiple Domain Hosting on One Virtual Server","totalEnrolled":"593","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course studies hosting multiple websites on a single DigitalOcean droplet server using a virtual host.","description":"Setting up multiple domains on one virtual machine is a fairly easy task, however, you need to keep in mind the correct processes and procedures from start to finish in order to avoid future issues that can be more challenging to resolve. This free online virtual server course will put you through your paces as you learn the configuration of name servers, DNS zone files, virtual host files, and how to navigate the DigitalOcean console.","courseOutcomes":["Discuss how to create and attach flo...","Recall how to create the directory s...","Outline the installation process for...","Describe how to navigate the Digital...","Discuss how to create and attach floating IPs to DigitalOcean droplets","Recall how to create the directory structure for hosting multiple sites on a single server","Outline the installation process for MySQL and PHP","Describe how to navigate the DigitalOcean admin panel","Recall how to deploy Ubuntu 18.04 on a virtual server","State the reasons for hosting multiple domains on one virtual server","Identify the process for the configuration of a virtual host on our server for each domain","Discuss the configuration of a DNS zone file, name server and virtual host files to multiple domains on one server","Explain how to access and test server configurations through a web proxy","Describe how to multiple domains on a single server with SSL certificates using Let's Encrypt","Analyze the management of the name server on our domain registrars admin panel","Explain how to modify MySQL authentication methods","Discuss how to create and attach flo...","Recall how to create the directory s...","Outline the installation process for...","Describe how to navigate the Digital...","Discuss how to create and attach floating IPs to DigitalOcean droplets","Recall how to create the directory structure for hosting multiple sites on a single server","Outline the installation process for MySQL and PHP","Describe how to navigate the DigitalOcean admin panel","Recall how to deploy Ubuntu 18.04 on a virtual server","State the reasons for hosting multiple domains on one virtual server","Identify the process for the configuration of a virtual host on our server for each domain","Discuss the configuration of a DNS zone file, name server and virtual host files to multiple domains on one server","Explain how to access and test server configurations through a web proxy","Describe how to multiple domains on a single server with SSL certificates using Let's Encrypt","Analyze the management of the name server on our domain registrars admin panel","Explain how to modify MySQL authentication methods"],"courseDescription":"<p>The primary aim of this virtualization training is to teach you how to host multiple domain names on a single virtual host and the hosting provider focused on is the popular DigitalOcean droplet server. The concept of virtual hosts allows more than one website on one system or web server and the servers are differentiated by their hostname. This DigitalOcean course will take you through step-by-step procedures of configuring a droplet with LAMP stack on Ubuntu 18.04 and what you will need for this course is the PuTTY application, a registered domain name, access to a domain registrar, and a DigitalOcean account. Learning how to host multiple domains on one virtual server can be for various personal or career reasons and irrespective of the reason, this virtualization guide will teach you how to navigate the DigitalOcean admin panel to achieve your desired results and configuration. The course explores an exciting new feature offered by DigitalOcean, called \"Floating IP's\" which allows you to transfer IP's easily between multiple droplets including the benefits of working with floating IPs and compares the floating IP with Amazon web service IP.</p><p>The next part of this virtual machine course, teaches you the technicalities of setting up and installing Apache, MySQL, PHP, PhpMyAdmin, and the related authentication methods. Various privileges granted to a user affects the MySQL database in different ways and this course covers all of the possible permutations. Configuration is the following topic of discussion and you will learn the options for name servers, DNS zone files and virtual hosts to host multiple domains from a single virtual server. Working with virtual servers can be quite complex and you will be taught how to develop an organized directory structure for all your websites.</p><p>How to work with the Apache HTTP server is the next key theme and you will learn that when using the platform, an administrator can set up one server to host multiple domains or sites off a single interface or IP by using a matching system. Set up and resetting of permission for domains of the Apache virtual host on Ubuntu 18.04 is explored before tackling the issue of security. With the age of information and data, there is a massive responsibility on the information security teams within IT and broader infrastructure professionals to ensure that safety is always taken care of. In this virtual machine training, the simple-to-use SSL certificate from Let’s Encrypt is used to show you the steps of securing your websites. Enrolling in this technical course is for IT students wanting to specialize in infrastructure, network configuration, and the deploying and management of virtual servers or IT professionals aiming to expand their IT skills to include virtual machines.</p><a href=\"https://alison.com/resume/courses/3953\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3953\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Installations and Setup","description":"This module introduces the installation and configuration process of PHP, MySQL and PhpMyAdmin. It explores the authentication methods used by MySQL to authenticate the root user. Also, this module discusses flush privileges and floating IPs.","topics":["Installations and Setup - Learning Outcomes","Introduction to Course","Floating IPs","Installing Essential Services","Installation and Setup - Lesson Summary"]},{"name":"Module","details":"Web Server Configuration","description":"This module introduces the apache virtual host and the reset permissions for domains. It analyzes the configure domain name server, DNS zone file, and a new virtual host setup. Also, this module describes securing of domain with SSL using let's encrypt.","topics":["Web Server Configuration - Learning Outcomes","Working with Virtual Host","Creating and Enabling Virtual Host File","Securing Domains with SSL","Web Server Configuration - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Multiple Domain Hosting on One Virtual Server - Course Assessment"]}]}