{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3802","title":"Introduction to Basic Settings and Functions in Adobe Lightroom","totalEnrolled":"894","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the functions and features of Adobe Lightroom, along with various digital image files.","description":"This free online course on Basic Settings and Functions in Adobe Lightroom teaches you about the multiple applications in Lightroom. You will learn about different digital image files, backup configuration, creating catalogues, colour-bit depth, and colour space types. We also cover text and graphic watermarks in this course, and you will learn about the differences between collections and collection sets.","courseOutcomes":["Outline the features and functions o...","State how to create folders for Ligh...","Outline the process and importance o...","Discuss the different qualities of t...","Outline the features and functions of Lightroom","State how to create folders for Lightroom photos and catalogue files","Outline the process and importance of backing up catalogues","Discuss the different qualities of the previews built-in Lightroom","List the colour-bit depths in JPEG, RAW, TIFF and DNG files","Distinguish between RAW and JPEG files","Describe the custom configuration process of an identity plate","Indicate how to create text and graphical watermarks","Distinguish between collections and collection sets","Explain how to add keyword identifiers to create customized collections","Outline the features and functions o...","State how to create folders for Ligh...","Outline the process and importance o...","Discuss the different qualities of t...","Outline the features and functions of Lightroom","State how to create folders for Lightroom photos and catalogue files","Outline the process and importance of backing up catalogues","Discuss the different qualities of the previews built-in Lightroom","List the colour-bit depths in JPEG, RAW, TIFF and DNG files","Distinguish between RAW and JPEG files","Describe the custom configuration process of an identity plate","Indicate how to create text and graphical watermarks","Distinguish between collections and collection sets","Explain how to add keyword identifiers to create customized collections"],"courseDescription":"<p>This free online course has been specifically designed to teach you how to navigate Lightroom and its multiple applications. It offers an ideal opportunity to familiarize yourself with the main functions of the application. We will show you the features of raw files and explain the importance of investing in an external hard drive. Did you know that Lightroom builds catalogues of your photos? We will help you make the most of this feature by showing you how to create folders for these catalogues. You will soon realize how important it is to configure Lightroom to automatically backup your catalogues. We will also explore the functions of smart previews and introduce you to the different qualities of previews built by Lightroom. Another exciting feature of Lightroom is the file renaming panel, which changes names on files as they are imported from a media source. The course will explain all the different formats of the file name extension. And upon the completion of this course, you will be able to explain how to create a preset.</p><p>We’ll also show you how integrated Lightroom is with other Adobe applications. For example, we will discuss editing images using external applications such as Adobe Photoshop through the external editing panel. There are various key terms used in Lightroom. By the end of this course, you will know how to indicate these features, along with the differences between RAW and JPEG files. Did you know RAW and JPEG files both support 16-bit colour depth? Once we’ve covered this section of the course, you will be familiar with the concept of colour-bit depths. You will know how to indicate the unique characteristics of Digital Negative (DNG) files and how they are configured when imported. We’ll also look at Adobe RAW, which is an application that helps to enhance images. You will learn about the versions of Camera RAW that your application uses. TIFF files are recommended when exporting photos from Lightroom to Photoshop. This course will teach you about all its features and benefits. Prophoto RGB is the largest colour space followed by Adobe RGB, and we will discuss the concepts and types of colour spaces. Lightroom allows you to personalize additional interface components through the identity plate. We will cover the configuration process of the identity plate extensively in this course.</p><p>Furthermore, you will learn about watermarks and the two types you can execute in the application. We’ll also explore Lightroom’s powerful features to help you organize your material, and you will become familiar with sorting and managing large volumes of photos. Collections are a vital concept to understand when navigating through the Lightroom application. We will highlight the differences between collections and collection sets. When images are imported into a gallery, they can be filtered by filename, copy name, or other data types. Keywords help you identify a specific image or group of images. This course will familiarise you with keyword identifiers and functions of the keyword suggestions panel. You will learn how to make thumbnails visible and the functions of the different tools in the navigator panel. This course will be of great interest to students, researchers, professional photographers, photo enthusiasts and anyone interested in understanding basic settings and functions in Adobe Lightroom. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3802\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3802\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Lightroom","description":"To start, this module will introduce you to the features and functions of lightroom, as well as the import dialog. You will also be introduced to catalog settings, as well as how to back up catalogs.","topics":["Introduction to Lightroom - Learning Outcomes","Features and Functions of Lightroom","Catalog Settings","Features of the Import Dialog","Introduction to Lightroom - Lesson Summary"]},{"name":"Module","details":"RAW and JPEG Files","description":"To start, this module will introduce you to the color-bit depth in JPEG, RAW, TIFF and DNG files. You will also be introduced to the differences between RAW and JPEG files.","topics":["RAW and JPEG Files - Learning Outcomes","Key Terms in Lightroom","RAW and JPEG Files","External Editing Panel","RAW and JPEG Files - Lesson Summary"]},{"name":"Module","details":"Collections and Collection Sets","description":"To start, this module will introduce you to creating custom watermarks for an image, as well as the types of watermarks. You will also be introduced to collections, collections sets and keyword identifiers.","topics":["Collections and Collection Sets - Learning Outcomes","Custom Watermarks","Keyword Identifiers","Navigating Through Images","Collections and Collection Sets - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basic Settings and Functions in Adobe Lightroom - Course Assessment"]}]}