{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4083","title":"Introduction to Analysis with Power BI Desktop","totalEnrolled":"3,208","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to design robust data models and amazing reports to improve business intelligence in this free online course.","description":"Level-up your skills of interpreting, producing, or expanding reports and dashboards with this free online Power BI course. You will learn how to confidently load and transform data using Power Query and create visualizations with Power BI’s drag-and-drop capability. Discover how to drill down into reports and make them fully interactive, and use DAX formulas to design customized calculated columns and fields for better data analysis.","courseOutcomes":["Analyze the Power BI workflow...","Summarize different Power BI visuali...","Outline the stages involved in build...","Identify and create various types of...","Analyze the Power BI workflow","Summarize different Power BI visualizations","Outline the stages involved in building an interactive dashboard","Identify and create various types of charts in Power BI","Define the concept of M code and indicate the process of locating it","Outline the Power Query features and items","List the stages involved in merging several datasets from various systems","Recognize how to change the sample file and combine data from other folders","Explain the DAX language concept","Describe the benefits and drawbacks of implied measures","Discuss the capabilities of time-intelligence functions","Classify the parameters used in Power BI and illustrate their functions","Analyze the Power BI workflow...","Summarize different Power BI visuali...","Outline the stages involved in build...","Identify and create various types of...","Analyze the Power BI workflow","Summarize different Power BI visualizations","Outline the stages involved in building an interactive dashboard","Identify and create various types of charts in Power BI","Define the concept of M code and indicate the process of locating it","Outline the Power Query features and items","List the stages involved in merging several datasets from various systems","Recognize how to change the sample file and combine data from other folders","Explain the DAX language concept","Describe the benefits and drawbacks of implied measures","Discuss the capabilities of time-intelligence functions","Classify the parameters used in Power BI and illustrate their functions"],"courseDescription":"<p>Are you interested in plunging into the data world to experience the methods of transforming distributed data streams into unified, attractive, and engaging insights? Power BI Desktop incorporates Microsoft's established query engine, data modelling, and visualization capabilities and this free online Power BI training will show you exactly how to get the most out of this powerful software. The first part of the course will show you a short overview of the basic BI flow, including information, transformation, and presentation. Then, you will learn how to relate a dataset to Power BI, load data from a data source, process and modify the data with Power Query, and generate your dashboard. The methods of making aggregated reports of numbers using a card visualization, changing the filter context with a slicer, drilling down into your data, and using a Q&amp;A box in your dashboards, are then explained.</p><p>The following section moves on to the features of Microsoft Excel Power Query and how to use them to change your data. You will explore the method for manipulating data and the steps for resolving specifics issues within the query table. The course then describes the concept of M code and numerous Power Query features with their functionality. You will discover how to use the “column from example” feature&nbsp; without writing any code, before learning how to combine data from two tables with differing formatting into a single sheet. This part of this Power BI certification also teaches you how to use the Merge feature in Power Query in creating a relationship between two tables to search data and retrieve matching results.</p><p>The last part of this Power BI tutorial outlines some key points about DAX that will help you understand the concepts and uses of DAX formulas while working on the Power BI Desktop for data analysis. You will discover the technique of creating a calculated column with values from related tables and how to use filter context to focus on the specific value inside a row. In addition to that, the course content will teach you how to create a way of showing multiple things more than once in your measure tools, using the CALCULATE function. Some other key topics in the last section of this in-depth Power BI online training discusses the time-intelligence functions, conditional formatting, and query parameters. Data analysis and data science skills are in-demand across a range of fields because of the advent of Big Data and the modern digital world and enrolling in this comprehensive course will teach you all the expertise and techniques needed to prepare interactive reports with visual statistics.</p><a href=\"https://alison.com/resume/courses/4083\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4083\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Workflow of Power BI","description":"This module gives you the expertise and confidence to use the drag-and-drop functions of Power BI for your projects. You will learn how to connect to hundreds of data sources, create complex relational models using simple and intuitive tools, and create appealing, interactive dashboards, reports, and insightful graphics for data analysis.","topics":["Workflow of Power BI - Learning Outcomes","Introduction to Microsoft Power BI","Dashboard NYC Link Camera","Retail Database Example: Connecting Datasets","A tour of Power BI visuals","More Power BI Visuals","Workflow of Power BI - Lesson Summary"]},{"name":"Module","details":"Using Power Query","description":"This module walks you through the features of Microsoft Excel Power Query and how to use them to change your data. You'll learn how to use Power Query to manipulate data in Excel, as well as how to merge multiple datasets and create a new blank workbook.","topics":["Using Power Query - Learning Outcomes","Introduction to Power Query","Manipulating Data","Tour of Power Query Items","File from Folder","Using Power Query - Lesson Summary"]},{"name":"Module","details":"DAX in Power BI","description":"This module discusses the concept of DAX language that includes DAX measures and parameters. You'll study the ways to create calculated columns and use DAX to design measures. You will discover how context affects DAX measures, and the CALCULATE function can manipulate filters. Query and What If parameters are both described.","topics":["DAX  in Power BI - Learning Outcomes","Introduction to DAX","Calculated Columns and Measures","Time - Intelligence Functions","Parameters in Power BI","DAX  in Power BI - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Analysis with Power BI Desktop - Course Assessment"]}]}