{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3805","title":"Introduction to Features of the Library Module in Adobe Lightroom","totalEnrolled":"523","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the many features and functions of the ‘develop and library’ module in Adobe Lightroom.","description":"The Adobe Creative Suite is one of the world’s most popular software packages for use in the creative industry and Adobe Lightroom is used widely across the photography industry. This free online Adobe Lightroom tutorial focuses on the ‘library and develop’ module and will teach you about exposure, tones, vibrancy, various views such as ‘compare’ and ‘survey’ along with how to create custom smart collections and the collections panel features.","courseOutcomes":["Explain the functions of the compare...","Define a quick collection...","State how to create customized image...","Indicate how to administer collectio...","Explain the functions of the compare and survey view","Define a quick collection","State how to create customized images specific to a collection","Indicate how to administer collections and collection sets","Explain how to sort catalogs using smart collections","Outline how to create custom smart collections","State how to create smart collections with keywords","Outline the functions of smart previews","Discuss the benefits of using smart previews","Explain the features of the quick develop panel","Indicate the functions of the history and collections panel","Discuss the concept of screen modes","Explain the functions of the compare...","Define a quick collection...","State how to create customized image...","Indicate how to administer collectio...","Explain the functions of the compare and survey view","Define a quick collection","State how to create customized images specific to a collection","Indicate how to administer collections and collection sets","Explain how to sort catalogs using smart collections","Outline how to create custom smart collections","State how to create smart collections with keywords","Outline the functions of smart previews","Discuss the benefits of using smart previews","Explain the features of the quick develop panel","Indicate the functions of the history and collections panel","Discuss the concept of screen modes"],"courseDescription":"<p>Adobe Lightroom is a platform that’s very popular in the creative field because of its ease-of-use and many tools available for image editing, processing and sorting. This free online Adobe Lightroom quick tutorial specifically explains how to use the important applications, concepts and features of the ‘library and develop’ modules as well as the survey view. When you have many images to process, sorting and filtering can be a tedious task and there are a few features in Adobe Lightroom that make this quick and easy. You will learn about functions such as tagging, star ratings, quick collections, flags, and labels in order to create smart- and standard collections, and collection sets.&nbsp;</p><p><br>The next section of this Adobe Lightroom course focuses on the library- and attribute filters along with what affects both of these such as the source folder, metadata filters, datasets, watch folder, and destination folder before moving on to actual image editing. White balance, light sources and their respective temperatures are discussed as well as many other image adjustment options. All the tools you will find are shown on different panels within Adobe Lightroom and a lot of time is spent explaining these which include the quick develop-, and history panels along with the various views and screen modes you can have in Adobe Lightroom to be able to work on large, multiple images at a time.&nbsp;&nbsp;&nbsp;</p><p>Adobe Lightroom has revolutionized image editing and sorting. This Introduction to Features of the Library Module in Adobe Lightroom course has been designed to explore some of the lesser-known tools and features so you can get the most out of this versatile software. You should enrol in this free online course if you are in photography as a student or professional, a graphic design professional or photography enthusiast wanting to understand and learn the interesting features of Adobe Lightroom.</p><a href=\"https://alison.com/resume/courses/3805\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3805\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Organizing and Prioritizing Images","description":"To start, this module will introduce you to the definition of a quick collection, as well as how to add images to a quick collection. You will also be introduced to the application of flags, as well as the two types of flags.","topics":["Organizing and Prioritzing Images - Learning Outcomes","Quick Collection","Creating Collections and Collection Sets","Prioritizing Images","Organizing and Prioritizing Images - Lesson Summary"]},{"name":"Module","details":"Exploring the Folders Panel","description":"To start, this module will introduce you to how to sort catalogs using smart collections, as well as create custom smart collections. You will also be introduced to how to filter metadata within images.","topics":["Exploring the Folders Panel - Learning Outcomes","Working with Smart Collections","Exploring the Folders Panel","Exploring Smart Previews","Exploring the Folders Panel - Lesson Summary"]},{"name":"Module","details":"The Develop Module","description":"To start, this module will introduce you to the multiple features and adjustment options in the quick develop panel. You will also be introduced to the functions of the history, as well as collections panel in the develop module.","topics":["The Develop Module - Learning Outcomes","Quick Develop Panel Adjustments","The Develop Module","History and Collections Panel","The Develop Module - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Features of the Library Module in Adobe Lightroom - Course Assessment"]}]}