{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1754","title":"Introduction to Server Administration Services","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the practices and techniques of server administration services, including DNS, NTFS and FTP.","description":"This free online digital security awareness course will equip you with the knowledge and tools needed to protect yourself and your sensitive information from security breaches. This course covers many simple and effective ways to prevent security breaches and protect valuable data. You will study various varieties of security threats, social engineering, identity theft, and data classification. You will also look into malware, piracy, and more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course Introduction to Server Administration Services introduces you to essential services on a network such as a name resolutions. You will learn about directory services and group policies, setting permissions for both files and users and applications such as remote desktop.</p><p>The course begins by introducing you to essential services on a network such as name resolutions like DNS and service that assign IP addresses for you. You will learn about a directory service and what it stores for you. You will learn about the structure of active directory in Microsoft technology.</p><p>Next, you will be introduced to NTFS file systems permissions and how to encrypt files and folders in a Windows system. You will learn about setting share permissions, printing on a network and issues that can arise from network printing. You will also learn about auditing what it is and used for.</p><p>Finally, you will be introduced to Web services and different transfer protocols like FTP. You will learn about security services and protocols like SSL. You will learn about remote desktop server and other variations of it. You will learn about virtual machine technology and what it does.</p><p>This free online Alison course will be of great interest to professionals working in areas such as computer networking, and network administration and who want to further their knowledge of Windows server administration.</p><p>Prerequisites: The learner will need to have completed the Introduction to Windows Server Administration course and the Diploma in Computer Networking course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}