{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3949","title":"Introduction to Basic Styling in Website Development","totalEnrolled":"3,306","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the various features available for building websites from scratch using HTML and CSS.","description":"This web design course introduces you to website development using HTML and CSS. Explore the essential elements of developing a website and the basics of website design. Learn how to build the structure of a website, the cascading style sheet model and how to create components in the navigation bar. By the end of this course, you will become well equipped with the necessary skills required to develop a world-class website.","courseOutcomes":["State the similarities between HTML ...","Explain the introductory aspect of d...","Discuss the role played by CSS in lo...","Discuss how to build the structure o...","State the similarities between HTML and CSS","Explain the introductory aspect of developing a website and the basics of website design","Discuss the role played by CSS in loading websites","Discuss how to build the structure of a website and the cascading style sheet model","Explain how to work through the CSS grid","Discuss how to use custom fonts and how they are critical to giving a nice look","Discuss working with images on HTML","State the similarities between HTML ...","Explain the introductory aspect of d...","Discuss the role played by CSS in lo...","Discuss how to build the structure o...","State the similarities between HTML and CSS","Explain the introductory aspect of developing a website and the basics of website design","Discuss the role played by CSS in loading websites","Discuss how to build the structure of a website and the cascading style sheet model","Explain how to work through the CSS grid","Discuss how to use custom fonts and how they are critical to giving a nice look","Discuss working with images on HTML"],"courseDescription":"<p>Are you intrigued by the idea of building a website? This fascinating course provides all the fundamental skills necessary to create a professional website using HTML and CSS. You will explore HTML5, CSS3, Flexbox, building animations, working with navigations and integrating images directly into a website. We will take you through simple processes employed in building websites and explain how to build the structure of a website and the relevance of the cascading style sheet model in the overall website experience. Do you know that web layout is crucial during the development of a website? We will introduce you to Flexbox and you will learn how to use it with the animation and planning of the layout of a website.</p><p>Then the course describes the various methods used in building components in the navigation bar of a website and ‘padding’ during website development. Discover the importance of design thinking in website development and how to use it to produce a user-oriented website. Next, we will introduce you to the two most important items required when building a website: a browser and a text editor. Do you know that CSS plays a vital role in developing a website? This course goes into further detail by taking you through how CSS influences the structure of a website. Does the name ‘Cascading Style Sheet’ sound a little confusing to you? We will take you through an in-depth analysis of the Cascading Style Sheet (CSS) to help alleviate any confusion. Learn how to embed links in HTML and how they work together with navigation elements. Finally, master the ‘HTML DIV’ tags and the process required for HTML class I.D.s.</p><p>This course will illustrate how to build the navigation bar components. Do you know that ‘padding’ is a fundamental concept in CSS? We will take you through a short guide on using it in CSS. Margins are more or less the foundational aspect of CSS and we will discuss the use of margins in CSS. Did you know that fonts are essential to give your website a nice look and feel? We explain how to integrate custom fonts in CSS and outline refactoring CSS code for more specific selectors in HTML. Study the use of Flexbox inside the CSS grid container before implementing animation in HTML and CSS. Finally, you will learn the details behind CSS’s different navigation bar styles. This course has no technical prerequisite and is perfect for anyone looking to start building a professional website entirely from scratch. The ideal student for this course is dedicated and wants to learn how to build a modern technology website. Start this course today and kickstart your fantastic career in website development.</p><a href=\"https://alison.com/resume/courses/3949\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3949\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to HTML and CSS","description":"This module explains the introductory aspect of developing a website and the basics of website design. The module also discusses how to build the structure of a website and the cascading style sheet model.","topics":["Introduction to HTML and CSS  - Learning Outcomes","Introduction to HTML & CSS","Introduction to CSS Styles","Introduction to Flexbox","Introduction to HTML and CSS - Lesson Summary"]},{"name":"Module","details":"Cascading Style Sheet","description":"This module explains the implementation of animation in HTML and CSS. The module also lists the different methods using in styling the columns in a navigation bar.","topics":["Cascading Style Sheet - Learning Outcomes","Introduction to CSS Grid","Introduction to CSS Animations","Parallax Features in CSS","Cascading Style Sheet - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Basic Styling in Website Development - Course Assessment"]}]}