{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1573","title":"Introduction to iOS app development, Xcode and Interface Builder","totalEnrolled":"2,567","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create adaptive user interfaces for iOS apps using Xcode with this free online app development course.","description":"This free online iOS app development course will teach absolute beginners about iOS app development, creating interfaces, and the Xcode environment. You will learn how to create adaptive, robust user interfaces for iOS applications as well as adaptive interface design through Xcode. You will also study how you can add sound and animations to your application, all through easy to understand, practical, and useful examples.","courseOutcomes":["Describe how to install and setup Xc...","Explain how to use interface builder...","Describe how to connect your code wi...","Explain the use of animation in iOS ...","Describe how to install and setup Xcode development environment","Explain how to use interface builder to design application interfaces","Describe how to connect your code with your interface using IBOutlets","Explain the use of animation in iOS applications","Implement a stack view in iOS applications","Describe how to create adaptive interfaces with autolayout","Explain how to debug errors in code","Explain how to build your first iOS app","Describe how to install and setup Xc...","Explain how to use interface builder...","Describe how to connect your code wi...","Explain the use of animation in iOS ...","Describe how to install and setup Xcode development environment","Explain how to use interface builder to design application interfaces","Describe how to connect your code with your interface using IBOutlets","Explain the use of animation in iOS applications","Implement a stack view in iOS applications","Describe how to create adaptive interfaces with autolayout","Explain how to debug errors in code","Explain how to build your first iOS app"],"courseDescription":"<p>This course demonstrates exactly how to setup and begin developing iOS applications in Xcode. The course provides a foundation to learners beginning iOS and user interface development. Learners will study how to begin creating robust, adaptive interfaces for iOS applications with graphics, sound and animation.</p><p>The course begins by covering how to setup and install Xcode, the iOS development environment, and continues by diving in to topics such as Interface builder, IBOutlets, IBActions, frames, auto layout and creating adaptive designs that work on both iPhone and iPad.</p><p>This course lays a perfect foundation for exploring iOS development in more depth. If you're interested in iOS app development or UI as a potential career, or if you're an IT professional seeking to learn a new skill then this course is an ideal starting point. With this course, the topics are explained clearly and concisely in just 3 hours. Start this course today and learn the valuable skill of iOS application development.</p><a href=\"https://alison.com/resume/courses/1573\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1573\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started With iOS 12","description":"This module covers setting up and installing Xcode, an integrated development environment for building iOS applications. In this module you will learn the about the different versions of Xcode, how to install the Xcode dark theme and the basics of working with sound, UI and Graphics in building your first app.","topics":["Getting Started With iOS 12 - Learning Outcomes","Installing Xcode & understanding Xcode versions","How to get Xcode in dark theme mode","Building your very first iOS app","Building the Hustle App - Graphics, UI, and Sound","Getting Started With iOS 12 - Lesson Summary"]},{"name":"Module","details":"Swoosh App- Intro to Interface Builder & Auto Layout in Xcode 10","description":"This module covers creating the Swoosh app. This topic covers the process of building interfaces for iOS applications. In this module you will learn how to work with interface builder and auto layout. This module introduces concepts such as frames, segues and stack views. In this module you will learn how to work with IBActions and pass data between view controllers.","topics":["Swoosh App- Intro to Interface Builder & Auto Layout - Learning Outcomes","Swoosh - Creating the Welcome Screen","Swoosh - Working with Frames","Swoosh - Intro to auto layout (support multiple screen sizes)","Swoosh - Working with stack views","Swoosh - Intro to segues (changing screens)","Swoosh - Refactoring in Xcode 9","Swoosh - Debugging setValueforUndefinedKey","Swoosh - Programmatic segues","Swoosh - IBActions (handling events) & data models","Swoosh - Passing data between view controllers","Swoosh App- Intro to Interface Builder & Auto Layout - Lesson Summary"]},{"name":"Module","details":"Profile App- Digging Deeper With Auto Layout","description":"This module covers building interfaces in more depth. In this module you will dig deeper with some of the tools and concepts explored in the previous module. This module outlines how to create adaptive designs that can be used on multiple different devices of varying sizes. This module demonstrates working with auto layout to create interface designs for iPhone and iPad.","topics":["Profile App- Digging Deeper With Auto Layout - Learning Outcomes","Dev Profile - Auto layout for iPhones","Dev Profile - Auto layout for iPads (size classes)","Profile App- Digging Deeper With Auto Layout - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to iOS app development, Xcode and Interface Builder Assessment"]}]}