{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1773","title":"Introduction to Programming with Python","totalEnrolled":"31,179","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn Python online with this free course on basic computer programming and boost your career development.","description":"This free online Python programming course will teach programming in Python from the ground up. The course will explain core programming concepts like functions, variables, loops, conditional statements, and algorithms, and will guide you through the creation of basic programs. Python is one of the most versatile and popular programming languages worldwide - go from complete beginner to certified programmer with our free online course.","courseOutcomes":["How to use the PyScripter IDE for th...","How to create a function...","Outline how to implement an If Else ...","How to use variables in For loops an...","How to use the PyScripter IDE for the Python programming language","How to create a function","Outline how to implement an If Else statement","How to use variables in For loops and While loops","Recognize how to use Iterative and recursive programs","Outline how to use algorithms such as the Insertion Sort algorithm","How to use the PyScripter IDE for th...","How to create a function...","Outline how to implement an If Else ...","How to use variables in For loops an...","How to use the PyScripter IDE for the Python programming language","How to create a function","Outline how to implement an If Else statement","How to use variables in For loops and While loops","Recognize how to use Iterative and recursive programs","Outline how to use algorithms such as the Insertion Sort algorithm"],"courseDescription":"<p>Hope to be a computer programmer? On your way already and looking for a boost? As automation takes over jobs that used to require physical labour, computer programming skills are in increasing demand. Starting down this path can be the step that not only ensures long term career in information technology, but that also gives you a valuable and well respected skill for the modern era. No matter what your reasons for being here, this free course can provide you with the tools and direction you need to move forward. Introducing you to the core components of Python, one of the most used programming languages worldwide, the course will show you howto use the free open-source PyScripter IDE to write basic programs using concepts such as functions, variables, If Else statements, For Loops, While Loops, and algorithms such as Insertion Sort. With these tools, and a little motivation, you can unlock the remainder of a long term Alison learning journey towards becoming the certified master programmer you have the potential to be. Along the way, we'll make available the tools and courses you specifically need to learn programming skills of use to any modern company in any country. But first, the basics. So why wait? You've come this far, now keep going. Start and stick with your Alison journey today!</p><a href=\"https://alison.com/resume/courses/1773\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1773\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Programming with Python","description":"In this module learn about the basics of computer programming using the Python programming language. Learn the core concepts of programming languages such as binary numbers, loops, variables and more. Create applications and develop your coding skills.","topics":["Learning Outcomes","Introduction To Programs, Data Types And Variables","Binary Numbers","Python Lists","For Loops in Python","While Loops in Python","Fun with Strings","Lesson Summary"]},{"name":"Module","details":"Factorial Programs and Functions","description":"This module will introduce you to both factorial programs and functions within Python Programming. Learn to write a simple factorial program in Python, learn about recursive functions and backwards compatibility in Python.","topics":["Factorial Programs and Functions - Learning Outcomes","Writing a Simple Factorial Program using Python 2","Stepping through the Factorial Function","Flowchart for the Factorial Program","Python 3 not Backwards Compatible with Python 2","Defining a Factorial Function","Diagramming What Happens with a Function Call","Recursive Factorial Function","Comparing Iterative and Recursive Factorial Functions","Factorial Programs and Functions - Lesson Summary"]},{"name":"Module","details":"Fibonacci Functions","description":"In this module, you will become familiar with Fibonacci Functions through exercises and examples. This module offers an exercise of writing a Fibonacci function. This module then demonstrates creating the an iterative function and a recursive function.","topics":["Fibonacci Functions - Learning Outcomes","Exercise - Write a Fibonacci Function","Iterative Fibonacci Function Example","Stepping through Iterative Fibonacci Function","Recursive Fibonacci Example","Stepping through Recursive Fibonacci Function","Fibonacci Functions - Lesson Summary"]},{"name":"Module","details":"Sort Functions","description":"Upon completion of this module, you will have a better understanding of what a Sort Function is and its role in Python Programming. This topic is an introduction to algorithms in Python and provides learners with a basic understanding of some core programming concepts.","topics":["Sort Functions - Learning Outcomes","Exercise - Write a Sorting Function","Insertion Sort Algorithm","Insertion Sort in Python","Stepping through Insertion Sort Function","Simpler Insertion Sort Function","Sort Functions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Programming with Python - Final Assessment"]}]}