{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3806","title":"Beginner Kotlin for Android","totalEnrolled":"1,705","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers how to program using Kotlin, the installation of Intellij lDEA, JDK and Android Studio.","description":"Introduction to Kotlin for Android is a free online course that explores the features and concepts of Kotlin programming language. It describes the installation process of Android Studio for Mac and Windows along with how to use Kotlin to program applications, its basic programming structures and all the other features such as how to assign variables, classes, data types and set up an emulator among others, to kick off coding with Kotlin.","courseOutcomes":["List some of the features of Android...","Recall how to declare a variable and...","Recall how to download and install t...","List the data types available in Kot...","List some of the features of Android Studio","Recall how to declare a variable and reference element directly in Kotlin","Recall how to download and install the IntelliJ IDEA for Mac and Windows","List the data types available in Kotlin programming language","Define variables and functions","Outline the types of strings in the Kotlin programming language","Describe how to call a function and pass a parameter to a function","Distinguish Kotlin from other programming languages","Recall how to create instances of a class","Describe the process for installing Android Studio","Recall how to install JDK (Java development kit)","Outline the functions of the SDK manager","List some of the features of Android...","Recall how to declare a variable and...","Recall how to download and install t...","List the data types available in Kot...","List some of the features of Android Studio","Recall how to declare a variable and reference element directly in Kotlin","Recall how to download and install the IntelliJ IDEA for Mac and Windows","List the data types available in Kotlin programming language","Define variables and functions","Outline the types of strings in the Kotlin programming language","Describe how to call a function and pass a parameter to a function","Distinguish Kotlin from other programming languages","Recall how to create instances of a class","Describe the process for installing Android Studio","Recall how to install JDK (Java development kit)","Outline the functions of the SDK manager"],"courseDescription":"<p>Kotlin is a statically typed, general-purpose programming language which was developed by JetBrains. Kotlin coding language has a lot of functional programming elements. It ranges from its object-oriented side, to support nominal subtyping with bounded parametric. This free online coding course has been specifically put together to take you through a wide range of concepts and applications of the Kotlin programming language. It starts by giving an overview of Kotlin and outlines some of its features: types of inference, fewer codes, and mixed language databases amongst others. The introduction of the Kotlin language to the programming space plays a key role in solving certain problems faced in other languages - it is relatively simple and carries very few rules compared to Java and other programming languages. Although Kotlin was inspired by Java, it is an improved version. For instance, the null pointer exception (NPE) is one of the main drawbacks of Java but is solved by Kotlin.</p><p>This coding tutorial teaches you a host of practical tips for installing and setting up the Java Development Kit (JDK) and Android Studio for Mac and Windows, the functions of a software development kit (SDK) manager, process of creating an emulator in the Android virtual device (AVD) manager, and how to manipulate controls in the emulator. The next section delves into Android Studio itself and you will learn about its features, how to create an application in Kotlin, the process of creating a new project and customizing your application, and how to run the applications you have created on actual Mac, Linux and Windows devices.</p><p>To create an application you will need to start with creating a project, assigning variables, data types and giving the compiler instructions to be executed. Declaring variables in Kotlin may be easy, but what happens when you want to declare a mutable variable or create variables with different data types? This programming course discusses the concept of mutability, the various data types used in Kotlin as well as how to declare a variable without setting a value to it, and the escape characters that are supported in Kotlin. To successfully design easy-to-read code with Kotlin, you will need detailed knowledge of how Kotlin language functions including the appropriate use of strings, conditional logic, how to handle multiple conditionals, the concept of classes, instances of a class, lambda expression and function interpolation. Enrolling in this Kotlin for Android course will teach you all of this and more, whether you are a beginner to coding or are a seasoned programming professional and are keen to gain experience in the Kotlin language and create functional programs and applications.</p><a href=\"https://alison.com/resume/courses/3806\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3806\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Install JDK and Android Studio for Mac/ Windows","description":"In this module, you will be introduced to Kotlin programming language. This module gives an overview of Kotlin and outlines some of its features. It analyzes the set- up process of JDK and android studios for mac and windows. Also, it illustrates how to to create and run a simple application on your device.","topics":["Install JDK and Android Studio for Mac/ Windows - Learning Outcomes","Introduction to Kotlin and Android","Install JDK and Android Studio","DinnerDecider","Run on a Real Device","Install JDK and Android Studio for Mac/ Windows - Lesson Summary"]},{"name":"Module","details":"Kotlin Foundation","description":"In this module, you will be introduced to the basics of Kotlin programming language using the IntellijIDEA. It analyzes the two main types of strings and useful methods that can be used with strings. This module also describes function interpolation, loops and nullability. It illustrates classes, instances of a class and inheritance in Kotlin.","topics":["Kotlin Foundation - Learning Outcomes","Installing IntellijlDEA","Variables and Strings with Kotlin","Functions and Conditional Logic","Classes and Inheritance","Kotlin Foundation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Kotlin for Android - Course Assessment"]}]}