{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4374","title":"Introduction to Graph Theory","totalEnrolled":"348","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Do you have a problem to solve? Learn to use a graph to find optimal solutions, with this free online maths course.","description":"This free online certificate course will introduce you to graph theory. The world is full of diverse problems, some of which are mathematical, scientific, business or even domestic in nature. The best way out of these problems is to get optimal solutions. This course has been designed to take you on a step-by-step journey into the world of graphs (using computer science) and to help you solve some everyday problems using graph theory.","courseOutcomes":["List and explain the types of graphs...","Outline some common problems in grap...","Discuss the features of the Breadth-...","Describe the different types of tree...","List and explain the types of graphs and identify the key differences between them","Outline some common problems in graph theory, citing the solution algorithms for each","Discuss the features of the Breadth-First Search (BFS) algorithm","Describe the different types of trees","Outline the steps involved in the Bellman-Ford (BF) algorithm","Explain the process of rebuilding the level graph and finding the blocking flow when using Dinic's algorithm","List and explain the types of graphs...","Outline some common problems in grap...","Discuss the features of the Breadth-...","Describe the different types of tree...","List and explain the types of graphs and identify the key differences between them","Outline some common problems in graph theory, citing the solution algorithms for each","Discuss the features of the Breadth-First Search (BFS) algorithm","Describe the different types of trees","Outline the steps involved in the Bellman-Ford (BF) algorithm","Explain the process of rebuilding the level graph and finding the blocking flow when using Dinic's algorithm"],"courseDescription":"<p>A graph is one simple way to visualise a problem, including the possible solutions. It can help you get the best solution to that problem staring at you in the face - with minimal effort! This course begins by introducing you to the meaning of graphs. How many types of graphs are there? What are the differences between them? The first module helps you answer these questions and sets the pace for this course. Going further, you will learn about ‘trees’, including isomorphic trees and lowest common ancestors (LCA). As you move on, you will learn about topological sorting, Dijkstra's Shortest Path and the Bellman-Ford and Floyd Warshall algorithms.</p><p>This course examines graphs from the viewpoint of computer science and will be reviewing a couple of network flow topics such as the Ford Fulkerson algorithm for max flow, bipartite matching and capacity scaling. This course is video-based and is not just for professionals who are already knowledgeable about coding. It simplifies graphs from the computer science perspective and presents graph theory in the simplest language possible. Sign up today and start learning.</p><a href=\"https://alison.com/resume/courses/4374\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4374\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Graph Theory","description":"This module will introduce you to graph theory. A simple answer to the question: What is a graph? will be provided. The module goes further to explain the four types of graphs and their differences.","topics":["Introduction to Graph Theory - Learning Outcomes","Introduction to Graph Theory","First Search Algorithms","Introduction to Graph Theory - Lesson Summary"]},{"name":"Module","details":"Understanding Trees","description":"In this module, you will learn about the meaning of trees from the computer science perspective. You will also learn about isomorphism in trees as well as how to find the Lowest Common Ancestor (LCA) of trees.","topics":["Understanding Trees - Learning Outcomes","Introduction to Tree Algorithms","Isomorphic Trees","Lowest Common Ancestor (LCA)","Understanding Trees - Lesson Summary"]},{"name":"Module","details":"Algorithms in Graph Theory","description":"In this module, we will be taking a look at some of the algorithms that can be used to solve the common problems in graph theory. We will examine Topological Sort, Bellman Ford and Floyd Warshall, Tarjan's Strongly Connected Component amongst others.","topics":["Algorithms in Graph Theory - Learning Outcomes","Topological Sort","Dijkstra's Shortest Path","Bellman Ford and Floyd Warshall","Tarjan's Strongly Connected Component","Algorithms in Graph Theory - Lesson Summary"]},{"name":"Module","details":"Travelling Salesman Problem","description":"In this module, you will learn what the Travelling Salesman Problem (TSP) is and the several algorithms that can be used to tackle this problem. The module discusses the Brute Force solution and the Dynamic Programming solution's approach to solving the (TSP).","topics":["Travelling Salesman Problem - Learning Outcomes","The Travelling Salesman Problem","Eulerian Paths and Circuits","Prim's Minimum Spanning Tree Algorithm","Travelling Salesman Problem - Lesson Summary"]},{"name":"Module","details":"Network Flow","description":"In this module, we will be looking at Network Flows. This module will cover important algorithms under network flow such as Max Flow Ford Fulkerson, Bipartite Matching, Edmonds Karp Algorithm, Capacity Scaling and Dinic's Algorithm.","topics":["Network Flow - Learning Outcomes","Max Flow Ford Fulkerson","Bipartite Matching","Edmonds Karp Algorithm","Capacity Scaling","Dinic's Algorithm","Network Flow - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Graph Theory - Course Assessment"]}]}