{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5101","title":"Introduction to Perl Programming","totalEnrolled":"381","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches the basics of Perl programming language with the aid of hands-on sample projects.","description":"Whether your interest is in GUI development, web applications, system administration or even networking, Perl programming language is equally effective in developing all. Initially used to analyze data or text, it has now found its purpose in developing various user interface applications. This course helps you explore the language intricacies and grasp Perl programming through a hands-on practical approach.","courseOutcomes":["Describe Perl language and discuss i...","List all the features and concepts o...","Outline the steps to create a Perl a...","Outline different data types in Perl...","Describe Perl language and discuss its uses and utilization","List all the features and concepts of the Perl language","Outline the steps to create a Perl application","Outline different data types in Perl and explain how to work with them","Recognize and define all the tools and functions in Perl","Explain how to use Perl tools, data, and functions for developing an application in Perl","Describe how to create automated applications with Perl","Explain how to build advanced text analyzer applications with Perl","Describe your skills with Perl language when applying for a developer or programmer job or project","Describe Perl language and discuss i...","List all the features and concepts o...","Outline the steps to create a Perl a...","Outline different data types in Perl...","Describe Perl language and discuss its uses and utilization","List all the features and concepts of the Perl language","Outline the steps to create a Perl application","Outline different data types in Perl and explain how to work with them","Recognize and define all the tools and functions in Perl","Explain how to use Perl tools, data, and functions for developing an application in Perl","Describe how to create automated applications with Perl","Explain how to build advanced text analyzer applications with Perl","Describe your skills with Perl language when applying for a developer or programmer job or project"],"courseDescription":"<p>Perl is a popular language amongst developers around the globe. A cross-platform language, its simplicity and versatility have generated the interest of all those who are either working or want to work with text manipulation, system administration, web development, network programming, GUI development or other related areas. Completing this course will be a great starting point for gaining fluency in the coding universe of Perl. You will become versed in the fundamentals and concepts of Perl and build your own Perl application or project.</p><p>This self-paced course helps you master the fundamentals, features and concepts to play around with Perl and build and design Perl applications. Each section and lecture comes bundled with sample projects that help you practice and reinforce the expertise you gain. In addition, there is a specially created project with all the source codes to help you utilize what you learn and further review your competence. The codes are also available for download from the resource section to help you practice and perfect your Perl fundamentals.</p><p>This course is an excellent start for those who are new to Perl or have an interest in development but still consider themselves a beginner. As it covers all the latest features of the Perl language, it also matches the needs of those familiar with Perl but who want to review their knowledge. The specifically designed crash course helps you apply your skills to different jobs and projects at the start. The learning will help you add expertise to your portfolio and raise your professional stakes. Join now and be a sought-after Perl developer.</p><a href=\"https://alison.com/resume/courses/5101\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5101\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Programming using Perl","description":"Get introduced to Perl and begin your learning path by first learning to install and set up a Perl environment and then creating a basic Perl program to get a feel of the language. You will then learn to work with various data types, arrays, and lists in Perl through specific sample projects.","topics":["Introduction to Programming using Perl – Learning Outcomes","Installing and Creating a Perl Program","Working with Scalar Data and Loops in Perl","Working with Arrays and Lists","Introduction to Programming using Perl - Lesson Summary"]},{"name":"Module","details":"Subroutines, Input and Output in Perl","description":"This module further raises your skills with Perl by teaching you major Perl elements like subroutines, input and out operators, and hashes. Learn to create and declare subroutines and then get hand walked to work around with Perl input and out operator. You then get familiar with Hashes and how to access and work with them in a Perl program.","topics":["Subroutines, Input and Output in Perl - Learning Outcomes","Working with Subroutines","Perl Input and Output","Working with Hashes in Perl","Subroutines, Input and Output in Perl - Lesson Summary"]},{"name":"Module","details":"Regular Expressions in Perl","description":"This module covers working with regular expressions and their various elements in Perl applications. Get familiar with all the options for defining or matching the pattern or search and replace operations in texts with this function. Then get hand-walked through a demonstrated final project using and applying the skills learned through the course.","topics":["Regular Expressions in Perl– Learning Outcomes","Working with Regular Expressions","Additional Regular Expressions","Course Final Project","Regular Expressions in Perl - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Perl Programming - Course Assessment"]}]}