{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1227","title":"Introduction to C++ Programming Language","totalEnrolled":"54,267","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn all about C++ programming concepts and principles, as well as how to use them.","description":"This free online C++ course can will introduce you to programming with C++, teaching you how C++ is written and why you might choose to use it. C++ is an incredibly useful tool which can be used to control a much wider range of applications compared to other programming languages. This course will teach you about how C++ combines both procedural and object-oriented elements in simple and clear language that'll get you started right away.","courseOutcomes":["Describe the three-step process code...","Discuss variable types in C++ and ho...","Explain why C++ is a strongly typed ...","Discuss the flow of control in a pro...","Describe the three-step process code goes through when it is being compiled.","Discuss variable types in C++ and how to convert them into different types.","Explain why C++ is a strongly typed programming language.","Discuss the flow of control in a program and the precedence of operators in C++.","Describe what functions are and how they work.","Explain the usefulness of creating a header file and an object file to hold functions and objects.","Describe the C++ standard library and how to include in your programs.","Explain different ways to call the C++ standard library member functions. Identify what an object is.","Explain how a class can help create complex objects.","Discuss the process of encapsulation within your program.","Describe the three-step process code...","Discuss variable types in C++ and ho...","Explain why C++ is a strongly typed ...","Discuss the flow of control in a pro...","Describe the three-step process code goes through when it is being compiled.","Discuss variable types in C++ and how to convert them into different types.","Explain why C++ is a strongly typed programming language.","Discuss the flow of control in a program and the precedence of operators in C++.","Describe what functions are and how they work.","Explain the usefulness of creating a header file and an object file to hold functions and objects.","Describe the C++ standard library and how to include in your programs.","Explain different ways to call the C++ standard library member functions. Identify what an object is.","Explain how a class can help create complex objects.","Discuss the process of encapsulation within your program."],"courseDescription":"<p>In the free online Introduction to C++ Programming course you will be introduced to programming principles in C++, and learn about some of its operators and functions and how to create objects and classes in C++. The course begins by introducing you to the history of C++. You will learn about the compilation process of a C++ program, about variables in C++, how they are strongly typed and what that means. Next, the course teaches you about the fundamentals operations of C++. You will learn about loops and the switch statement, and about operators in C++. You will also learn about functions, commenting, creating header files, and about using const to make sure variables don’t change their values. Finally, you will be introduced to what a object is and how classes help you in creating objects. You will learn about initialization, encapsulation and constructors. You will also learn about making const objects and problems that can occur with creating const objects. This free Alison course will be of great interest to programmers or developers who would like to learn more about the C++ programming language. Prerequisites: The learner will need to have a good understanding of programming concepts and know at least one other programming language.</p><a href=\"https://alison.com/resume/courses/1227\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1227\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Module 1 Getting Started with C++ Programming","description":"In this module you will be introduced to C++. You will learn about the compilation process of a C++ program. You will learn about a brief history of C++. You will learn about variables in C++ and how they are strongly typed and what that means.","topics":["Module 1 Learning Outcomes","Introduction","How to Write, Build and Run Code","Quick History of C++","Variable Types","Casting","Module 1 Lesson Summary"]},{"name":"Module","details":"Module 2 C++ Programming Principles","description":"In this module you will be introduced to fundamentals of C++. You will learn about loops and the switch statement. You will learn about operators in C++ and how they are more less the same as other programming languages. You will learn about functions, commenting and creating header files. You will learn about using const to make sure variable don’t change values and any time.","topics":["Module 2 Learning Outcomes","Flow of Control","Operators","Const","Module 2 Lesson Summary"]},{"name":"Module","details":"Module 3 The C++ Object Model","description":"In this module you will be introduced to objects and classes in C++. You will learn about what a object is and how classes help you in creating objects. You will learn about what initialization is. You will learn about encapsulation and constructors. You will learn about making const objects and problems that can occur with creating const objects.","topics":["Module 3 Learning Outcomes","Objects and Classes","Initialization","Encapsulation","Const Objects","Module 3 Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to C++ Programming Assessment"]}]}