{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3063","title":"Introduction to Python Tools","totalEnrolled":"5,955","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the various Python Programming Tools, APIs, XML and JSON Structure in this free online course.","description":"Python is a popular programming language with a simple syntax and a powerful set of libraries. This free online course discusses the various Python Programming Tools and Modules and Packages in detail, as well as Metaprogramming and JavaScript Object Notation (JSON). Discover how to interact with third-party APIs in an application, understand APIs, its importance, and how it can provide you with increased functionality in your program.","courseOutcomes":["Describe and understand what Iterato...","Describe and understand API Integrat...","Identify popular Python Packages...","Analyze Third-Party APIs in any Appl...","Describe and understand what Iterators and Generators are","Describe and understand API Integrations","Identify popular Python Packages","Analyze Third-Party APIs in any Application","Identify how to leverage Decorators for Metaprogramming implementations","Identify Monkey Patching and how it works","Describe and understand what Iterato...","Describe and understand API Integrat...","Identify popular Python Packages...","Analyze Third-Party APIs in any Appl...","Describe and understand what Iterators and Generators are","Describe and understand API Integrations","Identify popular Python Packages","Analyze Third-Party APIs in any Application","Identify how to leverage Decorators for Metaprogramming implementations","Identify Monkey Patching and how it works"],"courseDescription":"<p>This free online course on Python Tools explains Python as a language with a simple syntax, and a powerful set of libraries. Python is a general-purpose, versatile, and powerful programming language. It’s a great programming language because it’s concise and easy to read and everything from web development to machine learning and data science can be done with Python. If you have basic knowledge of Python, this Python course is a great next step because it discusses the Python Programming Tools, explains the Modules and Packages, Metaprogramming, and JavaScript Object Notation (JSON). You will understand the major Python Tools used for preparing the data for analysis, the tools available for understanding the data, using the data for insights and predictions. The content critically explains APIs, their importance, and how it can provide you with increased functionality in your program.&nbsp;</p><p>You will be introduced to core programming concepts like data structures, conditionals, loops, variables, and functions. It also provides you with coding exercises/assessments where you will learn to design and write fully-functional Python programs using commonly used data structures, custom functions, and reading/writing to files. The content discusses the basics of Python 3, including conditional execution and iteration as control structures, and strings and lists as data structures. You will learn what iterators and generators are, discuss the regular expressions in Python 3, identify the concept of introspection and lambda functions.</p><p>Python has worldwide popularity for very good reason - it is quick and stable enough for a vast amount of uses and this Introduction to Python Tools course is for anyone who perhaps needs a refresher on Python tools or if you may have had some exposure to Python programming but want to learn some more detailed skills.</p><a href=\"https://alison.com/resume/courses/3063\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3063\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Programming Tools","description":"In this module, you will be taken through what Iterators and Generators are. You will learn the Concept of Introspection and Lambda Functions, and analyze the various Python Concepts. Also, you will learn about Metaclasses and Decorators.","topics":["Programming Tools - Learning Outcomes","Iterators and Generators","Regular Expressions","Introspection and Lambda Functions","Metaclasses and Decorators","Programming Tools - Lesson Summary","Programming Tools Assessment"]},{"name":"Module","details":"Modules and Packages","description":"In this module, you will be taken through Modules and Packages, knowing how to Leverage Third-Party Modules and Packages in Applications. Additionally, you will be taken through working with APIs, understanding API Integrations and the common ways APIs are used.","topics":["Modules and Packages - Learning Outcomes","Modules and Packages","Working with APIs","Modules and Packages - Lesson Summary","Modules and Packages Assessment"]},{"name":"Module","details":"Metaprogramming and JSON","description":"In this module, you will be taken through Implementing Algorithms, the Concept of Metaprogramming and Python 3 Implementations, Decorators and Monkey Patching, understanding how they work. You will also learn the overall structure of XML and JSON feeds, how to generate data in XML and JSON formats. Lastly, how to parse the types of data protocols in a Python program.","topics":["Metaprogramming and JSON - Learning Outcomes","Implementing Algorithms","Metaprogramming Primer","Decorators and Monkey Patching","XML and JSON Structure","Generating XML and JSON","Parsing XML and JSON","Metaprogramming and JSON - Lesson Summary","Metaprogramming and JSON Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Python Tools - End of Course assessment"]}]}