{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2585","title":"Introduction to Microsoft Outlook 2019","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about Microsoft Outlook 2019 and features available that will improve your efficiency in this free online course.","description":"This free online course will bring you up to speed with the features available that will improve your efficiency when working with Microsoft Outlook. You will gain an understanding of how to manage your email and utilize its features ranging from the calendar, contact manager, journal, and to-do list. You will also be able to learn more about how every part of Outlook integrates together seamlessly to maximize productivity and efficiency.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will begin by introducing you to Microsoft Outlook 2019, which is a simple application for receiving and sending emails. Outlook is a personal information manager from Microsoft that allows you to send and receive emails. Improvements are made subsequently to make your life simpler, and also easier for you to keep track of your emails. You will learn about the features available that will improve your efficiency when working with Outlook. You will gain an understanding of how to manage your email and utilize its features ranging from the calendar, contact manager, journal, and to-do list.&nbsp;</p><p>Next, you will be familiar with how every part of Outlook integrates together seamlessly to maximize productivity and efficiency. You will then improve your knowledge on how Outlook can be used for personal emails and how you can set up a free account on Outlook.com. This will then enable you to have a grasp of the storage features, as free Outlook accounts get 15gb of storage space, whereas office 365 users of Outlook get 50gb of storage space.</p><p>Lastly, you will compare the differences between Outlook 2016 and 2019 versions. You will also be knowledgeable about how to ignore conversations that involve too many people, where the conversations are no longer relevant to you, by using the ‘ignore’ feature in Outlook. You will also be brought up to speed with how to reverse this action when you change your mind about your earlier decision by using the ‘stop ignoring’ feature. You will further be familiarized with the delete, archive, and restoring mail features. This will help you to delete emails you no longer want, hide emails that you do not want to see, and then restore mails you have once deleted respectively.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}