{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5203","title":"Introduction to EOS Blockchain Platform","totalEnrolled":"128","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the EOS blockchain platform and its distinguishing features in this free online app development course.","description":"EOS is one of the most popular blockchain platforms. Its core features offer user- and business-friendly app development tools while addressing the challenges of other blockchain platforms like Bitcoin and Ethereum. It is worth exploring the EOS blockchain structure and technology to keep up with the current developments in cryptocurrency. This course offers a complete knowledge of EOS and explains its defining features and success elements.","courseOutcomes":["Distinguish between Bitcoin/Ethereum...","Describe the current state of blockc...","Identify the requirements for blockc...","Discuss the type of data used by blo...","Distinguish between Bitcoin/Ethereum and EOS","Describe the current state of blockchain technology and explain how it works","Identify the requirements for blockchain applications","Discuss the type of data used by blockchain and describe how data is secured","Compare the various use cases for blockchain technology","Outline the economics of blockchain and recall the economic properties that make Bitcoin valuable","Define ‘smart contracts’ and describe how they work","Analyse EOS accounts and actions management","Discuss the deterministic parallel execution of applications","Recognise the structure of EOS blocks","Identify the ‘read-only’ action handlers and atomic transactions","Explain how the token is used to incent and power the network","Define ‘EOS governance’ and state how smart contracts are executed","Analyse EOS capacity for side/child chains","Outline how to set up the EOS development environment","Distinguish between Bitcoin/Ethereum...","Describe the current state of blockc...","Identify the requirements for blockc...","Discuss the type of data used by blo...","Distinguish between Bitcoin/Ethereum and EOS","Describe the current state of blockchain technology and explain how it works","Identify the requirements for blockchain applications","Discuss the type of data used by blockchain and describe how data is secured","Compare the various use cases for blockchain technology","Outline the economics of blockchain and recall the economic properties that make Bitcoin valuable","Define ‘smart contracts’ and describe how they work","Analyse EOS accounts and actions management","Discuss the deterministic parallel execution of applications","Recognise the structure of EOS blocks","Identify the ‘read-only’ action handlers and atomic transactions","Explain how the token is used to incent and power the network","Define ‘EOS governance’ and state how smart contracts are executed","Analyse EOS capacity for side/child chains","Outline how to set up the EOS development environment"],"courseDescription":"<p>The era of smart contracts and cryptocurrency transactions is here to stay. Bitcoin was one of the first cryptocurrency platforms to be developed but several better platforms have since appeared. EOS Blockchain is one of the most refined blockchain technologies that specialises in smart contracts and cryptocurrency transactions. This course covers the fundamental concepts of EOS Blockchain’s technology so you can quickly begin creating your own smart contracts and cryptocurrencies using its features to create distributed blockchain-enabled applications. The first module begins with an overview of the course structure. We then proceed to address the concepts crucial to EOS Blockchain, which was developed to address the shortcomings of other blockchain networks. To gain widespread use, applications on the blockchain require a platform that is flexible enough to meet several requirements, which we discuss. The course then outlines the basics of blockchain, security and crypto-economics.</p><p>What do ‘accounts’ and ‘wallets’ mean in the context of EOS? The EOS ‘wallet’ may be viewed as a repository for the public-private key pairs needed to sign blockchain transactions in the EOS system. Unlike other cryptocurrencies, EOS has a distinct structure for accounts. Depending on the account, some operations may be handled on a ‘pass/fail’ basis without altering the internal state of the account. We examine ‘read-only’ action handlers, atomic transactions, the EOS testnet and the EOS toolset.</p><p>Over time, EOS apps have distinguished themselves as the quicker, cheaper and safer alternatives to conventional blockchain apps. According to the current trends, EOS has emerged as a real champion of blockchain technology and can offer enormous benefits for a variety of business demands in the future. This course provides the training you need to create your own cryptocurrency with the EOS Blockchain platform. This course has no prerequisites and suits both novice and veteran users of blockchain technology. Sign up to improve your cryptocurrency and app development skills with EOS Blockchain.</p><a href=\"https://alison.com/resume/courses/5203\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5203\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of EOS Blockchain","description":"This module will teach the features of EOS, the current blockchain landscape, the ideas that shape EOS solutions, the proof paradigm, and the EOS mining protocol. Other topics include the concepts of EOS, how EOS works, detailed security approaches and implementations, crypto-economics, and EOS usability which includes accounts and actions.","topics":["EOS Features and Implementations - Learning Outcomes","Introduction to EOS Platform","Blockchain Basics","Accounts and Actions","EOS Features and Implementations - Lesson Summary"]},{"name":"Module","details":"Elements of EOS and EOS Token Model","description":"We will discuss in this module, the deterministic parallel execution of apps, the structure of EOS blocks, read-only action handlers and atomic transactions, deferred transactions, and context-free actions. We will also learn about the EOS token model and EOS toolset that we will use to set up the EOS development environment and much more.","topics":["Deterministic Parallel Execution of Apps - Learning Outcomes","Elements of EOS","EOS Token Model","EOS Toolset and Smart Contracts","Deterministic Parallel Execution of Apps - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to EOS Blockchain Platform - Course Assessment"]}]}