{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2479","title":"Introduction to QuickBooks Online","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to set up and use Intuit QuickBooks Online to handle business transactions with this free online course.","description":"This training course guides you step-by-step through the process of using Intuit QuickBooks Online accounting software to meet your business needs. We show you how to create and customize company files and manage users and customers. We cover how to handle sales transactions and manage your products and services while you generate reports with QuickBooks. Sign up to quickly polish your accounting software skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course lays out everything you need to know to make full use of Intuit’s Quickbooks Online cloud accounting software. We teach you the fundamental concepts of accounting and how they apply in handling your business transactions and preparing reports with QuickBooks Online. We begin with an overview of the software that shows you how to select the right subscription plan for your business.</p><p>The course then breaks down how to create and customize company files on QuickBooks and how to use the program’s unique user interface. We demonstrate how to upload QuickBooks desktop files to its Online version and manage users as an administrator. We then study the scope of the ‘chart of accounts’ on QuickBooks and explain how to handle customers and ‘sub-customers’ on the program’s customer list by adding, editing, importing and making them inactive. We also discuss how to record sales transactions, receive payments and issue credit memos, refunds and statements to customers. The course wraps up by training you to handle products and services on QuickBooks Online while you generate reports related to customers, sales, products and services.</p><p>This course covers the basic and advanced features of QuickBooks Online accounting software to meet your business needs. It is of interest to aspiring accountants, managers and business owners and offers you a valuable new skill that can boost your career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}