{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1658","title":"Introduction to Data Science","totalEnrolled":"65,614","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to extract information from data using data science methods, with this introduction to data science course.","description":"This free online Introduction to Data Science course from Alison will teach you the basics of data science. You will look into data science processes, receive an introduction to machine learning, and learn about data models for structuring data. You will also be shown how to gain knowledge and insights from data that is both structured and unstructured as well as learn to use scientific methods, processes, algorithms, and data science systems.","courseOutcomes":["Describe what data science is used f...","List the stages in the data science ...","Explain what machine learning is and...","Discuss the use of regression and th...","Describe what data science is used for","List the stages in the data science process","Explain what machine learning is and the parts that make it up","Discuss the use of regression and the different types of regression","Identify the different types of classification algorithms available for you to use","Describe how the two most popular clustering algorithms work","Discuss why you would use Azure ML for your data science projects","Describe what data science is used f...","List the stages in the data science ...","Explain what machine learning is and...","Discuss the use of regression and th...","Describe what data science is used for","List the stages in the data science process","Explain what machine learning is and the parts that make it up","Discuss the use of regression and the different types of regression","Identify the different types of classification algorithms available for you to use","Describe how the two most popular clustering algorithms work","Discuss why you would use Azure ML for your data science projects"],"courseDescription":"<p>With this online course Introduction to Data Science you will be introduced to the field of data science and the methodologies used in the data science process. You will also learn about machine learning and some of its algorithms.</p><p>The course starts off with introducing you to data science, where you will learn that data science is an interdisciplinary field that uses scientific processes and systems to extract knowledge or insights from data in its various forms.</p><p>After which, you will be introduced to some of the main algorithms that are used in machine learning. You will learn about regression and classification, and about two commonly used clustering algorithms. You will also be introduced to Azure Machine Learning(ML) Studio and why you would use Azure ML Studio for your data science projects.</p><p>This free Alison course will be of great interest to learners who would like to learn more about data science, big data and analytics.</p><p>Prerequisites: To complete this course you will need a basic knowledge of mathematics, including linear algebra. Additionally, some programming experience, ideally in either R or Python, is assumed.</p><a href=\"https://alison.com/resume/courses/1658\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1658\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Overview of Data Science","description":"In this module you will be introduced to data science. You will learn what data science is and how it’s an evolving subject. You will learn about the stages in the data science process.","topics":["Overview of Data Science Learning Outcomes","What is data Science","The Data Science Process","Introduction to machine Learning","Overview of Data Science Lesson Summary"]},{"name":"Module","details":"Overview of Machine Learning","description":"In this module you will be introduced to machine learning. You will learn about regression for predicting real valued outcomes, you learn about classification in detail. You will learn two clustering algorithms commonly used. You will learn about using Azure Machine Learning (ML) Studio and why you would use Azure ML Studio for your data science projects.","topics":["Overview of Machine Learning - Learning Outcomes","Regression","Classification","Clustering","Recommendation","Introduction to Data Science Technologies","Overview of Machine Learning Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Data Science - Course Assessment"]}]}