{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2486","title":"Introduction to Microsoft Word 2019/365","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use MS Word 2019, create documents, format characters, and execute commands in this free online course.","description":"This free online Introduction to Microsoft Word 2019 course provides an easy-to-understand and detailed guide to maximizing the potential of this word processing application. Learn how to use Microsoft Word 2019, work with a vast array of tools on your document and format characters and paragraphs like a pro. These skills are highly valuable and marketable in today's market, so start this course and improve your career skills today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Microsoft Word remains one of the most popular business tools and rightly so. Businesses around the world continue to rely on Word as their go-to for word processing, yet Microsoft Word training often takes a back seat. Free online Introduction to Microsoft Word 2019 course provides an extensive and simple guide to effectively and efficiently using the application. You will begin the course with a quick overview of the various elements on the MS Word 2019 screen and the options in the backstage view.</p><p>Next, you will study how to execute basic commands on MS Word 2019 and how to work with non-printing characters and line spacing options on your document. You will also learn how to use various tools to navigate your document on MS Word 2019. Then, you will analyze an array of character formatting options in Word 2019 and how to use the Cut, Copy, and Paste commands. You will also study the AutoCorrect options and the format painter. Finally, you will take a look at the paragraph formatting options and the line spacing options. You will also learn how to work with indents and tabs on your document.</p><p>This free online course will teach you how to maximize the full potential of the word processing application from Microsoft so that you can work like a pro on your documents. This course will be of interest to students, business developers, employees, and anyone with an interest in using the word processing application. Get started on this course today and improve your MS Office skills today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}