{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5003","title":"Introduction to Python Libraries: SciPy and NumPy","totalEnrolled":"177","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you to use the Python libraries SciPy and NumPy for scientific computing.","description":"NumPy and SciPy are important Python libraries that perform various functions and processes. NumPy refers to ‘numerical Python’, while SciPy refers to ‘scientific Python’. These Python libraries are employed to carry out various data operations. This course will enable you to learn scientific Python in a very accessible and practical way. Register for this course to discover how to design and carry out complex computing functions immediately.","courseOutcomes":["Explain the role of Python libraries...","Outline the benefits of Python libra...","Recognise when to choose one Python ...","List the steps involved in installin...","Explain the role of Python libraries SciPy and NumPy","Outline the benefits of Python libraries SciPy and NumPy","Recognise when to choose one Python library over the other","List the steps involved in installing SciPy and NumPy","Describe the reasons to use SciPy to perform complex functions, integrals, statistics and linear algebra","Identify the ways to use NumPy for calculating Eigenvalues, determinants and covariance","Explain the role of Python libraries...","Outline the benefits of Python libra...","Recognise when to choose one Python ...","List the steps involved in installin...","Explain the role of Python libraries SciPy and NumPy","Outline the benefits of Python libraries SciPy and NumPy","Recognise when to choose one Python library over the other","List the steps involved in installing SciPy and NumPy","Describe the reasons to use SciPy to perform complex functions, integrals, statistics and linear algebra","Identify the ways to use NumPy for calculating Eigenvalues, determinants and covariance"],"courseDescription":"<p>Understanding computational computing can be challenging. It is not easy to perform numerous mathematical functions in code. This course will walk you through several examples using Python's SciPy module to demonstrate how to design and execute complicated computing functions. It starts with an introduction to SciPy. Then you will discover how to install it. It will continue with elementary mathematical calculations and progress to more complex computations.</p><p>The subsequent lessons exhibit SciPy's full capabilities. You will discover how to execute rigorous, sophisticated computations without causing the program to bog down. The following section will teach you how and when to use NumPy's features for matrix computation. You will explore a few instances of matrix computing to demonstrate how NumPy may be beneficial in different situations.</p><p>Through challenging exercises, you will learn where NumPy excels and gain knowledge of the contexts in which it is most valuable. As you will see, Python has a few computing libraries available. It is critical to understand when to favour one over the other. This course is for you if you want to learn how to code even the most challenging mathematical functions. Sign up to put everything you have learned into action.</p><a href=\"https://alison.com/resume/courses/5003\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5003\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Python SciPy and NumPy","description":"This module will teach you about the Python libraries SciPy and NumPy. You will explore the benefits of both SciPy and NumPy, as well as how and when to utilise them.","topics":["Python SciPy and NumPy - Learning Outcomes","Python SciPy","Introduction to Python NumPy","Python NumPy","Python SciPy and NumPy - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Python Libraries: SciPy and NumPy - Course Assessment"]}]}