{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4308","title":"Introduction to JavaScript DOM Page Elements","totalEnrolled":"624","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will arm you with the skills needed to create page elements on webpages using JavaScript DOM.","description":"This course on JavaScript DOM Page Elements will equip you with the basic knowledge needed to modify elements on webpages with DOM using JavaScript. It teaches you how DOM relates to JavaScript code, methods of selecting elements and how to add and remove objects using append and prepend. In addition, this course will teach you about event listeners and their types and how to add animation frames to the page.","courseOutcomes":["Define DOM and state how it helps th...","Explain the functions of the query s...","Discuss how to select and update the...","Distinguish between append and prepe...","Define DOM and state how it helps the HTML interface.","Explain the functions of the query selector.","Discuss how to select and update the text content of an element.","Distinguish between append and prepend.","Recall how to create elements using the create element method","Recall how to create a list item for an unauthored list.","Distinguish between the properties of the child node and the children.","Discuss how to update related elements to the selected one.","Identify the functions of an event listener.","Explain the procedures to add and remove an event listener.","List and distinguish between the types of mouse movements.","Define DOM and state how it helps th...","Explain the functions of the query s...","Discuss how to select and update the...","Distinguish between append and prepe...","Define DOM and state how it helps the HTML interface.","Explain the functions of the query selector.","Discuss how to select and update the text content of an element.","Distinguish between append and prepend.","Recall how to create elements using the create element method","Recall how to create a list item for an unauthored list.","Distinguish between the properties of the child node and the children.","Discuss how to update related elements to the selected one.","Identify the functions of an event listener.","Explain the procedures to add and remove an event listener.","List and distinguish between the types of mouse movements."],"courseDescription":"<p>This course explores the basic knowledge and techniques required to create and update page elements using JavaScript DOM. It begins with an introduction to DOM. Here, you will learn the functions of DOM and how it helps improve a webpages' functionality, including connecting web pages to scripts or programming languages by representing the structure of a document. Then, you will learn how to use the Google Chrome dev tool to debug and test your HTML and JavaScript codes on windows and Mac OS. We demonstrate the various methods of selecting and updating page elements, including the query selector. Learn how to update all matching page elements using the JavaScript QuerrySelectorAll and return multiple elements into a node list, update the count of and the text content of an element.</p><p>In this course, you will learn how to select an element and update the style values, set the attributes of the page element and then update the HTML and add it to the page elements with the innerHTML property value. For example, update the colour and background colour of the selected element and apply various styling values to the style attribute with JavaScript. Next, you will learn class list methods to toggle an existing class, add, remove and check if the class exists on an element that returns a Boolean value. Then you will discover the Append, Prepend, AppendChild to parent Element methods of adding page elements to the page. Finally, we show how to navigate the DOM tree by selecting a starting element and moving to its related elements with JavaScript Code.</p><p>DOM is an abbreviation for document object model. It is a programming interface for web documents. DOM represents the document as nodes and objects, enabling programming languages such as JavaScript and HTML to interact and modify the page elements or contents. By taking this course on Alison.com, you will learn how to create and modify page elements and add event listeners for mouse and keyboard events. Why are you waiting? Take this free online course today and earn a new skill.</p><a href=\"https://alison.com/resume/courses/4308\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4308\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Adding HTML Code","description":"In this module, you will be shown how to connect the HTML contents back into a JavaScript object and also how to select page elements using query selector. You will learn how to update the text contents of an element, and apply styling, you will also learn how to update the attributes of elements, and create elements using the create element method","topics":["Introduction and Adding HTML Code - Learning Outcomes","Introduction and Setting Up","Adding Class Attributes and HTML Code","Introduction and Adding HTML Code - Lesson Summary"]},{"name":"Module","details":"JavaScript Event Listeners, Keyboard Events and Animation","description":"In this module, you will be introduced to event listeners, you will learn how to add mouse events and also the types of mouse movement which included mouse out and mouseover. You will also learn about keyboard events and how the keyboard arrow keys can be used to interact with the DOM contents and also how to add animated frames to the page.","topics":["JavaScript Event Listeners and Animation - Learning Outcome","JavaScript DOM Event Listeners","Keyboard Events and Animation Frames","JavaScript Event Listeners and Animation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to JavaScript DOM Page Elements - Course assessment"]}]}