{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1863","title":"Introduction to Administering Office 365 for Small Business","totalEnrolled":"9,781","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the features, requirements, and administration of Office 365 for small businesses and IT professionals.","description":"This free online Office 365 for small business course teaches you about administering Office 365 in a small business environment. This course will teach you how to manage and add users to Office 365 and use DirSync to make your administration duties easier and safer. It will also teach you about the two-main type of identity within Office 365, the requirements for running the Office suite, and what it can provide for your small business.","courseOutcomes":["Describe what Office 365 can do for ...","List the features and requirements o...","Describe what a Microsoft partner is...","Explain how to add or change a domai...","Describe what Office 365 can do for your business","List the features and requirements of Office 365","Describe what a Microsoft partner is","Explain how to add or change a domain in Office 365","Discuss different administration roles available in Office 365","Explain the process of adding and managing users in both the office 365 GUI and in PowerShell","Discuss the different types of identities in the office 365 environment","Describe what DirSync requires to run in your system","Distinguish the difference between Single Sign-On and Same Sign-On","Describe what Office 365 can do for ...","List the features and requirements o...","Describe what a Microsoft partner is...","Explain how to add or change a domai...","Describe what Office 365 can do for your business","List the features and requirements of Office 365","Describe what a Microsoft partner is","Explain how to add or change a domain in Office 365","Discuss different administration roles available in Office 365","Explain the process of adding and managing users in both the office 365 GUI and in PowerShell","Discuss the different types of identities in the office 365 environment","Describe what DirSync requires to run in your system","Distinguish the difference between Single Sign-On and Same Sign-On"],"courseDescription":"<p>This course begins with a detailed discussion of what Office 365 is and what it can do for your business. You will learn that Office 365 is a line of subscription services that provides plans including access to Microsoft Office applications plus other productivity services that are enabled over the Internet. You will study the features and requirements of Office 365, learn what a Microsoft partner is, and look into the PowerShell capabilities for Office 365 Administration.</p><p>You will then learn that to add or change a domain in office 365, you have to log on to your account on Office 365 admin centre and navigate to the Domains section in the admin portal. You will look into the different administration roles available in office 365, the process of adding a managing user in both the office 365 GUI and in PowerShell, the three option for adding/managing users in Office 365, and more.</p><p>Office 365 is designed to help you pursue your passion and grow your business using integrated apps and services. Upon the completion of this course, you will gain better insight into the features, requirements, and administration roles available in Office 365, the different types of identities in the office 365 environment among others. Sign up for this course and start learning more about administering Office 365 to conduct business processes more efficiently and effectively.</p><a href=\"https://alison.com/resume/courses/1863\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1863\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Office 365 Overview & Infrastructure","description":"In this module you will be introduced to Office 365, you will learn what Office 365 is and provides to you. You will learn about the features Office 365 can provide your business. You will learn about the requirements for running and using Office 365. You will learn about PowerShell what it is and how it can be used for administrating Office 365. You will learn what a Microsoft partner is and how to become one.","topics":["Office 365 Overview & Infrastructure Learning Outcomes","Office 365 Introduction","Service Overview and Offering","Features and Requirements","Portals, Powershell and Partner Opportunities","Office 365 Overview & Infrastructure Lesson Summary"]},{"name":"Module","details":"Office 365 User Management","description":"In this module you will be introduced to user management in Office 365. You will learn about adding a new domain to office 365 and how to add a user to that domain. You will learn about identities, namely the two-main type of identities cloud and federated. You will learn about adding and managing users, with the office 365 admin centre and PowerShell. You will learn about the different administration roles that can be assigned in Office 365.","topics":["Office 365 User Management Learning Outcomes","Adding a New Domain to Office 365","Understanding Identities","Adding and Managing Users and Groups","Administration Roles Overview","Office 365 User Management Lesson Summary"]},{"name":"Module","details":"Office 365 DirSync, Single Sign-On, & Same Sign-On","description":"In this module you will be introduced to DirSync. You will learn more about identities in office 365. You will learn about what DirSync is and how it works. You will learn about requirements need to use and run DirSync. You will learn about using Windows server 2012 R2 for same-sign on and you will learn about using single sign-on.","topics":["Office 365 DirSync, Single Sign-On, & Same Sign-On Learning Outcomes","Reviewing Identities","Understanding DirSync","DirSync Requirements","Server2012 R2 & Single sign-on","Office 365 DirSync, Single Sign-On, & Same Sign-On Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Administering Office 365 for Small Business - Course Assessment"]}]}