{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2590","title":"Introduction to Software Project Management","totalEnrolled":"10,133","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course on software project management, project life cycle models, AGILE models and SCRUM frameworks.","description":"This free online course on software project management provides an in-depth guide on how individuals and organizations can manage software projects. Learn about different types of software projects and activities involved in software project management. You will learn about life cycle models, as well as the different techniques of AGILE models and SCRUM frameworks. Start this course today and improve your knowledge of software project management.","courseOutcomes":["Define software project management...","Outline the symptoms of software cri...","Analyze the key factors that contrib...","Describe the two types of software p...","Define software project management","Outline the symptoms of software crisis","Analyze the key factors that contribute to the software crisis","Describe the two types of software projects","Analyze the responsibilities of a project manager","Outline the commonly used life cycle models","Describe the activities carried out during the feasibility study for a project.","Outline the strengths and weaknesses of the V Model","Define software project management...","Outline the symptoms of software cri...","Analyze the key factors that contrib...","Describe the two types of software p...","Define software project management","Outline the symptoms of software crisis","Analyze the key factors that contribute to the software crisis","Describe the two types of software projects","Analyze the responsibilities of a project manager","Outline the commonly used life cycle models","Describe the activities carried out during the feasibility study for a project.","Outline the strengths and weaknesses of the V Model"],"courseDescription":"<p>This free online course on Introduction to Software Project Management will begin by introducing you to the concept and characteristics of software management. You will learn about the software crisis and the factors that are key contributors to software crisis such as; poor project management, lack of adequate training in software engineering and low productivity improvements. You will also learn about the different types of software projects as well as the activities involved in software project management.</p><p>This course will then teach you about the two main types of project management standards; “off-the-shelf” and “in-house”. You will learn about software life cycle models from the conceptualization of the project to the retirement of the project. You will also learn life cycle models include; the waterfall, V model, evolutionary, prototyping, and the spiral models, as well as the major difficulties of waterfall-based models.</p><p>Lastly, this course will introduce you to the evolutionary model with iterations and AGILE models. You will learn about the advantages and disadvantages of the evolutionary model. This course will present you with the different techniques of AGILE models, as well as the principle technique which involves user stories, metaphors, spike, and refactor. Learn about the important principles of the AGILE model and the requirement for documentation, as well as the concept of SCRUM frameworks. Start this course today and improve your knowledge of software project management.</p><a href=\"https://alison.com/resume/courses/2590\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2590\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Software Project Management","description":"In this module, you will be introduced to the concept of software management. You will learn about the different types of software projects as well as the activities involved in software project management. You will also learn about project management standards.","topics":["Introduction to Software Project Management - Learning Outcomes","Introduction to Software Management","Types of Software Projects","Activities in Software Project Management","Project Management Standards","Introduction to Software Project Management - Lesson Summary"]},{"name":"Module","details":"Life Cycle Models","description":"In this module, you will be introduced to the concept of life cycle models, as well as the life cycle models in project management and study some examples of the model. You will gain more insight into the waterfall-based models as well as the evolutionary and AGILE models. You will also be introduced to the different techniques of AGILE models and SCRUM frameworks.","topics":["Life Cycle Models - Learning Outcomes","Life Cycle Models in Project Management","Examples of Life Cycle Models","Waterfall-Based Models","Evolutionary and AGILE Models","Techniques of AGILE Models","SCRUM Frameworks","Life Cycle Models - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Software Project Management - Course Assessment"]}]}