{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1234","title":"Introduction to Management: Analysis & Strategies","totalEnrolled":"8,417","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become a better manager by studying key analysis tools and strategies to define business goals and find opportunities.","description":"On your way to becoming a sought-after manager, you will study the principles of management, a range of modern management strategies, and useful tools for internal analysis and planning. Leading an organization on its road to success is not an easy task. Start this free online course today and gain the skills and knowledge that you'll need throughout your career.","courseOutcomes":["Describe who managers are and about ...","Explain why you should care about le...","Describe the dimensions of the plann...","Discuss how economic performance fee...","Describe who managers are and about the nature of their work","Explain why you should care about leadership, entrepreneurship and strategy","Describe the dimensions of the planning-organizing-leading-controlling (P-O-L-C) framework","Discuss how economic performance feeds social and environmental performance","Describe what performance means at individual and group levels","Create your survivor’s guide to learning and developing principles of management","Describe who managers are and about ...","Explain why you should care about le...","Describe the dimensions of the plann...","Discuss how economic performance fee...","Describe who managers are and about the nature of their work","Explain why you should care about leadership, entrepreneurship and strategy","Describe the dimensions of the planning-organizing-leading-controlling (P-O-L-C) framework","Discuss how economic performance feeds social and environmental performance","Describe what performance means at individual and group levels","Create your survivor’s guide to learning and developing principles of management"],"courseDescription":"<p>This free online course introduces you to SWOT analysis, a strategic planning technique that will help you identify your organization's strengths, weaknesses, opportunities and threats in relation to business competition or project planning. You will also cover the VRIO framework (value, rarity, imitability and organization) which is useful in analyzing your firm’s internal resources and capabilities to find out if they can be a source of sustained competitive advantage.</p><p>Next, you will study PESTEL analysis, which is a framework that you can use to analyse and monitor the political, economic, social, technological, environmental and legal factors that have an impact on your organisation. Then analyze important kinds of strategies such as differentiation, focus strategy and customer intimacy strategy. You will also cover management by objectives and group goals as well as financial and non-financial controls.</p><p>Learning about the different types of managers and management strategies will help you better execute your role in your company. By applying the analytical and strategic management methods taught in this online course, you will develop your team, output, and professional skills, all of which are excellent opportunities for growth and promotion. So, have a look at the course today and start learning some great management theories and tactics in just a few hours.</p><a href=\"https://alison.com/resume/courses/1234\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1234\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Analysis","description":"In this module you will be introduced to analysis strategies for management. You will learn about different tools that can be used when analyzing a management strategy, as well methods of internal analysis. In particular, you will be introduced to the meanings of the acronyms SWOT and VIRO, who are stakeholders, and what are core competencies.","topics":["Module 1: Learning Outcomes","Introducing Analysis","Analysis Tools","Internal Analysis","Module 1: Lesson Summary"]},{"name":"Module","details":"External and Social Analysis","description":"In this module you will continue to learn how to analyse a management strategy. In particular, this module will focus on external, network, and social needs analyses. You will learn the meaning of the acronym PESTEL, the difference between upstream and downstream markets, the meaning of industry, and the top three ethical concerns of social network analysis.","topics":["Module 2: Learning Outcomes","External Analysis","Network Analysis","Social Needs Analysis","Module 2: Lesson Summary"]},{"name":"Module","details":"Developing a Strategy","description":"In this module you will be introduced to the different kinds of managers, the meaning of strategy, and about strategic management. Furthermore, you will learn about different kinds of strategy such as differentiation, focus strategy, or customer intimacy strategy.","topics":["Module 3: Learning Outcomes","Strategy and Vision","Developing a Strategy","Choosing a Strategy","Module 3: Lesson Summary"]},{"name":"Module","details":"Internal Factors","description":"In this module you will be introduced to management by objectives (or MBO). You will learn about different internal factors to consider when creating a management strategy, particularly how to use the balanced scorecard to group goals, objectives, and metrics in different areas of an organization such as finances. You will also learn about organizational control, corrective action, and operational controls.","topics":["Module 4: Learning Outcomes","Goals and Objectives","Controls","Non-Financial Controls","Module 4: Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Management: Analysis and Strategies - Final Assessment"]}]}