{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3639","title":"Beginner vSphere Data Protection and Managing Firewalls","totalEnrolled":"258","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the different storage APIs in vSphere and ESXi active directory authentication.","description":"This free online course on vSphere Data Protection and Managing Firewalls teaches you about the features of the three types of virtual switches in vSphere 5.x. You will learn about the steps to set up multipathing in iSCSI storage, and study physical NIC commands, the architecture of fibre channels and the two forms of storage capabilities. We'll also cover the new vSphere 5 HA features, as well as VSAN configuration. Upskill yourself now!","courseOutcomes":["Explain the features of the three ty...","State how physical NIC commands are ...","Describe the features of the differe...","List the new vSphere 5 HA features...","Explain the features of the three types of virtual switches in vSphere 5.x","State how physical NIC commands are created","Describe the features of the different storage APIs in vSphere","List the new vSphere 5 HA features","Identify the functions, new features and components of vSphere Storage Appliance (VSA)","Describe how to configure a virtual flash host swap and read cache","Explain the Virtual SAN cluster configuration","Outline how to configure ESXi firewall via vSphere web client","Explain the features of the three ty...","State how physical NIC commands are ...","Describe the features of the differe...","List the new vSphere 5 HA features...","Explain the features of the three types of virtual switches in vSphere 5.x","State how physical NIC commands are created","Describe the features of the different storage APIs in vSphere","List the new vSphere 5 HA features","Identify the functions, new features and components of vSphere Storage Appliance (VSA)","Describe how to configure a virtual flash host swap and read cache","Explain the Virtual SAN cluster configuration","Outline how to configure ESXi firewall via vSphere web client"],"courseDescription":"<p>Introduction to vSphere data protection and managing firewalls is a free online course that has been specifically designed to introduce you to vSphere's multiple applications. The course highlights the three virtual switch types in version 5.x. You will learn about Cisco Discovery protocol and how to manage its capabilities. We will introduce you to the features and functions of vSphere Distributed Virtual Switches (VDS). And did you know that VDS has newer features in version 5.1? Get ready to learn about these technologies and the steps involved in creating VDS. The networking CLI commands and modified vSwitch properties are also key concepts to understand in this course. We will also extensively cover the different storage APIs in vSphere. You will expand your knowledge on multipathing with iSCSI software and learn the two ways to discover iSCSI targets and how to configure jumbo frames.&nbsp;</p><p>This course will explain the architecture of fibre channels and how to scan fibre channel LUNs. You will also learn about the functions of Virtual Machine File System (VMFS-5), as well as new updates in version 5.5. It is possible to upgrade an existing volume from VMFS-3 to VMFS-5. However, you will need to learn about the advantages and disadvantages of the process. We will also highlight the relationship between the Network Attached Storage (NAS) and ESXi. Are you aware that storage capabilities are of two types? Get ready to learn about their functions and differences. We will show you how to indicate the relevance of vSphere's Storage API for Storage Awareness (VASA). Datastore clusters are required parts of Storage DRS (SDRS). You will learn about how they work with SDRS. We will also highlight the features, as well as installation steps for vSphere Data Protection version 5.5.5.</p><p>Furthermore, we will provide you with an overview of vSphere Replication (VR) version 5.5. You will be familiar with the architecture, functions, along with the recovery process of VMware's Site Recovery Manager (SRM) version 5.5. The Fault Domain Manager (FDM) is an essential component that makes up High Availability (HA). For better understanding, you must learn about the functions and new features of HA in Vsphere 5. We'll take you through the configuration steps of a virtual flash resource and explain the functions of vSphere Storage Appliance (VSA). At the end of this course, you will also gain knowledge on managing ESXi firewalls and VSAN cluster configuration. If you're a student, researcher or have an interest in understanding vSphere data protection and managing firewalls, this course is for you. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3639\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3639\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Virtual Switches and Storage Concepts","description":"This module will introduce you to the new features and functions of vSphere Distributed Switch (vDS) in version 5.0, as well as 5.1. You will also be introduced to the properties and architecture of fibre channels","topics":["Virtual Switches and Storage Concepts - Learning Outcomes","vSphere Distributed Switch (vDS)","Storage Concepts","Network Attached and Profile Driven Storage","Virtual Switches and Storage Concepts - Lesson Summary","Virtual Switches and Storage Concepts - Assessment"]},{"name":"Module","details":"Virtual SAN and Security Enhancements","description":"In this module, you will be introduced to the features and installation steps of vSphere Data Protection (VDP) 5.5. You will also be introduced to steps on configuring a virtual flash host swap, as well as read cache.","topics":["Virtual SAN and Security Enhancements - Learning Outcomes","vSphere Data Protection and Replication","Virtual Flash and Virtual SAN","Security Enhancements","Virtual SAN and Security Enhancements - Lesson Summary","Virtual SAN and Security Enhancements - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["vSphere Data Protection and Managing Firewalls - Course Assessment"]}]}