{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3325","title":"Introduction to Embedded Systems Design","totalEnrolled":"2,086","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain insight into the design of embedded systems and the MSP430 microcontroller in this free online course.","description":"This free online course introduces you to embedded systems design. You will learn how these devices work, the processes involved in developing them, and the differences between embedded systems and general-purpose computer systems. You will also study the features and physical interfacing of the MSP430 microcontroller. This course is specifically designed for those interested in developing projects using embedded systems.","courseOutcomes":["Distinguish between embedded systems...","Explain the implementation of the em...","Outline the six-box model for embedd...","Select a suitable embedded controlle...","Distinguish between embedded systems and general-purpose computer systems","Explain the implementation of the embedded system design","Outline the six-box model for embedded system design","Select a suitable embedded controller for your personal project","Describe the features of MSP430 microcontrollers","Identify the registers of the CPU of the MSP430 microcontroller","Discuss the download mechanisms of the MSP430 microcontroller","Distinguish between the input and output devices of embedded systems","Distinguish between embedded systems...","Explain the implementation of the em...","Outline the six-box model for embedd...","Select a suitable embedded controlle...","Distinguish between embedded systems and general-purpose computer systems","Explain the implementation of the embedded system design","Outline the six-box model for embedded system design","Select a suitable embedded controller for your personal project","Describe the features of MSP430 microcontrollers","Identify the registers of the CPU of the MSP430 microcontroller","Discuss the download mechanisms of the MSP430 microcontroller","Distinguish between the input and output devices of embedded systems"],"courseDescription":"<p>An embedded system is a computer system containing the computer processor, memory, and input and output peripheral devices. In this course, you will be introduced to the development and design of embedded systems. You will examine the various applications and implementation of embedded systems as well as the contrasts between embedded computers and general-purpose computer systems. There are many ways of installing an embedded computer and one of the popular methods is using a microcontroller, which is a complete computer on a single chip. You will learn the classification of a microcontroller, how to choose the right device for your project, as well as its various features and functionalities. The ecosystem that a microcontroller requires and how to select a suitable embedded controller according to packaging will also be taught. Thereafter, you will study the properties, sources and classification of clock and reset subsystems. The program download capacity of the microcontroller ecosystem, the design of the power supply, and the required power supply for the microcontroller will be highlighted.</p><p>Next, you will be introduced to the features and working principles of the MSP430 microcontroller. The MSP430 is a mixed-signal entry-level microcontroller from Texas Instruments and is one of the oldest offerings as far as microcontrollers are concerned. The type of processer and series, as well as the important features and architecture of the MSP430G2x52, will also be examined. You will learn how to operate an MSP430 circuit with the help of a lemon battery, which is made out of lemons and two electrodes made out of copper and zinc. The MSP430 series memory architecture and map with a focus on the G2553 microcontroller will be highlighted. The 16 registers of the CPU of MSP430 with emphasis on four special purpose registers, namely program counter, stack pointer, status register and constant generator, will be analyzed. You will also consider the flash memory of the MSP430 microcontroller, the types, structure and the RAM. The various ways of programming the MSP430 and how to write programs and download them on the memory of the evaluation kit of the MSP430 LunchBox will be highlighted. The Code Composer Studio integrated development environment and the MSP430 download mechanisms will be analyzed.</p><p>Finally, you will be taken through the input and output devices of the MSP430. You will study the various ways in which a user can interact or provide input to the microcontroller. The various input and output devices of the MSP430 microcontroller will be outlined. You will also consider the types of switches and how to connect a switch to a microcontroller. Then, you will be introduced to the methods of connecting LEDs to a microcontroller. The RGB LED and the 7-segment displays of the LED as well as how to increase the currents of the LED will be explained. Also, you will learn how to operate a transistor in a switch-mode and how to ensure that the LED current remains constant in a battery with voltages going down. Thereafter, you will be taught how to use a microcontroller to connect to a multiplex display (4-digit 7-segment display) using PNP transistors. The features of the IC ULN2803 transistor as well as the low and high side LED drivers will be highlighted. The methods of controlling a large amount of current through LEDs and controlling relays using low- and high-side switches will be discussed. At the end of this course, you can expect to be able to design simple embedded systems from scratch. This online course is unique and has a hands-on approach for learning to operate significant hardware components in an embedded system. So, why wait? Start this course today.</p><a href=\"https://alison.com/resume/courses/3325\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3325\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Embedded Systems Design","description":"In this module, you will be introduced to the course objectives as well as its prerequisites. The modular approach to designing embedded systems will also be presented as well as the features of modern microcontrollers and the microcontroller classifications.","topics":["Embedded Systems Design - Learning Outcomes","Embedded Systems Design - Introduction","Embedded System Design with Project Demos","Modular Approach to ESD","The Six-Box Model for ESD","Salient Features of Modern Microcontrollers","Functions on Microcontroller Pins","Embedded Systems Design - Lesson Summary"]},{"name":"Module","details":"Microcontroller Ecosystem","description":"In this module, you will learn about the properties of the ecosystem that a microcontroller requires to function independently. The various elements and peripheral features of a microcontroller will be discussed and you will be introduced to the power supply building block which considers one of the six-block models from a comprehensive point of view in terms of the subsystem's requirements other than the microcontrollers.","topics":["Microcontroller Ecosystem - Learning Outcomes","Elements of Microcontroller Ecosystem","Embedded Microcontroller Selection","Power Supply for Embedded Systems","Power Supply Topologies","Microcontroller Ecosystem - Lesson Summary"]},{"name":"Module","details":"First Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 1-2 of the course.","topics":["First Assessment"]},{"name":"Module","details":"Introduction to the MSP430 Architecture","description":"In this module, you will be introduced to the working principles of the MSP430 microcontroller. The architecture of this device as well as its features will be explained. The MSP430 Lunchbox will be introduced and you will also study the functionalities of the MSP430G2x52. Lastly, you will learn how to program the CPU of the MSP430 device.","topics":["Learning Outcomes - Introduction to the MSP430 Architecture","Introduction To MSP430","MSP430 Architecture","MSP430 Architecture Roundup and Introduction to Lunchbox","Programming Methods for MSP430","Lesson Summary - Introduction to the MSP430 Architecture"]},{"name":"Module","details":"Physical Interfacing of Embedded Systems","description":"In this module, you will be introduced to the input and output devices of the MSP430 microcontroller. You will see how switches are connected to the device as well as the procedures involved in handling a large number of switches. You will also study the voltage drops across the seven LED colours, and the value of components and controls of a DC motor.","topics":["Learning Outcomes - Physical Interfacing of Embedded Systems","Physical Interfacing - 1","Physical Interfacing - 2","Physical Interfacing - 3","Physical Interfacing - 4","Physical Interfacing - 5","Physical Interfacing - 6","Lesson Summary - Physical Interfacing of Embedded Systems"]},{"name":"Module","details":"Second Assessment","description":"This assessment enables you to review your learning so you can determine your knowledge and understanding of modules 3-4 of the course.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Introduction to Embedded Systems Design"]}]}