{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3625","title":"Beginner VMware vSphere 5.5 - Virtualization Technologies","totalEnrolled":"805","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the skills to upgrade from VMware 4.x/5.x to VMware's vSphere 5.5 product in this free online course.","description":"VMware vSphere is formerly known as VMware Infrastructure and is the brand name for VMware's suite of server virtualization products that includes the ESXi Hypervisor and vCenter management software. There have been many versions of vSphere including changes to the ESXi Shell and the application program interface and this free online course takes you through this version of the platform along with more on virtual machines and virtualization.","courseOutcomes":["Identify vCloud suite 5.5 add-ons...","Discuss the various reasons for virt...","Define virtual infrastructure and vi...","Describe the local configuration pro...","Identify vCloud suite 5.5 add-ons","Discuss the various reasons for virtualization","Define virtual infrastructure and virtual machine","Describe the local configuration process of the ESXi 5.5 using the DCUI (direct console user interface)","Label the vSphere 5.x auto-deploy architecture","List the factors that affect the design and configuration of a vSphere environment","Explain the series of products available for managing VMWare infrastructure","Describe the direct console user interface (DCUI)","State the limitations between the two versions of vSphere's vCenter server","Identify the two versions of vSphere essentials 5.5 for small businesses","Define a virtual machine port group","Identify the five functions of the VMkernel port","Identify vCloud suite 5.5 add-ons...","Discuss the various reasons for virt...","Define virtual infrastructure and vi...","Describe the local configuration pro...","Identify vCloud suite 5.5 add-ons","Discuss the various reasons for virtualization","Define virtual infrastructure and virtual machine","Describe the local configuration process of the ESXi 5.5 using the DCUI (direct console user interface)","Label the vSphere 5.x auto-deploy architecture","List the factors that affect the design and configuration of a vSphere environment","Explain the series of products available for managing VMWare infrastructure","Describe the direct console user interface (DCUI)","State the limitations between the two versions of vSphere's vCenter server","Identify the two versions of vSphere essentials 5.5 for small businesses","Define a virtual machine port group","Identify the five functions of the VMkernel port"],"courseDescription":"<p>VMware vSphere is the primary server virtualization platform with continual management for virtual data centers. Formerly known as VMware Infrastructure 4, VMware vSphere is VMware's cloud computing operating system which consists of ESXi, a Type 1 hypervisor, and other important features to ensure that the virtual servers are running perfectly. Additionally, it serves as a platform for managing and implementing virtual machine (VM) infrastructure and is extremely useful as a large number of modern businesses nowadays depend on virtualization to help them scale up and cut hardware costs. In this course, you will be taken through the features of VMware as a virtualization platform where you will learn about resource manipulation, automated administration using PowerCLI, and VM creation.</p><p>This VMWare course will teach you the various components of VMware virtualization, how they work and how VM is the base unit of VMware virtualization as well as the command-line interface (CLI) for virtual machine management and how to configure virtual machine settings using the vSphere Client. The next section of content covers how to use other programs and the vSphere Web Services software development kit to configure VMs, how to create vSphere distributed switches and vSphere standard switches, and to configure networking for VMware vSphere. Some other key themes include vSphere Networking, how to use standard switches for providing network connectivity to hosts and VMs and how you can create network devices (abstracted) called vSphere standard switches.</p><p>Virtualization software allows you to run programs and deploy apps with two or more operating systems using an abstraction layer, gives a more structured utilization of computer hardware, and allows public and private cloud providers to serve even more users. Virtualization products are now an important part of many organizations and in this free online course, we detail the features of vSphere that make virtualization a practical, cost-efficient technology, and you can learn the skills required to administer VMs through vSphere 5.5 by enrolling in this free online course.</p><a href=\"https://alison.com/resume/courses/3625\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3625\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Virtualization Overview","description":"This module gives an overview of VM training physical setup and network IP setup. It outlines the lab terms used in VM training. It analyzes VMware virtualization and system centre virtual machine manager 2012 R2. Also, this module compares type 1 and type 2 hypervisors.","topics":["Virtualization Overview - Learning Outcomes","Introduction and Methodology","VMware Virtualization","Other VMware & 3rd Party Virtualization Technologies","Virtualization Overview - Lesson Summary","Virtualization Overview - Assessment"]},{"name":"Module","details":"Planning and Installing ESXi","description":"This module demonstrates the installation process of the ESXi 5.5. It analyzes troubleshooting of hostd and ESXI CIM management agents. Also, this module explores the core management tools called CIM embedded in the hypervisor and illustrates how to boot ESXi from a SAN LUN.","topics":["Planning and Installing ESXi - Learning Outcomes","Planning the ESXi Deployment","vSphere 5.x Deployment Guidelines","vSphere Hypervisor (ESXi) Installation","Configuring Hostname Resolution and NTP","Troubleshooting ESXi","Planning and Installing ESXi - Lesson Summary","Planning and Installing ESXi - Assessment"]},{"name":"Module","details":"Management Tools Overview","description":"This module demonstrates the different third-party tools available to VMware’s product. It analyzes the series of products available for managing VMware infrastructure and compares some Windows commands to Linux commands. Also, this module explores how to troubleshoot the vSphere client or the VIC.","topics":["Management Tools Overview - Learning Outcomes","Third-Party Tools for Management - Overview","Management Tools for EXSi","Linux Command Review","Troubleshooting vSphere/VIC","Management Tools Overview - Lesson Summary","Management Tools Overview - Assessment"]},{"name":"Module","details":"vCenter Server","description":"This module explores the vCenter server and its limitations. It analyzes vSphere, its versions and three licensing types. Also, this module analyzes the vCenter mobile access (vCMA) which is called a fling, created by VMware labs and how to troubleshoot the vCenter server in the database.","topics":["vCenter Server - Learning Outcomes","Licensing Model","Installation of vCenter Server","vSphere Web Client","vCenter Server Inventory","Managing vCenter Server","Planning vCenter Server Deployment","Troubleshooting the vCenter Server","vCenter Server - Lesson Summary","vCenter Server - Assessment"]},{"name":"Module","details":"Networking Terms","description":"This module explores the different networking concepts as well as how to create and modify virtual networks. It analyzes how to create and manage virtual networking. Also, this module analyzes the private VLAN support and takes you through how to edit the dvSwitch port.","topics":["Networking Terms - Learning Outcomes","Creating and Modifying Virtual Networks","vSphere Distributed Switches","Creating and Modifying Networking","Networking Terms - Lesson Summary","Networking Terms - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to VMware vSphere 5.5: Virtualization Technologies - Course Assessment"]}]}