{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3069","title":"Introduction to Alteryx","totalEnrolled":"1,712","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about data science using Alteryx and how to build Alteryx workflows in this free online course.","description":"This free online course will teach you about various tools and functionalities in Alteryx and how to create ETL (Extract, Transform and Load) Processes. You will learn how to develop repeatable Alteryx workflows and the concept of data parsing and data parsing techniques. Learn how to create reports in Alteryx that run on demand and how to use the predictive tools in Alteryx to perform data analysis with this free online Alteryx course.","courseOutcomes":["Explain the use of Alteryx workflows...","Discuss visual workflows in Alteryx...","Identify how to filter data in Alter...","Recall the function of the dynamic r...","Explain the use of Alteryx workflows to cut out repetitive tasks","Discuss visual workflows in Alteryx","Identify how to filter data in Alteryx","Recall the function of the dynamic rename datasets","Describe how to parse data in Alteryx","Discuss how to create reports in Alteryx that run on demand","Explain the use of Alteryx workflows...","Discuss visual workflows in Alteryx...","Identify how to filter data in Alter...","Recall the function of the dynamic r...","Explain the use of Alteryx workflows to cut out repetitive tasks","Discuss visual workflows in Alteryx","Identify how to filter data in Alteryx","Recall the function of the dynamic rename datasets","Describe how to parse data in Alteryx","Discuss how to create reports in Alteryx that run on demand"],"courseDescription":"<p>The growth in technology in today’s world and the impact of data science reaches far beyond the business sector and is helping to solve some of mankind's most pressing issues. Fortunately there are a growing number of tools to help make sense of the volume of raw data now available and Alteryx is one of those tools. In this free online course, you will be introduced to Alteryx and taught how to automate data processes with the power of Alteryx. A workflow consists of connected tools that perform different functions to process data and you will be shown what the Alteryx workflow canvas is used for and be introduced to different parts of the interface design of the Alteryx overview window. You will be exposed to tools such as Spatial Mapping, Join, Union, Tile, Filter, Select, Sample, Parsing and Maps, to name a few. This course goes on to teach you how to configure these tools and understand the concept of workflow and how you can save and share your workflow. How data comes into Alteryx, how data types can be changed and best practices of working with data is then covered.</p><p>The next part of this Introduction to Alteryx free online course teaches you how to automate processes, design robust optimization algorithms as well as combine several inputs to draw insights from data. There may be the need to combine data into one singular graph so that you can consume the data sets easily rather than adding multiple visuals from diverse sources into one report. So how do you bring this data together for analysis? How do you compare values across different sources? Based on these questions, you will be introduced to the concept of data blend and preparation. You will learn how to quickly filter data to isolate rows that fit a given criteria and you will be shown how to remove data that is not needed. How Microsoft Excel complements Alteryx and useful corresponding Excel-Alteryx terminology is then explained. You will also be taught how to leverage pre-existing SQL queries, how to translate common SQL keywords to their corresponding Alteryx tool and Alteryx basic functions. Data being fit-for-purpose depends on the structure it’s found in and often, the structure itself may not be suitable for the needs of the data. Alternatively, the structure of the data may be sound, but the use of it is insufficiently controlled or subject to error. To solve the problem of keeping data fit-for-purpose, we need to know what it means to parse data and this function along with data parsing techniques using the Alteryx parse tool palette is comprehensively covered. The dynamic rename tool has two inputs: left and right and your studies include analyzing what they mean and how the tool can be used to parse text files. Some key themes then covered are a VLOOKUP demonstration, how to work on multiple fields and cleaning up messy input data.</p><p>This course is perfect for beginners with a basic knowledge of computers, SQL and statistics, and/or intermediate to advanced MS Excel skills. So if you are an aspiring data scientist, analyst or new to Alteryx, you can enrol and learn how to work efficiently within the Alteryx designer platform.</p><a href=\"https://alison.com/resume/courses/3069\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3069\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Alteryx","description":"This module will introduce you to Alteryx and how to automate your data processes with the power of Alteryx. You will learn how to use Alteryx workflows to cut out repetitive tasks, how to build visual workflows in Alteryx and how to filter data in Alteryx. You will be shown data parsing techniques using the Alteryx parse tool palette, how to create reports in Alteryx that run on demand and how to use the predictive tools in Alteryx to perform data analysis.","topics":["Alteryx - Learning Outcomes","Alteryx Introduction","Data Blend and Prep","Data Parsing","Alteryx - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Alteryx - Course assessment"]}]}