{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1747","title":"Introduction to the Internet of Things (IoT)","totalEnrolled":"12,497","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the technology behind the Internet of Things (IoT).","description":"This free online course on the Internet of Things(IoT) will teach you about the extension of Internet connectivity to physical and electronic devices, and how it can be used to complete both complicated and menial tasks. IoT is growing in use, capability, and availability. Take this free online course today to gain a much stronger understanding of the IoT and how it can be used in your personal and professional life.","courseOutcomes":["Discuss the history of IoT...","Explain how IoT can be used in diffe...","Describe how companies can plan for ...","Discuss how IoT is important to smal...","Discuss the history of IoT","Explain how IoT can be used in different industries","Describe how companies can plan for the future of technologies","Discuss how IoT is important to small businesses","Describe examples of how IoT can apply to you in the future","Define challenges in how business are changing the way they’re doing business","Explain why SMB should use IoT","Discuss the history of IoT...","Explain how IoT can be used in diffe...","Describe how companies can plan for ...","Discuss how IoT is important to smal...","Discuss the history of IoT","Explain how IoT can be used in different industries","Describe how companies can plan for the future of technologies","Discuss how IoT is important to small businesses","Describe examples of how IoT can apply to you in the future","Define challenges in how business are changing the way they’re doing business","Explain why SMB should use IoT"],"courseDescription":"<p>In this online course Introduction to the Internet of Things (IoT) you will learn all about the Internet of Things. You will gain knowledge on how the term IoT came to be and how the IoT is evolving in a way that will change the way companies manage their workload.</p><p>The course starts off with introducing you to the history of IoT, you will learn about how the internet and networks have advanced and also the potential changes that IoT can make in the future. You will learn about the different capabilities that IoT has and how companies can prepare and plan for the future of technologies.</p><p>In the second module you will learn about ways in which small to medium sized businesses can benefit from implementing the IoT. You will learn about challenges that can be faced in SMB when wanting to use IoT and solutions in overcoming these, and will inform you on RFID tags, remote monitoring and how to approach a remote monitoring project. The final unit of this course will explain to you how to get started with introducing IoT to your company.</p><a href=\"https://alison.com/resume/courses/1747\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1747\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to the Internet of Things","description":"In this module you will learn about the history and development of the IoT. You will learn about what the IoT can do and how companies can plan for the future of technologies.","topics":["Introduction to the Internet of Things Learning Outcomes","The History of IoT","IoT and the Retail Industry","Microsoft Azure","Introduction to the Internet of Things Lesson Summary"]},{"name":"Module","details":"The IoT and Small Businesses","description":"In this module you will be introduced to SMB and why IoT is important to small businesses. You will learn about challenges that these companies can face when implementing IoT and how to overcome these challenges.","topics":["The IoT and Small Businesses Learning Outcomes","Opportunities created by using IoT","Remote Monitoring","Small Businesses using IoT","The IoT and Small Businesses Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to the Internet of Things (IoT) Course Assessment"]}]}