{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1914","title":"Introduction to R","totalEnrolled":"10,586","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Students will get an introduction to the R coding language with this free online introduction to R course.","description":"This free online Introduction to R course will teach you everything you need to know about the fundamentals of R. R is an integrated suite of software facilities for data manipulation. You will learn about R, RStudio, workspaces, and basic types as well as look into variables, data structures and operators, and data frames and tables. With this course, you will greatly enhance your statistics, data mining, and R coding skills.","courseOutcomes":["Identify R coding language...","Distinguish variables while coding...","Define data structures;...","Explain the role of operators and th...","Identify R coding language","Distinguish variables while coding","Define data structures;","Explain the role of operators and their function","Classify data frames and tables","Describe logical operators","Describe assignment operators","Identify R coding language...","Distinguish variables while coding...","Define data structures;...","Explain the role of operators and th...","Identify R coding language","Distinguish variables while coding","Define data structures;","Explain the role of operators and their function","Classify data frames and tables","Describe logical operators","Describe assignment operators"],"courseDescription":"<p>This free online course Introduction to R will provide you with an understanding of the basics of the R coding language. R is an integrated suite of software facilities for data manipulation. This course will be of great interest to those who work in statistics and data mining. You will learn about what the R coding language is. You will be able to explain variables, including basic types of variables, dates, and missing values.</p><p>Next, the course introduces you to RStudio and workspaces. The course then explains how to use vectors and matrices. The course teaches you about arrays, lists, factors, arithmetic, and relational operators. You will learn how R is designed around a true computer language allowing users to add additional functionality by defining new functions. Students will also learn about logical and assignment operators.</p><p>This course then wraps up by introducing you to data frames and tables. The course teaches you about working with data frames and data tables. By taking this free online course you will learn how to be better prepared for working with the R coding language. So why wait? Start learning today and improve your R coding skills!</p><a href=\"https://alison.com/resume/courses/1914\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1914\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to R","description":"In this module, Introduction to R, students will learn about R, RStudio, workspaces, and basic types.","topics":["Topic A: About R","Topic B: Rstudio","Topic C: Workspaces","Topic D: Basic Types","Review Quiz"]},{"name":"Module","details":"Variables","description":"In this module, Variables, students will learn about basic types, dates, variables, and missing values.","topics":["Topic A: Basic Types Demo","Topic B: Dates Demo","Topic C: Variables","Topic D: Missing Values","Review Quiz"]},{"name":"Module","details":"Data Structures and Operators","description":"In this module, Data Structures and Operators, students will learn about vectors, matrices, arrays, lists and factors, arithmetic and relational operators, logical and assignment operators.","topics":["Topic A: Vectors","Topic B: Matrices","Topic C: Arrays","Topic D: Lists and Factors","Topic E: Arithmetic and Relational Operators","Topic F: Logical and Assignment Operators","Review Quiz"]},{"name":"Module","details":"Data Frames and Tables","description":"In this module, Data Frames and Tables, students will learn about data frames, working with data frames, data tables, working with data tables, and shortcuts.","topics":["Topic A: Data Frames","Topic B: Working with Data Frames","Topic C: Data Tables","Topic D: Working with Data Tables","Topic E: Shortcuts","Review Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to R - Course Assessment"]}]}