{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1716","title":"iOS App Development: Data Persistence with Core Data","totalEnrolled":"1,667","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about how to incorporate data persistence with core data into iOS app development with this free online course.","description":"This free online iOS App Development course focuses on Data Persistence with Core Data and will give you a comprehensive introduction to the main tools and concepts of using data persistence in your projects. You will learn how to build an iOS application with persistent data, work with the Core Data framework, learn the functions of the Managed Object Model, Managed Object Context, Persistent Store Coordinator, and more!","courseOutcomes":["Outline how to build a iOS applicati...","Describe working with the Core Data ...","List the functions of the Managed Ob...","Define static data...","Outline how to build a iOS application with persistent data","Describe working with the Core Data framework","List the functions of the Managed Object Model, Managed Object Context and Persistent Store Coordinator","Define static data","Discuss working with the Core Data Entity","Create extensions for UIViewControllers and iOS components","Outline how to override default animation with Core Animation Transitions","Discuss how to fetch requests with the Managed Object Context","Outline how to build a iOS applicati...","Describe working with the Core Data ...","List the functions of the Managed Ob...","Define static data...","Outline how to build a iOS application with persistent data","Describe working with the Core Data framework","List the functions of the Managed Object Model, Managed Object Context and Persistent Store Coordinator","Define static data","Discuss working with the Core Data Entity","Create extensions for UIViewControllers and iOS components","Outline how to override default animation with Core Animation Transitions","Discuss how to fetch requests with the Managed Object Context"],"courseDescription":"<p>iOS app development is a fast-moving and lucrative industry. Data persistence is one of the key fundamental concepts that needs to be understood in order to become a successful developer. This course demonstrates exactly how to incorporate data persistence into your projects and utilise its benefits in your applications. Learners will study how to create persistent data using Core Data.</p><p>This course begins by giving an introduction to data persistence, the managed object model, the managed object context and the persistent store. This course focuses on creating the Goal post app and continues by exploring view controller extensions, fetching data from the persistent store, working with arrays and overriding animations with Core Animation Transitions. This course lays a perfect foundation for exploring more advanced iOS development topics. Data persistence is a key feature and is extremely useful in creating robust applications.</p><p>If you're interested in iOS app development or similar areas, or if you're an IT professional seeking to learn a new skill, then this course is an ideal starting point in mastering data persistence. With this course, the topics are explained clearly and concisely in just 3 hours. Start this course today and give your iOS app development skills a real boost!</p><a href=\"https://alison.com/resume/courses/1716\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1716\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Goal Post App- Introduction to Data Persistence in iOS 12 With Core Data","description":"This module gives a comprehensive introduction into the main tools and concepts in using data persistence in your projects. This module outlines how to create the Goalpost app which uses persistent storage with the Core Data Framework. This course explains and demonstrates the uses of the Managed Object Model, Managed Object Context and Persistent Store Coordinator. This topic discusses how to work with the Core Data Entity, static data and teaches you how to create a view controller subclass.","topics":["Intro to Data Persistence in iOS 12 With Core Data - Learning Outcomes","Intro to App- GoalPost","Creating Xcode Project - Project Folders","Building GoalsVC","Building GoalCell","What is Core Data-","Creating Goal Core Data Entity & Attributes","Displaying Static GoalCells in UITableView - Creating GoalType Enum","Building CreateGoalVC","Intro to Data Persistence in iOS 12 With Core Data - Lesson Summary"]},{"name":"Module","details":"Goal Post App- Core Animation, Fetch Requests and Advanced Data Persistence","description":"This module covers some of the more advanced concepts of data persistence in iOS and wraps up some of the key features of the Goalpost app. In this module you will learn how to modify view controller, override default animations with Core Animation Transitions and create view controller extensions. This topic also discusses how to fetch requests with the Managed Object Context, work with arrays and add an undo feature view controller to the application.","topics":["Core Animation, fetch requests and advanced data persistence - Learning Outcomes","Creating a UIViewController Extension","Creating a UIView - UIButton Extension","Building FinishGoalVC - Passing Data from CreateGoalVC","Saving Goal Data to Persistent Store","Fixing Dismissal of FinishGoalVC","Fetching Data from Persistent Store - Filling UITableView with Fetched Data","Removing Objects from Persistent Store using UITableView Delete Action","Setting Goal Progress for UITableViewCell","Challenge","Core Animation, fetch requests and advanced data persistence - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["iOS App Development: Data Persistence with Core Data - Course Assessment"]}]}