{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1878","title":"IT Management - Building Information Systems","totalEnrolled":"10,704","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about building information systems in industry, from a managerial network perspective.","description":"This free online sales management course will teach you the key skills you need to be effective in the sales network. While using traditional selling tenets as its foundation and teaching you the role of sales operations in everyday life, this course adapts these concepts to the rapidly changing world of business applications, including the use of Twitter, LinkedIn, Facebook, blogs, wikis, and other interactive means of connecting with customers.","courseOutcomes":["List the stages of the systems desig...","Discuss the roles of the users, mang...","Identify the key concerns of the sys...","Outline the various costs and benefi...","List the stages of the systems design life cycle","Discuss the roles of the users, mangers and designers in the systems design life cycle","Identify the key concerns of the systems analysis and feasibility study","Outline the various costs and benefits associated with the systems design life cycle","List the different tools available for Information Systems Design","Discuss the characteristics of structural design and object-oriented design with regards to information systems design","List the stages of the systems desig...","Discuss the roles of the users, mang...","Identify the key concerns of the sys...","Outline the various costs and benefi...","List the stages of the systems design life cycle","Discuss the roles of the users, mangers and designers in the systems design life cycle","Identify the key concerns of the systems analysis and feasibility study","Outline the various costs and benefits associated with the systems design life cycle","List the different tools available for Information Systems Design","Discuss the characteristics of structural design and object-oriented design with regards to information systems design"],"courseDescription":"<p>Information Systems are critical components in every business and organization, and managers have a fundamental role in the initiation, design model, and implementation of a new information system infrastructure. Information technology has a crucial role to play in modern corporate Information Systems.</p><p>In this free online course, the learner is introduced to the stages of system designs. The learner will see how the manager's role is fundamental to the success of the early stages of systems design, and how the user must have maximum impact during these real-time stages.</p><p>The learner will also be introduced to the various tools available to aid in Information Systems design. There are various costs and benefits associated with the lifecycle of information systems management, and various ways in which an organization's data may be impacted, and this course will address those issues.</p><p>This free course will be of great interest to professionals in the areas of business management, IT, and information systems management who would like to learn more about designing information systems and the costs and the challenges faced by managers when implementing a new Information System.</p><a href=\"https://alison.com/resume/courses/1878\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1878\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Building Information Systems","description":"Learn more about building information systems.","topics":["Building Information Systems - Learning Outcomes","The Design Task","A Systems Design Life Cycle","User-Oriented Design","Structured Vs Object-Oriented Design","Building Information Systems - Lesson Summary"]},{"name":"Module","details":"Systems Design - The Early Stages","description":"Learn more about the early stages of systems design.","topics":["Systems Design - The Early Stages - Learning Outcomes","Systems Analysis","Survey And Feasibility Study","Identifying Systems Alternatives","Undertaking Systems Design","Systems Design - The Early Stages - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["IT Management - Building Information Systems - Course Assessment"]}]}