{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1435","title":"JavaScript - Working with the Document Object Model and jQuery Plugins","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to add more functionality to your web page using the Document Object Model and jQuery in JavaScript.","description":"This free online Document Object Model course will introduce the concept of the Document Object Model, DOM methods in javascript, and how you can add greater functionality to the web page using jQuery. JavaScript can change HTML elements in a web page, including attributes and CSS styles, remove existing and add new HTML elements and attributes, and react to all existing HTML events in the page. Get up to speed with Javascript, today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This Document Object Model course will first introduce you to the methods that can be used to add JavaScript to web pages, such as linking web pages to external JavaScript files, adding JavaScript code using the onload method in the body tag, and adding JavaScript code using script tag within the header of a web page. You will also learn how to access object properties in JavaScript. The course will then discuss the Document Object Model (DOM) and how the HTML DOM allows JavaScript to change all the elements of an HTML document.</p><p>You will then look into the main components of jQuery which include Document Object Model DOM, AJAX, Events, and Effects. Here, the Document Object Model course will discuss the advantages of working with jQuery and look into its Production Version and Development Version. You will also study the different ways you can use jQuery on your web site, which shortcut to refer to jQuery, the benefits of using unobtrusive JavaScript, and the different scope chains in the JavaScript closure.</p><p>JavaScript is an object-based scripting language mainly used for client-side validation. It has many powerful features designed to give the user more control over the browser. This JavaScript - Working with the Document Object Model and jQuery Plugins online course will teach you how to use JavaScript to work with the Document Object Model DOM methods in javascript and jQuery plugins to enhance the functionality and interactivity of web pages. So, have a look at the course today and start enhancing your web development skills in just a few short hours!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}