{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1434","title":"JavaScript Application Programming","totalEnrolled":"23,158","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this online JavaScript course learn about JavaScript apps and create web pages with interactivity and functionality.","description":"This free online JavaScript app tutorial course will teach you JavaScript programming principles step-by-step, in a clear and concise manner. JavaScript is an extremely common and important application programming interface used to program the behavior of web pages. Created in 1995, and a European Computer Manufacturers Association standard by 1997, JavaScript is the third language all web developers must learn, along with HTML and CSS.","courseOutcomes":["- Understand JavaScript Programming ...","- Understand JavaScript and the Docu...","...","...","- Understand JavaScript Programming Concepts","- Understand JavaScript and the Document Object Model","- Understand JavaScript Programming ...","- Understand JavaScript and the Docu...","...","...","- Understand JavaScript Programming Concepts","- Understand JavaScript and the Document Object Model"],"courseDescription":"<p>This online JavaScript app tutorial will first introduce you to the JavaScript variable. You will learn to create a variable in JavaScript and the general rules for constructing unique identifiers for variables. You will then learn that HTML events are \"things\" that happen to HTML elements. The course will discuss some examples of HTML events which JavaScript can react to, the methods that can be used to let JavaScript work with events, the main types of errors in JavaScript code, and assignment operators.</p><p>You will then study conditional statements including 'if', 'else', else if', and 'switch', as well as look into equality operators. The course will discuss JavaScript functions, function parameters, function arguments, and anonymous functions. You will then learn what characters can be contained in a function name and study the different JavaScript loops. Finally, you will study the two types of scope in JavaScript, and you will be shown how to use the array object to store multiple values in a single variable.</p><p>JavaScript is currently used by 94.5% of all websites and helps web developers make web pages dynamic and interactive. This free online JavaScript Application Programming course can teach you how to use JavaScript to add dynamic behavior, store information, and handle requests and responses on a website. So check out the course today, and learn JavaScript to build interactive websites and pages in just a few short hours.</p><a href=\"https://alison.com/resume/courses/1434\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1434\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Writing your First JavaScript Application","description":"In this module you will learn about JavaScript variables, and concepts such as declaring variables using the var key word and use identifiers. You will learn about HTML events such as onclick and how JavaScript methods can be used to work with them. You will learn about the different types of conditional statements, their correct syntax and examples of their use.","topics":["Writing your First JavaScript Application - Learning Outcomes","Series Introduction","Writing your First JavaScript Application","Dissecting the First JavaScript Application You Wrote","Writing JavaScript in Visual Web Developer Express","JavaScript Variables, Types, Operators and Expressions","Writing your First JavaScript Application - Lesson Summary"]},{"name":"Module","details":"JavaScript Programming Concepts","description":"In this module different types of JavaScript loops (for, for/in, while and do/while loops) are discussed. You will learn about JavaScript arrays which are used to store multiple values in a single variable. You will also learn about the different types of 'falsy' and 'truthy' values. Finally, you will learn about the main types of errors in JavaScript code and how to minimize them.","topics":["JavaScript Programming Concepts - Learning Outcomes","Conditional Logic in JavaScript","JavaScript Functions","JavaScript Array","Looping Statements in JavaScript","Understanding Function versus Global Scope","JavaScript Programming Concepts - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["JavaScript Application Programming - Assessment"]}]}