{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4184","title":"JavaScript Dynamic Timeline Using JSON","totalEnrolled":"389","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to create an interactive timeline for your website using JSON in this free online JavaScript programming course.","description":"If you have ever wondered how to create an interactive timeline in JavaScript, then look no further. This web development course teaches you how to design an interactive timeline with end-users in mind. You will learn how to generate page content from JSON (JavaScript object notification) data objects and randomly from string characters to populate the web page, then apply styling to make the timeline more dynamic.","courseOutcomes":["Create an index page for a single-pa...","Discuss setting up the basic HTML st...","Create a dynamic timeline using JSON...","Categorize and output the content to...","Create an index page for a single-page website in JavaScript","Discuss setting up the basic HTML structure for a dynamic timeline","Create a dynamic timeline using JSON","Categorize and output the content to the webpage","Recall the process of building the indicator list of events","Apply styling to your dynamic timeline project","Generate random content that can be used to populate the timeline","Outline the procedure to hide and show content on the web page","Create a timeline effect on your project","Explain how to tweak your project in order to have it function properly as expected","Create an index page for a single-pa...","Discuss setting up the basic HTML st...","Create a dynamic timeline using JSON...","Categorize and output the content to...","Create an index page for a single-page website in JavaScript","Discuss setting up the basic HTML structure for a dynamic timeline","Create a dynamic timeline using JSON","Categorize and output the content to the webpage","Recall the process of building the indicator list of events","Apply styling to your dynamic timeline project","Generate random content that can be used to populate the timeline","Outline the procedure to hide and show content on the web page","Create a timeline effect on your project","Explain how to tweak your project in order to have it function properly as expected"],"courseDescription":"<p>You will learn how to build a JavaScript interactive timeline from scratch. This course teaches you the basic steps for creating a dynamic, interactive single web page. You will learn how to open an index.html page on which the code is written from the editor. The dynamic timeline is built on a single web page. See how to design the web page structure, and create and name files where some of the page content or data are saved. You will also understand the interaction between the HTML page and the web page. Most basically, you will get familiar with the arrangement of the variables and operators during coding. The material explains how to create random content data. Coding is about creating functions that are expected to be seen on the web page so you will learn how to create functions and output content to the page. You will also learn how to create functions that will sort content and indicate a list of events within the page.</p><p>This course explains the fundamental relationship between the console and the information put out on the web page. Master how to style and position content. You will also be able to create interaction with JavaScript, styling, page positioning, and content arrangements. Learn how to hide content or show it when such a command is given on the page, which can be done using the opacity function. JavaScript coding always has the allowance to make adjustments or corrections anytime.</p><p>This course helps you to create an outstanding interactive timeline for your website users and gives you a soft landing in mastering the skills needed to build a dynamic timeline using JavaScript object notation (JSON). Do you want to advance your coding knowledge and build a successful career in programming using JavaScript? If so, create your free Alison account and enrol now - it’s that easy.</p><a href=\"https://alison.com/resume/courses/4184\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4184\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setting Up and Content Data","description":"In this module, you are going to get acquainted with the coding examples used in this lesson before proceeding to learn how to create a dynamic timeline. Learn to set up the basic structure of the timeline as well as generating content and creating functions that will enable you to output the contents information to the webpage for the end-users.","topics":["Introduction, Setting Up and Content Data - Learning Outcomes","Introduction and Setting Up","Content Data and List of Events","Introduction, Setting Up and Content Data - Lesson Summary"]},{"name":"Module","details":"Indicator Stylings, Interactions and Conclusion","description":"In this module, you are going to learn how to apply stylings to your timeline indicators. Then you will learn how you can choose to either hide or show relevant content on your timeline, using the opacity function in JavaScript. Then you will proceed to learn how to add a line to your timeline project in order to give it the real timeline effect.","topics":["Indicator Stylings, Interactions and Conclusion - Learning Outcomes","Indicator Stylings and Interactions","Timeline Tweaks and Conclusion","Indicator Stylings, Interactions and Conclusion - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["JavaScript Dynamic Timeline Using JSON - Course Assessment"]}]}