{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2158","title":"Java Part 1: What's New","totalEnrolled":"4,690","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the new features of Java SE 7 including new language enhancements with this free online Java Part 1 course.","description":"This free online Java Part 1 course gives students an introduction to Java SE 7 by talking about some of the new features in this version of the Java programming language and what it can do that previous versions couldn't. These new features include new language enhancements as well as concurrency utilities, IO and New IO, file changes, and network protocols. Start this course today to learn about the new features of Java SE 7's development.","courseOutcomes":["Identify the various improvements to...","Explain how the NIO allows you to in...","List many of the new Language Enhanc...","Describe the various Network Protoco...","Identify the various improvements to Java","Explain how the NIO allows you to interact with files","List many of the new Language Enhancements","Describe the various Network Protocols","Outline the New Concurrent Utilities","Identify the various improvements to...","Explain how the NIO allows you to in...","List many of the new Language Enhanc...","Describe the various Network Protoco...","Identify the various improvements to Java","Explain how the NIO allows you to interact with files","List many of the new Language Enhancements","Describe the various Network Protocols","Outline the New Concurrent Utilities"],"courseDescription":"<p>This course, Java Part 1: What's New, will provide you with an understanding of Java SE 7, the new features included in the software, and how it compares to previous versions of Java. You will learn about the new language enhancements to Java SE 7. You will be able to explain the differences in generic type interface in Java SE 7 to previous versions of Java and how these are improvements. You will also learn about Concurrency Utilities in the latest version of Java like ThreadLocalRandom Class and the new Phaser Class.</p><p>This Java SE 7 course then explains the issues that came with the old IO of previous versions of Java and how the new IO improves on these issues. You will learn about how the new IO allows uses to interact with file data types. You will also learn about NIO Async Operations and NIO Async Channel Group.</p><p>This course then wraps up with Network Security Protocols. You will learn about the asynchronous channels of Java SE 7. By taking this course you will learn about the many upgrades that came with Java SE 7. So why wait? Start learning today.</p><a href=\"https://alison.com/resume/courses/2158\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2158\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Language Enhancements","description":"In this module, Language Enhancements, students will receive an introduction to the latest version of Java. Students will learn about some of the past versions of Java and the newest features of Java SE7. This includes an overview of the many new language enhancements. The module will also compare the generic type interface from Java SE7 to past versions.","topics":["Topic A: Overview","Topic B: Language Enhancements","Topic C: Generic Type Inference","Topic D: Data Type Enhancements","Topic E: Enhancements","Language Enhancements - Assessment"]},{"name":"Module","details":"Concurrency Utilities","description":"In this module, Concurrency Utilities, students will learn about New Concurrent Utilities that are a part of Java SE7. Students will also learn about ThreadLocalRandom Class, and how Java generates random numbers. The module will also go over the new Phaser Class and how it works to with its new phaser barrier.","topics":["Topic A: New Concurrent Utilities","Topic B: ThreadLocalRandom Class","Topic C: Phaser Class","Concurrency Utilities - Assessment"]},{"name":"Module","details":"IO and New IO","description":"In this module, IO and New IO, students will learn about IO and New IO with Java SE7. Students will learn about IO on past versions of Java and how the New IO fixes a lot of past issues. The module will also go into detail on NIO File System Operations and how it can be used to move and manipulate files.","topics":["Topic A: Java Stream Based File","Topic B: NIO Files Class","Topic C: NIO File System Operations","IO and New IO - Assessment"]},{"name":"Module","details":"Files, Async, Change","description":"In this module, Files, Async, Change, students will learn about walking the Dir Tree with NIO. Students will also learn about Finding Files With NIO. The module will also talk about NIO Async Operations. It will also cover NIO Async Channel Group. Finally the module will cover NIO Change Notification.","topics":["Topic A: NIO Walking the Dir Tree","Topic B: Finding Files With NIO","Topic C: NIO Async Operations","Topic D: NIO Async Channel Group","Topic E: NIO Change Notification","Files, Async, Change - Assessment"]},{"name":"Module","details":"Network Protocols","description":"In this module, Network Protocols, students will learn about the Network Protocols of Java SE 7. The module will cover the asynchronous channels of Java SE 7. The module will then cover the topic of Server Accept Client Msg. Students will then learn all about Sockets Direct Protocol.","topics":["Topic A: Network Protocols","Topic B: SCTP","Topic C: SDP","Network Protocols - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Java Part 1: What's New - Final Assessment"]}]}