{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3874","title":"JavaScript and CSS - Fully Responsive Mobile Ready Website","totalEnrolled":"1,681","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Level-up your coding skills and create a responsive mobile website using JavaScript and CSS in this free online course.","description":"More and more of the world’s web traffic is coming from mobile devices and organizations need to ensure that all their applications and websites are mobile-friendly. This free online web development course will teach you the skills, techniques and methods required to set up and build a fully responsive and dynamic mobile website including webpage content and a working navbar using the popular JavaScript and CSS coding languages.","courseOutcomes":["State the reason for creating a roug...","Describe the process of setting up t...","Recall the procedures for setting up...","Explain the functions of Chrome dev ...","State the reason for creating a rough sketch of the website","Describe the process of setting up the developing environment","Recall the procedures for setting up the main HTML","Explain the functions of Chrome dev tools","Summarize how to build the navbar and make it responsive","Explain how to build and update the website logo","Identify the appropriate format of various commands used in CSS","Recall how to set the minimum and maximum heights of an element","Describe how to update objects on the website using JavaScript","State the reasons for reviewing the website","Recall how to import and implement fonts on the website","State the reason for creating a roug...","Describe the process of setting up t...","Recall the procedures for setting up...","Explain the functions of Chrome dev ...","State the reason for creating a rough sketch of the website","Describe the process of setting up the developing environment","Recall the procedures for setting up the main HTML","Explain the functions of Chrome dev tools","Summarize how to build the navbar and make it responsive","Explain how to build and update the website logo","Identify the appropriate format of various commands used in CSS","Recall how to set the minimum and maximum heights of an element","Describe how to update objects on the website using JavaScript","State the reasons for reviewing the website","Recall how to import and implement fonts on the website"],"courseDescription":"<p>Coding as a field of expertise is in-demand given the advent of the Internet of Things (IoT) and this free online web development training will have you creating a dynamic mobile website using JavaScript and CSS in no time. The course begins with an introduction to building a mobile-ready website and you will learn the importance of making a sketch of the website and how to plan and set up the website which includes how to create the stylesheet file, the JavaScript file (also known and as the Js file) and the CSS file. The web development tutorial then moves on to teach you how to inspect, debug and troubleshoot the development codes using the chrome dev tools, the main setup of the HTML of the website,&nbsp; This free online course on Alison.com will teach you how to set up the main HTML of the website, website navigation bar, required media queries, and how to create and add a logo.</p><p>In the next part of the course, you will learn JavaScript which covers a whole host of techniques and effects such as updating objects or web content, various navigation options and more creative effects. Your imagination is the only limit because you can make your mobile website come to life with all sorts of interactivity, colours, characters, and fonts. Included in this section is specific tools and ideas for the look and feel of your mobile website such as how to create colour palettes, where to download fonts, how to add mock content to your website so you can have a view of how everything will look in the end, and all sorts of tweaks and adjustments. The final part will show you exactly how to perform a technical review of the website so you can ensure that everything is working perfectly as it should be.</p><p>A responsive mobile website is a system of creating a website that works perfectly on all mobile platforms, and it also means creating websites that will automatically scale its content to fit into users' environment, which is usually determined by the users' mobile screen size, -orientation, and mobile -platform. A responsive website helps users understand and consume the content easily and is the basis for a great overall user experience (UX). If you are starting out in a career in web development, application development or even user experience, enrolling in this course will teach you the technical know-how and UX design principles to not only create a fully functional mobile website, but also apply your knowledge to various other web development and design projects.</p><a href=\"https://alison.com/resume/courses/3874\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3874\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Setting up and Creating the Navbar","description":"In this module, you will be introduced to building a responsive mobile-ready website using JavaScript and CSS, you will learn how to plan and set up the website development environment and how to set up the main HTML structure, you will also learn how to build the navbar and make it responsive and also how to build and update the website logo.","topics":["Setting up and Creating the Navbar - Learning Outcomes","Setting Up the scene","Creating the Navbar","Setting up and Creating the Navbar - Lesson Summary"]},{"name":"Module","details":"Including JavaScript and Website Adjustments","description":"In this module, you will learn how to update the web contents using JavaScript, this includes creating the navigation effect. You will also learn how to add colors and placeholder contents to the website, you will be shown how to apply some tweaks and adjustments to the website and how to do a website review.","topics":["Including JavaScript and Website Adjustment - Learning Outcomes","JavaScript and Place Holder Content","Website Tweaks, Adjustments and Reviews","Including JavaScript and Website Adjustment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["JavaScript and CSS - Fully Responsive Mobile Ready Website - Course assessment"]}]}