{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4383","title":"jQuery Web Development and Programming","totalEnrolled":"858","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to use the feature-rich jQuery library to create dynamic, functional websites in this free online course.","description":"This course will teach you all you need to create dynamic and functional websites using jQuery, the light, fast and feature-rich JavaScript library. This course will cover the basics of jQuery web design, such as selecting elements and recording events, as well as the more advanced features like proxy functions and extending functions using jQuery. In addition, discover how to create elements, effects and animations and use utility functions.","courseOutcomes":["Distinguish between uncompressed, mi...","Recall the process of selecting elem...","Describe the process of selecting ‘c...","Outline the process of retrieving el...","Distinguish between uncompressed, minified and slim versions of jQuery","Recall the process of selecting elements using different properties","Describe the process of selecting ‘child’ and ‘parent’ elements","Outline the process of retrieving element attributes using jQuery","Explain the process of setting multiple attributes using jQuery","Define ‘element propagation’ in jQuery","Distinguish between the mouse down and mouse click events","Recall the process of setting multiple CSS properties using jQuery","Outline the process of filtering elements","Explain the function of the ‘stop’ method","Describe the function of the ‘trim’ method","Define ‘Global Evaluation’ in jQuery","Distinguish between uncompressed, mi...","Recall the process of selecting elem...","Describe the process of selecting ‘c...","Outline the process of retrieving el...","Distinguish between uncompressed, minified and slim versions of jQuery","Recall the process of selecting elements using different properties","Describe the process of selecting ‘child’ and ‘parent’ elements","Outline the process of retrieving element attributes using jQuery","Explain the process of setting multiple attributes using jQuery","Define ‘element propagation’ in jQuery","Distinguish between the mouse down and mouse click events","Recall the process of setting multiple CSS properties using jQuery","Outline the process of filtering elements","Explain the function of the ‘stop’ method","Describe the function of the ‘trim’ method","Define ‘Global Evaluation’ in jQuery"],"courseDescription":"<p>This short course will teach you everything you need to create dynamic websites using the jQuery JavaScript library. It begins from scratch, demonstrating the process of setting up jQuery on various platforms and the web. First, explore how elements can be selected using multiple properties such as their IDs, attributes, class, contained text and so on. Next, the course illustrates how to use jQuery to retrieve and set element values, attributes, classes and HTML.</p><p>The first half of the course concludes by teaching you how to record various mouse and keyboard events and use these detected events to make websites more dynamic. The second half shows using jQuery to retrieve and modify an element’s CSS properties, classes and dimensions. This section also presents how to create and remove HTML elements using jQuery and how to add effects and animate elements on a web page.</p><p>The course concludes by examining how to retrieve from and send data to a server using jQuery and use utility functions like the ‘get’, ‘post’, ‘trim’ and ‘extend’ functions. jQuery is a popular JavaScript library revered for its light, fast and yet functional nature. We will provide you with the information you need to use this powerful library. Both new and experienced web developers will find the information contained in this course helpful. So start now and learn to use the powerful jQuery library in only three hours.</p><a href=\"https://alison.com/resume/courses/4383\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4383\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setup and Selectors","description":"In this module, you will be introduced to the course content and will learn the process of setting up jQuery on various platforms, and on the web. You will also learn to select web elements based on properties such as their ID, attributes, class, and text.","topics":["Introduction, Setup and Selectors – Learning Outcomes","Introduction and Setup","jQuery Selectors","Introduction, Setup and Selectors – Lesson Summary"]},{"name":"Module","details":"Attributes, Values & Events","description":"In this module, you will learn about various events that can be recorded using jQuery, and how to make these events trigger an action on a webpage. You will also learn to use jQuery to set and retrieve an element's attributes, HTML, data values, class values; as well as how to prevent the default behavior of an element.","topics":["Attributes, Values & Events – Learning Outcomes","jQuery Attributes & Values","Mouse Events","Keyboard & Form Events","Attributes, Values & Events – Lesson Summary"]},{"name":"Module","details":"HTML, CSS, Traversing & Effects","description":"In this module, you will learn to use jQuery to retrieve and set the CSS properties of an element, as well as how to set element dimensions, add and remove HTML elements from a webpage. You will also learn to traverse a webpage and find elements based on their properties, and how to add effects like the fade and slide effects to a web page.","topics":["HTML, CSS, Traversing & Effects – Learning Outcomes","Setting HTML and CSS Properties","Traversing and Effects","HTML, CSS, Traversing & Effects – Lesson Summary"]},{"name":"Module","details":"AJAX & Utility Functions","description":"In this module, you will be introduced to using jQuery to add asynchronous updating capability to a website using AJAX. You will also learn about a host of useful functions like the trim, inArray, post, and get methods, used to manipulate and modify webpage elements.","topics":["AJAX & Utility Functions – Learning Outcomes","Asynchronous JavaScript & XML – AJAX","Utility Functions","AJAX & Utility Functions – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["jQuery Web Development & Programming – Course assessment"]}]}