{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4103","title":"Learn Game Development with Python and Pygame","totalEnrolled":"2,996","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online programming course will show you how to build a computer game from scratch with Python and Pygame.","description":"Are you a beginner or an aspiring game developer interested in learning game development with Python/Pygame from start to finish? Sign up for this free online course today to build and improve your cross-platfrom Python skills. You will also be taken through how to build a simple yet practical project that you can truly enjoy once it's finished. You don't need prior programming experience, although you need to have some basic Python knowledge.","courseOutcomes":["Identify three uses of VSC (Visual S...","Explain what Pygame is...","Discuss how to build a game window...","Create a game screen object...","Identify three uses of VSC (Visual Studio Code)","Explain what Pygame is","Discuss how to build a game window","Create a game screen object","State the concepts of the game loop","Explain the method to import an image to a project","Describe the process to integrate custom objects and Pygame components","Identify three uses of VSC (Visual S...","Explain what Pygame is...","Discuss how to build a game window...","Create a game screen object...","Identify three uses of VSC (Visual Studio Code)","Explain what Pygame is","Discuss how to build a game window","Create a game screen object","State the concepts of the game loop","Explain the method to import an image to a project","Describe the process to integrate custom objects and Pygame components"],"courseDescription":"<p>Python is one of the most popular programming languages out there today because it is easy to use. There are many frameworks and libraries available that can be used to build just about anything, including games. One framework that can be used to build games written in Python is called Pygame. The library is easy to install and use and contains all of the components needed to build a simple game. This free online course on computer game development will take you through how to improve a game by adding extra functionality, building new games and other Python projects. You will get to explore other Python frameworks and libraries.</p><p>In this course, you will learn how to integrate custom objects and Pygame components. Study decision making along with how to update object positioning and render graphics. Additionally, you will understand the process of implementing game logic and how to build an RPG-style (role-playing game) game. You don't need prior programming experience to begin this course, although you need some basic Python knowledge. As long as you have a Windows or a Mac OS, you are all set! Another thing you will need is the willingness to learn and challenge yourself.</p><p>This course is great for beginners in Python as you start with fundamentals like how to install Python and Pygame. You will work on creating and running a project so you get familiar with using a main.py file. Also, you will focus on creating and displaying a game window – along with using a game loop to keep the window open. Additionally, you will move to importing and drawing images from the project. In this course, you will understand how to implement custom objects such as GameObject, player and enemy classes. You will see how to implement collision detection to tell when colliding with an enemy. Lastly, you finish up with implementing game logic. This is an exciting course where you will be able to learn about Python and Pygame. One of the best ways to build your programming skills is to build a practical project that you can enjoy once it's finished. This course is targeted at anyone interested in developing simple games or improving their Python skills. Sign up for this course today and begin your next learning journey!</p><a href=\"https://alison.com/resume/courses/4103\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4103\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Game Development with Pygame","description":"This module introduces Pygame as one of the frameworks that can be used in developing a game. It is easy to use and install, and it contains all of the components needed to build a simple game. This module will guide you through the integration of custom objects and Pygame components.","topics":["Game Development with Pygame - Learning Outcomes","Installing Python, Anaconda, and Pygame","C++ Game Window","Event Handlers","Updating Multiple Enemies","Game Development with Pygame - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Learn Game Development with Python and Pygame - Course Assessment"]}]}