{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4262","title":"Learning Microsoft PowerPoint","totalEnrolled":"2,208","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the full capabilities and advanced features of Microsoft PowerPoint in this free online course.","description":"In this course, you will learn how to use MS Powerpoint 2016 to create and deliver compelling presentations. We provide practical lessons on how to modify some commonly used objects like charts and tables and lay out the steps to take in preparing your final work. PowerPoint is used to connect with audiences in many fields so the skills provided by this course will prove invaluable to your career.","courseOutcomes":["Outline the process of setting up an...","Demonstrate how to create and save y...","Explain how to perform basic and adv...","Discuss how to add, delete and modif...","Outline the process of setting up and navigating the PowerPoint 2016 environment","Demonstrate how to create and save your presentations successfully","Explain how to perform basic and advanced text edits on your presentations","Discuss how to add, delete and modify slides on PowerPoint 2016","Highlight how to add and modify objects and graphical elements to your slides","Describe how to design effective tables and charts for your presentations","Explain how to apply transitions to your presentation","Lay out the process of exporting and presenting a slideshow successfully","Outline the process of setting up an...","Demonstrate how to create and save y...","Explain how to perform basic and adv...","Discuss how to add, delete and modif...","Outline the process of setting up and navigating the PowerPoint 2016 environment","Demonstrate how to create and save your presentations successfully","Explain how to perform basic and advanced text edits on your presentations","Discuss how to add, delete and modify slides on PowerPoint 2016","Highlight how to add and modify objects and graphical elements to your slides","Describe how to design effective tables and charts for your presentations","Explain how to apply transitions to your presentation","Lay out the process of exporting and presenting a slideshow successfully"],"courseDescription":"<p>This course on Microsoft PowerPoint 2016 is designed to help you make full use of the program’s features when preparing presentations. We begin with an introductory module that demonstrates how to set up PowerPoint for easy access and outlines some key areas of its environment and how to navigate it. The first section will also highlight some of the basic editing operations that can be performed in PowerPoint. Without formatting, the text in your presentation is bound to appear flat and we explain how to avoid that. The course discusses some of these processes and provides general rules for formatting text and other advanced editing operations. Graphical elements make your presentations more appealing and we show you how to add images and shapes to your slides.</p><p>The second section of this course will take you through the processes of modifying objects in PowerPoint. Handling numerical data in presentations is an important aspect of creating slides. If you are to present financial budgets, statistical data or any figure-dense presentation content, how would you compile such data into a presentation that will appeal to your audience? This section of the course will show you how to insert engaging and informative charts and tables to convey numerical data. Our final section covers the final steps of preparing your course for presentation by reviewing and exporting your PowerPoint slides.</p><p>Microsoft PowerPoint is one of the most powerful presentation tools on the market and is widely used to deliver almost any type of presentation that you can imagine. Its tools have been designed to let you develop and deliver textual, numerical, graphical and even audio-based presentations. That said, some of the program’s capabilities are still relatively unknown even to people that use it very often. This course has been designed to provide you with a fundamental understanding of the basic and advanced features of Microsoft PowerPoint, using the 2016 version as an example. You will be introduced to its tools, learn how to edit and add elements and master the processes of modifying objects like charts and tables. Lastly, you will be shown how to review your work, add transitions and animations and perform other finishing touches before exporting and presenting your work to an audience. The course is invaluable to both new and old users of PowerPoint as we cover both fundamental and advanced use of the program. Sign up to master this powerful tool and deliver compelling presentations.</p><a href=\"https://alison.com/resume/courses/4262\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4262\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Microsoft PowerPoint","description":"In this module, you will be introduced to Microsoft Powerpoint and learn some basic level processes that can be done with the tools available within. You will learn about text editing, working with themes and how to add graphical elements effectively to your presentation.","topics":["Learning Outcomes","Getting Started with Microsoft PowerPoint","Developing a PowerPoint Presentation","Performing Advanced Text Editing Operations","Adding Graphical Elements","Module Lesson Summary"]},{"name":"Module","details":"Modifying Your PowerPoint Presentation","description":"In this module, you will learn about some more advanced processes using the PowerPoint program. You will be shown how to modify objects in your presentations, as well as how to apply some finishing touches like transitions and spell checks to your final work.","topics":["Learning Outcomes","Modifying Objects in Your Presentation","Adding Tables to Your Presentation","Adding Charts to Your Presentation","Preparing to Deliver Your Presentation","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Learning Microsoft PowerPoint - Course Assessment"]}]}