{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3515","title":"Linux Disc Management","totalEnrolled":"875","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, study Linux disc configuration and management, a vital skill for system administrators.","description":"A system administrator's responsibilities include implementing, configuring, maintaining, monitoring and guaranteeing the successful operation of a computer system. This free online course is designed to teach you how to configure and manage Linux discs in a virtual environment to perform advanced storage tasks. Such skills include adding new discs, extending storage space, partitioning discs and organising these partitions into logical volumes.","courseOutcomes":["Identify the functions of Oracle Vir...","List the steps to install a Linux op...","Recall the Linux boot process...","Outline the steps to add and partiti...","Identify the functions of Oracle VirtualBox","List the steps to install a Linux operating system on your computer","Recall the Linux boot process","Outline the steps to add and partition discs on your Linux system","Describe the function of Logical Volume Management (LVM)","Explain the role of swap files","Discuss the importance of file system checks","Define ‘RAID’ on Linux systems","Identify the functions of Oracle Vir...","List the steps to install a Linux op...","Recall the Linux boot process...","Outline the steps to add and partiti...","Identify the functions of Oracle VirtualBox","List the steps to install a Linux operating system on your computer","Recall the Linux boot process","Outline the steps to add and partition discs on your Linux system","Describe the function of Logical Volume Management (LVM)","Explain the role of swap files","Discuss the importance of file system checks","Define ‘RAID’ on Linux systems"],"courseDescription":"<p>We live in the era of information. Computers are not a luxury anymore; they are a necessity. From small businesses to large corporations, from home entrepreneurs to Fortune 500 companies, we all need to store vital information. E-mails, invoices, contracts and other important documents not only need a secure place to be stored but also need to be protected. This is why many people and many big companies, such as MasterCard and E-Commerce, use a CentOS Linux operating system. Learn about the tasks of Linux disk management such as adding or removing storage devices, creating and deleting partitions and mounting partitions on appropriate directories. This operating system is very stable and provides more effective security features than the most popular operating systems, such as the ubiquitous Windows OS. It also has a longer release cycle, which means that the applications running on it do not need to be updated as often, saving on costs associated with the time it takes to develop new applications. This course is intended to help anyone interested in becoming a system administrator for Linux systems to determine how to configure and manage Linux discs, which is vital for system administrators.</p><p>After a short introduction, this course will explain how to download and install the CentOS Linux operating system on your Windows computer. Unless you have the resources to purchase a computer that runs strictly on Linux or already work for a company operating on a Linux platform, most students learn and practise on a virtual Linux operating system running on their laptop. This course will therefore explain how to use Oracle VirtualBox to create a virtual machine for you to practise on. Even if you already have Linux running on your computer, study the videos and learn something new. After installing Linux on your computer, you will acquire fundamental skills in disc management. Every system administrator needs to understand the boot process of an operating system to troubleshoot effectively. Study the Linux boot process steps and become familiar with Linux’ System Run Levels, a state of initialisation that defines what system services are operating, much like ‘safe mode’ in Windows.</p><p>At the core of the course, you will study how to create new discs, partition your discs and add or extend storage space on existing discs. Learn what command codes to use for partitioning discs with the Linux Command Interface or Terminal. Become familiar with Logical Volume Management (LVM), a unique Linux tool for working with large storage requirements. Study how to create new storage space and add new storage space to an existing volume group in LVM. Towards the end of the course, you will study the importance of swap space and add swap space to your system. Understand how to run system file checks using the file check commands and you will learn about RAID, a method of arranging discs for storage that allows you to automatically create backups of your data. Linux system administrators are in high demand. Further your career by taking this ‘Linux Disc Management’ course and take a step towards becoming an accomplished Linux system administrator.</p><a href=\"https://alison.com/resume/courses/3515\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3515\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Linux Disc Configuration and Management","description":"As a system administrator, configuring and managing computer systems is a vital role. This module will discuss different aspects of configuring and managing a Linux operating system, such as adding disc space and partitioning a disc.","topics":["Linux Disc Configuration and Management - Learning Outcomes","Linux Disc Management Course Introduction","Linux Disc Management - Lab Setup","Fundamentals of Linux Disc Management","Logical Volume Management (LVM)","Linux File System Check and RAID","Linux Disc Configuration and Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Linux Disc Management - Course Assessment"]}]}