{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3517","title":"Linux Network Administrator","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the protocols and components involved in Linux Network Administration.","description":"Linux Network Administrator is a free online course that will introduce you to the commands and protocols you will use in the corporate environment in your role as a network administrator or engineer. You will understand the essential components of a network and the tool used to download files and applications in Linux. Develop your Linux network administration expertise and skills by studying this fascinating course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you an IT professional in the corporate environment looking to become an expert at Linux Network Administration? This course will introduce you to the software and commands you will need to master to become a successful network administrator. Gain insight into the Oracle VirtualBox, a virtual environment that allows you to run multiple operating systems on the same hardware. You will use this software to create your first virtual machine and understand how to enable internet access to your virtual machine. The crucial elements of a network that you will need to understand will be clearly explained to you. Imagine being able to configure different network components that will enable your virtual machine to go online such as assigning an IP address, subnet mask and gateway. Discover the key network files and commands that you will use to configure your machine to communicate with other devices.</p><p>At first, you will be introduced to the importance of assigning an IP address to the system when you intend to bring it to a particular network and understand the different interface configurations in Linux. Discover the importance of the loopback device, a unique interface that your computer uses to communicate with itself. This device is primarily used for diagnostics and troubleshooting and to connect to servers running on the local machine. What is the purpose of Network Interface Bonding? This question is commonly asked in network administration interviews. Recognise that this is one of the most important components of a Linux network configuration as you study this course and you will be well prepared for your next interview. You will discover how to download files and applications from the internet in Linux without using a GUI using the \"wget\" tool.</p><p>The cull and ping commands will be taught next, which will be very helpful to you when troubleshooting system network-related issues. You will master the main commands used to transfer files from one computer to another. These are the file transfer protocol, secure copy protocol and remote synchronization. Use the Secure Copy Protocol to transfer computer files securely from a local to a remote host with added security and authentication. Remote synchronization is a utility for efficiently transferring and synchronizing files within the same computer or to a remote computer by comparing files’ modification times and sizes. Finally, you will study network time protocol, tracing network traffic, secure shell protocol, hostname and IP address lookup. This course will interest systems administrators or learners enthusiastic about learning about Linux Network Administration. Don’t wait any longer! Begin this course today and become an expert in Linux administration.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}