{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4635","title":"Machine Learning for Absolute Beginners - Data Visualization with Python","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn data visualization and analysis using Matplotlib and Seaborn Python libraries in this free online course.","description":"This online training course introduces the fundamental concepts and required syntax for creating data visualization diagrams and charts in Python. We will learn how to leverage Matplotlib and Seaborn Python libraries to create various charts, including bar, pie, heat-maps, histograms and many more. We will also discuss how to select the most relevant chart for the needed task and smartly adjust the parameters of each chart.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Data science is gaining momentum in various applications, becoming one of the most exciting fields used in high-tech industries. It is an interdisciplinary field that uses scientific methods, algorithms and visualization methods to extract knowledge and insights from data. As a result, a growing number of companies are looking for data scientists, data engineers and machine learning experts to develop products, features and projects that will help them unleash the power of data in practical data science projects.</p><p>Sometimes a picture is worth a thousand words or one might say ‘a chart is worth a thousand data points’. When handling and processing data, the first and most important step is to know your data in detail. Therefore, it is essential to apply an Exploratory Data Analysis (EDA) method across the available datasets by summarising their main characteristics using statistical and data visualization methods. Using this approach, we will be able to understand the features in the dataset. Check the fill-rate of relevant features for testing data quality, and understand each feature's scale and unit to decide if any normalisation or transformation actions will be needed. We will also test how they are correlated to each other to better select the most relevant features and identify data patterns that will be useful for the subsequent steps.</p><p>In Python, there are a variety of data science libraries being used for performing data visualization. This training will focus on two prevalent libraries called ‘Matplotlib’ and ‘Seaborn’. Using those libraries, we will be able to create various visualization charts, including bar charts, pie charts, tree-map charts, line and area charts, histograms, density curve charts and many more. We will learn to select the most relevant chart for the needed job and adjust each chart's parameters to get a pixel-perfect result for our project's needs. Enrol today and start your journey to become a data scientist!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}