{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3628","title":"Managing VMware vSphere 4 Hypervisors","totalEnrolled":"204","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online programming course covers managing, installing, and configuring VMware's vSphere 4 Hypervisor.","description":"This course explores advanced features of VMware’s version 4 of vSphere covering the appropriate use of ESX, ESXi, vCenter, and virtual machine monitoring. It also examines installations of servers and backups on VMware's vSphere 4. Learners who complete this course will be able to maintain hypervisors for other virtual machine types. Start learning about VM hypervisors today!","courseOutcomes":["Outline prerequisites for linked mod...","Discuss the processes of creating, e...","Define the workings and advantages o...","Analyze the various configuration co...","Outline prerequisites for linked mode groups covering DNS, vCenter servers, domains, installers, RPC, and time synchronization","Discuss the processes of creating, exporting, editing, applying, attaching, and checking compliance of host profiles","Define the workings and advantages of VMware's Site Recovery Manager together with the different applications it uses","Analyze the various configuration controls of high availability (HA) clusters covering both failures and successes during operations","Describe what happens to virtual machines and VMkernels at power-on","Identify performance benchmarks used in troubleshooting virtual machine performances","List the types of local hard drives that ESXi 4.0 servers can be installed on","Recall the applications of the vSphere Command Line Interface (vCLI)","Outline prerequisites for linked mod...","Discuss the processes of creating, e...","Define the workings and advantages o...","Analyze the various configuration co...","Outline prerequisites for linked mode groups covering DNS, vCenter servers, domains, installers, RPC, and time synchronization","Discuss the processes of creating, exporting, editing, applying, attaching, and checking compliance of host profiles","Define the workings and advantages of VMware's Site Recovery Manager together with the different applications it uses","Analyze the various configuration controls of high availability (HA) clusters covering both failures and successes during operations","Describe what happens to virtual machines and VMkernels at power-on","Identify performance benchmarks used in troubleshooting virtual machine performances","List the types of local hard drives that ESXi 4.0 servers can be installed on","Recall the applications of the vSphere Command Line Interface (vCLI)"],"courseDescription":"<p>VMware vSphere 4.0 has been continuously developed to cater for multiple servers and operating systems simultaneously with lots of complexities as required by end-users. It has also received continuous updates to use additional platforms as well as guest operating system support. VMware uses feedback from its community to sustain the development of vSphere 4.0 till its lifecycle’s end. This free online course describes aspects of these developments and more stand out features of vSphere 4.0. It also equips learners with basic to advanced features relevant to the use of required configurations for different classes of end-users and functionalities in organizations or companies adopting vSphere 4.0. Learners also study functionality included in the different releases of vSphere 4.0.</p><p>The modules are detailed with guides for installing VMware vSphere Hypervisor (ESXi). It also specializes in providing the best training for successfully managing, optimizing, and even updating tools required by typical vSphere Hypervisors. The course extensively describes the various terms relevant to virtual machine administrators covering consoles, user interfaces, servers, containers, packages, and guest operating systems along with their required hardware. The material also discusses useful details for correctly configuring hypervisors, including settings for IP addresses, NTP, and hostnames. You will go through the steps necessary for applying for licenses to register ESXi. Also, learners who successfully complete this course would be able to handle multiple instances of operating systems sharing a single host with multiple hardware resources.&nbsp;</p><p>All resources required for the correct functioning of VMware environments are analyzed to give virtualization administrators an in-depth understanding of the tools they work with. You will also understand system protocol for disaster recovery and backup of virtual machines. Sysadmins who work with multiple operating systems and servers will learn about the best ways for troubleshooting different issues that arise when using VMware vSphere 4 Hypervisors. You will get familiar with the appropriate measures entailed in the day-to-day management of virtual infrastructure carrying ESX and ESXi along with their respective required documentation. This course has been carefully designed to support the learning of non-IT students and employees exposed to virtualization systems. It will help them use the flexibility of virtual machines in different environments. Begin your learning journey in managing tools relevant to VMware vSphere 4.0 today!</p><a href=\"https://alison.com/resume/courses/3628\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3628\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Advanced ESX and vCenter Management","description":"In this module, you will learn about advanced aspects of managing VMware's ESX servers and vCenter for vSphere 4. You will also learn about best practices for virtual machine resources. You will also learn about patches, upgrades, and migration of ESX.","topics":["Advanced ESX and vCenter Management - Learning Outcomes","Configuring VMotion","Storage VMotion","Distributed Resource Scheduler (DRS) Clusters","Resource Pools and Monitoring","vNetwork Distributed Switches","Host Profiles","Linked Mode vCenter Servers","Patching ESX Server","Patching With Update Manager","Upgrades and Migration","Introduction to SQL Server 2016 - Lesson Summary","Advanced ESX and vCenter Management - Assessment"]},{"name":"Module","details":"Disaster Recovery and Backup","description":"In this module, you will learn about correctly backing up virtual machine data and appropriately recovering them even in the events of disasters. You will also learn about concepts surrounding High Availability (HA) and different fault tolerances for virtual machines.","topics":["Disaster Recovery and Backup - Learning Outcomes","Site Recovery Manager (SRM)","High Availability (HA)","High Availability (HA) in Action","VM Fault Tolerance","Microsoft Clustering","Backup Strategies","Using VCB Command-Line Utilities","VMware Data Recovery","Third Party Backups","Disaster Recovery and Backup - Lesson Summary","Disaster Recovery and Backup - Assessment"]},{"name":"Module","details":"Server and VM Monitoring","description":"In this module, you will learn about monitoring different virtual machines and their servers together with their various log outputs from usual operations. You will also learn about various tools for virtual machine optimization and utilization on VMware.","topics":["Server and VM Monitoring - Learning Outcomes","Tools for Optimization","CPU and Memory Utilization","VM Performance Monitoring","Configuring Alarms","ESX and vCenter Logs","Files and Data Log Dump","Server and VM Monitoring - Lesson Summary","Server and VM Monitoring - Assessment"]},{"name":"Module","details":"Installing and Configuring ESXi","description":"In this module, you will learn about important processes involved in installing and configuring ESXi 4.0 for VMware. You will also learn about packages used alongside ESXi covering the vSphere Command Line Interface (vCLI) and the vSpehere Client (VIC).","topics":["Installing and Configuring ESXi - Learning Outcomes","ESXi Overview","ESXi Installation","ESXi Management","Installing and Configuring ESXi - Lesson Summary","Installing and Configuring ESXi Module - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Managing VMware vSphere 4 Hypervisors - Course Assessment"]}]}