{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3455","title":"Marketing Analytics: Customer Value and Promotion Strategy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how to calculate Customer Lifetime Value and sensitivity analysis for your business in this free online course.","description":"Your sales team strives to acquire new customers continually. Do you know what value they will bring to your business in the long-run? Vital business decisions such as product pricing, acquisition cost, and marketing budget should be based on customer lifetime value. How do businesses determine this value? This course teaches you different techniques of customer valuation and sensitivity analysis using Microsoft Excel.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>An effective marketing strategy to acquire and retain customers is vital to any business. On what do you base this strategy? Do you know how much your customers are worth to your company? If you are a marketing manager or business owner, you would understand that your sales and marketing budget should be based on the revenue that your customers will ultimately generate. However, given the market uncertainties, competition, and other factors, it is not easy to predict this value. Nothing can be worse than an arbitrary budget based solely on your capacity to spend at present, not knowing the current value of future cash flows. Modern businesses, therefore, rely on customer valuation using data analytics to base their business decisions on. Are you one of those who make intelligent and informed decisions on how to spend money on your business? Then this course is for you.</p><p>This course teaches you to calculate your Customer’s Lifetime Value (CLV) under varying market conditions and customer scenarios, using simple Excel techniques. You will begin by understanding concepts such as Net Present Value (NPV), Discounted Cash Flow (DCF), and Customer Churn, which are valuable indicators of the health of your business. Using these concepts, you will learn how to predict the lifetime value of a set of customers and how this value helps evaluate the effectiveness of your marketing strategy. You will then learn to take up various uncertain conditions and create a customer lifetime valuation model using Monte Carlo simulation. This model will enable you to estimate a range of outcomes for your marketing decisions. You will learn how to use Excel functionalities to create these models and simulations to get the best results. Going forward, you will be able to create your own Excel templates and tools using these techniques. You will also learn practical applications of these methods through business case examples and some examples in this marketing course have been taken from the book Marketing Analytics: Data-Driven Techniques with Microsoft Excel [Winston, Wayne L.]. This book can serve as good reference material and supplemental reading as well.</p><p>In the past, analysts often used mathematical techniques and formulas to calculate CLV and NPV. Now, with a large number of customers and a wide range of uncertainties, it becomes tedious and inaccurate. With the availability of software, it has become easier to use advanced models to predict customer behaviour and increase the company’s profitability. However, you need to know which parameters to consider for simulation and modelling. After completing this course, you will be able to confidently create, incorporate and discuss customer value models used by organizations worldwide. You don’t need any prior knowledge of advanced mathematics or computational skills. All you need are a PC with Excel installed, and basic knowledge of how to open and save Excel files. If you are a marketing professional or entrepreneur, this short course will prove invaluable for you. Enrol now, and within just a couple of hours you can become proficient in using data-driven techniques for business decisions.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}