{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4196","title":"Master the Fundamentals for Google Ads","totalEnrolled":"9,649","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to quickly set up a profitable and professional Google Ads campaign with this free online course.","description":"This free online course will help you to quickly and correctly set up a Google Ads account with the least cost in maintenance fees. The method achieves this by going over each critical element in a step by step procedure and highlights which configuration settings are irrelevant or may cost you more than its financial return. You will also learn to identify, sort and rephrase keywords that will attract the most clients to your business.","courseOutcomes":["Define the terms keyword, ad group a...","Recognise and explain the acronyms C...","Explain how to set up a dynamic sear...","Select a suitable target audience...","Define the terms keyword, ad group and broad match","Recognise and explain the acronyms CTR and CPA","Explain how to set up a dynamic search campaign","Select a suitable target audience","Recall the process to set up a remarketing display campaign","Identify the steps used in conversion tracking","Compare the advantages and disadvantages of the remarketing display campaign","State the importance of a standard keyword campaign","Outline the method to select an appropriate bidding strategy","Explain the relevance of your ad to its landing page","Select a suitable campaign budget","Indicate the process of adding an extension","Describe the use of Google Analytics","Select the most relevant keywords in a keyword list using Excel","Summarise the importance of an Adwords Editor","Define the terms keyword, ad group a...","Recognise and explain the acronyms C...","Explain how to set up a dynamic sear...","Select a suitable target audience...","Define the terms keyword, ad group and broad match","Recognise and explain the acronyms CTR and CPA","Explain how to set up a dynamic search campaign","Select a suitable target audience","Recall the process to set up a remarketing display campaign","Identify the steps used in conversion tracking","Compare the advantages and disadvantages of the remarketing display campaign","State the importance of a standard keyword campaign","Outline the method to select an appropriate bidding strategy","Explain the relevance of your ad to its landing page","Select a suitable campaign budget","Indicate the process of adding an extension","Describe the use of Google Analytics","Select the most relevant keywords in a keyword list using Excel","Summarise the importance of an Adwords Editor"],"courseDescription":"<p>This course will help you master Google Ads fundamentals in the shortest time by revealing Google’s formula to rank its keywords. The course will give you a step by step guide on setting up a Google Ads account using your business email and then highlights which settings you should enable and which to disable. We will set up a dynamics ads campaign showing you how to easily target your audience by their location and remove particular audiences using a negative audience list. Your campaign will receive a boost by adding extensions such as site links, callouts and location information. The course will demonstrate how to monitor your conversion rate through Google analytics with a seamless and easy connection to your Ads campaign. We will discuss various strategies to improve the conversion success rate of your campaigns and the appropriate time frame to monitor a campaign before it is safe to remove it. We will also give an overview of how to navigate an Adwords editor.</p><p>Google AdWords is an internet advertising platform that provides advertisers with the opportunity to display their ads on a Google search page. As a result of keywords that the advertisers want to target, companies pay to have their ads put at the top of the search page. The platform runs on an advertising model where you only pay when a visitor clicks your ad. The Advertising marketplace uses an auction-like system where people bid for customer clicks. Apart from the bid amount, Google also uses the advertiser's quality score to guarantee the client is clicking on adverts that give a superior user experience. The auction system is centred on keywords or phrases chosen from a list of keywords relevant to the advertiser’s business offerings and derived from words that customers are most likely to use to search for their product. Each advertiser bids on these keywords and are only limited by the amount they are prepared to pay for a user to click on their ad.</p><p>This course is perfect for newcomers to Google AdWords or beginners with e-commerce campaigns and Google Analytics. You will feel more confident to set budgets, select keywords and know when to increase or decrease bids for certain words. Sign up is free and there are no subscription fees so you can start boosting your digital marketing and PPC knowledge right now.</p><a href=\"https://alison.com/resume/courses/4196\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4196\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Basics of Google Ads","description":"In this module, you will learn how to set up a Google Ads account quickly and add callout and location extensions. We will also introduce you to the best strategy to target the right audience through an Ads campaign.","topics":["The Basics of Google Ads - Learning Outcomes","Getting Started","Dynamic Search Campaign","Dynamic Ad Targets","Adding Extensions","The Basics of Google Ads - Lesson Summary"]},{"name":"Module","details":"Conversion Tracking and Keyword Campaign","description":"This module will teach you how to connect to Google Analytics to monitor your conversion rate easily. We will also introduce you to Adword editor and its significance to search keywords.","topics":["Conversion Tracking and Keyword Campaign - Learning Outcomes","Google Analytics","Remarketing Lists","Setting up Conversions","Keyword Campaign Introduction","Adwords Editor","Conversion Tracking and Keyword Campaign - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Master the Fundamentals for Google Ads - Course Assessment"]}]}