{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4195","title":"Master the Flexbox Model for Websites","totalEnrolled":"311","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, you will learn to use Flexbox to create responsive websites with less coding, easily.","description":"Learn about Flexbox, an efficient solution to your problem of making your websites responsive. You will see how to use simple Flexbox properties in your code to create beautiful sites. The course demonstrates these techniques by taking you through creating a website from scratch, including all its component elements. Troubleshooting tips are also provided to make the site look good on all devices.","courseOutcomes":["Explain the features and advantages ...","List the flex properties used in cre...","State the benefits of using CSS vari...","Identify the files needed to set up ...","Explain the features and advantages of Flexbox","List the flex properties used in creating a website design","State the benefits of using CSS variables","Identify the files needed to set up a website-building project","Define a Flexbox container","Explain the advantages of using SVG icons in website design","Explain how Flexbox makes a webpage responsive","Discuss the various Flexbox properties you can use to make the webpage attractive on all devices","Explain the features and advantages ...","List the flex properties used in cre...","State the benefits of using CSS vari...","Identify the files needed to set up ...","Explain the features and advantages of Flexbox","List the flex properties used in creating a website design","State the benefits of using CSS variables","Identify the files needed to set up a website-building project","Define a Flexbox container","Explain the advantages of using SVG icons in website design","Explain how Flexbox makes a webpage responsive","Discuss the various Flexbox properties you can use to make the webpage attractive on all devices"],"courseDescription":"<p>Flexbox (flexible box) makes it easy to design and create responsive website structures without using floats or positioning. This course will teach you all about Flexbox, its properties and applications in responsive website building. You will learn it practically by building an interactive webpage - simply follow the steps demonstrated in the course to replicate the page on your computer. The starter code and other materials you may need during the process will be provided..</p><p>To begin, you will learn how to define a flex container and then master the flex properties such as flex-direction, justify-content, align-items and flex-wrap. Simple examples will help you achieve this quickly. You will then be ready to start work on ‘Project Whizzbizz’, which involves creating an interactive and responsive webpage. First, you will make the header section. Then, you will design the main body including parts such as ‘Our Services’, ‘Meet our Team’, ‘Testimonials’, ‘Contact us’, and the footer section. You will use multiple Flexbox properties and understand their correct applications by the end of this section. As a bonus, you will learn to create animated buttons with a hover effect, an image gallery with a masonry layout, an interactive image carousel with radio buttons, and interactive carousel arrows using JavaScript. You will also get valuable tips on downloading and using SVG icons and waves, and using the correct browsers and required Flexbox prefixes for your projects. Finally, you will learn how to look for problems in your page's layout on different devices and make it look good on all of them.</p><p>Non-responsive pages are fast becoming a thing of the past. With the increased use of smartphones, tablets and other devices, it is imperative that you make all of your designs look good and interactive on screens of any size or dimension. If you are a UX/UI designer working in HTML, CSS, JavaScript etc you will find this course invaluable. You can build your webpages and applications much faster and make them responsive too. The opportunity to create a webpage from scratch, with multiple and varied interactive elements, makes this course unique and easy to understand. Why wait any longer? Start learning now and master Flexbox within a few hours! And don’t forget to download the starter kit and other resources from the ‘Resources’ section of this course. Good luck!</p><a href=\"https://alison.com/resume/courses/4195\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4195\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started with Flexbox","description":"In this module, you will discover the magic of Flexbox. You will learn about its properties and benefits and how to use them to your advantage in building a website. Finally, you will start working on a website building project and complete the header section.","topics":["Getting Started with Flexbox - Learning Outcomes","Introduction to Flexbox","Project BizzWhizz","The Header Section","Getting Started with Flexbox - Lesson Summary"]},{"name":"Module","details":"Building the Body of a Website","description":"In this module, you will see how flexbox makes it easy to build complex interactions and attractive effects in the main body of a website. This includes a section with blocks for various services, an area with a slider function, and an image gallery.","topics":["Building the Body of a Website - Learning Outcomes","Creating the Services Section","Working with Images","Creating a Testimonial Carousel","Carousel Arrows","Building the Body of a Website - Lesson Summary"]},{"name":"Module","details":"Finishing Up With Flexbox","description":"In this module, you will create the bottom sections of the web page, including the 'Contact us'' and the CTA. You will also learn several tricks to make your page perfectly responsive and show up exactly the way you want it on any device.","topics":["Finishing Up With Flexbox - Learning Outcomes","Creating the Contact Section","The CTA and the Footer","Making the Page Responsive","Finishing Up With Flexbox - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Master the Flexbox Model for Websites - Course Assessment"]}]}