{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5329","title":"Master AutoCAD 2023 in 2 Dimensions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to draw and modify objects in 2 dimensions in AutoCAD 2023 with this free online computer-aided design course.","description":"AutoCAD is one of the most famous computer-aided design software, particularly useful for engineers and designers. This course will cover drawing, modifying, and editing objects in two dimensions, making this course a valuable resource for beginners and experienced users. We work through the text, block, and dimension commands and explore the use of layers. Finally, printing from the model and layout is presented.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>AutoCAD is an essential component in the engineering and construction fields. It is used worldwide by engineers, architects, and designers. In this course, you will learn to use the ribbon and the keyboard to access the various commands in AutoCAD 2023. We will guide you through the main settings, such as units and limits, and teach you basic drawing commands like lines, polylines, and circles. We explain the hatch, divide, and measure commands in detail before exploring the basic modifying commands such as rotate, mirror, and offset.</p><p>Next, the course will highlight the basic text commands and text styles. You will learn to create and edit layers and realise that changing the layer status will boost performance. This course will instruct you on the dimension style manager and linear, radius and baseline dimensions. But what happens when we want to save parts of the drawing and recall them when we need them? We will delve into the blocks and how to create, edit and save them in the current drawing or to the hard disk.</p><p>The last part presents commands such as the linetype and match properties. Finally, the course will teach you to print from the model and the layout. This free online course has many short videos that provide information and questions to assist your learning. If you are an engineer, designer, or architect who wants to learn AutoCAD or a competent user who wants to understand the latest version and review some topics, this course is for you. So why wait? Enrol today and become an expert on AutoCAD.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}