{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4288","title":"Master Unity from Zero - Foundations","totalEnrolled":"1,001","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A practical, easy step-by-step free online course to get you started with Unity and create your first game in no time.","description":"This course is an introduction to Unity; it takes the learner from knowing nothing to good levels of familiarity and proficiency with its interface and core components. It is relevant for hobbyists who are looking to get started with Unity and game development easily. It is also perfect for parents looking to introduce their children to programming painlessly, or teachers looking for a complete and clear resource on developing computer games.","courseOutcomes":["Explain the process of launching Uni...","Identify where Unity is installed on...","Recognize the features that you need...","Explain how Unity hub can be used to...","Explain the process of launching Unity","Identify where Unity is installed on your computer","Recognize the features that you need to create 2D and 3D environments for your games","Explain how Unity hub can be used to install and run several versions of Unity","Create and navigate through realistic 3D indoor and outdoor environments","Create a 3D Maze with lights, walls and textures","Discuss and use ProBuilder to create a house","Create an island with trees, sandy beaches, mountains and water","Illustrate the method to include and control a car and a plane","Explain the process of launching Uni...","Identify where Unity is installed on...","Recognize the features that you need...","Explain how Unity hub can be used to...","Explain the process of launching Unity","Identify where Unity is installed on your computer","Recognize the features that you need to create 2D and 3D environments for your games","Explain how Unity hub can be used to install and run several versions of Unity","Create and navigate through realistic 3D indoor and outdoor environments","Create a 3D Maze with lights, walls and textures","Discuss and use ProBuilder to create a house","Create an island with trees, sandy beaches, mountains and water","Illustrate the method to include and control a car and a plane"],"courseDescription":"<p>With this free online course, get started with Unity and enjoy your game development journey without any frustration. It includes six sections that painlessly guide you through the necessary skills to master Unity's interface, use its core features, and create and navigate through realistic 3D environments. It assumes no prior knowledge on your part and ensures that you have all the information and explanations required every step of the way. All instructions are step-by-step using a format that is easy to follow. During the course you will learn to create indoor and outdoor environments, adding and controlling vehicles, and understand Unity's interface.</p><p>After completing this course, you will be able to master the features needed to create 3D environments for your games, quickly create and navigate through realistic 3D indoors and outdoors environments. Furthermore you will be able to create a 3D Maze with lights, walls and textures, and an island with trees, sandy beaches, mountains and water. You will also learn to control a car and a plane and export your games to the Web.</p><p>This course is the perfect place for people who want to get started with Unity and understand game development easily. It can act as a stepping stone for parents who are looking for a way to introduce their children to game programming in a simple way, for teachers looking for a comprehensive resource on programming through the creation of games or for aspiring indie game developers. So what are you waiting for: enroll now to begin your game development journey!</p><a href=\"https://alison.com/resume/courses/4288\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4288\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Master Unity (Foundations)","description":"In this module you will learn to install and become familiar with Unity, its interface and shortcuts. Furthermore you will add first-and third-person controllers, as well as vehicles and use them to navigate through a maze and and a realistic island that you will create yourself using a combination of built-in shapes and standard assets.","topics":["Master Unity (Foundations) - Learning Outcomes","Part 1: Introduction and Becoming Familiar With the Interface","Part 2: Creating and Manipulating Built-In Objects","Part 3: Managing Your Assets","Part 4: Creating Indoors Environments","Part 5: Creating Outdoors Environments","Master Unity (Foundations) - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Master Unity from Zero - Foundations - Course Assessment"]}]}