{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4015","title":"Mastering Data Analysis using Microsoft Excel: Formulas and Pivot Tables","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to develop and apply formulas and perform useful data analysis with this free online Microsoft Excel training.","description":"Did you know that Excel has become a prerequisite for almost all jobs in the analytics and consulting sector? Through this free online Microsoft Excel certification, you will gain the in-demand skills to generate and use lookup, conditional, and advanced Excel formulas and functions to conduct complex calculations, build professional reports as well as perform the data analysis and visualization of Excel tools, pivot tables and pivot charts.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you tired of feeling like you are walking into a brick wall every time you try to organize and analyze spreadsheets in Microsoft Excel? In this Microsoft Excel tutorial, discover how to use the essential Excel formulae to execute all your work automatically, rather than screen the hundreds of cells on your desk using a calculator. You will learn how to use LOOKUP functions to look up information in a row or column and formulae and functions like SUMIF and COUNTIF to do conditional calculations.</p><p>After that, you will experiment with a variety of new Excel features and learn how to use UNIQUE and FILTER functions to return a list of unique values in a list and filter a range of data based on the criteria you define. The next section discusses that applying the TEXTJOIN and LET functions leads to adding given text values and controlling the delimiters and calculations within a formula.</p><p>This Microsoft Excel course then delves into the benefits of using Named Ranges, such as making formulas easier to enter and debug and generating variable-size ranges to make your spreadsheet dynamic and easy to update. The final part of the course will teach you how to use pivot tables and charts and the techniques needed to combine these two capabilities to perform in-depth numerical analysis, query enormous volumes of data in a variety of user-friendly ways, and add data visualizations. Enrolling in this Microsoft Excel training course will teach you the technical expertise and practical application of a range of important and useful functions in order to master the software so you can become an Excel power user to apply in your data, analytics, technical, administration or finance career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}