{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1683","title":"Media Studies - Gaming, the Internet and Social Media","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Do gaming, the Internet and social media affect society? This course looks at the pros and cons of each on our culture.","description":"Look into the history and evolution of electronic games, the Internet and social media to see both the positive - educational uses - and negative effects - such as video game addiction - of these developments on the wider culture and society. You will also learn about net neutrality, how to identify credible online courses and the so-called Internet Paradox.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course starts by explaining the important innovations that have driven the acceptance of video games. You will study the developments that influenced the evolution of video games and identify the effect of electronic games on culture. Look into gaming culture, the ways video games affected other forms of media, and how video games can be used for educational purposes. The course also covers the effects of video game addiction and other controversial issues related to modern gaming.</p><p>Next, examine the technologies that made the Internet accessible, and study the causes and effects of the dot-com implosion and market crash. The material then discusses the pros and cons of blogs on the distribution of information and the ways privacy is being addressed on the Internet. You will also study the Internet Paradox, the information superhighway as it relates to the Internet, and the different ways to identify credible sources online. Finally, the course will teach you about net neutrality.</p><p>The aesthetics and principles of gaming culture and social media have had a massive impact on mainstream culture. This has led to the gradual acceptance of marginalized social groups, increased comfort with virtual worlds, and the pursuit of new means of interaction. This free Media Studies course on gaming, the World Wide Web and social media will give you a much stronger understanding of how the Internet has made pop culture transmission a two-way street and how virtual worlds have been creating new social spaces.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}