{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2269","title":"Microsoft Excel 2019 Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn Microsoft Excel 2019 and conquer your spreadsheet demons with this free online Excel video course.","description":"This free online Microsoft Excel 2019 course is perfect for those brand new to Excel and who are using Excel 2019 or Excel 365 editions. You'll learn everything from how to create basic formulas in Excel, to how to print the correct part of your spreadsheet! In this course, your expert author gives you a solid grounding in the basics of Excel and guides you towards becoming more confident with spreadsheets.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Microsoft Excel remains the go-to spreadsheet software for millions of people around the world.&nbsp;If you've been meaning to learn Excel for years but haven't quite got around to it, or if you use Excel every day but feel lost when you log in, then this course is for you.</p><p>The course begins by introducing you to entering numbers and text into Excel, create basic formulas and how relative references and Order of Operations works. You will then learn how to work with larger Excel files and utilize split-screen and freeze panes, as well as how to insert headers and Footers in Excel. The course also teaches you how to add rows and columns and change column widths, how to use copy, cut and paste to save time, and how to print the correct part of your spreadsheet!</p><p>Simon Sez IT has been helping students master Excel for more than ten years. With a simple to follow approach and instructors that explain everything thoroughly, you can rest assured you are in safe hands.&nbsp;This course was recorded using Excel 2019 but is suitable for Excel 2013, 2016, and 365 users. Start this course today and you will gain a solid grounding in the basics of Excel 2019, and become more confident with spreadsheets.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}