{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1268","title":"Microsoft Excel 2010 - Revised 2017","totalEnrolled":"164,087","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Work with spreadsheets more efficiently and effectively with this free online Microsoft Excel 2010 tutorial course.","description":"This course provides a thorough understanding of Microsoft Excel 2010 and its most important applications. Excel remains one of the world’s most popular software applications and is a key tool used in most workplaces. Whether you are a beginner or an intermediate user, this course teaches you tips and tricks, like hotkeys and other shortcuts, to quickly boost your productivity and career so sign up to get ahead of the competition.","courseOutcomes":["Navigate Excel's menus...","List its 2010 improvements and new f...","Explain how to create a worksheet an...","Work with formulas and functions...","Navigate Excel's menus","List its 2010 improvements and new features","Explain how to create a worksheet and save, prepare for printing and apply templates to it","Work with formulas and functions","Use ‘VLOOKUP’ to search through the data in the spreadsheet","Identify patterns and trends with conditional formatting, sparklines and charts","Apply a table to data","Check conditions with the ‘IF’ function","Describe the ‘save’ and ‘run’ macros","Calculate dates using formulas","Work more efficiently with keyboard shortcuts","Navigate Excel's menus...","List its 2010 improvements and new f...","Explain how to create a worksheet an...","Work with formulas and functions...","Navigate Excel's menus","List its 2010 improvements and new features","Explain how to create a worksheet and save, prepare for printing and apply templates to it","Work with formulas and functions","Use ‘VLOOKUP’ to search through the data in the spreadsheet","Identify patterns and trends with conditional formatting, sparklines and charts","Apply a table to data","Check conditions with the ‘IF’ function","Describe the ‘save’ and ‘run’ macros","Calculate dates using formulas","Work more efficiently with keyboard shortcuts"],"courseDescription":"<p>This course teaches you how to make full use of the revised 2010 version of Microsoft Excel. We explore the program’s menus and examine the different tasks it can perform. We present practical exercises and sample spreadsheets to show you how Excel handles basic math while we add and delete columns and rows and prepare the worksheet for printing. We demonstrate how to visually represent data to indicate trends, patterns and comparisons across charts, tables or other templates.</p><p>Excel 2010 boasts many improvements and new features. It can automatically perform calculations once you add in the formula, which makes it a great tool for analyzing data in accounts, budgets, billings and many other areas. This course explains how to work with formulas and functions before covering the use of ‘VLOOKUP’ to search through a spreadsheet’s data. We also lay out the steps required to calculate dates using formulas and check conditions with the ‘IF’ function before we describe the ‘save’ and ‘run’ macros.</p><p>You can use Microsoft Excel 2010 to keep track of almost any data, from work schedules to stocks and beyond. The program is a vital business budgeting tool and is employed worldwide by a range of industries. Every office has its ‘Excel experts’ who stand apart from their peers so sign up for this training course to become one of them.</p><a href=\"https://alison.com/resume/courses/1268\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1268\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Making the switch to Excel 2010","description":"This module will teach you about switching from and older versions of Microsoft Excel to Excel 2010","topics":["Making the switch to Excel 2010 Learning Outcomes","Making the switch to Excel 2010","Work with files in the Backstage view","Do the basics on the home tab","Math, Anywhere","Commands when you need them","Keyboard shortcuts","Keep your favorite buttons visible","Work between new and old Excel versions","Making the switch to Excel 2010 Lesson Summary"]},{"name":"Module","details":"What's new in Excel 2010","description":"There are many new and improved features in this version of Excel. This module will show you these changes that will allow you to be more productive.","topics":["What's new in Excel 2010 Learning Outcomes","Access the right tools, at the right time","Backstage view in Excel 2010","Access workbooks in new ways","Make fast, effective comparisons from lists of data","Introduction to Sparklines","Obtain powerful analysis from your desktop","Changes made to functions","Create an Excel table","Create workbooks with more visual impact","Paste with live preview","Collaborate on workbooks in new ways","Collaborate on a worksheet in the browser","Find and fix accessibility issues","Extend workbooks in new ways","What's new in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Basic Tasks in Excel 2010","description":"This module will help you get set up and started using Excel. These simple step by step instructions will guide you through creating and saving a workbook and show you how to complete basic tasks.","topics":["Basic Tasks in Excel 2010 Learning Outcomes","What is Excel?","Create, save, print, and apply templates to a workbook","Format numbers in a worksheet","Create an Excel table, formula and chart your data","Filter and sort your data","Basic Tasks in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Create your first spreadsheet","description":"This module will get you started working on a spreadsheet, doing basic math, add and delete columns and rows and prepare the worksheet for printing.","topics":["Create your first spreadsheet Learning Outcomes","Meet the Excel spreadsheet","Do basic math in Excel","Create column titles","Let Excel type for you","Get more(or less) columns, rows, spreadsheets","Keep column titles in sight as you scroll","Prepare to print","Create your first spreadsheet Lesson Summary"]},{"name":"Module","details":"Create Formulas","description":"This module explains that when working with formulas the results automatically update when values are changed and also how to use functions which are more complicated formulas.","topics":["Create Formulas Learning Outcomes","Formulas in Excel","Cell references in formulas","The SUM and AVERAGE functions","More about cell references and formulas","More about functions","Create Formulas Lesson Summary"]},{"name":"Module","details":"VLOOKUP - What it is and when to use it","description":"You will be introduced to VLOOKUP in this module; it is used to look up a value to find corresponding data on the same row.","topics":["VLOOKUP - What it is and when to use it Learning Outcomes","What is VLOOKUP","How, and when to use VLOOKUP","Using more than one spreadsheet with VLOOKUP","Using absolute cell references with VLOOKUP","Avoiding VLOOKUP errors","VLOOKUP - What it is and when to use it Lesson Summary"]},{"name":"Module","details":"Understand Data at a glance with Conditional Formatting","description":"This module explains how to use conditional formatting to make your data stand out, this helps you to analyse data and to determine patterns and trends.","topics":["Understand Data at a glance with Conditional Formatting Learning Outcomes","Format cells to make data stand out","Quick formatting","Work with rules","Make your own rules","Understand Data at a glance with Conditional Formatting Lesson Summary"]},{"name":"Module","details":"Sparklines - Use tiny charts to show data trends","description":"Here you will be shown Sparklines which are tiny charts that fit into a spreadsheet cell, these give a visual representation of your data to help spot patterns and trends.","topics":["Sparklines - Use tiny charts to show data trends Learning Outcomes","Introduction to Sparklines","Line sparklines","Column sparklines","Win, Loss sparklines","Sparklines - Use tiny charts to show data trends Lesson Summary"]},{"name":"Module","details":"Use Excel tables to manage information","description":"In this module you will learn to apply tables in Excel, their used to store related information to make it easier to format, sort and total your data.","topics":["Use Excel tables to manage information Learning Outcomes","Introduction to tables","Sort, filter, and remove duplicates","Using formulas in tables","More about formulas","Use Excel tables to manage information Lesson Summary"]},{"name":"Module","details":"The IF Function - What it is and how to use it","description":"In this module you will learn about the IF function, this checks if a condition you specify is true or false and it executes a reaction depending on the result.","topics":["The IF Function - What it is and how to use it Learning Outcomes","Introduction to the IF function","Add or multiply IF results","Using more than one IF function","The IF Function - What it is and how to use it Lesson Summary"]},{"name":"Module","details":"How to create a basic chart in Excel 2010","description":"There are many different charts in Excel for representing different data visually to show comparisons, patterns and trends.","topics":["How to create a basic chart in Excel 2010 Learning Outcomes","Introduction to charts","How spreadsheet data appears in a chart","Change the chart view","Add chart titles","Change the look of your chart","Make a pie chart","More chart types","How to create a basic chart in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Save time by creating and running macros in Excel 2010","description":"You will be shown how to save and execute a macro in this module, macros are used to record a set of instructions you do all the time to use whenever you want.","topics":["Save time by creating and running macros in Excel 2010 Learning Outcomes","Create and run macros","Edit an existing macro to change what it does","Save my macro in the Personal Workbook","Assign a button to my macro","Save time by creating and running macros in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Figure out dates by using formulas in Excel 2010","description":"This module explains how dates are stored in Excel for using in formulas to get the number of days between two dates.","topics":["Figure out dates by using formulas in Excel 2010 Learning Outcomes","Dates and formulas","Find the number of days between two dates","Find the number of workdays between two dates","Find the date that falls after a number of workdays","Find the date that falls after a number of months","Find the date that falls after a year, months, and days","Figure out dates by using formulas in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Plan payments and savings in Excel 2010","description":"You will be shown in this module how to use more complex formulas for figuring out mortgage repayments and calculating the accumulative interest on your savings.","topics":["Plan payments and savings in Excel 2010 Learning Outcomes","Calculate credit cart debt","Figure out mortgage payments","Calculate vacation savings","How a first deposit affects savings","Figure out a down payment","Paying off a personal loan","How much your saving add up to over time","Plan payments and savings in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Keyboard shortcuts in Excel 2010","description":"In this module you will learn how to use CTRL key shortcuts and ALT key shortcuts to gain a quicker workflow.","topics":["Keyboard shortcuts in Excel 2010 Learning Outcomes","Introduction to keyboard shortcuts","Basic keyboard shortcuts","Keyboard shortcuts for formulas","Keyboard shortcuts for moving around workbooks","Keyboard shortcuts for selecting","Keyboard shortcuts for adding and inserting","Keyboard shortcuts for formatting","Introduction to access keys","Access keys from previous versions","Access keys in dialog boxes","Other kinds of access key","Keyboard shortcuts in Excel 2010 Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microsoft Excel 2010 - Course Assessment"]}]}