{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4019","title":"Microsoft Access Masterclass","totalEnrolled":"1,754","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the principles for the creation and proficient use of databases with Microsoft Access in this free online course.","description":"Databases are an important part of the information landscape and this free online Microsoft Access tutorial will show you how to proficiently leverage data with the use of Microsoft Access. You will learn how to design and build tables, forms, reports, controls and queries that work efficiently, access macros and program control structures in Visual Basic for Applications (VBA) as well as fix Excel data import errors.","courseOutcomes":["Explain how to navigate a table and ...","Summarize how to create tables...","Define reports and queries...","Explain how reports, controls and qu...","Explain how to navigate a table and edit records","Summarize how to create tables","Define reports and queries","Explain how reports, controls and queries are created and used","Define what forms are and explain how to create them","Discuss how coding and spreadsheet experts can better understand Microsoft Access","Describe how the importing of Excel into Microsoft Access is done","Outline the rules of normalized tables","Categorize relationships in Microsoft Access","Analyze Control Structures","Discuss the process of creation and use of macros","Explain how to navigate a table and ...","Summarize how to create tables...","Define reports and queries...","Explain how reports, controls and qu...","Explain how to navigate a table and edit records","Summarize how to create tables","Define reports and queries","Explain how reports, controls and queries are created and used","Define what forms are and explain how to create them","Discuss how coding and spreadsheet experts can better understand Microsoft Access","Describe how the importing of Excel into Microsoft Access is done","Outline the rules of normalized tables","Categorize relationships in Microsoft Access","Analyze Control Structures","Discuss the process of creation and use of macros"],"courseDescription":"<p>Today we live in an age that has been aptly dubbed the computer, information or digital age. The world economy is largely powered by information that is exchanged at unprecedented speeds and volumes and these metrics are increasing at an exponential rate almost daily. All of this information ultimately sits on some kind of database. Database tools are diverse and varied, catering to different types of users for whom they were created or who found them useful and have adopted them. Microsoft Access is one such database application that has evolved into a leader in the field over time. In this free online Microsoft Access training, you will be exploring this interesting tool extensively. You will be shown how to navigate and work with existing database structures as well as the fundamentals of editing records and the sorting of information by following all database management principles.</p><p>The understanding of tweaking field properties like size, format, input masks, default values and validation rules can give you a good start at creating tables professionally. You will learn the functions of the 'zero-length text fields' and 'look-ups' as well as how to move fields and add fields in the design view. Reports can simply be defined as outputs from our tables and in light of this, you will be introduced to reports and report wizards. In addition, this Access database tutorial will illustrate how to move, resize and align data in reports. You will also learn what controls are, the different types you can use in Access and how to manage them properly. There are no databases without queries and Access is not an exception. You will be taught what queries are and the best way to design them. Forms come in handy for adding records to your database. In order to provide a quick and efficient method for modifying and inserting records into your databases, this Microsoft Access certification explores how to create forms with proper attention given to features such as alignment, styling and controlling tab order.&nbsp;</p><p>Rules are necessary for order to prevail and this is so with MS Access too. This section of the course discusses the rules of normalized tables, the tips for primary keys, the reason for picking a starting auto-number and the necessity for duplication. You will also be taught the techniques of using Excel with Access without getting bogged down by the associated problems and errors that come with it. This Microsoft Access course will finally teach you how to normalize and create a master table as well as how to create relationships between tables and append a query. Two other key topics covered include how to use control structures and macros. Have you always been curious about Microsoft Access? What does it do? How can it work for you? All of these questions and much more are answered in this course. There are many lines of work that use the power of Microsoft Access including data science, engineering, business management and computer science and the technicalities you learn in this course can add valuable skills to your portfolio to increase job opportunities. Any version of MS Access ranging from 2013 to present installed on a PC is all you need. If you know how to use a computer and are motivated to learn, then enrol right away and become a database management expert in just a few hours.</p><a href=\"https://alison.com/resume/courses/4019\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4019\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Working With Tables","description":"In this module, you will learn how to navigate existing tables, edit records, sort data, filter records and use the find and replace features in Access. You will be taught the fundamentals of creating new tables and how to set field properties and what look-ups are used for. On top of this, you will learn how to define, create and manage controls, reports and queries.","topics":["Working with Tables - Learning Outcomes","Manipulating Records in Tables","Creating Tables","Reports and Controls","Working With Queries","Types of Queries","Working with Tables - Lesson Summary"]},{"name":"Module","details":"Database Design","description":"In this module, you will learn how to create and manage forms. You will be taught how to explain Access to experts that are used to working with spreadsheets and codes. You will learn the rules of normalization, how to use primary keys, referential integrity and how the different types of relationships in databases are managed in Microsoft Access.","topics":["Database Design - Learning Outcomes","Working with Forms","Rules for Normalized Tables","Table Design","Types of Relationships","Database Design - Lesson Summary"]},{"name":"Module","details":"Advanced Features","description":"In this module, you will learn how to import excel into Access using the GUI as well as how to organize and structure data after importation. You will be shown how control structures are used for selection and looping, how macros, a simplified programming language are created and how to import Excel into Access using VBA which is also a program.","topics":["Advanced Features - Learning Outcomes","Excel and Access","Control Structures","Working with Macros","Advanced Features - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microsoft Access Masterclass - Course Assessment"]}]}