{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1330","title":"Microsoft Outlook 2010","totalEnrolled":"13,249","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the different functions of the Microsoft Outlook 2010 and improve your emailing skills with this free course.","description":"This free online Microsoft Outlook 2010 training course will teach you everything about the popular emailing and personal information management application. It includes a calendar, task manager, contact manager, note-taking, journal, and web browsing. Outlook 2010 has greatly increased the functionality of the software program and with this course, you will learn the new features that extend its workflow capabilities and functionality.","courseOutcomes":["Create, manage, and organize email a...","Save time with Outlook Calendar...","Organize your time more easily with ...","Organize messages and Automatic Repl...","Create, manage, and organize email and contacts","Save time with Outlook Calendar","Organize your time more easily with meeting requests","Organize messages and Automatic Replies","Enrich your emails with electronic business cards and e-mail signatures","Use conversation view to eliminate excess emails in your inbox","Maximize your time with Quick Steps","Stay connected with the new Outlook Social Connector","Manage your information and create RSS web feeds","Use Instant Search to quickly locate a file","Speed up your email with efficient attachments","Create Templates to use again and again","Create, manage, and organize email a...","Save time with Outlook Calendar...","Organize your time more easily with ...","Organize messages and Automatic Repl...","Create, manage, and organize email and contacts","Save time with Outlook Calendar","Organize your time more easily with meeting requests","Organize messages and Automatic Replies","Enrich your emails with electronic business cards and e-mail signatures","Use conversation view to eliminate excess emails in your inbox","Maximize your time with Quick Steps","Stay connected with the new Outlook Social Connector","Manage your information and create RSS web feeds","Use Instant Search to quickly locate a file","Speed up your email with efficient attachments","Create Templates to use again and again"],"courseDescription":"<p>The Microsoft Outlook online course begins by showing you the reasons why you should make the switch to Outlook 2010 from previous versions of the software. You will learn how to navigate the ribbon and understand the different tasks that it can be used for. You will then learn how to create, manage, and organize your email, calendar, contacts, and tasks. The course will also show you how to enrich your email with attachments and business cards.<br><br>One of the most important features of Microsoft Outlook mail is the conversation view for eliminating excess emails in your inbox. This course will cover this feature clearly and simply. You will then learn the use of Quick Steps and Outlook Social Connector as well as how to manage your information and create RSS web feeds. The course will also teach you how to use Instant Search to quickly locate a file, how to speed up your email with efficient attachments, and how to create templates that you can reuse.<br><br>This free online Microsoft Office Outlook course will be of great interest to professionals in any business who wish to organize their schedule and emails in a professional manner. This is a core skill-set required in any career. So check out the course now, and bring your emailing and personal information management skills to the next level in no time at all!</p><a href=\"https://alison.com/resume/courses/1330\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1330\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Making the Switch to Outlook 2010","description":"This module will teach you about switching from and older versions of Microsoft Outlook to Outlook 2010","topics":["Making the Switch to Outlook 2010 Learning Outcomes","Find everyday commands in Outlook 2010","Get around in your calendar","Search and find in Outlook 2010","Making the Switch to Outlook 2010 Lesson Summary","Create and send messages","Print and set Outlook options","Read and respond to messages"]},{"name":"Module","details":"What's new in Microsoft Outlook 2010","description":"In this module learn more about the new features and functionality of Outlook 2010.","topics":["What's new in Microsoft Outlook 2010 Learning Outcomes","The ribbon, file tab, conversation view, and start topic","Messages and meetings features","Instant search improvements","Organizing your inbox conversations","Calendar improvements","E-mail attachment features","Improved features","What's new in Microsoft Outlook 2010 Lesson Summary"]},{"name":"Module","details":"Get Familiar with the Outlook Calendar","description":"In this module you will learn about the Outlook Calendar and its features.","topics":["Get Familiar with the Outlook Calendar Learning Outcomes","Calendar basics","Create meetings","Create recurring meeetings","Use colour categories and follow-up flags","Set tasks and reminders","Set all-day events and free/busy data","Get Familiar with the Outlook Calendar Lesson Summary"]},{"name":"Module","details":"Manage Your Information and Create RSS Web Feeds","description":"In this module learn how to manage your information and create RSS web feeds.","topics":["Manage Your Information and Create RSS Web Feeds Learning Outcomes","Stay organized with conditional formatting","Conditional formats with calendars and tasks","Use your RSS feeds in Outlook","Change settings for your RSS feeds","Manage your RSS feeds with search folders","Unsubscribe from an RSS feed","Manage Your Information and Create RSS Web Feeds Lesson Summary"]},{"name":"Module","details":"Organise Messages and Automatic Replies","description":"In this module learn about organizing messages and automatic replies.","topics":["Organise Messages and Automatic Replies Learning Outcomes","Better than just date arrangement","Introducing date (conversations)","Reading the conversation map","Acting conversationally","Switching views and using search","Use automatic replies","Send replies without Exchange","Rules to manage mails by","Organise Messages and Automatic Replies Lesson Summary"]},{"name":"Module","details":"Electronic Business Cards, E-mail Signatures and Instant Search","description":"Learn more about electronic business cards, e-mail signatures and Instant Search.","topics":["Electronic Business Cards, E-mail Signatures and Instant Search Learning Outcomes","Create electronic business cards","Change the look and feels of a business card","Create e-mail signatures","Jazz up your signature","Find it with instant search","Pile and file with search folders","Electronic Business Cards, E-mail Signatures and Instant Search Lesson Summary"]},{"name":"Module","details":"Organise with Templates and Views","description":"In this module learn how to organize with templates and views.","topics":["Organise with Templates and Views Learning Outcomes","Create and use templates","Use templates with calendars, tasks, and contacts","Organise your mailbox with views","See just what you need with custom views","Reduce clutter with conversations view","Organise with Templates and Views Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microsoft Outlook 2010 Assessment"]}]}