{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5019","title":"Microsoft Word 2021","totalEnrolled":"3,799","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the fundamental tools and functionalities required to create documents using Word 2021.","description":"Word 2021 lets you write and edit documents, exchange notes and collaborate on projects. Why use Word 2021? What are some of the keyboard shortcuts in Word 2021? This course will explore what Word 2021 is, including its tools. You will see what it can do for you and examine all its functions, including the use of templates. In addition, you will find information about the benefits of keyboard shortcuts. Enrol today to master MS Word 21.","courseOutcomes":["Evaluate the Word interface and work...","Explain the core concepts of spell c...","Identify how to create and save a do...","Analyse how to open and edit documen...","Evaluate the Word interface and work with the ruler","Explain the core concepts of spell check and its key shortcuts","Identify how to create and save a document","Analyse how to open and edit documents effectively","Define how to use an immersive reader and focus","Describe how to switch document views correctly","Discuss the different forms of advanced text formatting","Evaluate the Word interface and work...","Explain the core concepts of spell c...","Identify how to create and save a do...","Analyse how to open and edit documen...","Evaluate the Word interface and work with the ruler","Explain the core concepts of spell check and its key shortcuts","Identify how to create and save a document","Analyse how to open and edit documents effectively","Define how to use an immersive reader and focus","Describe how to switch document views correctly","Discuss the different forms of advanced text formatting"],"courseDescription":"<p>MS Word 2021 allows you to write and produce documents on your PC, edit them, exchange comments, generate stunning cover letters and collaborate on projects. We will begin by studying the layout of Word 2021, including the ‘start’ screen. In addition, you can explore its main functions by creating a document using Word 2021 and saving it. Before exploring the keyboard shortcuts, we will demonstrate the benefits of checking your spelling in Word 2021.</p><p>The course then explores the roles and duties of using Word templates. It will teach you to analyse information in order to edit existing documents. Finally, we will help you investigate the theories and practical ways you can find tools in Word 2021. We will research applying basic formatting and the use of entering text. This course will also examine making selections and advanced text formatting. It will help you answer questions like ‘what are the benefits of using the ‘dark mode’?’ or ‘what is advanced text formatting?’.</p><p>This course will teach you how to use Word 2021 to build a document. We give precise functions and essential foundations so you can confidently use them in your workplace. This course is ideal for getting started with Word 2021. So enrol right now and study the essentials of using this program.</p><a href=\"https://alison.com/resume/courses/5019\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5019\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Microsoft Word 2021","description":"In this module, we will help you analyse what Word 2021 is. In addition, we will examine the necessary steps for downloading and installing Word 2021. We will have the opportunity to explore in-depth the opening and editing of a document, answering questions like: What are the benefits of checking spelling in Word? How can you switch documents?","topics":["Introduction to Microsoft Word 2021 - Learning Outcomes","Introduction to Microsoft Word 2021","Word Interface","Toolbar and Keyboard Shortcuts","Creating a Document","Navigating a Document","Introduction to Microsoft Word 2021 - Lesson Summary"]},{"name":"Module","details":"Documents, and Paragraph Management","description":"In this module, we will help you analyse how to switch document views. We will also look at the procedure required to understand the dark mode. This module will explore the understanding of advanced text formatting, answering questions such as: How can you move text? What are some of the paragraph spacing options?","topics":["Documents, and Paragraph Management - Learning Outcomes","Document Views and Dark Modes","Enter Text and Make Selections","Moving text and formatting","Paragraps Managent","Paragraphs and Text","Documents, and Paragraph Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microsoft Word 2021 - Course assessment"]}]}