{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1277","title":"Microsoft Word 2010","totalEnrolled":"59,447","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to make full use of the features and tools of Microsoft Word 2010 in this free online tutorial course.","description":"This course guides you through the most useful features of Microsoft Word 2010 to let you unleash the full potential of this popular and powerful word processor. Word is used worldwide as a productivity tool for writing, word processing and document creation. Its features, tools, ease of use and overall power continues to increase to keep up with the evolving demands of the modern workplace. This course suits anyone who writes or edits text.","courseOutcomes":["Navigate the new layout and interfac...","Explain the program’s formatting fea...","Utilize Word’s basic functions ...","Use the navigation panel to manage h...","Navigate the new layout and interfaces of Word 2010","Explain the program’s formatting features","Utilize Word’s basic functions","Use the navigation panel to manage headings and find objects and text","Create visually effective content without using other software","Manage header and footer content and update page numbers and dates","Insert complete table of contents for large documents","Create accessible documents for e-reader software","Identify the shortcuts and useful features of Word 2010","Use keyboard shortcuts with access keys and key combos","Navigate the new layout and interfac...","Explain the program’s formatting fea...","Utilize Word’s basic functions ...","Use the navigation panel to manage h...","Navigate the new layout and interfaces of Word 2010","Explain the program’s formatting features","Utilize Word’s basic functions","Use the navigation panel to manage headings and find objects and text","Create visually effective content without using other software","Manage header and footer content and update page numbers and dates","Insert complete table of contents for large documents","Create accessible documents for e-reader software","Identify the shortcuts and useful features of Word 2010","Use keyboard shortcuts with access keys and key combos"],"courseDescription":"<p>This course begins by introducing you to Microsoft Word 2010’s layout and interface, including the ‘backstage’ view, customizable ribbon, text and image formatting options, live collaboration, cloud storage tools and much more. We examine the navigation panel used to manage headings, find objects and update page numbers and dates. We then show you how to customize your workspace and create complex documents with Word 2010.</p><p>Updating your word-processing skills with this course provides an excellent return for your time and energy as it can make you far more efficient in your daily use of Word. Those who have completed ‘ABC IT’, our comprehensive introductory computer course, will find this course to be the perfect next step. In addition to the complete basic functions of Word 2010, we explain how to use keyboard shortcuts with ‘access keys’ and key combos, which will speed up your use of Word.</p><p>This course suits all Microsoft Word users who wish to increase their efficiency and productivity to create better documents without increasing their workload. Take advantage of this online tutorial to boost your computer skills and get ahead of the pack.</p><a href=\"https://alison.com/resume/courses/1277\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1277\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Making the switch to Word 2010","description":"This module will teach you about switching from and older versions of Microsoft Word to Word 2010","topics":["Learning Outcomes","What's new with keyboard shortcuts","Reacquaint yourself with everyday tasks","Acquaint yourself with the ribbon","Some tools appear on demand","Behind the scenes: File tab and Backstage view","Work between new and earlier versions of Word","Lesson Summary"]},{"name":"Module","details":"Whats's New in Word","description":"In this module, you will see many of the new features and formatting enhancements of Word 2010.","topics":["Learning Outcomes","Work in Word anywhere","Bring your best ideas to life","Document Navigation Pane","Work more easily","Customize the Ribbon","Work better together","Coauthoring","Lesson Summary"]},{"name":"Module","details":"Creating your first Word document","description":"This module outlines the basics functions of Word 2010, from creating a new document and formatting text to changing page margins and moving around your document.","topics":["Learning Outcomes","Create and save a new document","Fix spelling and grammar as you type","Add formatting to your text","Save, print and close a new document","Moving around in a document","Use formatting marks","Change page margins","Move text around in the document","Change line spacing and alignment","Lesson Summary"]},{"name":"Module","details":"Explore Your Document using the Navigation Pane","description":"In this module you will see the features of the new Navigation Pane such as headings management and learn how to find text and objects within the document.","topics":["Learning Outcomes","See what your document is made of","Locate, add to, and reorganize content","Find and replace text and other elements","Lesson Summary"]},{"name":"Module","details":"Create visually compelling documents","description":"Visually effective documents stand out and in this module you learn about the new features which allow for greater image and photograph manipulation without leaving Word 2010.","topics":["Learning Outcomes","Make your text stand out with special effects","Polish your pictures like a pro","Add a screenshot without using another program","SmartArt graphics: Turn ideas into illustrations","Lesson Summary"]},{"name":"Module","details":"Get control of Page Numbers, Headers, and Footers","description":"This module guides you through organizing your document with Headers and Footers to allow for structures such as page numbers and time & date to be included and updated.","topics":["Learning Outcomes","Open the header and footer space; find tools","Get more help from Word with style galleries","Get less help from Word by using Quick Parts","Insert page numbers; use \"Page X of Y\" format","Add the current date and time","Add the document filename and path","Insert an art logo into a header","Adjust header and footer position on the page","Use varying headers and footers","Remove page numbers, headers, and footers","Lesson Summary"]},{"name":"Module","details":"Create and Customize a Table of Contents","description":"To allow readers of your document to find their way, this module outlines the various methods of creating and formatting a Table of Contents.","topics":["Learning Outcomes","Generate and update a TOC","Create and customize a table of contents","Mark other styles for use in a TOC","Use outline levels to mark text for a TOC","Control TOC content and formatting","Customize a TOC by changing styles","Remove a TOC","Lesson Summary"]},{"name":"Module","details":"Create accessible documents","description":"In this module you will learn the techniques for creating documents which are more accessible to people with disabilities such as visual impairment.","topics":["Learning Outcomes","Heading styles","Paragraph styles","Add alt text to images and tables","Structure tables for easy navigation","Tips and tricks","Lesson Summary"]},{"name":"Module","details":"Word 2010 tips and techniques","description":"This module contains many shortcuts and useful features within Word 2010, like zooming in and out using you mouse.","topics":["Learning Outcomes","Open Word quickly","Use a template from Office.com","Convert a list into a table","Make a bulleted list more interesting","Crop a picture to shape","Zoom with your mouse","Put documents on SkyDrive","Find and replace text","Techniques for selecting things","Show or hide the Ribbon","Use the Quick Access Toolbar","Add a list with checkboxes","Lesson Summary"]},{"name":"Module","details":"Keyboard Shortcuts","description":"In this module you will learn many of the keyboard short cuts in Word 2010, using both Access Keys and Key Combinations.","topics":["Learning Outcomes","Access keys in dialog boxes","How to use key combinations","Key combos for working with files","Moving around a document","Key combos for working with text","Other handy shortcuts","Lesson Summary","F6: Another kind of access key","Introduction","How to use access keys"]},{"name":"Module","details":"Microsoft Office 2010 Security","description":"This module guides you through the various Security options available within Office 2010, including Protected View, Trusted Documents and Enabling Active Content.","topics":["Learning Outcomes","Active content","Enable content","Trusted documents","Protected view","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microsoft Word 2010 Assessment"]}]}