{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4458","title":"Microsoft OneDrive: A Step-by-Step Guide","totalEnrolled":"1,663","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Harness OneDrive and Microsoft Office’s online resources to sync files on any device with this free online course.","description":"Modern technology has permeated every aspect of our lives, transforming how we communicate or engage with one another and introducing the notion of ‘virtuality’ into the workplace. This course aims to lay the groundwork for understanding the fundamentals of OneDrive for home and personal usage. Stop relying on local storage and start interacting with customers, sharing everything you want with family or collaborating in real-time with friends.","courseOutcomes":["Recognise the technical attributes i...","Outline the steps involved for setti...","Identify how and when to use MS OneD...","Explain the various sections of the ...","Recognise the technical attributes integrated into the OneDrive environment","Outline the steps involved for setting up the Microsoft OneDrive Desktop application","Identify how and when to use MS OneDrive to download, store, generate, edit and share documents or files","Explain the various sections of the Navigation bar","Indicate the OneDrive Personal Vault security and accessibility specifications","State the configuration steps for Android and iOS systems","Outline the MS Office (PowerPoint, Excel, Outlook, Word and others) capabilities offered in the OneDrive version","List the ribbon tools available for each program in OneDrive","Distinguish the viewing modes offered for file quality check included on all MS Office tools","Describe the prospects of using OneNote, MS Forms and Plain Text in OneDrive","Recognise the technical attributes i...","Outline the steps involved for setti...","Identify how and when to use MS OneD...","Explain the various sections of the ...","Recognise the technical attributes integrated into the OneDrive environment","Outline the steps involved for setting up the Microsoft OneDrive Desktop application","Identify how and when to use MS OneDrive to download, store, generate, edit and share documents or files","Explain the various sections of the Navigation bar","Indicate the OneDrive Personal Vault security and accessibility specifications","State the configuration steps for Android and iOS systems","Outline the MS Office (PowerPoint, Excel, Outlook, Word and others) capabilities offered in the OneDrive version","List the ribbon tools available for each program in OneDrive","Distinguish the viewing modes offered for file quality check included on all MS Office tools","Describe the prospects of using OneNote, MS Forms and Plain Text in OneDrive"],"courseDescription":"<p>For a long time, people have used files as a reference for organising chores and staying in touch with others. But if there is one word to define how we have utilised technology since 2020, it is the word ‘remotely’. Our jobs, business meetings, children's education and even our social events have all shifted to the virtual realm. As a result, Microsoft promoted OneDrive, their formidable platform. This file storage service allows clients to stay connected and includes access to Office Online, where you can create documents, spreadsheets, presentations, notes and surveys. Once you've used OneDrive to save files in the cloud, you may alter and trade them without having to download them to your computer. Amazing, right? This course supplies the foundation of OneDrive as the file storage solution and collaborative suite of tools that allow anyone to develop remarkable documents for either the job, school or home. Start by learning the platform interface. We explain concepts step-by-step to deepen your knowledge and navigate each menu to comprehend its characteristics, functionalities and configuration items behind the scenes.</p><p>Nowadays, users repeatedly run out of storage space and gadgets often lack SD card slot capabilities. In such cases, users continually depend on cloud-based resources. OneDrive is a platform designed for all Microsoft account holders. OneDrive offers 5GB of free space. Once you establish a connection, OneDrive synchronises data across workstations, smartphones or tablets registered with the same login. Enjoy the freedom to access, modify and share your files on every one of your devices, no matter where you are. Explore security, management and collaborative features available for all users within the files hosting platform. Then become acquainted with the application by learning how to install it on your desktop and mobile devices. As OneDrive synchronises across your devices, you will not end up losing your files and photos if a device is lost or stolen. Complete your first module considering the security aspects, like the Personal Vault, a new line of defence to secure your most sensitive and valuable information. The next section helps you understand Office Online, a freeware version of the popular programs: Word, Excel, PowerPoint and OneNote. Begin learning how to manage documents from any web browser without launching software. You can also experience changes or revisions of any shared presentation or workbook in real-time. Conclude by visualising the functions of other Office tools, like Microsoft OneNote MS Forms, and practising the knowledge acquired during the course.</p><p>At the end of this course, you will have gained a toolkit of core methodologies and best practices for working with Office web in OneDrive to create presentations, documents or spreadsheets and to reach analytical conclusions for business or day-to-day operations. The material presented in the curriculum will provide you with skills to face challenges for last-minute presentations. You will understand the fundamentals of Excel, Word and PowerPoint by navigating Office’s built-in capabilities. Get ready to face the new digital world with JM Ekhteyari because broken presentations and numerous versions of a file attached in endless email documents are things of the past. Enrol now in 'Microsoft OneDrive: A Step-by-Step Guide' to harness everything you have saved to your OneDrive folders, including documents, photos, videos and any other media.</p><a href=\"https://alison.com/resume/courses/4458\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4458\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"MS OneDrive Environment and Functions","description":"This module presents the bases of OneDrive, a powerful file hosting venue offered by Microsoft for personal and business use. With web-enhanced features for teamwork, accessibility, and security. Learn to keep documents, photos, and files into the 'personal vault' only accessible with a robust authentication system on any device, all in OneDrive.","topics":["MS OneDrive Environment and Functions - Learning Outcomes","Microsoft OneDrive Overview","Understanding the OneDrive Interphase","Navigating Through MS OneDrive","OneDrive Sharing and Security Features","MS OneDrive Environment and Functions - Lesson Summary"]},{"name":"Module","details":"Grasping Office from MS OneDrive","description":"This module steers to the Office environment for managing, reviewing, and storing your best projects. Start exploring Word. Then discover Excel, followed by guidelines for PowerPoint. You will practise with real projects to improve the quality and accuracy. And finally, get the most out of OneDrive by learning about Outlook, OneNote, and Forms.","topics":["Grasping Office from MS OneDrive - Learning Outcomes","Knowing the MS Word Environment","Microsoft Excel in OneDrive","The OneDrive PowerPoint Version","Microsoft Outlook OneDrive Integration","Miscellaneous Settings and Practises","Grasping Office from MS OneDrive - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Microsoft OneDrive: A Step-by-Step Guide - Course Assessment"]}]}