{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4325","title":"Microsoft Visio 2019","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn and master the key features and functions of Microsoft Visio 2019 with this free online course on Alison.com.","description":"Are you looking to diagrammatically present complex data? Or do you want to create a process flowchart for your organisation or department? This free online course on Alison.com will help you become acquainted with Visio 2019, the perfect software for transforming data into diagrams, flowcharts and shapes. So don't waste time: learn all you need to know about Visio 2019 to help contribute to your business or organisation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you looking to create a flow chart of the management hierarchy within your organisation or business? Or do you want to create a diagram to design the new floor of your office building? This free online course will give you all the information you need about Microsoft Visio 2019, which can help you diagrammatically present your ideas and concepts. It doesn't matter if you are starting to learn Visio from scratch or simply shifting to the newer version - we have got you covered. The course begins by giving you all the information about acquiring or downloading Visio 2019. Then we explain how to access Visio once you have downloaded it on your device with the ‘start screen’ interface. We demonstrate the ‘ribbon’ interface and its various tabs and commands. We will also explain the ‘quick access’ toolbar and how you can customise it based on your requirements. Multiple methods are available to help users with their drawings, keyboard shortcuts and key terms.</p><p>We will then shift your focus towards the crucial component of creating and editing drawings. We will explore the basics of creating a drawing and use starter diagrams in detail, using the ‘shapes’ window to edit and customise the various projects efficiently. Are you looking to measure the actual physical profile of the drawings you create? Visio 2019 contains dynamic grids, rulers and guides that can provide accurate measurements of the graphics you work on, which can significantly help in real-life situations. Since shapes are an important component of Visio, knowing how to edit, customise and label shapes based on your requirements is a crucial feature. We illustrate how to save the work performed for later use or transfer it to someone else and give them access.</p><p>The final section clarifies how to create organisation charts or management hierarchies using Visio 2019. We will analyse Visio 2019's ability to import data from various other sources such as Microsoft Excel or Word and edit it on its own platform. Another critical component of organisation charts is styling. Finally, we will discuss Visio’s key features, functions and benefits. From flowcharts to processes within the organisational work environment, Visio has been one of the most popular tools businesses use to fulfil their professional and personal needs worldwide. As one of the key components of the Microsoft Office family, Visio 2019 is another step forward towards ensuring that great software helps move individuals and businesses forward. So don't waste any more time. Get started now with this Microsoft Visio 2019 course on Alison.com.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}