{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4382","title":"Mobile App Development with Kotlin","totalEnrolled":"1,988","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will provide the techniques and knowledge required to build mobile applications using Kotlin.","description":"Kotlin is a programming language which is available across platforms and statically typed with type inference. This course will equip you with the understanding required to develop mobile applications using Kotlin. It explores setting up the Kotlin development environment and implementing the build codes. Learn about variables, testing codes online, data types, control statements, functions, exception handling and Kotlin classes and objects.","courseOutcomes":["Explain how to set up Kotlin on a Wi...","Distinguish between arithmetic and r...","Discuss how to comment codes in Kotl...","Explain the function of the ‘return’...","Explain how to set up Kotlin on a Windows Machine, Mac and Linux OS","Distinguish between arithmetic and relational operators","Discuss how to comment codes in Kotlin programming","Explain the function of the ‘return’ statement","State the advantage of a function in a program","Explain the function of recursion in a program","Recall how to throw an exception in Kotlin","List the various types of visibility modifiers in Kotlin","Explain the function of ‘inheritance’ in Kotlin","Explain how to set up Kotlin on a Wi...","Distinguish between arithmetic and r...","Discuss how to comment codes in Kotl...","Explain the function of the ‘return’...","Explain how to set up Kotlin on a Windows Machine, Mac and Linux OS","Distinguish between arithmetic and relational operators","Discuss how to comment codes in Kotlin programming","Explain the function of the ‘return’ statement","State the advantage of a function in a program","Explain the function of recursion in a program","Recall how to throw an exception in Kotlin","List the various types of visibility modifiers in Kotlin","Explain the function of ‘inheritance’ in Kotlin"],"courseDescription":"<p>We have designed this course to equip developers with the abundant skills and knowledge required to develop mobile applications. We begin by teaching you how to set up Kotlin on a Windows, Mac or Linux operating system. Then we introduce you to Kotlin basics. You will learn about variables, data types, strings and arrays, data type conversion and making comments. Next, you will learn about operators used in Kotlin, which will include the arithmetic operator, relational, assignment, bitwise, unary and logical. Then discover control statements in Kotlin, their functions and the conditional 'If' statement, which checks for some specified conditions and runs the codes based on that. Next, explore the functions of loops, including the ‘for loop’ used to iterate over a part of a program multiple times, the ‘while loop’ and the ‘infinite loop’.</p><p>This course will also teach you the functions of the ‘break’ and ‘continue’ statements in Kotlin. Investigate how it performs tasks and enhances the performance of other functions in Kotlin. Research how to solve a problem by creating a function called ‘recursion’ multiple times until the set condition is met. Learn how a ‘try’ block can be used in exception handling and make nullable and non-nullable variables. Examine Kotlin classes, the list of functions, the mutable list, an array list as well as how to efficiently retrieve the corresponding values to each key using the mutable map. Finally, analyse object-oriented programming and the properties of a nested class, visibility modifiers and types, including the private and public modifiers. Then you will learn how to call a Java code from Kotlin and call a Kotlin file from Java.</p><p>Kotlin is a cross-platform general programming language used by over sixty percent of app developers. It has a mature language and environment, making it very user-friendly, enabling easier and swifter application development. This course will teach you how to set up Kotlin, the basics and control flow statements like ‘loop’ and ‘when loop’. You will also learn about the error and exception handling and class and how to call Java codes from Kotlin and vice versa. So, why are you waiting? Take this course today and enhance your application development skills.</p><a href=\"https://alison.com/resume/courses/4382\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4382\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setting-up and Kotlin Basics","description":"In this module, you learn how to set up Kotlin on a windows machine, Mac and Linux OS using IntelliJ IDEA, and also how to test codes on the web, you will also learn about variables, data types, strings and arrays, you will then be taught how to comment on codes in Kotlin and learn about arithmetic operators, relational and logical operators.","topics":["Introduction, Setting-up and Kotlin Basics - Learning Outcomes","Introduction and setting up","Kotlin Basics","Introduction, Setting-up and Kotlin Basics - Lesson Summary"]},{"name":"Module","details":"Kotlin Control Flow Statements and Functions","description":"In this module, you will learn about \"if statements\" and the functions of the loop, you will be taught the functions of the break and continue statement in Kotlin and you will learn about functions, how to send values and parameters to a function, also learn about default and named arguments, lambda functions and how to implement inline functions.","topics":["Kotlin Control Flow Statements and Functions - Learning Outcomes","Kotlin Control Flow Statements","Kotlin Functions","Kotlin Control Flow Statements and Functions - Lesson Summary"]},{"name":"Module","details":"Kotlin Error and Exceptional Handling, Null Safety and Collections","description":"In this module, you will learn about exception handling in Kotlin, you will learn the function of try-catch block and multiple catch block, and also how to implement nullable and non-nullable data types, you will also learn about mutable and immutable lists in Kotlin programming and as well as Hashmap and the application of set in Kotlin.","topics":["Kotlin Error and Exceptional Handling - Learning Outcomes","Kotlin Error and Exceptional Handling","Kotlin Null Safety","Kotlin Collections","Kotlin Error and Exceptional Handling - Lesson Summary"]},{"name":"Module","details":"Kotlin Classes, Objects, Ranges and Extras","description":"In this module, you will learn about nested and inner class and also the types of visibility modifiers which includes public and private modifiers, you will also learn about inheritance, property overriding, and sealed class, and you will be taught how to call a java code from a Kotlin file as well as how to call a Kotlin file from Java.","topics":["Kotlin Classes, Objects, Ranges and Extras - Learning Outcomes","Kotlin Classes and Objects","Kotlin Ranges and Extras","Kotlin Classes, Objects, Ranges and Extras - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Mobile App Development with Kotlin - Course assessment"]}]}