{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4229","title":"Mobile and Web Development using Ionic","totalEnrolled":"1,580","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to use the Ionic framework to develop websites and apps for Android and iOS devices, in this free online course.","description":"This development course teaches you how to build websites, and mobile applications, using the cross-platform development framework called Ionic. You will learn the process of setting it up, as well as testing and debugging applications across platforms. You will also learn about various styling elements like lists, toggles, and sliders, that can be added to your application or webpage, and how the Ionic framework is used to add them.","courseOutcomes":["Explain Ionic compatibility across v...","Select applications to debug and tes...","Outline the default formatting optio...","Create headers and footers using Ion...","Explain Ionic compatibility across various platforms","Select applications to debug and test","Outline the default formatting options for styling components","Create headers and footers using Ionic","Compare lists in applications using the Ionic framework","Identify and style cards using Ionic","Distinguish between toggles and checkboxes in Ionic applications","Identify different styling options that could be added to forms using Ionic","Define a 'radio button","Explain the function of the Ion-Grid system","Explain Ionic compatibility across v...","Select applications to debug and tes...","Outline the default formatting optio...","Create headers and footers using Ion...","Explain Ionic compatibility across various platforms","Select applications to debug and test","Outline the default formatting options for styling components","Create headers and footers using Ionic","Compare lists in applications using the Ionic framework","Identify and style cards using Ionic","Distinguish between toggles and checkboxes in Ionic applications","Identify different styling options that could be added to forms using Ionic","Define a 'radio button","Explain the function of the Ion-Grid system"],"courseDescription":"<p>This course teaches you all you need to know to get started with developing websites and mobile applications using the Ionic framework. It begins with tutorials on how to set up Ionic, as well as the developer environment needed for using the framework. It demonstrates the process of testing and debugging applications across different platforms. The first half of the course concludes with tutorials on how to add styling elements like headers, footers, buttons, and lists, using the Ionic.</p><p>The second half introduces some more styling components, as well as explaining how they can be added to a webpage, or mobile application, using Ionic. Styling components covered in this part include cards, forms, toggles, checkboxes, radio buttons, sliders, dropdowns, and tabs. The course explains the Ionic grid system, and how it is used to design responsive webpages and mobile applications.</p><p>Being a cross-platform, and web-based framework, Ionic provides web developers with a way to create highly functional web and mobile applications that leverage their existing knowledge of web development. This course suits web developers with some knowledge of web design and HTML, JavaScript and CSS. Start this course now, and be on your way to building functional, responsive, and visually pleasing applications for various platforms, using the Ionic framework, in under three hours.</p><a href=\"https://alison.com/resume/courses/4229\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4229\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Testing and Styling","description":"In this module, you will learn to setup Ionic, and how to debug and test applications on multiple platforms. You will also learn how to add styling components like Headers, Footers, Buttons, and Lists to an Ionic application.","topics":["Introduction, Testing and Styling – Learning Outcomes","Introduction, Setting up and Testing","Styling Headers, Footers and Buttons","Introduction, Testing and Styling – Lesson Summary"]},{"name":"Module","details":"Additional Styling Components","description":"In this module, you will be introduced to more styling components that could be added to Ionic apps. You will learn to add and style components like Cards, Forms, Toggles, Checkbox, Radio Buttons, Sliders, Dropdowns, and Tabs. You will also learn about the Grid System and its use in responsive app design.","topics":["Additional Styling Components – Learning Outcomes","Styling Cards, Forms and Checkboxes","Styling Radio Buttons, Sliders and Tabs","Additional Styling Components – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Mobile and Web Development using Ionic – Course assessment"]}]}