{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4696","title":"Mobile App Design Using Sketch 3 and Swift TableViews","totalEnrolled":"391","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to design interactives iOS mobile applications using Sketch 3 and Swift Tableviews in this free online course.","description":"Due to an increase in the demand for innovative apps for iOS and Android OS, the need for mobile app developers is expected to rise from 17% to 24% by 2026. App designers are in charge of the app's overall appearance, including colors, font selection and the types of buttons and widgets the user will use. We've compiled essential information and resources to assist you in understanding how to excel at mobile app design.","courseOutcomes":["Discuss the properties of the layer ...","Recall various keyboard shortcuts us...","Describe how to create artboards, an...","List and explain the various export ...","Discuss the properties of the layer panel in Sketch.","Recall various keyboard shortcuts used in Sketch.","Describe how to create artboards, and shapes and how to resize them.","List and explain the various export options available in Sketch.","Discuss the role of the \"create shared layer\" tool in Sketch.","State the use of the vector tool and the transform tool.","Identify the various options for combining shapes in Sketch.","List the steps involved in creating a variable to store items.","Discuss the properties of the layer ...","Recall various keyboard shortcuts us...","Describe how to create artboards, an...","List and explain the various export ...","Discuss the properties of the layer panel in Sketch.","Recall various keyboard shortcuts used in Sketch.","Describe how to create artboards, and shapes and how to resize them.","List and explain the various export options available in Sketch.","Discuss the role of the \"create shared layer\" tool in Sketch.","State the use of the vector tool and the transform tool.","Identify the various options for combining shapes in Sketch.","List the steps involved in creating a variable to store items."],"courseDescription":"<p>One of the primary reasons for the rapid rise in demand for mobile app designers is that eCommerce and other businesses have grown in size, with the number of users increasing daily. The majority of these businesses are looking for efficient app designers who can become the company's main asset with their talent and creativity. Therefore, we have designed this course to instil in you the skills to become a professional iOS mobile app designer using Sketch 3 and Swift Tableviews.</p><p>We begin this course by demonstrating how to download and install the Sketch 3 design software on your computer. We follow this with a quick overview of the design interface, layers and artboards and the various keyboard shortcuts required for design ease and speed. Next, we show you how to create a simple Facebook-style page. Learn about the different project exporting options, how to obtain resource materials from the online sketch forum, create pages, apply styles to them, transform shapes and objects and create icons. Finally, you will learn to construct an iOS app with multiple screens using Swift Tableviews.</p><p>This course is ideal for aspiring app designers who want to learn how to create iOS mobile applications from scratch or who want to brush up on their design skills. You will progress from creating a simple Facebook-like page to creating an iOS app with multiple screens using Swift Tableview. The knowledge gained from this course will set you apart from the crowd, assisting you in becoming an efficient app designer and being at the top of the game. So enrol today and be ready to design tomorrow.</p><a href=\"https://alison.com/resume/courses/4696\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4696\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Sketch 3 Mobile App Design and Swift TableViews","description":"In this module, you be introduced to designs in sketch 3, you will learn how to use various design tools, import elements, create and export components, you will also learn how to get external design resources, add sketch page, apply styles across them as well as how to build an app with multiple screens using TableViews and swift.","topics":["Sketch 3 Mobile App Design and Swift TableViews - Learning Outcomes","Introduction to Sketch 3 Mobile App Design","Building an App using Sketch 3","Design Templates and Other Resources","Creating a Set Icons","Building an iOS App using Swift TableViews","Sketch 3 Mobile App Design and Swift TableViews - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Mobile App Design Using Sketch 3 and Swift TableViews - Course assessment"]}]}