{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3088","title":"MS Excel 2013 Advanced","totalEnrolled":"9,488","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course learn advanced data manipulation and create scenarios and statistical analysis using MS Excel","description":"Learning how to use Excel is an asset in any career; the ability to efficiently use spreadsheets, tables, and automation to process large quantities of data is useful in several lines of work. This comprehensive course is suitable for those who would like greater insight into the more advanced features available in Microsoft Excel 2013. To complete this course, you will need to have a good knowledge of the basic features of MS Excel 2013.","courseOutcomes":["Explain how to record a macro using ...","Discuss how to apply conditional for...","State how to watch and evaluate form...","Describe the watch window in Excel 2...","Explain how to record a macro using the record macro dialogue box","Discuss how to apply conditional formatting","State how to watch and evaluate formula features","Describe the watch window in Excel 2013","State how to add and edit a Sparkline in Excel 2013","Define a scenario in Excel 2013","Explain how to inaugurate Excel data with the web","Describe how to publish a file in Excel 2013","Explain how to record a macro using ...","Discuss how to apply conditional for...","State how to watch and evaluate form...","Describe the watch window in Excel 2...","Explain how to record a macro using the record macro dialogue box","Discuss how to apply conditional formatting","State how to watch and evaluate formula features","Describe the watch window in Excel 2013","State how to add and edit a Sparkline in Excel 2013","Define a scenario in Excel 2013","Explain how to inaugurate Excel data with the web","Describe how to publish a file in Excel 2013"],"courseDescription":"<p>Would you like to develop your knowledge of Excel and improve your professional skillset? MS Excel 2013 Advanced is a free online course that has been specifically prepared to teach you about advanced customization and formatting features for easy data manipulation and organization. This course teaches you how to apply conditional formatting with a particular focus on the conditional formatting rules manager. Do you know that the conditional formatting rule manager can be edited? When working on Excel, it is important how to add data validation criteria to ranges of cells in a workbook. In this course, you will learn how to trace cells with the error tracing tool.</p><p>Next, this course will teach you how to create sparklines. Completing this course will help you know how to create and save different groups of values as scenarios. We are going to create scenarios and perform a what-if analysis. You will learn how to perform a statistical analysis using the analysis toolpak. When defining a Power View, it is said to be a data visualization technology that lets you create interactive charts. You will learn how to create a power view worksheet and create interactive data. As you proceed in this study, you will be exposed to the steps of data consolidation. When you create formulas in Excel and refer to a data point in another workbook, Excel creates a link to that workbook. This course teaches you how to link cells in different workbooks. The techniques for comparing and merging workbook features will be covered.</p><p>Furthermore, you will learn how to export Excel data and save your workbook in different formats. Do you know that an Excel workbook can also be saved in PDF or XPS? This course has been designed for all those who depend heavily on MS-Excel to prepare charts, tables, and professional reports involving a large amount of complex data. If you are a learner who is required to have advanced knowledge of the MS Excel 2013 features, then don’t hesitate to enroll today.</p><a href=\"https://alison.com/resume/courses/3088\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3088\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Automating Worksheet Functionality","description":"In this module, you will be introduced to steps on how to update workbook properties. A macro is an action or a set of actions that you can run as many times as you want, you will discover how to create and edit a macro. You will also learn how to apply conditional formatting and data validation criteria to ranges of cells in your workbook.","topics":["Automating Worksheet Functionality - Learning Outcomes","Updating Workbook Properties","Creating and Editing a Macro","Applying Conditional Formatting","Adding Data Validation Criteria","Automating Worksheet Functionality - Lesson Summary","Automating Worksheet Functionality - Assessment"]},{"name":"Module","details":"Auditing Worksheets","description":"In this module, you will be introduced to steps on how to trace cells. You will learn how to troubleshoot invalid data and formulas, how to watch and evaluate formulas. Excel allows you to group rows or columns so that they can be hidden or displayed with a single mouse click. You will learn how to create a data list outline using Excel 2013.","topics":["Auditing Worksheets - Learning Outcomes","Tracing Cells","Troubleshooting Invalid Data and Formula","Watching and Evaluating Formulas","Creating a Data List Outline","Auditing Worksheets - Lesson Summary","Auditing Worksheets - Assessment"]},{"name":"Module","details":"Analyzing and Presenting Data","description":"In this module, you will be introduced to the creation of sparklines, as well as create scenarios and perform a what-if analysis. You will learn how to perform a statistical analysis using the analysis tool pack. You will also learn about how to create interactive data using power view.","topics":["Analyzing and Presenting Data - Learning Outcomes","Creating Sparklines","Creating Scenarios","Performing a What-If Analysis","Performing a Statistical Analysis with the Analysis ToolPak","Creating Interactive Data with Power View","Analyzing and Presenting Data - Lesson Summary","Analyzing and Presenting Data - Assessment"]},{"name":"Module","details":"Working With Multiple Workbooks","description":"In this module, you will be introduced to steps on how to consolidate data. When you create formulas in Excel and refer to a data point in another workbook, Excel creates a link to that workbook. This module teaches you how to link cells in different workbooks and how to merge workbooks.","topics":["Working With Multiple Workbooks - Learning Outcomes","Consolidating Data","Linking Cells in Different Workbooks","Merging Workbooks","Working With Multiple Workbooks - Lesson Summary","Working With Multiple Workbooks - Assessment"]},{"name":"Module","details":"Exporting Excel Data","description":"In this module, you will be introduced to steps on how to export Excel data. A comma-delimited file is one where each value in the file is separated by a comma. You will learn how to import a delimited text file, integrate Excel data with the web and how to create a web query.","topics":["Exporting Excel Data -  Learning Outcomes","Exporting Excel Data","Importing a Delimited Text File","Integrating Excel Data With the Web","Creating a Web Query","Exporting Excel Data - Lesson Summary","Exporting Excel Data - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["MS Excel 2013 Advanced - Course Assessment"]}]}