{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3087","title":"MS Excel 2013 Basic","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master MS Excel 2013’s advanced features to manage data and information with this free online spreadsheet course.","description":"This free online spreadsheet course introduces you to the basics of MS Excel 2013, a spreadsheet program that helps you to store, organize and analyze information. Anyone can take advantage of Excel's powerful features and it is the most popular spreadsheet program used for business, classwork and even personal data organization. We teach you how to identify and use the elements of the program’s interface to manipulate data.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you know that an Excel worksheet can be saved in different file formats? The Help function is one of the best tools that Excel provides and this course addresses how to use it effectively. Excel 2013 integrates nicely with the Microsoft version of cloud storage called ‘SkyDrive’. After setting up a Microsoft account, you can use SkyDrive to store and share Office 2013 documents. This course introduces you to SkyDrive and the process of checking for compatibility. We outline the important steps required to create a basic worksheet before exploring the elements of Excel formulae along with common mathematical operators and their order of operations before delving into the difference between relative references, absolute references, and mixed references.&nbsp;</p><p>Do you know that it is possible to hide and reveal rows in Excel when you right-click? You can also reveal all hidden rows using the ‘format’ option in the ‘home’ tab. Cell references can be simplified with friendly names and we unpack the ‘find’ and ‘replace’ command. We teach you how to modify fonts and add borders and colors to cells before demonstrating how to apply number formats to cells and align cell contents. The ‘page layout’ function offers various commands that can prepare the workbook for printing and exporting to other formats. We also show you how to format worksheet tabs and look at all the possible tab-formatting options.</p><p>This course covers the Excel ‘ribbon’ and the quick access toolbar that appears at the upper left-hand corner of your screen, which contain multiple commands logically subdivided into groups. You can modify these tabs to save time and effort. Finally, we examine Excel’s general, language and formula-related options to help you customize your user experience. Whether you're keeping a budget, organizing a training log or creating an invoice, Excel makes it easy to work with different types of data and the program is a staple tool for many professions.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}