{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2756","title":"MS Outlook 2013 Basic","totalEnrolled":"2,563","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn Microsoft Outlook 2013 Basic with this free online course.","description":"This free online course, Microsoft Outlook 2013 Basic, teaches you the ins and outs of the outlook interface. Learn how to customize reading options and attachments. The course will also teach you how to manage and organize your messages. The course will also teach you how to manage calendar and appointments in Microsoft outlook. So, why wait? Start this course today and learn about Microsoft Outlook 2013.","courseOutcomes":["Categorize your email messages in Mi...","Describe how to create contacts in O...","Arrange your appointments in the cal...","Analyze and customize the Microsoft ...","Categorize your email messages in Microsoft Outlook","Describe how to create contacts in Outlook","Arrange your appointments in the calendar","Analyze and customize the Microsoft Outlook interface","Explain how to enhance your email messages","Categorize your email messages in Mi...","Describe how to create contacts in O...","Arrange your appointments in the cal...","Analyze and customize the Microsoft ...","Categorize your email messages in Microsoft Outlook","Describe how to create contacts in Outlook","Arrange your appointments in the calendar","Analyze and customize the Microsoft Outlook interface","Explain how to enhance your email messages"],"courseDescription":"<p>This course, Microsoft Outlook 2013 Basic, will provide you with an understanding of the basic tools and functions that come with using the 2013 version of Microsoft Outlook. You will learn how to explore the outlook interface. You will be able to explain how to preform basic email functions. You will also learn about enhancing email messages in Microsoft Outlook. You will learn about formatting message content along with spelling and grammar checks and enhancing email messages.</p><p>This course then explains how to customize your reading options in Outlook. You will learn about attachments and managing your email responses. You will also learn about managing organizing messages in Microsoft Outlook. The course will teach your about using tags and folders when organizing messages.</p><p>This course then wraps up with managing with the calendar in outlook along with managing appointments. You will learn about creating and managing contacts in outlook as well as managing tasks and notes. By taking this course you will learn the ins and outs of the Outlook interface and how to use it's many features. So why wait? Start learning today.</p><a href=\"https://alison.com/resume/courses/2756\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2756\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Exploring the Outlook Interface","description":"In this module, Exploring the Outlook Interface, students will learn about the Microsoft Outlook 2013 interface. Students will learn about the preforming basic email functions in Microsoft Outlook. The module will then go over basic Outlook help. The module wraps up with a quiz on the Outlook interface.","topics":["The Interface Outlook","Performing Basic Email Functions","Outlook Help","Exploring the Outlook Interface Quiz"]},{"name":"Module","details":"Enhancing Email Messages in MS Outlook","description":"In this module, Enhancing Email Messages in MS Outlook, students will learn about improving your email messages when using Outlook. Students will learn about creating a message and new email on outlook. The module will teach students how to format message content and attach files to a message/ Students will also learn about enhancing email.","topics":["Creating Message and New Email on Outlook","Spelling and Grammar Check","Formatting Message Content","Attaching Files to a Message","Enhancing Email Messages","Managing Automatic Message Content","Enhancing Email Messages in Outlook Quiz"]},{"name":"Module","details":"Customizing Reading Options and Attachments in MS Outlook","description":"In this module, Customizing Reading Options and Attachments in MS Outlook, students will learn about reading options in Microsoft Outlook. Students will learn about how to customize the reading options in Outlook. The module will also go over types of attachments. The module wraps up with managing your email responses.","topics":["Customizing Your Reading Options","Attachments","Managing Your Email Responses","Customizing Reading Options and Attachments in MS Outlook Quiz"]},{"name":"Module","details":"Managing and Organizing Messages in MS Outlook","description":"In this module, Managing and Organizing Messages in MS Outlook, students will learn about organizing messages in Microsoft Outlook. Students will also learn about managing messages in Microsoft Outlook using tags. The module will then also over organizing messages within Microsoft Outlook using folders.","topics":["Managing Messages Using Tags","Organizing Messages Using Folders","Managing and Organizing Messages in MS Outlook Quiz"]},{"name":"Module","details":"Managing Calendar and Appointments in MS Outlook","description":"In this module, Managing Calendar and Appointments in MS Outlook, students will learn about the calendar and its options in Microsoft Outlook. Students will learn about the making and managing appointments in the Microsoft Outlook. The module will also go over managing meetings in Outlook and printing out your calendar.","topics":["Calendar on MS Outlook","Managing Appointments","Managing Meetings","Printing Your Calendar","Managing Calendar and Appointments in MS Outlook Quiz"]},{"name":"Module","details":"Creating and Organizing Contacts in MS Outlook","description":"In this module, Creating and Organizing Contacts in MS Outlook, students will learn about contacts in Microsoft Outlook. Students will learn how to create and update Microsoft Office 2013. The module will also show students how to view and organize their contacts in Microsoft Outlook.","topics":["How to Create and Update Contacts","Viewing and Organizing Contacts","Creating and Organizing Contacts in MS Outlook Quiz"]},{"name":"Module","details":"Managing Tasks and Notes in MS Outlook","description":"In this module, Managing Tasks and Notes in MS Outlook, students will learn about the various tasks in Microsoft Outlook. Students will learn about the different types of tasks in Microsoft Outlook and how to manage them. The module will also go over how to manage notes in outlook as well.","topics":["Managing Tasks","Managing Notes","Managing Tasks and Notes in MS Outlook Quiz"]},{"name":"Module","details":"Customizing MS Outlook Interface and Managing Quick Steps","description":"In this module, Customizing MS Outlook Interface and Managing Quick Steps., students will learn about the Microsoft Outlook interface. The module starts with teaching students how to customize the Microsoft Outlook interface. The module will then wrap up with teaching students how to manage quick steps.","topics":["Customizing MS Outlook Interface","How to Create and Manage Quick Steps","Customizing MS Outlook Interface and Managing Quick Steps Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["MS Outlook 2013 Basic - Course assessment"]}]}