{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2758","title":"Diploma in MS PowerPoint 2013 Advanced","totalEnrolled":"2,994","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Microsoft PowerPoint 2013 in this free online course to improve your presentation skills.","description":"Polish your presentation skills in this MS PowerPoint 2013 training course. You may already know how to add a slide and include a transition but can you make your presentation really stand out? Making full use of PowerPoint requires knowledge of various tips and tricks that we go over in this course. We show you how to modify the program’s working environment, customize design templates and slide shows, add ‘SmartArt’ and more.","courseOutcomes":["Modify the PowerPoint environment...","Explain how to secure and distribute...","Outline how to collaborate on a pres...","Highlight how to add media and anima...","Modify the PowerPoint environment","Explain how to secure and distribute a presentation","Outline how to collaborate on a presentation","Highlight how to add media and animation to a presentation","Lay out the steps to take to customize a slide show","Modify the PowerPoint environment...","Explain how to secure and distribute...","Outline how to collaborate on a pres...","Highlight how to add media and anima...","Modify the PowerPoint environment","Explain how to secure and distribute a presentation","Outline how to collaborate on a presentation","Highlight how to add media and animation to a presentation","Lay out the steps to take to customize a slide show"],"courseDescription":"<p>Imagine you’re applying for a new job. You look at your hard skills and think to yourself, “I can make a presentation so I’ll add ‘PowerPoint’ to my resumé.” Fast forward to the boardroom and you’re at the front. One person is asleep, another is confused and your boss is changing colours as they try to process how they feel about your awful presentation. You cast your mind back to that course you saw on Alison.com that you wanted to take in order to update your PowerPoint skills and then forgot. If only things could be different.</p><p>But wait, they still can! Don’t let this happen to you. Whether you use it often or not, mastery of PowerPoint is a useful hard skill for many professional occasions. This training course teaches you more than just basic transitions as it shows you how to really engage with your audience through compelling visuals. We explain how to customize the user interface to fit your needs and explore the program’s various available options.</p><p>Using Powerpoint means working with media, animation, video and audio - all components of an effective and interactive presentation. Develop the confidence to collaborate with others by saving and sharing via the web and impress your colleagues by showing them how to annotate a presentation and add hyperlinks. Don’t be the future version of you that missed out on this opportunity. Be the smart you that had everyone cheering you as you nailed that presentation. This Powerpoint training course teaches you everything you need to know to impress your future colleagues and get ahead.</p><a href=\"https://alison.com/resume/courses/2758\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2758\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Modifying the Powerpoint Environment","description":"","topics":["Customize the User Interface","Set PowerPoint 2013 Options","Modifying the Powerpoint Environment Quiz"]},{"name":"Module","details":"Customizing Design Template","description":"","topics":["Modify Slide Masters and Slide Layouts","Add Headers and Footers","Modify the Notes Master and the Handout Master","Customizing Design Template Quiz"]},{"name":"Module","details":"Adding SmartArt to a Presentation","description":"","topics":["Create SmartArt","Modify SmartArt","Adding SmartArt to a Presentation Quiz"]},{"name":"Module","details":"Working with Media and Animation","description":"","topics":["Add Audio to a Presentation","Add Video to a Presentation","Customize Animations and Transitions","Working with Media and Animation Quiz"]},{"name":"Module","details":"Collaborating on a Presentation","description":"","topics":["Review a Presentation","Store and Share Presentations on the Web","Collaborating on a Presentation Quiz"]},{"name":"Module","details":"Customizing a Slide Show","description":"","topics":["Annotate a Presentation","Set Up a Slide Show","Create a Custom Slide Show","Add Hyperlinks and Action Buttons","Record a Presentation","Customizing a Slide Show Quiz"]},{"name":"Module","details":"Securing and Distributing a Presentation","description":"","topics":["Secure a Presentation","Broadcast a Slide Show","Create a Video or a CD","Securing and Distributing a Presentation - Quiz"]},{"name":"Module","details":"Course assessment","description":"","topics":["MS PowerPoint 2013 Advanced - Course assessment"]}]}