{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3128","title":"MS Project 2013 Advanced","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about more advanced aspects of MS Project 2013 with this free online course.","description":"‘MS Project 2013 Advanced’ is a free online course that discusses the features through which critical aspects of project management can be addressed. Learn about planning, scheduling, collaboration, reporting, resource management, and more. With advancing technology in all fields of work these days, using software to manage projects is the best and most effective option. Register for this course today and boost your project management skills!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>MS Project 2013 is the preferred project management tool that enables project managers to handle complex projects with multiple tasks. By taking this course, you will learn the more advanced aspects of this popular project management software. This course will teach you how to use this tool to develop a plan, baseline and forecast using reporting tools. You will also learn how to track and control project commitments, communicate these and report the status of resources and deliverables, ensuring timely completion. Explore various shortcuts for opening and saving files, assigning resources, managing project costs, setting up earned value tracking, and much more. Discover handy tips for exchanging data with other projects as well as linking and embedding data. The course is built around simplifying your life and helping your projects succeed. It is a follow-up to the Microsoft Project 2013 Basic course, ideal for those seeking to enhance their project management expertise.</p><p>Without the right tools, project planning and management can become overwhelming. This course incorporates the requisite tools for both sides of the equation. You will be presented with the advanced project management features Microsoft Project has to offer, and you will learn how to develop a project plan and allocate resources to diverse tasks. Furthermore, you will study the techniques of tracking the progress of a project and managing a budget. You will explore how to effectively modify the built-in templates of MS Project to suit a project’s requirements. You will master how to manage tasks and resources, work with calendars and create detailed project plans. Knowing how to use Microsoft Project’s desktop tool for managing projects is a necessity in the project management world. How else would you efficiently keep track of and report on multiple project variables, including tasks, resources, timing and milestones? When it comes to reporting, the course will show you how to generate eye-catching graphical and visual reports. Additionally, you will learn how to customize fields and share various customizations and configurations.</p><p>This comprehensive course provides you with an advanced-level understanding of this important software which will be of immense value to you within your project management role. In addition to examining task lists and structures, this course teaches you how to manipulate project views and produce useful reports. Project managers and other business professionals who are familiar with Microsoft Project 2013 and want to step up their game will greatly benefit from this course. The course would also be of benefit to students of all academic backgrounds, however, a basic knowledge of Microsoft Project would be an advantage. If you are interested in project management, or you are a professional seeking additional knowledge in this field to improve your project management skills, this advanced course is for you. Register for this free online course today and take your professional skills to the next level!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}