{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3127","title":"MS Project 2013 Basic","totalEnrolled":"2,817","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the basics of Microsoft Project 2013 in this free online course for beginners.","description":"This course is designed for new users of Microsoft Project 2013. It discusses the features of this project management software product and includes rich illustrations for easy comprehension. MS Project 2013 improves the efficiency, organization and speed of project completion. Register for this course today and take your career to the next level!","courseOutcomes":["Define project management...","Identify the five phases and process...","Explain how to change working time i...","Explain how to add holidays to a cal...","Define project management","Identify the five phases and processes of a project","Explain how to change working time in a project","Explain how to add holidays to a calendar","Explain what the priority field is","Define a summary task","Identify how to allocate work resources","Define work resources","Describe what the file menu does","Identify how to print a project view","Define project management...","Identify the five phases and process...","Explain how to change working time i...","Explain how to add holidays to a cal...","Define project management","Identify the five phases and processes of a project","Explain how to change working time in a project","Explain how to add holidays to a calendar","Explain what the priority field is","Define a summary task","Identify how to allocate work resources","Define work resources","Describe what the file menu does","Identify how to print a project view"],"courseDescription":"<p>MS Project, the project management software program by Microsoft, is a must-have tool for project managers. The software helps develop a schedule, assign resources to tasks, track progress, manage budgets and analyze workloads for ongoing projects. This course discusses the various features of the software program along with examples for easy understanding. The tool improves the efficiency, organization, and speed of project completion and is available in a standard as well as a professional version. The professional version includes extra features such as tools for team collaboration and access to Microsoft's Project Server. Both versions allow users to keep track of every aspect of a variety of project types, including the ability to share and communicate between programs, trace task paths and create graphical reports.</p><p>If you are new to Microsoft Project 2013 or upgrading from an older version of the software, then this course is designed specifically for you! Knowledge of Microsoft Project is a great advantage for anyone whose job involves managing many people and resources. Discover how to design custom projects, use templates, and export your work to other Microsoft programs. You will explore other functionalities ranging from uploading to the cloud, allocating resources, managing calendars, the touch screen feature and much more. This course educates you on how to better manage your project's deadlines, tasks, and resources. Study how to handle standard procedures such as setting up project files, creating tasks, assigning resources, and using baseline calculations to track progress. Plus, you will learn how to report project information and share it with others.</p><p>‘Microsoft Project 2013 Basic’ is a free online course created for businesses and professionals to help better manage individual projects within companies. Over time, some principles of MS Project have changed, and in the MS Project 2013 version, there have been many additions and functional changes. Decades ago, everything would be done on paper. You'd have pages of notes, and copies would be made for everyone who had a role in the project. Nowadays, project management software can make managing and completing a project easier than ever before. Tracking the progress of a project is as easy as signing into the program. This course is intended for students, researchers, project managers and anyone interested in gaining relevant project management career skills. Upon successful completion of this course, you will possess all the tools you need to use Microsoft Project 2013 to organize, access, and deliver your projects in record time. So, what are you waiting for? Begin this course today and boost your project management skills!</p><a href=\"https://alison.com/resume/courses/3127\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3127\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Navigate and Customize the Project 2013 Interface","description":"In this module, you will be taken through the Microsoft Project 2013 Basic. You will understand how to define Project Management and how to navigate and customize the project 2013 interface. You will also learn how to add tasks, add resources to a project and how to save a project file.","topics":["Navigate and Customize the Project 2013 Interface - Learning Outcomes","Project Management 101","Navigating and Customizing the Project 2013 Interface","Adding Tasks To a Project","Adding Resource To a Project","Saving Your Project","Navigate and Customize the Project 2013 Interface - Lesson Summary","Navigate and Customize the Project 2013 Interface - Assessment"]},{"name":"Module","details":"Manage Project Timeframes","description":"In this module, you will be taken through Project Calendars. You will understand how to manage project timeframes, and also how to change working time. Additionally, learn how to change your working time for a project. Learn to understand the project tab, and how you can modify the working time or holidays for the calendar that acts as an umbrella for your entire project.","topics":["Manage Project Timeframes - Learning Outcomes","Managing Project Time Frames","Changing The Working Time For a Project","Manage Project Timeframes - Lesson Summary","Managing Project Timeframes - Assessment"]},{"name":"Module","details":"Manage Project Tasks","description":"In this module, you will learn about Manage Project Tasks. You will be taken through how to work with project tasks, understand how to manage your project tasks in more detail including how to add summary tasks and milestones.","topics":["Manage Project Tasks - Learning Outcomes","Managing Project Tasks","Adding Summary Task and Milestones","Manage Project Tasks - Lesson Summary","Manage Project Tasks - Assessment"]},{"name":"Module","details":"Manage Project Resources","description":"In this module, you will learn about managing project resources on MS Project 2013. You will be taken through how to use task information and resource dialogue boxes. Learn how to allocate and level work resources from this module.","topics":["Manage Project Resources - Learning Outcomes","Managing Project Resources","Levelling Resources","Manage Project Resources - Lesson Summary","Manage Project Resources - Assessment"]},{"name":"Module","details":"Print Project Views","description":"In this module, you will learn about Printing Project Views. You will be taken through how to deliver a project plan and the process of printing project views. This module also explores how to share and export projects.","topics":["Print Project Views - Learning Outcomes","Printing a Project View","Sharing Projects","Print Project Views - Lesson Summary","Print Project Views - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["MS Project 2013 Basic - Course Assessment"]}]}