{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4797","title":"Network Forensics Examiner","totalEnrolled":"2,444","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about network-based evidence and how to become a network forensics examiner in this free online course.","description":"This course on network forensics will get you started on becoming a certified network forensics examiner. We focus on the best practices in network forensic investigation and teach you how to investigate network-based evidence, physical interception, traffic acquisition and wireless attacks. You will also learn to analyse network data and install the best traffic acquisition software for your devices. Start this course today.","courseOutcomes":["Identify the challenges relating to ...","Discuss the network forensics invest...","Outline the principles of internetwo...","Distinguish between IP version 4 and...","Identify the challenges relating to network forensics evidence","Discuss the network forensics investigative methodology","Outline the principles of internetworking and networking.","Distinguish between IP version 4 and IP version 6","List some network intrusion detection tools used to capture network traffic","Identify network devices where you can find information or evidence","Explain the legal issues involved with creating and using logs for forensic investigation","Identify the challenges relating to ...","Discuss the network forensics invest...","Outline the principles of internetwo...","Distinguish between IP version 4 and...","Identify the challenges relating to network forensics evidence","Discuss the network forensics investigative methodology","Outline the principles of internetworking and networking.","Distinguish between IP version 4 and IP version 6","List some network intrusion detection tools used to capture network traffic","Identify network devices where you can find information or evidence","Explain the legal issues involved with creating and using logs for forensic investigation"],"courseDescription":"<p>Network forensics is a digital forensics branch that checks and analyses computer network traffic to gather evidence. As a network forensic investigator, you must be mindful of everything you handle or collect. We begin by familiarising you with definitions and terminologies used in digital investigations. You will learn concepts such as real, circumstantial, network-based digital evidence and many more. Next, examine the challenges you may encounter when gathering evidence as a network forensics examiner.</p><p>As you become acquainted with the network environment, you will review the methodologies, principles and sources of network-based evidence. You will also study the history and components of the internet protocol suite and the physical interceptions of networking. We will introduce network traffic acquisition tools and software like libpcap, WinPcap, tcpdump and Wireshark. Finally, explore the wireless environment and some key technology areas to pay attention to from a forensics point of view.</p><p>Network administrators cannot prevent attacks even if they implement all security measures. Therefore, the course will critically examine some network intrusion detection tools used to capture network traffic and create alerts from different kinds of attacks. You will also scrutinise network devices such as the storage media, switches, routers and firewalls where you can find information. Additionally, you will learn details about malware in general that forensic examiners should pay attention to. We have designed this course to take your network forensic investigative skills to the next level with practical examples and real-world scenarios. Register now!</p><a href=\"https://alison.com/resume/courses/4797\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4797\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Network Forensics Protocols","description":"This module will teach you some definitions and terminologies used in digital evidence. You will also study challenges in acquiring network evidence as well as the methodology used in collecting network forensic evidence. Also, you will get to understand some networking principles and explore essential network acquisition software and tools.","topics":["Network Forensics Protocols - Learning Outcomes","Concepts of Digital Evidence","Network Evidence Challenges","Network Forensics Investigative Methodology","Network-Based Evidence","Network Principles","Internet Protocol Suite","Physical Interception","Traffic Acquisition Software","Live Acquisition","Layer 2 Protocol","Network Forensics Protocols - Lesson Summary"]},{"name":"Module","details":"Network Investigative Tools","description":"In this module, you will learn the fundamentals and challenges of protocol analysis and wireless access points. You will also examine some wireless traffic capturing tools and software. Types of operating system logs and web proxies will be analyzed. Also, you will explore network tunnelling, malware forensics and the legality of using logs.","topics":["Network Investigative Tools - Learning Outcomes","Protocol Analysis","Wireless Access Points","Wireless Traffic Capture and Analysis","Network Intrusion Detection System/Snort","Centralized Logging and Syslog","Investigating Network Devices","Web Proxies and Encryption","Network Tunneling","Malware Forensics","Network Forensics and Investigating Logs","Network Investigative Tools - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Network Forensics Examiner - Course Assessment"]}]}