{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4024","title":"Networking Theory and Architecture","totalEnrolled":"1,655","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Acquire the basic knowledge needed to understand networks and their arrangements in this free online networking course.","description":"The journey to solid expertise in network architecture starts by understanding the fundamental framework at the heart of computer network design. This computer organisation and architecture course covers the basics of computer networks, with an emphasis on network infrastructure and protocols. Learn the process of organizing and configuring various components to implement a network as well as the critical functions of computer networks.","courseOutcomes":["Describe the central properties of a...","Explain how to use the OSI Model to ...","Compare the various network topologi...","Identify what devices are considered...","Describe the central properties of a LAN, WAN, MAN and WLAN","Explain how to use the OSI Model to troubleshoot network issues","Compare the various network topologies","Identify what devices are considered network devices","List the numerous types of wired network connections","Outline the different types of wireless network connections","List the four requirements for a computer to communicate correctly over a TCP/IP network","Explain the purpose of a VPC and the three types of VPN in use","Recall the function of virtual servers, virtual switches, and virtual network interfaces","Summarise the network planning process","Describe the central properties of a...","Explain how to use the OSI Model to ...","Compare the various network topologi...","Identify what devices are considered...","Describe the central properties of a LAN, WAN, MAN and WLAN","Explain how to use the OSI Model to troubleshoot network issues","Compare the various network topologies","Identify what devices are considered network devices","List the numerous types of wired network connections","Outline the different types of wireless network connections","List the four requirements for a computer to communicate correctly over a TCP/IP network","Explain the purpose of a VPC and the three types of VPN in use","Recall the function of virtual servers, virtual switches, and virtual network interfaces","Summarise the network planning process"],"courseDescription":"<p>A career in network architecture is both lucrative and is in high demand. It is an ideal career for people that enjoy solving complex problems and thinking systematically. This free online network certification will help you get started by understanding network theory and architecture. It begins by illustrating the framework at the heart of networks, the OSI model. You will discover how a network works and how its various components are organized and interconnected, and how Wide Area Network (WAN) network technology enables internet access by involving all the elements. The various network topologies (how networks are arranged) is studied before moving on to the kinds of wired network devices that you will come across in the field.</p><p>This computer networking course continues by teaching you the concepts and functions of network devices, wired connections, connectors, routers, switches, firewalls, network devices, cables, wiring standards, and connections. In the field of networking, one of the most important topics is that of servers and how they operate. This is the next key theme in this computer networking certificate and you will discuss the responsibilities of Dynamic Host Configuration Protocol (DHCP) and Domain Name System (DNS) servers, along with different kinds of wireless connections and IP fundamentals. We will also explain the components required for computers to communicate over a Transmission Control Protocol/Internet Protocol (TCP/IP) network.</p><p>Virtualization is critical in modern computing and with the complexities of modern IT infrastructure, the last part of this computer network tutorial explains the various aspects of virtualization that aid in making your network hardware independent. The course concludes by teaching you about the routing protocols and advantages of software-defined networking (SDN) over traditional networking. This introduction to computer networks course is a great one to enrol in if you are in a different sphere of IT and need a refresher or if you want to become a network expert and want to kickstart your career with some solid, technical knowledge that you can apply immediately.</p><a href=\"https://alison.com/resume/courses/4024\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4024\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Network Fundamentals to Implementation","description":"This module begins with network fundamentals, including network theory, the OSI model, and topologies, before moving to network devices (both wired and wireless), routing protocols, virtualization, and network implementation.","topics":["Network Fundamentals to Implementation - Learning Outcomes","The Basics of Networks and WAN","Network Devices, Wired Connections and Connectors","Wireless, DHCP, DNS and Addressing Schema","Routing Protocols, Virtualization, SDN, and Network Planning","Network Fundamentals to Implementation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Networking Theory and Architecture - Course Assessment"]}]}