{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3894","title":"New Microsoft Excel Functions for 2021","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use the various new MS Excel functions introduced in MS Office 365 with this free online Excel course.","description":"This free online course will teach you about the various MS Excel functions that have been added to Office 365 and you will learn about dynamic arrays, their importance in MS Excel and how to use them. Other key learning areas include the importance, syntax structure, and numerous examples of functions like RANDARRAY, SORT, FILTER, CONCAT, IF, and SWITCH along with how to master the skills needed to create powerful management reports.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Every day, businesses all over the world generate massive amounts of data. This data is useless unless it is sorted and organized in order to extract meaningful information from it. Excel is one of the tools used by businesses all over the world to extract this valuable information and generate meaningful reports. Excel is a powerful tool that is used not only by businesses but also by individuals for personal purposes, such as maintaining and tracking expenses. People who are skilled with this tool are in high demand and have an advantage in the job market over those who are not. MS Excel is a data organizing and calculation program which is capable of analyzing data, computing statistics, creating pivot tables, and displaying data in the form of a chart or graph and this free online Microsoft Excel tutorial will explore some of the newer advanced features.</p><p>The use of functions is a powerful tool provided by MS Excel and these mathematical formulas allow quick and precise processing of data that would otherwise be time-consuming to do. This Microsoft Excel certification focuses on these powerful functions and the reports that can be generated by using them. A function has three basic parts: the ‘=’ sign which signifies the start of the function, the function name and the parameters or arguments and each of these parts plays an important role in the proper execution of the function. This particular Microsoft Excel training course will focus on functions like RAND, RANDBETWEEN, RANDARRAY, and other functions like SEQUENCE, SORT, FILTER, CONCAT, TEXT-JOIN. You will discuss the intricacies of these functions including practical examples so you can see these functions in action. Some other important bits covered in this free Microsoft Excel training will teach you how to generate lists, sort complex data as well as filter important information from a pool of data which has vast business applications.</p><p>Learning MS Excel functions makes your work easier, more efficient, and improves the quality of your reports and other information sheets. If you want to know how to use these new formulas and functions to increase your productivity exponentially, then you should enroll for this Microsoft Excel online course. These in-demand technical data processing skills will work for you as a business professional in anything from business management, to business administration and finance and this course would be ideal in order to improve the speed and quality of your work as well as the value that you add to your team.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}