{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1545","title":"Operating Systems - Introduction to Scheduling","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about scheduling processes in a single processor, in multi-processors, and in Linux systems with this free course.","description":"This free online course in operating systems will teach you about operating system scheduling. All operating systems depend on process scheduling to execute processes efficiently. With this course, you will learn how these resources are allocated appropriately to increase throughput time, reduce wait time, and increase responsiveness and turnaround times with a single or multiple processors in a Linux operating system.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first teach you the different methods of process scheduling. You will study the two phases of execution which are the CPU Burst and the CPU Idle. You will also learn how scheduling works in a Multiprocessor environment. The course will then discuss Static Priority and Dynamic Priority which are the two main types of Priority for a process. You will also study the Strawman approach for multi-processor scheduling and the Symmetrical Scheduling approach.</p><p>Linux classifies processes into two types: Real Time and Normal Processes. This course will teach you the functions of each type as well as how Completely Fair Scheduling (CFS) works in Linux. You will then study the schedulers that are used in Linux which include the O(n) scheduler, the O(1) scheduler, and the CFS scheduler. The course will also cover the Process Control Block (PCB) which is used to track a process’s execution status.</p><p>Every computer OS programmer needs to understand priority-based scheduling and how to set priorities for processes. By taking this course, you will learn all the techniques for multiprocessor scheduling and how they work. This will give your professional skills, and your résumé, a solid boost, and open up a much wider range of job opportunities for you around the world. So why wait? Check out the course today, and start moving forward.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}