{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4765","title":"Password-Less Authentication Guide Using Facebook Account Kit","totalEnrolled":"314","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to build password-less authentication apps using Facebook Account Kit.","description":"Password-less authentication eliminates reliance on passwords and ensures that online business customers get a flawless login experience. Facebook Account Kit is an excellent option for any app developer wishing to implement mobile number-based or email-based authentication. This course teaches you the step-by-step process of creating a password-less user login page with PHP using the Facebook Account Kit. Enrol today!","courseOutcomes":["Describe how to install and configur...","Identify basic HTML elements and att...","Recall how to apply some basic CSS s...","Explain how variables, functions and...","Describe how to install and configure the XAMPP local server","Identify basic HTML elements and attributes","Recall how to apply some basic CSS selectors for styling a page","Explain how variables, functions and arrays are used in PHP language","Recognise how to write a simple PHP program using functions, operators and arrays","List 10 types of operators of the PHP language","Summarise how to create a Facebook developer account","Discuss how to create a passwordless app using PHP, HTML, CSS and Facebook Account Kit","Describe how to install and configur...","Identify basic HTML elements and att...","Recall how to apply some basic CSS s...","Explain how variables, functions and...","Describe how to install and configure the XAMPP local server","Identify basic HTML elements and attributes","Recall how to apply some basic CSS selectors for styling a page","Explain how variables, functions and arrays are used in PHP language","Recognise how to write a simple PHP program using functions, operators and arrays","List 10 types of operators of the PHP language","Summarise how to create a Facebook developer account","Discuss how to create a passwordless app using PHP, HTML, CSS and Facebook Account Kit"],"courseDescription":"<p>Many websites require their users to register or log in to an account to have exclusive access to their services. This step usually involves the need to create complex and unique passwords for each user, typically changing them frequently to avoid data breaches. A user can have multiple accounts with different websites and memorising these passwords can be daunting. This need has resulted in the repetition of the same weak passwords, note pads containing passwords and the frequent use of the 'forgot password' feature. It's no surprise that passwords have become a popular target for cybercriminals. The Facebook Account Kit allows users to log into new apps and websites using only their phone number or email address. This course will teach you how to use the Facebook Account Kit to create password-less authentication using the PHP programming language.&nbsp;</p><p>How do you implement password authentication? Creating password-less authentication requires a web server. We begin by showing you how to download and install XAMPP, which you will use during the entire course. We'll then show you how to set up the Atom code editor you'll use to write your PHP code. After that, you'll study the fundamentals of HTML and CSS, including how to use the CSS library (Bootstrap). Having learned about these fundamentals, you will write your first PHP code within the HTML document. You'll learn about PHP variables and functions and how they work. In addition, we'll discuss the different types of operators used in PHP and explore the concept of PHP objects. This course provides a resource guide that contains a list of complete PHP operators that you can use within a PHP code. You will research PHP arrays and how you can use them.&nbsp;</p><p>Next, we demonstrate how to create a login page using the fundamental concepts of PHP. We'll be using a live secure website where our PHP code will be deployed and then implement the password-less authentication functionality using the Facebook app and the Account Kit. Once logged in, you'll create a Facebook developer account and learn how to create a new app. Next, examine how to log into your cPanel and create your PHP files directly on the web server. Next, we investigate how to design the user login page using HTML and CSS style tags, including creating the ‘form’ action and using the ‘post’ methods for a request-response between a client and server. Lastly, we cover how to initialise the Account Kit and use the login callback function. This course requires that learners have a basic knowledge of HTML, CSS and PHP. The Facebook Account Kit is easy and quick to adapt for both new and old web apps, allowing you to focus on developing your main product rather than designing a login system and managing password storage. So why wait? Register today.</p><a href=\"https://alison.com/resume/courses/4765\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4765\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Password-less Authentication","description":"In this module, you will learn about the fundamentals of HTML and CSS including how to use them to create a login page. We will then show you how to use the PHP back end and Facebook Account Kit to create the passwordless login page that only requires either an email or phone number for login.","topics":["Password-less Authentication - Learning Outcomes","HTML and CSS","PHP Fundamentals","Facebook Account Kit","Building the Login Page","Page Authentication","Password-less Authentication - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Password-Less Authentication Guide Using Facebook Account Kit"]}]}