{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3270","title":"Perl Fundamentals","totalEnrolled":"296","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you to program in Perl, a general-purpose programming language.","description":"The Perl programming language is commonly used for file processing. This free online course will teach you about the various concepts used to manipulate Perl codes. You will learn how to use string functions, lists, conditional statements, different types of loops as well as subroutines. You will also learn about literals and variables in Perl. This course is useful in developing error-free programs, graphical user interfaces or managing data.","courseOutcomes":["Discuss briefly the history of the P...","Recognize how to create and use vari...","Recognize loops and conditional stat...","Distinguish between lists and arrays...","Discuss briefly the history of the Perl programming language","Recognize how to create and use variables","Recognize loops and conditional statements in Perl programming","Distinguish between lists and arrays","Outline the syntax for creating an array","Explain standard input and output files in Perl programming","Define hashing and outline the syntax for creating a hash","Define subroutines, and create and invoke subroutines using the appropriate syntax","Outline regular expressions to solve different problems","Compare and contrast different regular expressions","Recognize metacharacters and the qualifiers acceptable in Perl","Discuss briefly the history of the P...","Recognize how to create and use vari...","Recognize loops and conditional stat...","Distinguish between lists and arrays...","Discuss briefly the history of the Perl programming language","Recognize how to create and use variables","Recognize loops and conditional statements in Perl programming","Distinguish between lists and arrays","Outline the syntax for creating an array","Explain standard input and output files in Perl programming","Define hashing and outline the syntax for creating a hash","Define subroutines, and create and invoke subroutines using the appropriate syntax","Outline regular expressions to solve different problems","Compare and contrast different regular expressions","Recognize metacharacters and the qualifiers acceptable in Perl"],"courseDescription":"<p>The fundamentals of Perl programming is a free online course that has been specially prepared to give you a comprehensive guide on the various concepts used to manipulate Perl codes. Before creating Perl scripts, it is important to understand the various functionalities Perl provides and identify the correct version of Perl to install. This course will take you through a brief history of Perl programming language, the different versions of Perl and reasons why Perl language should be used. This course introduces you to how Perl stores variables, the types of variables and variable interpolation. Have you considered formatting text in your codes such that it suits your needs? This course will teach you how to use string functions to change the case of text, explore escape characters and make a number of strings into a single string. It illustrates the various syntax types for initializing and manipulating these variables and string functions. You will have a whole lot of debugging to do if you do not enlighten yourself on coding with Perl.</p><p>If you want to know how to create, add and remove items from a list using specific keywords, then you should complete this course. You will be able to differentiate between lists and arrays, sort arrays, and use the maximum element to find the number of items contained in a list. Also, this course will help you test for files using file test operators as well as get information about an already existing file using file handles. Do you know that it is possible to show Perl how to make choices? This course explores the various conditional statements in Perl, such as “elsif” and “if”. It also analyzes Boolean logic and explores ways in which your codes can be made efficient by executing the right codes. This course explains in detail command line inputs. If you have struggled with differentiating the Perl syntaxes for carrying out various functionalities across the language, then this course is for you.</p><p>Furthermore, you will also learn about using loops to iterate a collection of items, conditional logic circuits as well as how to move around a loop. This course will take you through setting up, creating and invoking subroutines. You will also learn to detect “undef” in Perl. If you are familiar with other programming languages or have very little programming experience, taking this course on Perl fundamentals can have you writing useful and error-free programs in a very short time. This course will explain in detail literals and metacharacters. You will be able to match a set of characters, range digits, regular expressions, negate ranges and identify the patterns provided by Perl. ‘Perl Fundamentals’ will be of great interest to students, researchers and anyone with an interest in creating programs using Perl language. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3270\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3270\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Perl","description":"In this module, you will be introduced to the general-purpose programming language Perl. This module explores a brief history of Perl, string functions, variable interpolation, and how to use loops to iterate collections of items. It illustrates the uses of variables and distinguishes between single and double coated strings.","topics":["Introduction to perl - Learning Outcomes","Introduction to Perl","Literals and Variables","String Functions","Variables","Conditionals","Loops","Introduction to perl - Lesson Summary","Introduction to perl - Assessment"]},{"name":"Module","details":"Data Structures, Input and Output","description":"In this module, you will be introduced to the manipulation of codes in Perl using various concepts like the list, list demos, array interpolation, and command-line input. This module explores adding, changing and accessing key values in a hash. Also, it illustrates testing for files using test operators as well as provides the various syntax for these Perl concepts.","topics":["Data Structures, Input and Output - Learning Outcomes","Lists","List Demos","Command Line Input","File Input and Output","Hashing","Data Structures, Input and Output - Lesson Summary","Data Structures, Input and Output - Assessment"]},{"name":"Module","details":"Subroutines and Regex","description":"In this module, you will be introduced to creating and invoking subroutine in Perl. This module explores manipulating Perl codes with text manipulations, metacharacters and single regular expressions. Also, it illustrates global modifier, private subroutines and variable argument list in Perl programming language.","topics":["Subroutines and Regex - Learning Outcomes","Subroutines","Arguments and Return Values","Simple Regular Expressions","Metacharacters","Text Manipulations","Subroutines and Regex - Lesson Summary","Subroutines and Regex - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Perl Fundamentals - Final Assessment"]}]}