{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3969","title":"Photo Editing Using Adobe Lightroom","totalEnrolled":"3,853","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will equip you with the skills and techniques required to edit images using Adobe Lightroom.","description":"If you have a deep appreciation for a beautiful image and are creative, then you have come to the right place. Arm yourself with the skills required to edit various types of images using Adobe Lightroom with this free online Adobe Lightroom tutorial. You will learn how to adjust images, add effects and make transformations in Adobe Lightroom to all kinds of images including landscape images, cityscape images, portrait images, and much more.","courseOutcomes":["Distinguish between a folder and a s...","State the importance of creating a p...","Recall the two methods of importing ...","Explain the purpose of rating photos...","Distinguish between a folder and a subfolder in Adobe Lightroom","State the importance of creating a photo catalog in Adobe Lightroom","Recall the two methods of importing photos in Adobe Lightroom","Explain the purpose of rating photos in Adobe Lightroom","State the functions of a histogram in AdobeLightroom","Define clipping as applied in Adobe Lightroom","Recall the types of clipping in Adobe Lightroom","Identify various local adjustment tools in Adobe Lightroom and state their functions","Describe how to separate two colors from each other in Adobe Lightroom","Distinguish between a landscape and cityscape image","State the functions of the exposure slider in Adobe Lightroom","Explain what is meant by lowlight images","Distinguish between shadows and highlights","Explain what a noise is in photography","Distinguish between a folder and a s...","State the importance of creating a p...","Recall the two methods of importing ...","Explain the purpose of rating photos...","Distinguish between a folder and a subfolder in Adobe Lightroom","State the importance of creating a photo catalog in Adobe Lightroom","Recall the two methods of importing photos in Adobe Lightroom","Explain the purpose of rating photos in Adobe Lightroom","State the functions of a histogram in AdobeLightroom","Define clipping as applied in Adobe Lightroom","Recall the types of clipping in Adobe Lightroom","Identify various local adjustment tools in Adobe Lightroom and state their functions","Describe how to separate two colors from each other in Adobe Lightroom","Distinguish between a landscape and cityscape image","State the functions of the exposure slider in Adobe Lightroom","Explain what is meant by lowlight images","Distinguish between shadows and highlights","Explain what a noise is in photography"],"courseDescription":"<p>This free online Photo Editing Using Adobe Lightroom course has been carefully crafted to equip photographers and designers with the skills and knowledge needed to edit all types of images using the Adobe Lightroom software application. This Adobe Lightroom quick tutorial begins with an introduction to lightroom, where you will be taken through the various types of images that can be edited in Lightroom, and an overview of editing in Lightroom which covers the methods of importing images and folders into the Lightroom editing scene. The next key topics will teach you about how to set tone curves, hue, saturation, and luminance and then how to create catalogs, subfolders, and folders in Lightroom which shows you some advanced organizing features too.</p><p>There are some fundamentals that you need to know when it comes to categorizing and organizing and these include the importance of rating your images using the three rating methods - it will make your life a whole lot easier if you can make ratings part of your process. Some more technical elements in this Adobe certification follows where all sorts of features are comprehensively covered including the histogram, local adjustment tools, how to set tone curves and sharpen images, noise elimination, global adjustment tools, split toning and lens correction. The last part of the course will teach you how to edit landscape, portrait and cityscape images which specifically covers exposure, lowlight images, small sensors, Milkyway images and “blue hour” images.</p><p>Adobe Lightroom is the premiere photo editor application for all photography levels and it has many features to help you enhance and organize your photos quickly and easily. Photo editing enhances the photo and gives you a second chance to get what you didn’t get right while shooting the image. The options are limitless and even if photos are damaged, they are always able to be improved through the many Adobe Lightroom features. Enrol in this free online Adobe training and bring your images to life whether you are a professional photographer, do photography as a hobby or if</p><a href=\"https://alison.com/resume/courses/3969\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3969\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Adobe Lightroom","description":"In this module, you will be shown an overview of editing different types of photos in lightroom, this includes landscape images, cityscape, lowlight images, etc. You will learn how to set up the editing scene in lightroom, this includes how to import images, create folders, subfolders, and catalogs to aid a faster work rate.","topics":["Introduction to Adobe Lightroom - Learning Outcomes","Adobe Lightroom Overview","Advanced Organizing","Introduction to Adobe Lightroom - Lesson Summary"]},{"name":"Module","details":"Image Adjustment and Effects","description":"In this module, you will learn the functions of a histogram in Lightroom, you will be shown how to make quick edits with the local adjustment tools and how to set tone curves, you will also learn how to sharpen images and reduce the quantity of grain in an image, and also how to use the free transform tool to manipulate images.","topics":["Image Adjustment and Effects - Learning Outcomes","Histogram and Image Adjustment","Effects and Transformations","Image Adjustment and Effects - Lesson Summary"]},{"name":"Module","details":"Image Editing in Lightroom","description":"In this module, you will learn how to edit landscape images and cityscape images, you will learn the functions of shadow slider, and exposure and highlight sliders, and you will also learn how to edit other types of images which includes portrait images, lowlight, small sensor images, etc.","topics":["Image Editing in Lightroom - Learning Outcomes","Landscape, Cityscape and Lighting","Milkyway, Waterfall and Sunrise","Travel Portraits and HDR Panoramic","Image Editing in Lightroom - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Photo Editing Using Adobe Lightroom - Course assessment"]}]}