{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4254","title":"Podcasting Essentials","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to plan your podcast, record high quality audio, edit and publish an episode with this free online course.","description":"Podcasts are audio broadcasts found on the internet that can be delivered automatically to your computer or cellphone. This course examines the prerequisites to start podcasting and explains how to select appropriate topics before delving into the recording process itself. We provide everything you need to know, from your choice of a microphone to what type of advertising may boost revenue. Sign up to become your own broadcaster.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A podcast informs its audience engagingly and conversationally and lets the listener multitask by playing it in the background while doing other activities. This genre of publishing platforms has become increasingly popular in the last few years. Would you like to start your own podcast? This course covers planning, recording, editing and promoting your work. Before breaking down the podcasting process into easy steps, we lay out what you need to start producing and establish the benefits of doing so. We go through various terms and definitions and explain how to select the most suitable topics before formatting and structuring episodes.</p><p>The course then delves into budgeting to help you find the most cost-effective podcasting methods. We also provide some ‘secrets’ on writing scripts while showing you how to set up and monitor crucial parameters before a recording session. We examine different microphone types to let you select the right one to suit your needs and produce the best audio quality. The course demonstrates how to include sound effects in an episode to make it more entertaining. It will also teach you some audio editing as you learn to fix defects with editing software like Audacity. We explain how to generate useful metadata to let potential listeners know what to expect.</p><p>A podcast provides you with an effective way to communicate with thousands of people while earning revenue from subscriptions or marketing. We teach you how to create ‘show notes’ to drive traffic to your podcast on various platforms like Spotify and Podbean. We explore various ways to promote your work to establish a more extensive and more diverse listenership. This course can help you start and monetize your podcast to let you find your voice and express yourself to a widening audience. Whether you’re interested in politics, sports or culture, sign up to make yourself heard.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}