{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3999","title":"Powerful Functions in Excel","totalEnrolled":"3,964","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the most important text, numeric, logical and lookup functions in Microsoft Excel in this free online course.","description":"Microsoft Excel is a very popular data processing and organizing tool and this free online Microsoft Excel course will teach you the most useful functions in the program. You will discover the advantages of using Microsoft Excel and become familiar with its interface, how to create pivot tables along with the uses of the pivot table function including examples, as well as other popular features that will have you organizing data in no time.","courseOutcomes":["Recall the purpose of different menu...","List the use of various logical func...","Summarize various text and numeric f...","Discuss the different types of looku...","Recall the purpose of different menu options in Microsoft Excel","List the use of various logical functions like AND, OR, and NOT","Summarize various text and numeric functions and explain their uses","Discuss the different types of lookup functions in Microsoft Excel","Distinguish between the various random number generation functions","Outline the steps to create a pivot table","Identify the various scenarios to use the IF and IFS functions","Recall the purpose of different menu...","List the use of various logical func...","Summarize various text and numeric f...","Discuss the different types of looku...","Recall the purpose of different menu options in Microsoft Excel","List the use of various logical functions like AND, OR, and NOT","Summarize various text and numeric functions and explain their uses","Discuss the different types of lookup functions in Microsoft Excel","Distinguish between the various random number generation functions","Outline the steps to create a pivot table","Identify the various scenarios to use the IF and IFS functions"],"courseDescription":"<p>MS Excel is capable of analyzing data, computing statistics, creating pivot tables, and displaying data in the form of a chart or graphs. Massive amounts of data are generated by organizations all over the world and this data is useless unless it is sorted and organized so that meaningful information can be extracted from it. Excel is one of the tools that businesses around the world use to extract this valuable information and generate meaningful reports. The use of mathematical formulas known as functions allow you to quickly and easily perform calculations that would otherwise be difficult to perform manually. People who are proficient with this tool are in high demand and have a competitive advantage over those who are not and this Microsoft Excel certification focuses on the most fundamental and useful Excel functions.</p><p>A function consists of three basic components: the ‘=' sign, which indicates the beginning of the function, the function name, and the parameters or arguments. Each of these components are critical to the function's proper execution. As a result, proper syntax writing is required, and this will be covered in this course. Microsoft Excel functions are divided into several categories, including text functions, numeric functions, logical functions, lookup functions, and many others. To begin, you will learn the most basic numeric functions such as SUM, AVG and COUNT. After you've learned how to write and execute a simple function, you will move on to other important text functions like UPPER, LOWER, and PROPER. Following that, various logical functions and scenarios in which logical functions can be used will be demonstrated. Excel contains a number of functions that can assist in the generation of random numbers and two of these are RAND and RANDARRAY,&nbsp; which will both be covered in the following section.</p><p>In Excel, a person must frequently search for a value in a pool of data. It can be a time-consuming process if done manually, so Excel includes functions such as VLOOKUP and XLOOKUP to help with the search. This Microsoft Excel tutorial will also cover the various ways to configure lookup functions. Finally, the use of pivot tables for data filtering will be illustrated. Learning Excel functions simplifies your work and raises the quality of your reports and other information sheets and Excel formulas allow you to do more while saving time. If you know how to use Excel formulas and functions, you can exponentially increase your productivity, whether you are a manager or a new employee. This course is appropriate for students, professionals, or anyone looking to improve their skills and add the most in-demand skill in the market to their portfolio. Enrol today and make the most of this opportunity by mastering Excel functions.</p><a href=\"https://alison.com/resume/courses/3999\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3999\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Excel Functions","description":"This module will teach you the fundamental and most commonly used Excel functions. You will learn proper syntax writing, functionalities, and how to use functions such as VlookUp, XlookUp, Sum, Average, Find, Concat, logical functions, and more.","topics":["Excel Functions - Learning Outcomes","Introduction to Excel","Other Important Excel Functions","Excel Functions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Powerful Functions in Excel - Course Assessment"]}]}