{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4922","title":"Procurement in SAP S/4HANA","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you to use SAP S/4HANA for master data management and procurement automation.","description":"This online procurement course will teach you how to use SAP S/4HANA for master data management, purchase requisition, invoice processing, and inventory management. Learn to utilise the app to optimise your purchasing and procurement processes to maximise operational efficiency in your organisation. Whether you are a beginner or an advanced user of S/4HANA, you will be able to automate your procurement processes by taking this course. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Many organisations have enormous amounts of unprocessed data, which amounts to thousands of gigabytes of resources you can use to speed up business operations and offer higher customer value. With SAP S/4HANA, business organisations can access in-memory processing and real-time data analytics to aid management decisions and ensure the rapid usability of available data. It is an all-in-one solution that facilitates the standardisation of the procurement process in an organisation. It offers an all-inclusive function for vendor management, invoice verification, contract management, inventory processing and operational purchasing.</p><p>This free online course was designed by Winfried Würzer, an in-house consultant for SAP procurement and an MRP controller with over 18 years of experience as a purchaser and trainer. To begin, we will explore the properties of Fiori apps. You will learn about the Fiori app types and its library. Next, we will examine the changes and new features of the Material Master in SAP S/4HANA. Investigate how to use a business partner in a migration project, including how to assign numbers to the business partners and how to maintain business partner roles. We will discuss manual purchase requisitions, purchase requisitions in Employee Self Service (ESS), flexible workflows used for purchase requisitions and analytical apps for purchase requisitions.</p><p>Furthermore, we will demonstrate how to create and manage the templates for purchase contracts. You will learn about contract releases, including the flexible workflows for releasing contracts. Similarly, you will study supplier evaluation methodologies and output management procedures. Included are the methods for posting goods receipts and inventory analysis. Finally, we will consider the SAP Ariba solutions for e-procurement and the additional benefits they add to the procurement process. This online course will help you automate management activities and improve your procurement processes with SAP S/4HANA. Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}