{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4818","title":"Professional Ethical Hacking","totalEnrolled":"6,322","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn highly sought-after skills and techniques to become a professional ethical hacker with this free online course.","description":"Hacking has become one of the most common problems companies face. However, not all hacking is harmful. In this course, you will learn the fundamental concepts of ethical hacking. Cryptography, vulnerability assessments and password cracking are also topics discussed. In addition, learn how to compromise servers, penetrate networks and cover your digital footprint. This course is an excellent place to launch a career in ethical hacking.","courseOutcomes":["Distinguish between ethical hacking ...","Describe an asymmetrically encrypted...","Discuss the impact of denial of serv...","Discuss the impact of social enginee...","Distinguish between ethical hacking and penetration testing","Describe an asymmetrically encrypted password","Discuss the impact of denial of service attacks on an available IT resource","Discuss the impact of social engineering in the IT industry","List the various tools used for hacking a wireless network","Discuss the OWASP’s top 10 most common web application vulnerabilities","Distinguish between active and passive information gathering techniques","Distinguish between ethical hacking ...","Describe an asymmetrically encrypted...","Discuss the impact of denial of serv...","Discuss the impact of social enginee...","Distinguish between ethical hacking and penetration testing","Describe an asymmetrically encrypted password","Discuss the impact of denial of service attacks on an available IT resource","Discuss the impact of social engineering in the IT industry","List the various tools used for hacking a wireless network","Discuss the OWASP’s top 10 most common web application vulnerabilities","Distinguish between active and passive information gathering techniques"],"courseDescription":"<p>Ethical hacking is one of the most in-demand career paths today because of the advancement of technology and the increasing number of systems and network attacks. Most organisations need this capability to identify their weaknesses and flaws before hackers do. We have designed this course to teach you the skills needed to identify protection opportunities and improve the security controls of systems and networks to reduce the risk associated with working on the internet.</p><p>We introduce the concept of ethical hacking and familiarise you with the Linux operating system and command-line interpreters. Next, you will explore the two major network models and study why an ethical hacker must understand network ports and protocols. We investigate cryptography and provide a demonstration of the functionalities of some encryption tools. You will also examine tools and techniques used in password cracking and the evolution of malicious software.&nbsp;</p><p>Before ethical hackers can gain access to a system, they must gather information about the target system. The concluding section will review active and passive reconnaissance and the tools used to collect information about a system. Then you will learn how to perform a vulnerability assessment of a system and discover ways to hack into a network device, server, web application and wireless network. Finally, we explain how to become adept at maintaining access to a system that has been compromised and the importance of covering your tracks after hacking a system. This course is essential for information system owners, cyber security engineers, penetration testers and others in any related field of study. Enrol today.</p><a href=\"https://alison.com/resume/courses/4818\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4818\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Ethical Hacking Fundamentals","description":"This module introduces you to the fundamentals of ethical hacking. You will also learn about the structure of the Linux operating system as well as the different types of ports and protocols. Also, this module will help you understand cryptography, how to creak passwords and explore ways to deal with suspicious malware and viruses.","topics":["Ethical Hacking Fundamentals - Learning Outcomes","Introduction to Ethical Hacking","Linux Fundamentals","Ports and Protocols","Cryptography","Password Cracking","DoS and Malware","Security Devices","Ethical Hacking Fundamentals - Lesson Summary"]},{"name":"Module","details":"Reconnaissance and Hacking","description":"This module will teach you the importance of information gathering before accessing a security system or network. You will also learn about social engineering and how to perform a vulnerability assessment of a security infrastructure. Also, you will study how to hack servers, web technology and wireless networks, as well as cover your tracks.","topics":["Reconnaissance and Hacking - Learning Outcomes","Information Gathering- Reconnaissance-Passive (External Only)","Social Engineering","Reconnaissance-Active Scanning-Enumeration","Vulnerability Assessment","Network Attacks","Hacking Servers","Assessing and Hacking Web Technologies","Hacking Wireless Networks","Maintaining Access and Covering Tracks","Reconnaissance and Hacking - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Professional Ethical Hacking - Course Assessment"]}]}