{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4987","title":"Programming Using Scala Language","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the principles of functional programming in Scala and broaden your programming scope with this free online course.","description":"Scala is a programming language used to build stable static systems and useful apps. It is object-oriented and JVM-based. It can communicate with libraries and run Java programs. It is assumed to be a static type language because the concept of primitive data is absent. Whether you are a seasoned programmer or simply want to grasp some core programming concepts using the Scala programming language, this course is created for you.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course starts by exploring the fundamentals of Scala, which is a wonderful place to start as it helps you better understand how Scala works. First, we will cover the basics of its language. You will learn how to download and set up Scala on any operating system you choose. We then discuss variables and constants, string manipulation and variable-length arrays.</p><p>Progressively, we will delve into list manipulations and maps (mutable and immutable maps), element traversing and streams, tuples and zipping, conditionals and loops. In addition, we will spend time analysing statements and expressions, expression blocks and pattern guards. The Scala language has a powerful feature called pattern matching. It is a system for comparing a value to a pattern. A good match breaks the value down into its component pieces. We will explore match-all and wildcards, downcasting and closures.</p><p>The final section will explore how to use functions and the various signature types and parameterization schemes. When invoking a method or constructor, a named parameter is one for which we explicitly use the parameter's name. We will cover the use of named parameters and the creation of functions with variable parameter counts. Finally, we will examine how to read and write from files using I/O and how to build exception constructions from these operations. So let's get started!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}