{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3481","title":"Diploma in Programming C#: Intermediate","totalEnrolled":"2,402","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the manipulation techniques and applications of C# programming in this free online advanced C# course.","description":"Refine your C# skills with this Programming C#: Intermediate free online course and learn how to apply C# and the many techniques provided by the .NET framework to enhance code functionalities. This advanced C# course covers a host of methods that you will need to take your coding in C# to the next level, including learning about types, operators, the manipulation of strings, looping construct, and processes involved in creating classes.","courseOutcomes":["Analyze the conversion of data types...","Discuss the application and types of...","Discuss the operations of the type o...","Discuss the null condition operator ...","Analyze the conversion of data types","Discuss the application and types of arithmetic operators along with string concatenation","Discuss the operations of the type operators","Discuss the null condition operator of C#","Describe the functionalities associated with working with XML","Analyze the access and manipulation of information in the system.io namespace","Analyze the features and basic functionalities of strings","Discuss the structure and methods of the System.DateTime structure","Discuss the applications, types, and reasons for conditional branching","Analyze the syntaxes of the while and do-while loops","Discuss the uses of class constructors and methods of the Fileinfo class","Explain the functions of the generated codes when a class is created using the .NET tools","Analyze the conversion of data types...","Discuss the application and types of...","Discuss the operations of the type o...","Discuss the null condition operator ...","Analyze the conversion of data types","Discuss the application and types of arithmetic operators along with string concatenation","Discuss the operations of the type operators","Discuss the null condition operator of C#","Describe the functionalities associated with working with XML","Analyze the access and manipulation of information in the system.io namespace","Analyze the features and basic functionalities of strings","Discuss the structure and methods of the System.DateTime structure","Discuss the applications, types, and reasons for conditional branching","Analyze the syntaxes of the while and do-while loops","Discuss the uses of class constructors and methods of the Fileinfo class","Explain the functions of the generated codes when a class is created using the .NET tools"],"courseDescription":"<p>If you already are adept with some of the features of C# (Csharp/C sharp), then this Programming C#: Intermediate free online course is a great next step. The first part covers a lot of basic content where you will be taught about the conversion of data types, the various ways to use operators, what “Parse”is and how it’s used for data conversion, and all about Value- and Reference Types. The next section of this C# course covers operators such as arithmetic, comparison, logical, type, and null condition and then you move on to discussing the GetType method, the concepts of nulls and default values, together with their applications. Functionalities associated with working with XML are discussed in-depth and you will conclude this section by exploring the application and structure of .NET framework classes.</p><p>The following section teaches you all about the system.io namespace and then the various kinds and applications of strings. Some themes you will get to know are string concatenation, string conversion, name separation of strings, gathering data from strings, and string data type formatting and display features of the .NET framework. Often, you can find that there are issues associated with using too many concatenation operations on a string in a code and this can be addressed by using StringBuilder. StringBuilder along with its functions and applications are studied in great detail and you will finish off this part of this C# tutorial by delving into structures such as System.DateTime, TimeSpan, conditional branching and the if-else statement vs switch statement. The last part of the course starts by teaching you the workings of a code compiler, all about loops, the importance of system.io namespace, class constructors as well as the uses of programs such as Visual Studio and how they assist with coding.</p><p>If you have a coding or programming background and want to hone your C# skills, then this free online course is perfect for you. Programming students can also learn a lot from this advanced C# course because it truly demonstrates the uses and applications of this very popular coding language.</p><a href=\"https://alison.com/resume/courses/3481\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3481\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Types and Operators","description":"This module analyses data types conversion along with the methods, the resultant conversion, and the equivalent C# Data Type of the system convert class. This module also discusses the value and reference types in addition to arithmetic operators.","topics":["Types and Operators - Learning Outcomes","Data Types Conversion","Using Convert or Parse","Value and Reference Types","C# Operators","Types and Operators - Lesson Summary","Types and Operators - Assessment"]},{"name":"Module","details":"Precedence and Nulls","description":"This module explains the applications of the logical operators along with the type operators of C#. This module also analyses the concepts of nulls and default values in addition to the null condition operator of C#.","topics":["Precedence and Nulls - Learning Outcomes","Logical Operators and Precedence","Nulls and Default Values","Null Handling Operators","Precedence and Nulls - Lesson Summary","Precedence and Nulls - Assessment"]},{"name":"Module","details":"XML and File I/O","description":"This module analyses the application and structure of .NET framework classes in addition to the namespace, the elements, and attributes of XML. This module also discusses the access and manipulation of information in the system.io namespace.","topics":["XML and File I/O - Learning Outcomes",".NET Framework Classes","Working With XML","File, Input, and Output","XML and File I/O - Lesson Summary","XML and File I/O - Assessment"]},{"name":"Module","details":"Strings and Dates","description":"This module describes the basic functionalities of strings, the methods used in the manipulation of strings in addition to the string data type formatting. This module analyses the functions of a StringBuilder class, the methods of the System.DateTime method, and the application of the time span structure of the .NET framework.","topics":["Strings and Dates - Learning Outcomes","Working With Strings","Methods of String Class","Formatting Strings","Using StringBuilder","Working With Dates and Times","Using TimeSpan Structure","Strings and Dates - Lesson Summary","Strings and Dates - Assessment"]},{"name":"Module","details":"Conditionals and Looping","description":"This module describes the concept of conditional branching, switch statement, and the need for looping constructs in codes. Get to learn about the concepts of controlled looping, uncontrolled looping, and unbounded looping.","topics":["Conditionals and Looping - Learning Outcomes","Conditional Branching","Switch Statements","Repeating Code Blocks and Looping","Controlled Looping","Unconditional Branching","Conditionals and Looping - Lesson Summary","Conditionals and Looping - Assessment"]},{"name":"Module","details":"Objects and Classes","description":"This module analyses the necessity of the objects in the system.io namespace in the creation of classes. Get to study the methods used to call and add a class method. This module also discusses the building of classes using Visual Studio tools and the modification of Visual Studio's generated codes.","topics":["Objects and Classes - Learning Outcomes","Objects and Classes","Class Properties and Methods","Creating a Class","Building Classes With Visual Studio","Implement Class Code","Add Class Methods","Objects and Classes - Lesson Summary","Objects and Classes - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Programming C#: Intermediate - Course Assessment"]}]}