{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4157","title":"Programming Using Python","totalEnrolled":"4,857","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to program using the Python language and improve your coding skill set with this free online programming course.","description":"In this coding course, you will learn how to program using the Python language. The course breaks down various features and functionalities applicable in Python and most other programming languages. With the basics being covered first, you will be set with a solid foundation that the course material then builds on, leaving you with a comprehensive understanding of programming, in general, and Python, specifically.","courseOutcomes":["Explain how to set up Python on Wind...","Describe variables and explain how t...","Describe decision making and explain...","Describe functions and modules in Py...","Explain how to set up Python on Windows, Mac, and Linux operating systems, and run Python online","Describe variables and explain how to use different variable types in Python","Describe decision making and explain the methods for using conditional statements in Python","Describe functions and modules in Python, and explain function return statements and default arguments","Describe classes in Python and explain how to create instance objects of them","Describe regular expressions and explain how to create a RegEx using the search function","Define CGI programming and explain how to create forms using CGI for the get and post methods","Recall how to install, run and connect to a Python MySQL database","Identify the process to implement network servers and clients using Python","Discuss the method to implement entry, frame, and label GUI widgets in Python","Outline the procedure to implement the MessageBox GUI element using Python","Explain how to set up Python on Wind...","Describe variables and explain how t...","Describe decision making and explain...","Describe functions and modules in Py...","Explain how to set up Python on Windows, Mac, and Linux operating systems, and run Python online","Describe variables and explain how to use different variable types in Python","Describe decision making and explain the methods for using conditional statements in Python","Describe functions and modules in Python, and explain function return statements and default arguments","Describe classes in Python and explain how to create instance objects of them","Describe regular expressions and explain how to create a RegEx using the search function","Define CGI programming and explain how to create forms using CGI for the get and post methods","Recall how to install, run and connect to a Python MySQL database","Identify the process to implement network servers and clients using Python","Discuss the method to implement entry, frame, and label GUI widgets in Python","Outline the procedure to implement the MessageBox GUI element using Python"],"courseDescription":"<p>The Python program setup and basics lessons are essential to acquiring a solid foundation that can then be built upon. After establishing that structure, the course shifts to more advanced functionalities like RegEx (regular expression) and CGI programming, covering a multitude of subjects such as advanced expressions, and the get and post methods. In between, learners are provided with detailed lessons on classes and objects, including class inheritance and the initialization method. The material also covers databases, with lessons on setting up a database and editing the information contained within it. The lessons also include tutorials on creating networking servers and clients that connect to them. Multithreading is another topic that is covered, with lessons on subjects such as thread creation and synchronization. The final course module details the GUI (graphical user interface), covering various widgets and elements such as text, menu, and a message box.</p><p>This course focuses on various subjects within the realm of programming and development. Some subjects are more specific to Python, but most of the material is applicable in programming as a whole. The lessons provide detail on almost all aspects of programming that are currently in use throughout the world and in all types of applications. Each lesson supplies ample explanation so that the information being covered gets absorbed in full. And, all of the tutorials include step-by-step guides that learners can apply on their own to get a further enhancement on their learning experience. A GitHub link to the source files is included for this purpose. The detailed assessments throughout the course and at its conclusion will test your knowledge of the material. Another advantage of this online course is that it is free. So enroll now and benefit from the comprehensive programming lessons that the course offers.</p><a href=\"https://alison.com/resume/courses/4157\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4157\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setting Up and Basics","description":"In this module, you will be introduced to the Python programming language and learn how to run Python locally or online. You will also learn the Python Programming Basics including lessons on Variables and Operators. Finally, you will learn how to use Functions and Conditional Statements in Python.","topics":["Introduction, Setting Up and Basics - Learning Outcomes","Introduction and Setting Up","Python Programming Basics","Conditional Statements and Functions","Introduction, Setting Up and Basics - Lesson Summary"]},{"name":"Module","details":"Classes, Objects and Regular Expressions","description":"In this module, you will learn about Classes and Class Objects in general and in Python language, specifically. You will also learn about Regular Expressions and using the Match and Search Functions, and CGI Programming using the Get and Post Methods. Finally, you will learn how to set, retrieve and delete Cookies.","topics":["Classes, Objects and Regular Expressions - Learning Outcomes","Classes and Objects","Regular Expressions and CGI Programming","Classes, Objects and Regular Expressions - Lesson Summary"]},{"name":"Module","details":"Database, Networking and Multithreading","description":"In this module, you will learn how to work with Databases and MySQL using Python. You will also learn about Network Server and Client implementations, and about Multithreading and Multithreaded Priority Queuing. Finally, you will be provided with a step-by-step tutorial on Parsing an XML File using Python.","topics":["Database, Networking and Multithreading - Learening Outcomes","Database and Networking","Multithreading","Database, Networking and Multithreading - Summary"]},{"name":"Module","details":"Graphical User Interface - GUI","description":"In this module, you will be introduced to the Tkinter Module as part of GUI Programming within Python. You will learn how to implement a wide array of GUI Widgets within Python including the Menu, Text, and Canvas Widgets. You will also learn to create Additional GUI Features using Python such as the PanedWindow, MessageBox, and LabelFrame.","topics":["Graphical User Interface - GUI - Learning Outcomes","Introduction to Python GUI","Additional GUI Features","Graphical User Interface - GUI - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Programming Using Python - Course Assessment"]}]}