{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4341","title":"Programming using Visual Basic","totalEnrolled":"1,392","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"With this free online course, learn to create programs using Visual Basic, an easy-to-learn programming language.","description":"In this course, you will learn to write programs for Windows from scratch using the Visual Basic programming language. You will learn everything from setting up Visual Basic to data types and functions and creating graphical user interface (GUI) programs. Visual Basic is a good language for beginners, exposing them to a highly functional yet easy-to-use language. For experienced users, Visual Basic provides a language for rapid development.","courseOutcomes":["Describe the process of writing to t...","Explain the process of writing comme...","Distinguish between variables and co...","Contrast a Hash Table with a Sorted ...","Describe the process of writing to the console and receiving user input from it","Explain the process of writing comments in Visual Basic","Distinguish between variables and constants in Visual Basic","Contrast a Hash Table with a Sorted List","Recall the functions of Queues and Stacks","Outline the different Scope types in Visual Basic","Distinguish between a ‘button’ and a ‘label’ in Visual Basic","Distinguish between ‘checkboxes’ and ‘radio’ buttons","Describe the process of adding a picture box","Explain the function of a Group Box in Visual Basic","Recall the process of adding font and colour dialogs","Explain the concepts of ‘anchoring’ and ‘docking’","Describe the process of writing to t...","Explain the process of writing comme...","Distinguish between variables and co...","Contrast a Hash Table with a Sorted ...","Describe the process of writing to the console and receiving user input from it","Explain the process of writing comments in Visual Basic","Distinguish between variables and constants in Visual Basic","Contrast a Hash Table with a Sorted List","Recall the functions of Queues and Stacks","Outline the different Scope types in Visual Basic","Distinguish between a ‘button’ and a ‘label’ in Visual Basic","Distinguish between ‘checkboxes’ and ‘radio’ buttons","Describe the process of adding a picture box","Explain the function of a Group Box in Visual Basic","Recall the process of adding font and colour dialogs","Explain the concepts of ‘anchoring’ and ‘docking’"],"courseDescription":"<p>This course provides a rigorous introduction to the basic and advanced concepts found in Visual Basic programming. It introduces the language and demonstrates the process of setting up on the web or Windows machine. The course covers basic concepts like adding comments, console input and output, creating variables, subs, Enums, functions, loops, arrays, exception handling and much more. In addition, the topics demonstrate the use of classes, handling documents and setting up a GUI project.</p><p>The second half of the course begins with tutorials on functional GUI components like forms, text boxes, labels, buttons, checkboxes, picture boxes and progress bars. This section also explains more useful concepts like events and tab control and more components like the tree view, list view and web browser components. Finally, it concludes with lessons on using various dialog types, menus, anchoring and docking, regular expressions and parsing an XML file.</p><p>Knowledge of programming with Visual Basic is advantageous in any developer's arsenal, new or experienced. The language quickly creates functional programs while being easy to use. This course will benefit individuals new to programming, experienced programmers looking to add Visual Basic to their stack and any developer searching for reference material. Start now and learn to create programs using Visual Basic in only three hours.</p><a href=\"https://alison.com/resume/courses/4341\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4341\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setup and VB Basics","description":"This module contains an introduction to the course and tutorials on how to set up Visual Basic on the web and on a PC. You will also be introduced to vital components in the programming language, such as the console, data types, variables, constants, loops, arrays, and much more.","topics":["Introduction, Setup and VB Basics – Learning Outcomes","Introduction and Setting Up","Visual Basics Variables, Datatypes and Operators","Arrays, Loops and Functions","Introduction, Setup and VB Basics – Lesson Summary"]},{"name":"Module","details":"Visual Basics Classes, Objects and GUI","description":"In this module, you will be introduced to Classes in Visual Basic. You will learn about class constructors and destructors, properties, inheritance, and scope. You will also learn about creating a GUI project and adding important GUI components like labels, buttons, checkboxes, combo boxes, progress bars, and so on.","topics":["Visual Basic Classes, Objects & GUI – Learning Outcomes","Classes and Objects","Visual Basics GUI: Part One","Visual Basics GUI: Part Two","Visual Basic Classes, Objects & GUI – Lesson Summary"]},{"name":"Module","details":"Dialog Boxes and Advanced VB Features","description":"In this module, you will learn to add various types of dialogs to a GUI program using Visual Basic. You will learn to add font, color, print, save files, and open file dialog boxes. You will also learn about advanced concepts like Anchoring and Docking, Regular Expression, and Parsing an XML file.","topics":["Dialog Boxes and Advanced VB Features – Learning Outcomes","Visual Basics Dialog Boxes","Advanced Visual Basics Features","Dialog Boxes and Advanced VB Features – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Programming using Visual Basic – Course assessment"]}]}