{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4699","title":"Python Flask Development with Docker","totalEnrolled":"216","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an understanding of how to utilize Docker for the development of Flask in this free online course on Alison.com.","description":"Flask is a Python-based microframework for web development. It's dubbed a ‘microframework’ since it runs without additional software or plug-ins. Are you looking to package an application and its dependencies in a virtual container that can run on any Linux, Windows or macOS computer? This course will provide step-by-step instructions on creating a Python Flask development using the Docker platform. So don't waste any more time - enroll now.","courseOutcomes":["Discuss the main functions and featu...","Explain the process of installing Do...","Discuss the method through which Doc...","Explain how to operate a basic Flask...","Discuss the main functions and features of the Docker platform","Explain the process of installing Docker on Macintosh, LInux or Windows-based devices","Discuss the method through which Docker applications can be switched between foreground and background","Explain how to operate a basic Flask container along with a Gunicorn web server","Explain the role and function of the Docker ‘compose’ tool and how it can be used to create multiple containers","Describe the method through which a MySQL server instance can be run on Docker","Identify the various methods through which users can interact with the various containers that are running on Docker","Describe the ways in which a MongoDB application can be used and tested on Docker","Discuss the Python ‘debugging’ feature on Docker and how to properly run it","Discuss the main functions and featu...","Explain the process of installing Do...","Discuss the method through which Doc...","Explain how to operate a basic Flask...","Discuss the main functions and features of the Docker platform","Explain the process of installing Docker on Macintosh, LInux or Windows-based devices","Discuss the method through which Docker applications can be switched between foreground and background","Explain how to operate a basic Flask container along with a Gunicorn web server","Explain the role and function of the Docker ‘compose’ tool and how it can be used to create multiple containers","Describe the method through which a MySQL server instance can be run on Docker","Identify the various methods through which users can interact with the various containers that are running on Docker","Describe the ways in which a MongoDB application can be used and tested on Docker","Discuss the Python ‘debugging’ feature on Docker and how to properly run it"],"courseDescription":"<p>Are you looking to run and deliver multiple applications in a hassle-free manner? Or are you looking for a software platform that allows you to build, test and deploy applications quickly? In this course, we give an in-depth look at Docker's platform. Docker is a software framework for building, running and managing containers on servers and the cloud. The course starts with an introduction to the Docker platform, key requirements for having Docker on your device and some basic features. Then we supply a detailed walkthrough of how you can download and install Docker on any device, be it Windows, Mac or Linux.</p><p>The following section equips you to use the 'Hello-World' command. This command ensures that everything is up and running smoothly. We explore the Docker workflow, which includes the hierarchy of files, containers and applications. With Docker running multiple applications simultaneously, we will demonstrate how to bring applications running in the background to the foreground. Next, we will focus on running the primary Flask containers. We will explain each concept using video tutorials to ensure that the fundamentals are clear. Another critical concept is the addition of a WSGI HTTP server. This server allows users of Flask applications to serve on more than one thread through the tool called ‘Gunicorn’.</p><p>As the course moves on, you will study Docker ‘compose’ and analyze how to run multi-container Docker applications. We explain how to use YAML files to configure applications, explore the MySQL application and run them on the Docker ‘compose’ tool. Next, we delve into the document database called ‘MongoDB’ that has the scalability and flexibility that developers want, running and testing the application. In the final section, we go through the Python debugging program called ‘PDB’. The use of modern tools and software has simplified the complexity of application development. Docker aims to provide a similar experience to users by accelerating development workflows and consolidating application components. Don't waste any more time if you want to be part of the community of developers making the most of Docker. Enroll today!</p><a href=\"https://alison.com/resume/courses/4699\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4699\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Docker and Flask Container","description":"In this module, the learner will be introduced to the basic concepts of the Docker platform and the flask application. An explanation of how to install dockers on any device will be provided. Running docker applications in both the foreground and background will be analyzed. A description of how to run a basic Flask container will also be provided.","topics":["Introduction to Docker and Flask Container - Learning Outcomes","Introduction to Docker","Installing Docker","Docker Concepts","Basic Flask Container","Hot Reload Gunicorn Flask App","Introduction to Docker and Flask Container - Lesson Summary"]},{"name":"Module","details":"Docker Compose and Other Applications","description":"In this module, the learner will be going through various Docker applications. It starts off with a description of the Docker compose application. The running of a MySQL-based flask application using Docker compose will be explained. The use of the MongoDB application with Docker-compose will also be analyzed.","topics":["Docker Compose and Other Applications - Learning Outcomes","Introduction to Docker Compose","MySQL Counter Application","Interacting With the Containers","Running MongoDB Application","Using PDB With Docker","Docker Compose and Other Applications - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Python Flask Development With Docker - Course assessment"]}]}