{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4675","title":"Python and Matplotlib Data Visualization","totalEnrolled":"527","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the fundamentals of Python and how to use Matplotlib for data visualization.","description":"In this course, we will learn how to visualise data with Python using Matplotlib, a third-party Python module. We will talk about customizing Matplotlib, basemap, subplots, 3D scatter plots, 3D bar charts and 3D graphics. Next, we will discuss 3D dot plots, wireframes and bar charts, including the full range of 3D graph representations. In addition, we learn about the titles, legends and role of histograms in Matplotlib.","courseOutcomes":["Explain how we can visualize data wi...","Summarize the features of Pyplot fra...","Describe how to add titles and label...","Explain how to add grids and change ...","Explain how we can visualize data with Python using Matplotlib, a third-party Python module","Summarize the features of Pyplot framework, one of the most important frameworks for creating charts and graphs in Matplotlib","Describe how to add titles and labels and customise legends","Explain how to add grids and change labels in the graphs","Describe how to add different styles to the graphs and how to create our own styles with presets","Outline how to clean up markers and correct labels to make them understandable for readers","Discuss how to optimise the projections in the basemap and explain why the projections need to be adjusted","Outline the difference between a two-dimensional plot and a three-dimensional plot","Summarize how to insert data into a three-dimensional bar chart","Explain how we can visualize data wi...","Summarize the features of Pyplot fra...","Describe how to add titles and label...","Explain how to add grids and change ...","Explain how we can visualize data with Python using Matplotlib, a third-party Python module","Summarize the features of Pyplot framework, one of the most important frameworks for creating charts and graphs in Matplotlib","Describe how to add titles and labels and customise legends","Explain how to add grids and change labels in the graphs","Describe how to add different styles to the graphs and how to create our own styles with presets","Outline how to clean up markers and correct labels to make them understandable for readers","Discuss how to optimise the projections in the basemap and explain why the projections need to be adjusted","Outline the difference between a two-dimensional plot and a three-dimensional plot","Summarize how to insert data into a three-dimensional bar chart"],"courseDescription":"<p>In this course, 'Python and Matplotlib Data Visualization,' you will learn how to download Matplotlib and set it up on your computer. You will study the different code editors you can use for Python before exploring the basics of working with Matplotlib. Then we explain some of the basic plotting options and how we can use Matplotlib. Are you wondering what role titles play in our plots and why we use them? We will answer this question and go through histograms and customizing legends, titles and labels in Matplotlib.</p><p>The course will then demonstrate various adjustments you can make with Matplotlib. We will use shared data that consists of multiple series to do this. When analyzing stock data, we will investigate how we can interpret price and volume data and transform the data in various ways. Next, we will learn to create a function that converts data based on the given information. We will also look at how to add grids and change labels. Finally, discover how to create your own styles, use some premade styles and edit them. We cover topics that teach you to make live charts and update them as the reading data changes.</p><p>Learning how to subplot with Matplotlib is convenient. We will discuss how to add multiple plots to a figure and plot multiple series at once. In addition, we explain indicators, like moving averages, and how we can add them to our charts. Are you wondering about the features of 3D charts and how we can use them with Matplotlib? The 3D charts provide three axes and three dimensions to plot and are very useful for plotting data in charts. We will cover all of these topics, such as 3D dot plots, wireframes and bar charts, and explore a range of 3D representations of graphs. This course is ideal for students who want to learn more about data science with Python or professionals who wish to brush up on their Python programming skills. So why wait? Start your learning journey today.</p><a href=\"https://alison.com/resume/courses/4675\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4675\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Python Data Visualization with Matplotlib","description":"In this module, you will learn how to visualize data with Python using Matplotlib, a third-party Python module. We will learn the complete process of downloading and installing Matplotlib. Then we will learn some amazing features of Matplotlib such as plot options, labels, titles, legends, pie charts, histograms and scatter plots, etc.","topics":["Python Data Visualization with Matplotlib - Learning Outcomes","Introduction to Data Visualization with Python","Working With Matplotlib","Legends, Labels and Titles","Purpose of Histogram","Scatter Plots and Pie Charts","Loading Data With CSV and Numpy","Python Data Visualization with Matplotlib - Lesson Summary"]},{"name":"Module","details":"Customization of Matplotlib","description":"In this module, we will talk about the customization of Matplotlib. We will learn what changes we can make and what is generally done with matplotlib graphs. Next, we will discuss how to customize ticks, spines, and text as well as create our own style using Matplotlib for graphs.","topics":["Customization of Matplotlib  - Learning Outcomes","Introduction to Customizing Matplotlib","Parsing Stock Prices","Converting Unix Time","Add Remove and Customize Spines","Styles With Matplotlib","Adding and Placing Text","Dynamic Annotation of Last Price","Customization of Matplotlib - Lesson Summary"]},{"name":"Module","details":"Introduction to Subplots","description":"In this module, we will talk about subplots using Matplotlib. We will discuss how to add multiple plots to the same figure and plot multiple series at once. Next, we will learn about some indicators such as moving averages and how to add them to our charts.","topics":["Introduction to Subplots - Learning Outcomes","Subplots with Matplotlib","Changes to Candlestick Graph","Creating Moving Averages for Subplot","Fixing Dates and Some Labels","Sharing X and Y-Axis","Customizing Legends","Introduction to Subplots - Lesson Summary"]},{"name":"Module","details":"Introduction to Basemap","description":"This module is about displaying geographic data on maps with Python and Matplotlib using the Matplotlib extension Basemap. We will learn how to optimize projections in Basemap and why projections need to be adjusted. We will also explore how to incorporate logic into our plots to see the difference between land and water.","topics":["Introduction to Basemap - Learning Outcomes","Plotting Things Geographically","Basic Basemap Example","Customizing the Projection","Plotting Coordinates on a Map","Connecting Coordinates","Introduction to Basemap - Lesson Summary"]},{"name":"Module","details":"Introduction to 3D Graphing","description":"In this module, we will look at 3D graphs using Matplotlib. 3D gives us three axes and three dimensions to plot and is very useful for representing data in graphs. We will cover things like 3D dot plots, wireframes, and bar charts. We will explore a whole range of 3D representations of charts.","topics":["Introduction to 3D Graphing - Learning Outcomes","3D Graphing With Matplotlib","3D Scatter Plot","3D Bar Charts","Wireframes Continued","Introduction to 3D Graphing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}