{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4242","title":"Python for Data Science: From the Basics to Advanced","totalEnrolled":"6,642","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This data science course teaches you the basics of Python programming as well as the NumPy and Pandas libraries.","description":"Python is one of the best and fastest-growing programming languages used in data analysis worldwide. This free online course shows you how to apply the fundamental programming concepts of Python such as looping, variables, data types and data structures to data science. It also explores the NumPy and Pandas libraries that will help you further manipulate, analyze and visualize data in Python.","courseOutcomes":["Identify the basic data types in Pyt...","Use the arithmetic, logic, assignmen...","Discuss the 'for loop' and 'while lo...","Create and apply functions to perfor...","Identify the basic data types in Python","Use the arithmetic, logic, assignment and comparison operators","Discuss the 'for loop' and 'while loop' structures","Create and apply functions to perform basic arithmetic operations","Summarise the nested data and iteration concept in Python","Create a NumPy array","Describe NumPy indexing and slicing","Select data from a data set using both the index-based and label-based methods in Pandas","Identify the basic data types in Pyt...","Use the arithmetic, logic, assignmen...","Discuss the 'for loop' and 'while lo...","Create and apply functions to perfor...","Identify the basic data types in Python","Use the arithmetic, logic, assignment and comparison operators","Discuss the 'for loop' and 'while loop' structures","Create and apply functions to perform basic arithmetic operations","Summarise the nested data and iteration concept in Python","Create a NumPy array","Describe NumPy indexing and slicing","Select data from a data set using both the index-based and label-based methods in Pandas"],"courseDescription":"<p>The demand for skilled data scientists with a sound knowledge of programming languages is increasing exponentially. Python is one of the best data science programming languages. Apart from being easy to learn and implement, it has a wide range of applications in web and game development. This course teaches you programming concepts in Python and how they can be applied to manipulate and analyze data. It begins by introducing you to the Jupyter Notebook environment where you will be writing your code. Moving on, you will be taught how to use markdown cells to add images, text and links to your code. You will learn about variables, indentation and how to comment on your code for other programmers to understand. Furthermore, the course shows you how to work with different data types in Python such as lists, dictionaries, sets, and tuples as well as how to use operators.</p><p>Next, the material explores the various decision-making statements in Python such as the 'if statements', 'else statements', the 'else-if statements' as well as the 'for loops' and the 'while loops'. Functions are a great way to save time and effort when writing computer programs because they are a set of instructions that can be used repeatedly to perform a specific task when called upon. In this course, you will create a function that converts the temperature scale from Celsius to Fahrenheit and then call it out to execution. Learners will gain an understanding of the difference between the print function and the return statements as well as the AWS Lambda keyword and its syntax. This free Python course also teached you how to iterate and use the concept of nesting to access other functions and variables. You will learn about double indexing and how to select a specific item from a list or dictionary.&nbsp;</p><p>Python libraries play an important role in data science as they help eliminate the need for writing programs from scratch. The final part focuses on two key Python libraries - NumPy and Pandas - which ease sorting, manipulating and the analysis of a data set. The material shows you how to create and shape an array using NumPy and how to select items from a data set using the NumPy indexing and slicing techniques. The various functions of NumPy that serve different purposes will be reviewed. Then, the focus shifts to Pandas, where you will gain a thorough understanding of how to engineer and examine raw data. This course is your stepping stone to a career in data science, as it walks you through the basics of the application of Python to data science.</p><a href=\"https://alison.com/resume/courses/4242\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4242\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Python Fundamentals","description":"In this module, you will be introduced to the Python programming language and the Jupyter Notebook interface. You will gain an understanding of how and when to use the inline and block comments on your codes. Furthermore, you will learn about variables and data types in Python as well as how to create and work with functions.","topics":["Python Fundamentals - Learning Outcomes","Introduction to Python","Basic Concepts in Python","Decision and Looping Structures","Working With Functions","Nested Data, Iteration and Lists","Python Fundamentals - Lesson Summary"]},{"name":"Module","details":"Python Libraries","description":"In this module, you will learn about the NumPy and Pandas Python libraries. You will be taught how to create and shape arrays as well as how to select items from an array using NumPy indexing and NumPy slicing. This module will explore the various functions in NumPy such as the reshape function, append function, insert function and more.","topics":["Python Libraries - Learning Outcomes","Introduction to NumPy","NumPy Functions","Introduction to Pandas","Pandas Function","Python Libraries - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Python for Data Science: From the Basics to Advanced"]}]}