{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3061","title":"Diploma in Python Fundamentals","totalEnrolled":"10,131","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the powerful Python Programming Language and its uses in this free online Python Fundamentals course.","description":"This free online course in Python Fundamentals can be of great benefit to you and your career because of Python’s popularity. Python is widely used by programmers because it is extremely fast and reliable and this course will give you more insight into Python through theory, practical demonstrations alongside case studies. By the end of this course, you should understand the standards, features and fundamentals of Python language.","courseOutcomes":["Explain the uses and applications of...","Identify the features of Python envi...","Define Fundamental data types...","List the characteristics of Python P...","Explain the uses and applications of variables","Identify the features of Python environment","Define Fundamental data types","List the characteristics of Python Programming language","Discuss Syntax and Imports","Differentiate between Sets and Tuples","List the Python data types and their applications","Analyze the concept of class inheritance","Explain the uses and applications of...","Identify the features of Python envi...","Define Fundamental data types...","List the characteristics of Python P...","Explain the uses and applications of variables","Identify the features of Python environment","Define Fundamental data types","List the characteristics of Python Programming language","Discuss Syntax and Imports","Differentiate between Sets and Tuples","List the Python data types and their applications","Analyze the concept of class inheritance"],"courseDescription":"<p>Computer and software programming is a critical skill in the modern era and since 2003, Python has consistently ranked in the top ten most popular programming languages in the TIOBE Programming Community Index. Python is still the third most popular programming language in the world (behind Java, and C) and is commonly used because of its vast applications. This Python Fundamentals free online programming language course will teach you the uses, applications, variables and features of Python and the various fundamental data types with their definitions.</p><p>&nbsp;</p><p>You will then move on to some more technical elements and learn Python characteristics, the programming Syntax and Imports implications and how these apply to Python’s specific Sets and Tuples. Another important discussion point is that of class inheritance in the context of object-based programming and at the end of this course, you will be able to define and discuss this topic comprehensively. ‘Modules’ are used in Python in order to logically organise the code and this is further enhanced by being able to group related code which makes it easier to understand and use. These Python ‘modules’ are covered extensively in this introductory Python course as well as how to define your own Types known as Classes.&nbsp;</p><p><br>Aspiring programmers or programmers who need to add Python to their programming and coding language skill set will greatly benefit from this Python Fundamentals free online course because it not only covers the basics, but it also provides an in-depth study of some of the most important components and how to use them. With game-changing platforms such as Django and Pycharm both based on Python - taking this Python Fundamentals course will no-doubt elevate your programming skills.</p><a href=\"https://alison.com/resume/courses/3061\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3061\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Install and Configure","description":"Learn about how to install and configure Python programming language as well as the Python documentation from the official Python website. You will also learn about Variables and how they are defined and used in Python. You will also learn about how Python interacts with the Command Line Arguments","topics":["Install and Configure - Learning Outcomes","Installing Python","Python Documentation","Command Line","Variables","Install and Configure - Lesson Summary","Install and Configure - Assessment"]},{"name":"Module","details":"Syntax, Import, BuiltIn Methods","description":"Learn about the Syntax, Import and BuiltIn Methods of Python Programming Language in this topic. You will also learn about comments, indentation and the various tasks you can do with Keywords. This topic also discusses how to import modules into an application and differentiate between BuiltIn Types and methods. You will also learn about Comparison Operators","topics":["Syntax, Import, BuiltIn Methods - Learning Outcomes","Simple Python Syntax","Keywords","Import Module","BuiltIn Methods","Syntax, Import, BuiltIn Methods - Lesson Summary","Syntax, Import, BuiltIn Methods - Assessment"]},{"name":"Module","details":"Statements","description":"In this module, you will learn the uses Statements. Then you will learn about the types of statements as well as Sequence break and other keywords for further control. You will also learn about boolean expressions and how they are used to determine whether a particular block of code is to be executed or not. You will learn how to use all the types of statements in python.","topics":["Statements - Learning Outcomes","If, Elif, Else","For Loops","Loops","Execute","Iterable","Exceptions","Statements - Leasson Summary","Statements -  Assessment"]},{"name":"Module","details":"Data Types","description":"In this module, you will learn about Python Data Types. You will also learn how to define your own Types known as Classes. Then you will learn about Other Data Types and how they are used and implemented in Python. You will also learn about the different kinds of intergers, the use of Boolean operators and well as BuiltIn Collection Types in Python Programming Language","topics":["Data Types - Learning Outcomes","Data Types","Number Types","Numerical Operations","Data Types - Lesson Summary","Types - Assessment"]},{"name":"Module","details":"Strings, Booleans, and Files","description":"In this module, you will learn about Strings and how to define strings in your program. You will also learn about how text is represented as a unicode character in python. You will also discuss the basic concept of concatenation and how it can be applied. You will also learn to about python data types and how they can be used in a program","topics":["Strings, Booleans, and Files - Learning Outcomes","Strings","String Operations","Booleans","Files","Strings, Booleans, and Files - Lesson Summary","Strings, Booleans and Files - Assessment"]},{"name":"Module","details":"Lists, Tuples, Comprehensions","description":"In this module, you will be introduced to List, List filtering system and the various applications of list in python. You will also learn about the differences and similarities between Sets and Tuples as well as their, Tuples, Comprehensions, how to make define them and the various applications. It also discusses the differences between Mutable and Immutable data types in python","topics":["Lists, Tuples, Comprehensions - Learning Outcomes","Lists","Dictionary","Tuples","Sets","Comprehensions","Lists, Tuples, Comprehensions - Lesson Summary","List, Tuples, Comprehension  -  Assessment"]},{"name":"Module","details":"Functions","description":"In this module, you will learn about Functions as well as Variadic Functions . You will also learn about Generators and the different tasks that can be done with it. It also discusses Python as a Object oriented programming language. You will also learn about Exceptions and how to use Lambda keywords to define expressions","topics":["Functions - Learning Outcomes","Definitions","Functions","Default Arguments","Doc Strings","Variadic Functions","Factorial","Function Objects","Lambda","Generators","Closures","Functions - Lesson Summary","Functions - Assessment"]},{"name":"Module","details":"Classes","description":"In this module, you will learn about Classes in Python. You will also learn about object initialization and how to instantiate class to create an object. You will also learn how to invoke functions and the concept of class inheritance. It also discusses the concept of data hiding as well as the applications of data hiding in a program","topics":["Classes - Learning Outcomes","Classes","Object Initialization","Class Static Members","Classic Inheritance","Data Hiding","Classes - Lesson Summary","Classes - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}