{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2586","title":"Diploma in QuickBooks Desktop Canada","totalEnrolled":"4,149","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course on how QuickBooks works, its customization, as well as receiving payments and managing deposits.","description":"This free online QuickBooks desktop Canada course teaches you about how to work with the QuickBooks software in accounting, as well as using the Easy Step Interview and opening a second company file. You will learn about how to customize preferences in QuickBooks. You will also be able to learn how to manage payments, handle down payments, as well as issue invoices to customers. Start this course today to improve your understanding of QuickBooks.","courseOutcomes":["Describe how QuickBooks works. ...","Identify how to create a company fil...","Outline how to up your preferences i...","Identify how to create invoices, est...","Describe how QuickBooks works.","Identify how to create a company file and set up your chart of accounts","Outline how to up your preferences in QuickBooks to suit your company","Identify how to create invoices, estimates, receive payments and deposits","Discuss the steps in processing payroll and payroll taxes","Describe how QuickBooks works. ...","Identify how to create a company fil...","Outline how to up your preferences i...","Identify how to create invoices, est...","Describe how QuickBooks works.","Identify how to create a company file and set up your chart of accounts","Outline how to up your preferences in QuickBooks to suit your company","Identify how to create invoices, estimates, receive payments and deposits","Discuss the steps in processing payroll and payroll taxes"],"courseDescription":"<p>QuickBooks Desktop Canada is a free online course that begins by introducing you to the accounting software called QuickBooks, as well as it uses in managing a business. The course will also introduce you to how QuickBooks works, as well as how to set up your company file on QuickBooks and using the Easy Step Interview to set up a company on QuickBooks. The steps for getting around in QuickBooks, starting and exiting QuickBooks, as well as opening a second company file will also be covered in this course.</p><p>This course then explains the different customizable options available in QuickBooks, as well as the process for customizing preferences on QuickBooks. You will learn the step by step process for setting up different users on QuickBooks, as well as how to set up the chart of accounts feature on QuickBooks. This course will then teach you through various exercises the ways to create a new account or company, as well as how to assign different important information to the new company.</p><p>Furthermore, this course will help you get familiar with the customer centre in QuickBooks, as well as creating new customers and jobs. You will learn about the process for preparing estimates, as well as drawing up invoices from the estimates. You will also learn about receiving payments, as well as handling customer down payments, and using the income tracker. This free online course will be of great interest to students, researchers, and anyone with an interest in handling accounts. Register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/2586\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2586\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started","description":"In this module, you will be introduced to how QuickBooks work, as well as how to set up your company file on QuickBooks and using the Easy Step Interview to set up a company on QuickBooks. You will also be introduced to the steps for getting around in QuickBooks, starting and exiting QuickBooks, as well as opening a second company file.","topics":["Getting Started - Learning Outcomes","How QuickBooks Files Work","Setting Up Your Company File","Using Easy Step Interview - Part 1","Using Easy Step Interview - Part 2","Getting Around in QuickBooks - Part 1","Getting Around in QuickBooks - Part 2","Starting and Exiting QuickBooks","Opening a Second Company File","Getting Started - Lesson Summary"]},{"name":"Module","details":"Customizing the QuickBooks Environment","description":"In this module, you will be introduced to the process for customizing preferences on QuickBooks, as well as setting up different users on QuickBooks. You will also be introduced to the setup process for the chart of accounts on QuickBooks, as well as try out an exercise to create a new account and assign different variables.","topics":["Customizing the QuickBooks Environment - Learning Outcomes","Preferences - Part 1","Preferences - Part 2","Working with Users","Chart of Accounts - Part 1","Chart of Accounts - Part 2","Let Me Try: Creating a New Account","Customizing the QuickBooks Environment - Lesson Summary"]},{"name":"Module","details":"Working with Customers & Jobs","description":"In this module, you will be introduced to the customer centre in QuickBooks, how to create customers and jobs, how to prepare estimates, as well as creating invoices from estimates. You will also be introduced to the process of receiving payments, entering overpayments, as well as handling customer down payments, and using the income tracker.","topics":["Working with Customers & Jobs - Learning Outcomes","Walkthrough of the Customer Centre","Creating Customers and Jobs","Estimates - Part 1","Estimates - Part 2","Invoicing from Estimates - Part 1","Invoicing from Estimates - Part 2","Invoicing Customers for Products and Services","Receiving Payments","Creating Deposits","Creating Credit Memos","Entering an Overpayment","Handling Customer Down Payments","Memorizing a Sale","Using Price Levels","Creating Statements","Using the Income Tracker","Let Me Try: Creating a New Customer and an Invoice","Let Me Try: Receiving a Payment","Let Me Try: Creating a Deposit","Working with Customers & Jobs - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["QuickBooks Desktop Canada Online Course - Course Assessment"]}]}