{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2630","title":"Representing the Real World in Geographic Information System","totalEnrolled":"2,063","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how you can represent the real world in geographic information systems, and data types in this free online course.","description":"This free online course will help you become more knowledgeable about representing the real world in geographic information systems. You will gain an understanding of georeferencing, how to do georeferencing, the kinds of systems you can use, and the various projections that can be applied. You will also be brought up to speed about coordinate reference systems, geographical coordinate-system, geodetic datum, and representation of the earth.","courseOutcomes":["Discuss how you can represent a real...","Identify the different types of data...","List the different types of data mod...","Explain the meaning of a data model ...","Discuss how you can represent a real-world in geographic information system","Identify the different types of data n GIS","List the different types of data models in GIS with examples","Explain the meaning of a data model as used in GIS","Define spatial data as used in geographic information system","Explain the meaning of topology as used in geographic information system","Describe how to do a georeferencing in geographic information system","Define geoid and datums as used in geographic information system","Identify the two types of georeferencing in GIS","Define continuous georeferencing as used in GIS","Describe relative georeferencing and polar georeferencing as used in GIS","List the three major categories by which discrete georeferencing can be done","Discuss how you can represent a real...","Identify the different types of data...","List the different types of data mod...","Explain the meaning of a data model ...","Discuss how you can represent a real-world in geographic information system","Identify the different types of data n GIS","List the different types of data models in GIS with examples","Explain the meaning of a data model as used in GIS","Define spatial data as used in geographic information system","Explain the meaning of topology as used in geographic information system","Describe how to do a georeferencing in geographic information system","Define geoid and datums as used in geographic information system","Identify the two types of georeferencing in GIS","Define continuous georeferencing as used in GIS","Describe relative georeferencing and polar georeferencing as used in GIS","List the three major categories by which discrete georeferencing can be done"],"courseDescription":"<p>This course will begin by introducing you to the meaning of data, the kind of data that can be handled by geographic information systems, the different data models, and examples of data models. This includes the vector data model, the two types of vector data models which are the spaghetti data model and the topological data model. You will learn about representing the real world in the surface model, surface representation, and how you can represent the real world in terms of surface models. This will lead you to digital terrain, the digital surface model, and the digital elevation model.</p><p>Next, you will understand how to do georeferencing, the different kinds of systems, and different projections. You will be familiar with geoid, the different kinds of the geoid, and how we look at the geoid as a reference point. You will also be familiar with datums, how we look at datums, and certain coordinate systems. Moving on, you will be knowledgeable about maps, how maps are represented; the meaning of a map, and what you should look out for in a map.&nbsp;</p><p>Lastly, you will be brought up to speed about coordinate reference systems, geographical coordinate-system, geodetic datum, and representation of the earth. You will gain an understanding of the components of the coordinate reference system and the two important systems in which earth is referenced. You will further understand the things that you have to look at before you start analyzing a particular map. This will then lead you to how to identify a map, and the scale on a map, even without knowing the scale.</p><a href=\"https://alison.com/resume/courses/2630\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2630\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Types and Data Models","description":"This module discusses what data is, the kind of data that can be handled by GIS, the different data models, and examples of data models. You will learn about the vector data model, the two types of vector data models which are the spaghetti data model and the topological data model. You will also learn about representing the real world in the surface model.","topics":["Data Types and Data Models - Learning Outcomes","Types of Data","Vector Data Model","Raster Data Model","Surface Representation","Triangulated Irregular Network","Data Types and Data Models - Lesson Summary"]},{"name":"Module","details":"Querying, Georeferencing and Map Projections","description":"This module discusses how to do georeferencing, the kinds of different systems there are, and different projections. You will learn about geoid, what kind of geoid is there, and how we look at the geoid as a reference point. You will then learn about datums, how we look at datums, and certain coordinate systems.","topics":["Querying, Georeferencing and Map Projections - Learning Outcomes","Querying and Georeferencing","Elevation, Relative and Discrete Referencing","Coordinate Systems","Maps and Numbering","Map Projections","Querying, Georeferencing and Map Projections - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Representing the Real World in Geographic Information System - Course Assessment"]}]}