{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3062","title":"Ruby: Fundamentals","totalEnrolled":"636","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Start your coding journey or refine your programming skills with this Ruby Fundamentals free online course.","description":"Ruby programming language is a great place to start learning programming basics because of its elegance and simplicity. This free online course allows you to learn the fundamentals of programming and web development as well as the uses of Ruby to write interactive programs or build scripts to speed up common tasks. Your learning includes understanding core object types such as variables, hashes, arrays and the various control structures.","courseOutcomes":["Recall and install Ruby workspace on...","Identify and use the tools introduce...","Explain briefly the history of Ruby ...","Outline the popular conventions of R...","Recall and install Ruby workspace on your PC","Identify and use the tools introduced during the course of this program","Explain briefly the history of Ruby programming language","Outline the popular conventions of Ruby as stated during this course","List the goals of Ruby programming language","Recall and implement the CamelCase in Ruby","Recall and install Ruby workspace on...","Identify and use the tools introduce...","Explain briefly the history of Ruby ...","Outline the popular conventions of R...","Recall and install Ruby workspace on your PC","Identify and use the tools introduced during the course of this program","Explain briefly the history of Ruby programming language","Outline the popular conventions of Ruby as stated during this course","List the goals of Ruby programming language","Recall and implement the CamelCase in Ruby"],"courseDescription":"<p>If you would like to kick-start your coding career then Ruby object-oriented open-source programming language can help you broaden your skills. This elegant and simple coding language is easy to understand and flexible enough to be applied fulfil various development and programming needs. This free online course will provide you with the basics that you need to know to start coding with Ruby. This Ruby tutorial starts by walking you through the core object types: variables, hashes, arrays and then the various control structures, loops, conditionals and iterators. Additionally, this free online coding course explains scripting best practices and shows the power of using enumerables and code blocks as well as how to use your own custom methods.</p><p>What is covered next are the key features of Ruby including classes, methods, blocks and modules alongside some of the standard types like strings, arrays, hashes and regular expressions. You will learn Ruby tools and techniques needed to write real-world software, including testing, debugging and packaging your code. Your learning includes being able to explain how and when to incorporate RubyGems into Ruby applications, define RubyGems and state their uses, create a new file, pull data in from a file, add information to a pre-existing file and delete a file from a computer or server.&nbsp;</p><p>Ruby is used mostly for building web applications, but can also help with data analysis, prototyping, and much more. Proficiency in Ruby and its accompanying framework, Ruby on Rails, is a marketable skill, with a growing demand for Ruby and Rails developers so enrolling in this course as a beginner or more advanced coder will open a new world of programming along with many job opportunities in the market.</p><a href=\"https://alison.com/resume/courses/3062\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3062\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started","description":"In this module, you will be introduced to Ruby programming language, some of its best practices and style information for variables and classes. It explains the history, goals, and tools used in Ruby. This module takes us through the installation process of Ruby on various operating systems and how to switch between the various versions of Ruby.","topics":["Getting Started - Learning Outcomes","History and Installation","Conventions and Best Practices","Getting Started - Lesson Summary","Getting Started - Assessment"]},{"name":"Module","details":"Classes and Methods","description":"This module describes the step by step process for building classes in a Ruby program, how to work with multiple types of arguments and understanding the functionalities of methods in Ruby. This module further explains how Ruby works from an object oriented point of view.","topics":["Classes and Methods - Learning Outcomes","Classes of Ruby programming language","Methods of Ruby programming language","Object Oriented Programming","Classes and Methods - Lesson Summary","Classes and Methods - Assessment"]},{"name":"Module","details":"Variables and Data Structures","description":"This module comprises of three sub-topics; Variables, hashes, arrays and structs. This module with hands on practicals illustrates creating and adding items to hash and how to create and access arrays. It further illustrates storing values in variables in Ruby.","topics":["Variables and Data Structures - Learning Outcomes","Variables","Arrays and Structs","Hashes","Variables and Data Structures - Lesson Summary","Variables and Data Structures - Assessment"]},{"name":"Module","details":"Loops and Enumerable Methods","description":"This module discuses the implementation of various loops in Ruby program, this include While, Generic and Each loops which are the standard ways to interact through collections. It then explains to the learner enumerable class and enumerable methods such as Map and Inject.","topics":["Loops and Enumerable Methods - Learning Outcomes","Loops","Map, Inject, and Permutation","Loops and Enumerable Methods - Lesson Summary","Loops and Enumerable Methods - Assessment"]},{"name":"Module","details":"Finishing Touches","description":"In this module, you will be introduced to how you can work with files in Ruby programs, this will include how to create a new file, pulling data in from a file, adding information to a pre-existing file and deleting of file from a computer or server.","topics":["Finishing Touches - Learning Outcomes","File Operations","Input and Output","RubyGems","Finishing Touches - Lesson Summary","Finishing Touches - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ruby: Fundamentals Final Assessment"]}]}