{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1249","title":"Ruby on Rails for Web Application Development","totalEnrolled":"6,250","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Make creating a server-side web application using Ruby on Rails easy, with this free online Ruby on Rails course.","description":"This free online Ruby on Rails course will teach you about the Ruby on Rails web app framework, and teach you how to use it for developing web applications. Ruby on Rails is an easy-to-learn and open source web application program with a liberal license. It has rich libraries, is easy to extend, and is remarkably object-oriented. It also involves less coding, and fewer bugs, which makes it ideal for beginner web developers.","courseOutcomes":["Identify the features of the Ruby pr...","Describe how to create a Ruby web ap...","Define what Object-Orientated progra...","Explain the difference in creating a...","Identify the features of the Ruby programming language.","Describe how to create a Ruby web app through the command line interface.","Define what Object-Orientated programming is about. - Discuss inheritance in programming Explain how to create a class and an object.","Explain the difference in creating a method and a class method.","Identify how to create a method in Ruby.","Recognise the syntax for creating conditional branching statements.","Recognise the different types of loops in Ruby.","Explain what inclusive and exclusive ranges are.","Explain what MVC (Model View Controller) architecture is.","Describe how to change your database schema using Rails.","Identify the features of the Ruby pr...","Describe how to create a Ruby web ap...","Define what Object-Orientated progra...","Explain the difference in creating a...","Identify the features of the Ruby programming language.","Describe how to create a Ruby web app through the command line interface.","Define what Object-Orientated programming is about. - Discuss inheritance in programming Explain how to create a class and an object.","Explain the difference in creating a method and a class method.","Identify how to create a method in Ruby.","Recognise the syntax for creating conditional branching statements.","Recognise the different types of loops in Ruby.","Explain what inclusive and exclusive ranges are.","Explain what MVC (Model View Controller) architecture is.","Describe how to change your database schema using Rails."],"courseDescription":"<p>This course will first introduce you to Ruby on Rails as a programming language and its uses for developing web applications. You will learn its installation process and object orientation and be shown how to make a class. You will then learn how to reference the current object, class methods, and inheritance. The course will also teach you how to create a Ruby file and Ruby code on a demo.<br><br>You will then study the Ruby on Rails syntax and learn how loops and conditional branching work. You will also learn how to create methods, along with the correct syntax for writing these procedures in Ruby on Rails. You will study the MVC architecture, which will help you organize code for the creation of robust web applications, and learn how it separates the application into three main logical components which are the model, the view, and the controller.<br><br>This web application development course will teach you how Ruby on Rails is used to develop modern web applications in an effective and efficient manner. If you already have a basic understanding of web application development and have completed Alison's courses on Web Page Design Using HTML5 and CSS3, and Knowledge of Programming Concepts with Python, now is the perfect time to take this course and learn how Ruby on Rails can be useful for you!</p><a href=\"https://alison.com/resume/courses/1249\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1249\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Module 1 Introduction to Ruby and Rails","description":"In this module you will be introduced to Ruby on Rails as a programming language and its uses for developing web applications.","topics":["Module 1 Learning Outcomes","Presenter Introductions","Ruby and Rails Introduction and Installation","Creating a Web Application","Module 1 Lesson Summary"]},{"name":"Module","details":"Module 2 Objects and Classes","description":"In this module you will learn what object-orientated programming is about. You will learn about classes, method and inheritance which are the core building blocks of any object-orientated program.","topics":["Module 2 Learning Outcomes","Introduction to Object-Orientation in Ruby","How to Make a Class","How to Reference the Current Object, Class Methods and Inheritance","Demo Create and Run a Ruby File and Ruby Code","Module 2 Lesson Summary"]},{"name":"Module","details":"Module 3 Ruby Syntax","description":"This module introduces you to the Ruby on Rails syntax. You will learn how loops and conditional branching work. You will also learn how to create methods, along with the correct syntax for writing these procedures in Ruby on Rails.","topics":["Module 3 Learning Outcomes","Control Flow and If Else","Loops","Methods","Iterators and Blocks","Writing Methods for Blocks","Using Methods Across Classes","Demo Self, Classes, and Methods(Getters, Setters and Initialize)","Test-Driven Development","Demo RSpec","Module 3 Lesson Summary"]},{"name":"Module","details":"Module 4 The Rails Framework","description":"This module introduces you to MVC architecture, its main components and how the Rails Framework works.","topics":["Module 4 Learning Outcomes","Introduction to Rails","Demo Rails and the CLI","The Model(M) in MVC","Demo The Model(M) in MVC and Migrations","Validation","Demo Validation","Associations","Demo Associations (Has One)","Demo Associations (Has Many)","Demo Associations (Has Many Through)","Module 4 Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}