{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4755","title":"Scaling a Web App with Docker on AWS","totalEnrolled":"314","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to develop and deploy a scalable Ruby application using Docker and Amazon Web Services in this free online course.","description":"Docker provides a useful infrastructure solution for developing and deploying apps while Amazon Web Services is an inexpensive, feature-rich cloud platform for hosting apps and data. The two services yield a handy solution for developing and managing apps when used in tandem. In this short course, we will combine the power of AWS and Docker containers in developing, testing and deploying scalable web applications. Sign up today!","courseOutcomes":["Explain the function of ECS in manag...","Recall the function of various compo...","Outline the benefits of interacting ...","Summarise the process for installing...","Explain the function of ECS in managing Docker apps on AWS","Recall the function of various components of ECS","Outline the benefits of interacting with AWS using the CLI over the user interface","Summarise the process for installing Docker on various platforms","Discuss the function of an S3 bucket in AWS","Distinguish between Amazon's ECR and RDS services","Recall the process for creating and destroying rails models using AWS","Identify the factors that determine the cost of using AWS to host a web application","Explain the process for pushing an image to a private ECR registry","Recall the options for updating a running web application with Docker","Recognise commands for creating and interacting with production clusters","Explain the function of ECS in manag...","Recall the function of various compo...","Outline the benefits of interacting ...","Summarise the process for installing...","Explain the function of ECS in managing Docker apps on AWS","Recall the function of various components of ECS","Outline the benefits of interacting with AWS using the CLI over the user interface","Summarise the process for installing Docker on various platforms","Discuss the function of an S3 bucket in AWS","Distinguish between Amazon's ECR and RDS services","Recall the process for creating and destroying rails models using AWS","Identify the factors that determine the cost of using AWS to host a web application","Explain the process for pushing an image to a private ECR registry","Recall the options for updating a running web application with Docker","Recognise commands for creating and interacting with production clusters"],"courseDescription":"<p>When combined, Amazon Web Services (AWS) and Docker yield a feature-rich solution for developing and deploying web apps. Furthermore, a collaboration between both services has made for a smooth combination process. However, using these services in tandem requires understanding many components, commands, dependencies and processes. This course teaches you everything you need to know to develop and deploy scalable, fault-tolerant and load-balanced apps with Docker on AWS. We start by diving deeply into Amazon Elastic Container Service (ECS) and its various components.</p><p>The first third of the course focuses on helping you understand AWS and showing you the procedure for setting up the environment required to develop and deploy the web app. Here you will investigate Amazon ECS, which is necessary to manage containers on AWS and its vital components, including clusters, container agents and task definitions. You will also learn the setup process for Docker and AWS and the process for creating SSH keypairs and security groups.</p><p>The following sections cover the methods of developing and deploying the app. You will learn to ‘Dockerise’ the app, build a demo, configure dependencies and predict AWS pricing. To effectively deploy the app, you will also learn to create clusters and primary repositories and schedule services. Finally, we will explain how to update, troubleshoot and link your app to a domain name. By taking this course, you will gain knowledge on using AWS and be capable of deploying scalable apps using Docker in only a few hours. Enrol today!</p><a href=\"https://alison.com/resume/courses/4755\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4755\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Setting Up","description":"In this module, you will learn about Amazon ECS service, and see how it ranks among competitors. You will also learn to set up the needed developer environment for developing and deploying the Rails app with Docker and AWS. Finally, you will learn about the various components of the ECS service and its functions.","topics":["Introduction and Setting Up – Learning Outcomes","What is Amazon ECS?","Setting Up the Environment","ECS Components","Introduction and Setting Up – Lesson Summary"]},{"name":"Module","details":"Developing the Web Application","description":"In this module, we will focus on using Docker to develop the Ruby on Rails application that would be deployed on AWS. You will learn to dockerise an application and run it locally, as well as how to configure Nginx and set up S3 buckets. Also, you will be introduced to pricing in AWS and learn techniques to reduce the cost of hosting your app.","topics":["Developing the Web Application – Learning Outcomes","Developing the Rails App","Preparing to Deploy the App","Understanding AWS Pricing","Developing the Web Application – Lesson Summary"]},{"name":"Module","details":"Deploying the Web Application","description":"In this module, we will go over the process involved in deploying a dockerised application on AWS. You will learn to create production clusters, spin multiple containers, schedule services, and automate deployments with a script. Also, you will learn to link your app to a domain name, and create free SSL certificates with ACM.","topics":["Deploying the Web Application – Learning Outcomes","Production Clusters and Private Repositories","Scheduling Services & Pushing Changes","Doman Names and SSL","Deploying the Web Application – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Scaling a Web App with Docker on AWS – Course assessment"]}]}