{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5377","title":"Secure Software: Deployment and Acquisition","totalEnrolled":"426","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to acquire, operate and maintain secure software that can resist cyber attacks in this free online course.","description":"Network security is one of the top priorities when we install and use software as we look to maintain the integrity of our data and devices. This cyber security course explains how to safeguard the confidentiality and integrity of sensitive information by using tokens, passwords and other methods used to keep applications working in real-world settings. We also trace the phases and lifecycle of software acquisition and development.","courseOutcomes":["List the security considerations for...","Describe how to handle root cause an...","Discuss how security monitoring shou...","Outline how supplier risk assessment...","List the security considerations for configuration management pre and post-installation","Describe how to handle root cause analysis","Discuss how security monitoring should be handled","Outline how supplier risk assessment and management works","Define ‘service level agreement’ (SLA)","Explain the chain of custody in software acquisition","Estimate the maintenance and support costs of secure software","Outline common methods used for the sanitation of devices and media","Recall the type of relationship that exists between the buyers and suppliers of software","Identify the phases of software acquisition","Discuss the role of software audits in ensuring security compliance and outline the phases and types of security audits","List standard patching operating procedures and methods","List the security considerations for...","Describe how to handle root cause an...","Discuss how security monitoring shou...","Outline how supplier risk assessment...","List the security considerations for configuration management pre and post-installation","Describe how to handle root cause analysis","Discuss how security monitoring should be handled","Outline how supplier risk assessment and management works","Define ‘service level agreement’ (SLA)","Explain the chain of custody in software acquisition","Estimate the maintenance and support costs of secure software","Outline common methods used for the sanitation of devices and media","Recall the type of relationship that exists between the buyers and suppliers of software","Identify the phases of software acquisition","Discuss the role of software audits in ensuring security compliance and outline the phases and types of security audits","List standard patching operating procedures and methods"],"courseDescription":"<p>‘Configuration management’ drives the monitoring and maintenance of information about all the resources needed to deliver software services. However, there are security considerations that you need to know to effect proper configuration management both pre and post-installation. This cyber security course explains how to maintain operations security to keep the software's resilience levels above acceptable risk levels in terms of operations and maintenance. We discuss software disposal, backups, recovery, archiving, incident management, root cause analysis, change management, patch management and security monitoring.</p><p>When it comes to the software acquisition lifecycle, you want to ensure that software meets security requirements and functions as intended even when under cyber attack. This course studies the phases of software acquisition. We then explore the relationship between buyer and supplier in terms of supplier risk management before outlining the risks of not performing a proper assessment of software suppliers. We also cover intellectual property, service level agreements and chain of custody.</p><p>Software audits offer proof of compliance with established security requirements. A software audit normally comprises five phases and we go through each in detail while identifying their different types. Organisations must make sure that the security measures specified in the ‘statement of work’ are both present and functional. The course also covers software maintenance, support and sustainment controls. Software needs to be correctly integrated throughout an organisation to ensure cyber security and effectiveness. Instances of network security outages and interruptions can be decreased by following a well-organised software deployment and procurement strategy. This course is ideal for software developers and provides valuable cyber security skills you can use to keep networks and data secure.</p><a href=\"https://alison.com/resume/courses/5377\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5377\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Secure Software Management and Acquisition","description":"Topics you will learn in this module include secure software installation and deployment, operations and maintenance, security monitoring, incident management, root cause analysis, acquisition lifecycle, supplier risk assessment and management, contractual controls, intellectual property, chain of custody and service level agreement.","topics":["Management and Acquisition - Learning Outcomes","Secure Software Deployment","Secure Software Management","Supply Chain and Software Acquisition","Management and Acquisition - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Secure Software: Deployment and Acquisition - Course Assessment"]}]}