{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2658","title":"Diploma in Secure MEAN Stack Developer","totalEnrolled":"7,170","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create and maintain functional web applications in MEAN stack development in this free online course.","description":"MEAN stands for MongoDB, Express, Angular and Node, a combination of document database programs and JavaScript software that allows developers to build dynamic websites and applications. Being a MEAN stack developer allows you to use each of these four open-source programs to develop for both the back-end (server side) and front-end (client or user side). MEAN stack developers are sought-after as they have in-demand development and IT skills.","courseOutcomes":["Discuss the definition and concepts ...","Understand the concept and working s...","Describe the process model and insta...","Recognize how to create REST APIs to...","Discuss the definition and concepts of MEAN stack","Understand the concept and working system of Node.js","Describe the process model and installation process of Node.js","Recognize how to create REST APIs to perform CRUD operations","Evaluate the function of MongoDB in MEAN stack development","Indicate JavaScript applications used for front-end development","Discuss Angular services as a function and its applications","Compare the two web form design approaches, explain their nature and state where each of them is applicable","Explain the need for data validation and outline its step-by-step procedures","Outline the HTTPS request functions and their uses","Discuss the definition and concepts ...","Understand the concept and working s...","Describe the process model and insta...","Recognize how to create REST APIs to...","Discuss the definition and concepts of MEAN stack","Understand the concept and working system of Node.js","Describe the process model and installation process of Node.js","Recognize how to create REST APIs to perform CRUD operations","Evaluate the function of MongoDB in MEAN stack development","Indicate JavaScript applications used for front-end development","Discuss Angular services as a function and its applications","Compare the two web form design approaches, explain their nature and state where each of them is applicable","Explain the need for data validation and outline its step-by-step procedures","Outline the HTTPS request functions and their uses"],"courseDescription":"<p>This free MEAN stack training course kicks off with examining the use of MongoDB as a database function. You will also investigate the uses of Angular as an open-source platform for creating mobile and desktop web apps. You will then study the anatomy, properties, methods and installation processes of Node for executing JavaScript outside a web browser, as well as the steps involved in building an HTTP web server. The course will give you an understanding of how to create and restructure a Node.js Express app, as well as how to use Express malware functions.</p><p>You will then unpack the processes involved in testing and refactoring APIs as a MEAN stack developer. Next is understanding CRUD (create, read, update, delete) operations in database management, as well as how effectively CRUD can be used in sample MongoDB databases.</p><p>Finally, you will see exactly how Angular is used to modify components of application within MEAN stack development, including how to build components for navigation. You will also be grounded in the basic design approaches to web forms as well as the importance of data validation. Working with the built-in DI (dependency injection) system in Angular and HTTPS requests to APIs to carry out database operations, is also covered. MEAN stack developer certification is possible on completion of this course so register your account now and start studying today.</p><a href=\"https://alison.com/resume/courses/2658\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2658\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction To MEAN Stack Architecture","description":"In this module, you will be introduced to the concepts, components and systems of MEAN Stack Architecture, as well as the four open-source technologies that it comprises of. You will also be introduced to the step by step processes, as well as how to select different preferences when installing Visual Studio Code.","topics":["Introduction To MEAN Stack Architecture - Learning Outcomes","The MEAN Stack Architecture","Installing Visual Studio Code","Introduction to MEAN Stack Architecture - Lesson Summary"]},{"name":"Module","details":"Getting Started with Node.js","description":"In this module, you will be introduced to the anatomy, properties, methods and installation processes of Node.js as well as, the phases of the event loop cycle. You will also be introduced to the steps involved in creating an HTTP web server, as well as how to respond to HTTP requests in Node.js.","topics":["Getting Started with Node.js - Learning Outcomes","Introduction to Node.js","Installing Node.js","The Package.json File","The Node.js Event Loop","The I/O Cycle","The Anatomy of a Node.js Module","Creating Node Modules","Importing and Exporting Information from Modules","Exploring the Node.js HTTP Module","Creating an HTTP Webserver with Node.js","Responding to HTTP Requests","Routing in Node.js","Creating a Sample Node.js Application","Getting Started with Node.js - Lesson Summary"]},{"name":"Module","details":"Server-Side Development with Express (E) Part 1","description":"In this module, you will be introduced to the Express framework, as well as how to create, test and restructure a Node.js Express app. You will also be introduced to the service provider page as well as, how to create the list page.","topics":["Server-side Development with Express (E) - Learning Outcomes","Introduction to the Express Framework","Installing and Testing Express","Creating a Node.js Express App","Importing Files from the App Object in Node.js","Restructuring an Express App","Creating Templates","Using Express Middleware Functions","Creating the List Page","Creating the List Page Part 2","Creating the Details Page","Computing Providers Detail Information","Server-side Development with Express (E) - Lesson Summary"]},{"name":"Module","details":"Server-Side Development with Express (E) Part 2","description":"This module will continue where the last module left off with showing your how to create the details, edit and add page. The module will also introduce you to the processes involved in testing and refactoring APIs.","topics":["Server-Side Development with Express (E) Part 2 - Learning Outcomes","Creating the Edit Page","Creating the Edit Page Part 2","Creating the Add Page","Creating the Add Page Part 2","Deleting Data","Deleting Data Part 2","Rest API Basics","Implementing Rest APIs","Testing Rest APIs","Refactoring APIs","Refactoring APIs Part 2","Server-Side Development with Express (E) Part 2 - Lesson Summary"]},{"name":"Module","details":"Getting Started with MongoDB (M)","description":"In this module, you will be introduced to MongoDB, its installation process, and make use of some of its main functions using sample databases. You will also analyze some MongoDB features, their uses, rules, and expected results from sample databases.","topics":["Getting Started with MongoDB (M) - Learning Outcomes","Introduction to MongoDB","Installing MongoDB","Using MongoDB Compass","Using MongoDB Compass - Part 2","Using Mongo Shell Interface","Connecting to MongoDB","Creating Schemas and Models","Getting Started with MongoDB (M) - Lesson Summary"]},{"name":"Module","details":"Secure MEAN Stack Developer - First Assessment","description":"You must score 80% or more to pass.","topics":["Secure MEAN Stack Developer - First Assessment"]},{"name":"Module","details":"Configuring the Backend","description":"In this module, you will be introduced to some CRUD Operations using sample APIs to interact directly with MongoDB through Mongoose and its functions. You will also be introduced to more database querying using different functions on sample databases contained in different applications.","topics":["Configuring the Backend - Learning Outcomes","Querying Documents Using find()","Insert Documents Using create()","Updating Documents Using findOneAndUpdate()","Deleting Documents Using findOneAndDelete() and deleteMany()","Configuring the Backend - Lesson Summary"]},{"name":"Module","details":"Front-End Development with JavaScript","description":"In this module, you will be introduced to Front-End Development with JavaScript Framework using Angular. You will also be introduced to the Angular Project File Structure and discuss its components.","topics":["Frontend Development with JavaScript - Learning Outcomes","Getting Started with Angular","Creating an Angular Application","Angular Project File Structure","Anatomy of an Angular Component","Anatomy of an Angular Component Part 2","One-Way Data Binding","Two-Way Data Binding","Using Nglf Directive","Using ngForOf Directive","Angular Modules","Creating NgModules","Creating NgModules Part 2","Using Angular Router","Frontend Development with JavaScript - Lesson Summary"]},{"name":"Module","details":"Configuring the Frontend","description":"In this module, you will be introduced to the configuration of application apps using bootstrap themes, as well as the creation and management of the navigation components of an application. You will also be introduced to the various approaches to web-forms modification and highlights the best fit for different forms.","topics":["Configuring the Frontend - Learning Outcomes","Configuring Templates","Creating Navigations","Working with Template-driven Forms","Working with Reactive Forms","Validating Form Data: Using In-built Validators","Validating Form Data: Error Check Messages","Configuring the Frontend - Lesson Summary"]},{"name":"Module","details":"Performing CRUD Operations","description":"In this module, you will be introduced to the basic HTTPS request functions and its application in a database. You will also be introduced to the creation of Angular services to communicate with the back end server, as well as using the built-in DI system to inject services to applications.","topics":["Performing CRUD Operations - Learning Outcomes","Services and Dependency Injection (DI)","Reading Data from Database","Inserting Data into Database","Updating Data in the Database: Definitions and Functions of PUT","Updating Data in the Database: Application of the PUT function","Delete Data from Database","Conclusion","Performing CRUD Operations - Lesson Summary"]},{"name":"Module","details":"Secure MEAN Stack Developer - Second Assessment","description":"You must score 80% or more to pass.","topics":["Secure MEAN Stack Developer - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Secure MEAN Stack Developer - Course Assessment"]}]}