{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3904","title":"Setting Up and Publishing a Chat Application Using Kotlin","totalEnrolled":"431","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to set up and publish a chat application using Kotlin programming language with this free online course.","description":"If you are interested in refining your programming skills and want to learn how to use Kotlin coding language, then look no further. This free online Kotlin Android development tutorial will teach you all you need to know about setting up and publishing a chat application using its many features including web requests, chat APIs, the Android application package (APK), and broadcast manager along with practical error handling.","courseOutcomes":["Discuss a web request from the appli...","List the different types of web requ...","Recall how to set up an API on Herok...","Recall how to set up a broadcast man...","Discuss a web request from the application’s perspective","List the different types of web requests","Recall how to set up an API on Heroku or locally","Recall how to set up a broadcast manager","State the process for creating and working with sockets from scratch","List the data expected by an API when a chat message is emitted","Identify the best practice for launching an application","Recall how to launch an application on the Google Play Store","Explain the process for generating a signed APK","Outline the different ways to build an APK file","Describe the procedure for updating your application","Recall how to create a chat application in Android studio using Kotlin","Discuss a web request from the appli...","List the different types of web requ...","Recall how to set up an API on Herok...","Recall how to set up a broadcast man...","Discuss a web request from the application’s perspective","List the different types of web requests","Recall how to set up an API on Heroku or locally","Recall how to set up a broadcast manager","State the process for creating and working with sockets from scratch","List the data expected by an API when a chat message is emitted","Identify the best practice for launching an application","Recall how to launch an application on the Google Play Store","Explain the process for generating a signed APK","Outline the different ways to build an APK file","Describe the procedure for updating your application","Recall how to create a chat application in Android studio using Kotlin"],"courseDescription":"<p>Kotlin is a general-purpose open-source programming language initially designed for the Java virtual machine (JVM) and Android that combines object-oriented and functional programming features. Building a real-time Android chat application can be challenging and there are different open-source options available. However, this free online Kotlin programming tutorial will take you through easy, detailed, and interesting procedures to develop your chat app with your desired features. Chat apps are great methods for real-time communication and you will learn how to set up the project, main activity UI, login activity as well as steps to generate an avatar, background colour, and work with the navigation drawer activity feature on Android Studio.</p><p>Developers need to understand web requests (also known as a hypertext transfer protocol or HTTP)&nbsp; because in these modern digital times, just about all applications use web requests. A web request is the communicative message that is transmitted between the client or web servers to the servers and is essential in providing the user with correct and preferred web pages that the server displays on the user’s interface. This Kotlin course discusses web requests in detail from an application perspective, as well as application programming interfaces (APIs) and then moves on to outlining the different types of web requests and security measures to ensure that data is not accessed from the API without authority or permission. Did you know that not all APIs return HTTP as a response to a request? Some return JavaScript object notation (JSON) and the following section in the course discusses how APIs return JSON, how to create a spinner, handle errors and set up a broadcast manager.</p><p>The next part of this Kotlin Android development course discusses how to add a broadcast receiver or channel dialog and will teach you how to work with Socket.IO Android as well as create and work with web sockets from scratch. After successfully creating a chat app, you may decide to take it a step further by displaying or sharing the application with other people - this entire process is covered in detail in the final section of the course. If you want to learn Android app development with Kotlin including best practices for publishing an application to the Google Play Store and are a student or developer wanting to learn all about creating and publishing a chat application in Android Studio, then you should enrol for this comprehensive, exciting free online course to level-up your programming skills.</p><a href=\"https://alison.com/resume/courses/3904\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3904\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Smack Chat Application","description":"This module introduces the creation of a chat application using Android studio. It describes web requests and web sockets. It discusses HTTP and chats APIs (Application program interface). Also, this topic illustrates error handling and setting up the broadcast manager. It analyzes how to add a broadcast receiver and alert dialog.","topics":["Smack Chat Application - Learning Outcomes","Introduction to Smack Application","Web Requests and APIs","Registering a User","Broadcast the Receiver","Sockets and Downloading Channels","Channel Selection","Smack Chat Application - Lesson Summary"]},{"name":"Module","details":"Publishing your Application","description":"This module introduces the different ways to build an APK file. It illustrates the process for sharing applications with others. This module also describes the procedures for submitting an application to the google play store and navigating the google play console. It outlines the best practices for launching an application.","topics":["Publishing your Application - Learning Outcomes","Google Play Store","Registering Account","Generate Signed APK","Publishing your Application - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Setting Up and Publishing a Chat Application Using Kotlin - Course Assessment"]}]}