{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3854","title":"SFML Game Development : Tic-Tac-Toe","totalEnrolled":"1,153","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to create a fully-functioning SFML tic-tac-toe game with this free online game development course.","description":"This free online game development certificate provides step-by-step coding instructions on how to create a fully functioning tic-tac-toe game using the SFML (Simple and Fast Media Library) package. Hone your programming skills and learn the various requirements to set it up for Windows and Mac, the details for setting up the game engine system, stage creation process, how to implement the grid system, and adding AI (artificial intelligence).","courseOutcomes":["Identify the method for SFML setup o...","Describe how to implement the State ...","Describe how to implement an Asset M...","Explain how to build an Input Manage...","Identify the method for SFML setup on Windows and Mac machines","Describe how to implement the State Machine to switch between different states in a game","Describe how to implement an Asset Manager for a game","Explain how to build an Input Manager for a game","List and create the states in a game","Explain the method for implementing a ‘win condition’ in the tic-tac-toe game","Describe how to add AI into a game","Explain the methods for initializing the grid system, placing a piece and ‘checking for win’ condition","Identify the method for SFML setup o...","Describe how to implement the State ...","Describe how to implement an Asset M...","Explain how to build an Input Manage...","Identify the method for SFML setup on Windows and Mac machines","Describe how to implement the State Machine to switch between different states in a game","Describe how to implement an Asset Manager for a game","Explain how to build an Input Manager for a game","List and create the states in a game","Explain the method for implementing a ‘win condition’ in the tic-tac-toe game","Describe how to add AI into a game","Explain the methods for initializing the grid system, placing a piece and ‘checking for win’ condition"],"courseDescription":"<p>Learn game development with SFML and create a simple, functional tic-tac-toe game where you will get to understand the principles of coding. The first course module covers SFML setup on Windows (using Visual Studio) and Mac (using Xcode and Homebrew) systems before moving onto setting up the gaming engine which includes State Machine (switching between states), Asset Manager (loading and storing assets), Input Manager (handles all of the input, providing specific data such as when a sprite is clicked), and the Game Loop (what brings all of the managers together).</p><p>The second module of this SFML game development course covers explaining and implementing the game states and grid system development. The tic-tac-toe game contains five states which are the splash, main menu, game, pause, and ‘game over’ states. You then move on to the game logic components, which consists of the grid, AI, and ‘game over’ screen switch implementations. The grid development process is broken down into three parts: initialisation (which represents the initial set-up process), checking for empty and occupied grid spaces in order to place a piece, and implementing a ‘check for the win’ condition. The implementation of AI essentially adds an extra dimension to the game with an artificial opponent capable of winning. The next part of the course&nbsp; is the “extras” section and suggests extra features that can be added to the game to further enhance the user experience.</p><p>This game tutorial is an asset to anyone interested in a career in game development. It goes into intricate details on every process, providing you with all of the information that is necessary to complete the game, but also apply the principles to other game development projects. If you have existing game development experience, then this free online course can also provide a comprehensive refresher on SFML. Enrolling in this course from start to finish will take only three hours and video demonstrations make learning fun, interesting and practical at the same time.</p><a href=\"https://alison.com/resume/courses/3854\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3854\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"System and Engine Set-Up","description":"In this module, you will learn how to install and set up SFML on Windows and Mac machines. SFML on Windows requires Visual Studio, while on a Mac SFML is set up using Xcode. This module also provides set-up instructions for each of the Game Engine components including the State Machine, Asset Manager, and Game Loop.","topics":["System and Engine Set-Up - Learning Outcomes","System Set-up","Game Engine Set-Up","System and Engine Set-Up - Lesson Summary"]},{"name":"Module","details":"Game States and Grid System Development","description":"In this module, you will learn how to implement the different Game States that make up the Tic-tac-toe game. The module also includes instructions on how to implement the Grid System, add AI to the game and switch to the Game Over State.","topics":["Game States and Grid System Development - Learning Outcomes","Game  States","Grid System and Condition Checks","Game States and Grid System Development - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["SFML Game Development : Tic-tac-toe - Course assessment"]}]}