{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4001","title":"SFML C++ Game Development - Flappy Bird Clone","totalEnrolled":"1,272","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online C++ course will equip you with the skills required to effectively develop games using SFML.","description":"Developing games is a great way to refine and practice your coding skills. This free online C++ game programming course has been designed to arm you with the necessary skills and knowledge needed to develop games. This course teaches game development using Simple and Fast Multimedia Library (SFML) and includes setting up the game engine, creating the various game states, animating the game, and implementing sound effects.","courseOutcomes":["Explain how to set up SFML for Windo...","State the role of a project director...","Explain how to hide the console on a...","Discuss how to implement the header ...","Explain how to set up SFML for Windows OS and Mac OS","State the role of a project directory folder and how to create one","Explain how to hide the console on a Windows machine","Discuss how to implement the header files in a state machine","State the functions of an asset manager","Distinguish between splash state and main menu state","Recall the procedures for implementing the various game states","Explain how to set up SFML for Windo...","State the role of a project director...","Explain how to hide the console on a...","Discuss how to implement the header ...","Explain how to set up SFML for Windows OS and Mac OS","State the role of a project directory folder and how to create one","Explain how to hide the console on a Windows machine","Discuss how to implement the header files in a state machine","State the functions of an asset manager","Distinguish between splash state and main menu state","Recall the procedures for implementing the various game states"],"courseDescription":"<p>Learn C++ for game development and use these skills to create a fun Flappy Bird Clone game. This free online course has been designed to equip game developers with amazing game developing skills using SFML. SFML is an acronym for Simple and Fast Multimedia Library and it is a cross-platform software development library designed to provide a simple interface to the various components of your PC, for easy game- and multimedia application development. This course begins with an introduction to SFML and the procedures to set up SFML on Windows (using Visual Studio code) and also on Mac (using Xcode). This part of the course covers setting up the game engine, state machine, input manager, asset manager, and implementing the game loop. The various game states are included here too which are the splash state, main menu state, implementing the game state, and the game over state.</p><p>The following part C++ game development course will discuss the many game scenes required as well as creating the pipe class, bird class and automatic spawning and deleting of the various pipes. Animating is the next subject which explores how to make the bird rotate, fly, and collide with obstacles as well as the implementation of the game scoring system. Other than actual gameplay, there are many screens that require development and these screens are the game over screen, scores that display at the game over screen, medals and much more. You will then be shown how to add sound effects to your game as the final part of your game development project.</p><p>Game development is the process of modeling and designing video games for entertainment purposes and usually involves a series of stages which should be studied and mastered carefully. This free online game development course has been carefully crafted to show you how to develop games using SFML C++ on the Windows and Mac platforms and will be a great boost for your career as a game developer. You could also enrol in this course if you would love to try your hand at game development coding as a hobby or side project.</p><a href=\"https://alison.com/resume/courses/4001\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4001\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setting up and State Creation","description":"In this module, you will be introduced to game development using SFML, you will learn how to set up SFML on windows and Mac OS. You will also learn about how to implement the asset manager, input manager, and game loop and then you will be shown how to create various game states which include the splash state, game state, etc.","topics":["Introduction, Setting up and State Creation - Learning Outcomes","Introduction and Setting up","Game Engine Setup","State Creation","Introduction, Setting up and State Creation - Lesson Summary"]},{"name":"Module","details":"Game Logic and Final Touches","description":"In this module, you will be shown how to set up the pipe and bird class, you will learn how to animate the bird, this includes rotating and making the bird fly, you will also learn how to implement the scoring system and also how to add sound effects to the game.","topics":["Game Logic and Final Touches - Learning Outcomes","Pipe and Bird Class Set up","Animating the Bird and Displaying Scores","Game Over Set up and Sound Effects","Game Logic and Final Touches - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["SFML C++ Game Development - Flappy Bird Clone - Course assessment"]}]}