{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4349","title":"SharePoint Online","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course introduces you to SharePoint and describes the essential functions of creating a website.","description":"SharePoint is a Microsoft product used as a document management and storage system, but its usage differs between companies. This course details the various characteristics and uses of the SharePoint site. You will explore all the features needed to create lists, update files and edit them on SharePoint. Learn to import lists from Microsoft Excel or delete them on the site. This course is an asset to your CV and will help you advance your career.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The SharePoint platform is web-based and integrates well with Microsoft Office. This course presents you with accurate information on the working principles of using SharePoint. We explain and define the features and functions of the site tools. We guide you through specific information about the practice site and help you understand the roles and principles. What tools can I use on SharePoint? How can I edit the roles and permissions or work with lists? This course gives a clear outline to help you navigate these areas. For example, we will discuss the definition of creating a task list and the tools you will be using before teaching you to assess the various ways of adding and modifying lists.</p><p>Next, this course will instruct you on deleting list items. Discover the ways to correctly use the tools in SharePoint to understand list views and how to create and modify lists. Investigate how to import list data from Excel to SharePoint. Furthermore, you will learn the distinct varieties of ways to develop document libraries. Finally, learn how to upload documents and then modify and edit them. We will teach you how to work with metadata suitably, what tools help you edit and modify documents and finally how to implement version control on SharePoint.</p><p>This course will provide you with a better understanding of SharePoint, giving you clear and precise methods to apply it in your working field. Have you considered expanding your knowledge of SharePoint? This course is excellent for anyone building cooperation in their organisation or team leaders and managers who want to increase their understanding of the SharePoint platform. So begin today and advance your knowledge of this online site.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}