{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3292","title":"SQL Server 2014: Tour and Installing","totalEnrolled":"416","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the components, editions, management tools and installation of SQL Server 2014 in this free course.","description":"‘SQL Server 2014: Tour and Installing’ is a free online course from Alison for database administrators to gain an understanding of Microsoft’s relational database management system. Learners who take this course will gain vital proficiency in the installation of SQL Server 2014, its management tools as well as the features of SQL Server Management Studio. Register for this course today and enhance your database management skills.","courseOutcomes":["Define the SQL Server as a tool for ...","Outline the step-by-step procedures ...","Describe the connection of servers t...","Outline the procedures of resetting ...","Define the SQL Server as a tool for information management","Outline the step-by-step procedures of running Management Studio","Describe the connection of servers to Management Studio","Outline the procedures of resetting the layout of Management Studio","Explain the connection and disconnection of the SQL Server Data Tools","List the procedures of creating databases","Define the concept of snapshotting a project","Discuss the suite of business intelligence tools","Discuss the requirements before installation of SQL Server 2014","Outline the functions of the upgrade advisor","Analyze the configuration of the SQL Server installation centre","Outline the functions of the numerous tools of the configuration manager","Define the SQL Server as a tool for ...","Outline the step-by-step procedures ...","Describe the connection of servers t...","Outline the procedures of resetting ...","Define the SQL Server as a tool for information management","Outline the step-by-step procedures of running Management Studio","Describe the connection of servers to Management Studio","Outline the procedures of resetting the layout of Management Studio","Explain the connection and disconnection of the SQL Server Data Tools","List the procedures of creating databases","Define the concept of snapshotting a project","Discuss the suite of business intelligence tools","Discuss the requirements before installation of SQL Server 2014","Outline the functions of the upgrade advisor","Analyze the configuration of the SQL Server installation centre","Outline the functions of the numerous tools of the configuration manager"],"courseDescription":"<p>When you think of databases, you visualize the numerous collections of information created to make the management of data simpler and accessible. This course will take you on a tour of Microsoft SQL Server 2014, a relational database management system, including the installation process. The course provides an overview of SQL Server 2014 together with the SQL Server as a tool for information management. You will be introduced to the server components, editions, management tools and content of the feature pack. Learn about the features and application of SQL Server Management Studio along with the step-by-step procedures of running it and the functionality of objects, including the installation of sample databases. You will explore objects at the instance and database levels as well as the connection of servers to Management Studio. You will determine the process of object search and the functions of the Activity Monitor tool. Study the uses of SQL Server Data Tools (SSDT) along with Transact-SQL design capabilities in maintaining databases.&nbsp;</p><p>Furthermore, you will identify the requirements for installing the SSDT and the technologies supported by this toolset. Get to grips with the modern step-by-step procedures of setting primary keys, editing data types, using schemas and an array of other activities. The modes of connection in addition to the flexibility of the data tool will also be covered extensively in this course. Have you ever wondered how to snapshot a project? This course provides in-depth coverage of project snapshotting along with the procedures of working with data tools in disconnected mode. Study the necessity of tables, queries and views, including the application of these elements in a database. Learn the step-by-step method of creating, editing and querying tables along with the performance of views. By taking this course, database enthusiasts stand to gain vital information on the application and components of business intelligence tools including integration, reporting and analytical services. The course also includes details about the supported technologies, requirements and specifications needed before installation.</p><p>Lastly, you will analyze common issues encountered and considerations for upgrading to SQL Server 2014. This course will examine the configurable and robust nature of Management Studio, along with the flow of windows and the procedures for resetting the layout and the configuration of tools in the Options dialogue box. Also, the functions of the upgrade advisor, as well as the configuration of the advisor components, will be covered extensively in this course. You will discover how to set up a machine for the installation of the software, including the configuration, default setup and recommended settings of each tab of the installation centre. You will also learn about the numerous options for configuring the server post-installation. Finally, you will survey the hallmarks, functions and configuration of the numerous tools of the configuration manager. This course will be of significant interest to students, researchers, professional database administrators and enthusiasts as well as anyone with an interest in databases. Register for this course today and begin your next learning journey!</p><a href=\"https://alison.com/resume/courses/3292\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3292\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to SQL Server 2014: Tour and Installing","description":"This module discusses the fundamentals, server components, editions, and management tools of the SQL Server 2012. This module also outlines the features and running process of the IDE along with the functions of the object of the SQL Server management studio.","topics":["Introduction to SQL Server 2014: Tour and Installing - Learning Outcomes","Introduction to Tour and Installing","Using Management Studio","Exploring DB Objects","Introduction to SQL Server 2014: Tour and Installing - Lesson Summary","Introduction to SQL Server 2014: Tour and Installing - Assessment"]},{"name":"Module","details":"SQL Server Data Tools","description":"This module discusses the robust nature and the description of the various tools of the management studio. This module also describes the SQL Server Data Tools Transact-SQL design capabilities to build and maintain databases along with the procedures of using the SQL Server Data Tools.","topics":["SQL Server Data Tools - Learning Outcomes","Customizing the UI and Help","SQL Server Data Tools","Using SQL Server Data Tools","SQL Server Data Tools - Lesson Summary","SQL Server Data Tools - Assessment"]},{"name":"Module","details":"Mode, Tables, and BI Services","description":"This module explains the distinctive features and procedures of working with the SQL Server data tools in the disconnected mode in addition to snapshotting a project. You will discuss the application of tables, queries, and views in a database along with the components of business intelligence tools.","topics":["Mode, Tables, and BI Services - Learning Outcomes","Disconnected Mode","Tables, Queries, and Views","SQL Server Integration Services","Mode, Tables, and BI Services - Lesson Summary","Mode, Tables, and BI Services - Assessment"]},{"name":"Module","details":"Preparing for Installation","description":"This module explains the requirements and specifications to be put in place before installation in addition to the components of the SQL Server 2012. This module also outlines the issues encountered along with considerations of upgrading to the SQL server 2012.","topics":["Preparing for Installation - Learning Outcomes","Preparing for Installation","Upgrading an Earlier Version","Preparing for Installation - Lesson Summary","Preparing for Installation - Assessment"]},{"name":"Module","details":"Installation and Configuration","description":"This module outlines the configuration, default setup, and recommended settings of each tab of the SQL Server installation centre along with SQL Server prerequisites. Learn about the many options for configuring the server of the SQL Server after installation and the components of the configuration manager from this module.","topics":["Installation and Configuration - Learning Outcomes","SQL Server Installation","Configuring the Server","Installation and Configuration - Lesson Summary","Installation and Configuration - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["SQL Server 2014: Tour and Installing - Course Assessment"]}]}