{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3206","title":"SQL Server 2014: T-SQL Fundamentals","totalEnrolled":"1,507","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"The free online course will help you master T-SQL fundamentals which is central to using Microsoft SQL Server.","description":"This free online course has been specifically prepared for beginners in T-SQL and will help you understand the various aspects of SQL Server 2014. Study the differences between a data manipulation language (DLL) and data definition language (DDL), and explore concepts of normalization and concurrency. The course material also covers the operations of WHERE, ORDERBY and GROUPBY clauses, as well as the functions of the Cartesian product.","courseOutcomes":["Outline the history and overview of ...","Distinguish between data manipulatio...","State the operations of batches and ...","Explain the functions of REPLACE, ST...","Outline the history and overview of SQL","Distinguish between data manipulation language (DLL) and data definition language (DDL)","State the operations of batches and scripts","Explain the functions of REPLACE, STUFF and SUBSTRING","Discuss the functions of LTRTIM and RTRIM in string expressions","Describe the GETDATE, DATEPART and DATENAME functions","Describe the ORDERBY and GROUPBY clauses","Explain the operations and functions of the Cartesian product","Distinguish between the inner and outer joins","Explain the functions of the DELETE and TRUNCATE statements","Describe the concepts and challenges of concurrency","Discuss the four isolation levels of SQL Server","Outline the history and overview of ...","Distinguish between data manipulatio...","State the operations of batches and ...","Explain the functions of REPLACE, ST...","Outline the history and overview of SQL","Distinguish between data manipulation language (DLL) and data definition language (DDL)","State the operations of batches and scripts","Explain the functions of REPLACE, STUFF and SUBSTRING","Discuss the functions of LTRTIM and RTRIM in string expressions","Describe the GETDATE, DATEPART and DATENAME functions","Describe the ORDERBY and GROUPBY clauses","Explain the operations and functions of the Cartesian product","Distinguish between the inner and outer joins","Explain the functions of the DELETE and TRUNCATE statements","Describe the concepts and challenges of concurrency","Discuss the four isolation levels of SQL Server"],"courseDescription":"<p>‘SQL Server 2014: T-SQL Fundamentals’ has been specifically prepared to teach you about the history, operations and elements of Transact-SQL (T-SQL). Are you aware that there are two broad statement types in SQL? You will learn about their differences and functions. Once you have begun this course, you will be introduced to the various categories of operators and conversion methods. You will also learn about the main categories of built-in functions, and the working operations of REPLACE, WHERE and SUBSTRING will also be introduced to you. This course teaches you to work with date functions such as GETDATE and DATENAME, and how to explain global functions like @@ROWCOUNT. An understanding of T-SQL data selection and the use of schema with the object name will also be highlighted in this course. Prepare yourself to learn about the tools for controlling programming flow and operations of the four ranking functions in T-SQL.</p><p>Did you know that there are several symbol-based comparison operators supported by the WHERE clause? The course will expand on this becasue knowing when and how to use these operators is an important skill for anyone working on T-SQL. You will gain a better understanding of the three-valued logic of nulls and the differences between GROUPBY and ORDERBY clauses. The operations of the aggregate functions, the concept of normalization and the functions of the Cartesian product are topics that will be analyzed in this course. To improve your knowledge further, you will also become familiar with the functions of JOIN in the WHERE clause and multiple tables.</p><p>Are you familiar with the three types of outer joins in T-SQL? Their differences and functions will be highlighted. Furthermore, you will also learn the order in which inner and outer joins work in a query, as well as the challenges faced when using both. Completing this course will help you gain vital knowledge on how to modify data, how to create a global temp table and how to use bulk copy to insert data. You will also learn how to update a single row with columns and how to delete both single and multiple rows with columns. While completing this course, you will grasp the concepts, challenges and functions of concurrency. The four basic isolation levels in T-SQL will also be covered. This course will be of great interest to students, researchers and anyone with an interest in understanding T-SQL fundamentals and their relevance in programming. So, register for this course and start your next learning journey today.</p><a href=\"https://alison.com/resume/courses/3206\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3206\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to T-SQL","description":"To start, this module will introduce you to the two broad statement types of T-SQLwhich include Data Definition Language (DLL) and Data Manipulation Language (DML). You will also be introduced to the different categories of operators in T-SQL.","topics":["Introduction to T-SQL - Learning Outcomes","Introduction to Transact-SQL","Operators and Converting","Null and Number Functions","Introduction to T-SQL - Lesson Summary","Introduction to T-SQL - Assessment"]},{"name":"Module","details":"Functions, Flow, Results","description":"To start, this module will introduce you to the functions and operations of IF, ELSE, WHEN, WAITFOR, and UPDATE statements. You will also be introduced to the four ranking functions in Transact-SQL.","topics":["Functions, Flow, Results - Learning Outcomes","String Functions","Date and Global Functions","Controlling Program Flow","Ranking Results","Functions, Flow, Results - Lesson Summary","Functions, Flow, Result - Assessment"]},{"name":"Module","details":"Select, Where, Clauses, Tables","description":"To start, you will be introduced to the functions of the WHERE clause, as well as the symbol-based comparison operators supported by the WHERE clause. You will also be introduced to the operations and functions of the Cartesian product.","topics":["Select, Where, Clauses, Tables - Learning Outcomes","Data Selection with SELECT","WHERE Clause","GROUPBY and ORDERBY","Joining Tables","Outer and Self Joins","Select, Where, Clauses, Tables - Lesson Summary","Select, Where, Clauses, Tables - Assessment"]},{"name":"Module","details":"Working with Data","description":"To start, this module will introduce you to how to modify data using T-SQL, as well as how to insert data using tables. You will also be introduced to the four basic isolation levels in the SQL server.","topics":["Working with Data - Learning Outcomes","Inserting Data","Temp Tables, Output, Bulk Copy","Updating and Deleting Data","Understanding Transactions","Working with Data - Lesson Summary","Working with Data - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["SQL Server 2014: T-SQL Fundamentals - Course Assessment"]}]}