{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3396","title":"SQL Server 2014: Security Fundamentals","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you the fundamentals of SQL Server 2014 and the steps for creating secure databases.","description":"This software engineering course takes you through the security fundamentals of SQL Server 2014, as well as teaching you about authentication and contained databases. It explains how to design secure databases using the full range of security options. By the end of the course, you will be more acquainted with the theory and implementation of secure server management, authorization and authentication. Optional SQL certification available.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This is a fundamental-level course that begins by explaining the reason for and importance of storing your data in a relational database. It explains why security is the most important feature of SQL Server 2014. You will learn about essential security concepts in SQL Server 2014 and how your data is kept safe. The typical way of finding out how digital resources can be accessed by anyone is through the use of a username and password. ‘Authentication’ is the process of verifying that a principal is who they claim to be. The course explains how SQL Server uniquely identifies principals in order to authorize access to a database. When you use SQL Server login for authentication, clients’ applications have to provide a valid username and password to connect to the database. The course explains why SQL Server authentication is preferred to Windows authentication. You will learn about the procedures used in creating a SQL Server login.&nbsp;</p><p>Contained databases are an interesting part of SQL Server 2014 because they implement new security features and elements. The course explains how they solve the problem of moving a database from one server to another. Authentication is an important part required for accessing the important parts of a database. You will learn about the roles of authorization and authentication to database objects. Understand the concept of ‘principals’, which are users or processes allowed to access secured objects. This course explains how to implement permissions to keep the server and the database secured. It also describes how SQL permission gives the principal some kind of access to a securable object. A schema is essentially a container for elements within the database. See how SQL Server allows for the assignment of default schemas for users and groups. The course explains how SQL servers are not able to automatically create a schema with the same name as the user. The principle of least privilege is a major step in securing a database. The material describes the few common permissions available in SQL Server and you will learn about the three types of statements that cover the kinds of permissions that can be assigned: GRANT, REVOKE and DENY.</p><p>Finally, see how SQL Server follows a procedure to ensure users have permissions to execute codes. The course also describes the concept of ‘exception’, which exists when a code owner has permissions on underlying objects. One of the most important layers that can be applied to any digital asset is encryption. The course explains the security features built into the SQL server that can be used to protect data objects. The process of encrypting data by the use of a key or password is explained. You will learn how important data is usually encrypted and study how to encrypt data containing sensitive information. Security issues associated with a database are quite common in SQL Server. A security mechanism that can help you understand how to attain the highest level of security for your data is called Defense in-Depth. The course also explains the types of encryption keys used in database systems. Start this course today and improve your skills in designing much more secure databases as an administrator, analyst or developer.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}