{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4591","title":"Stakeholder Mapping with Kumu","totalEnrolled":"259","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use Kumu to map relationships and create stakeholder maps with this free online data visualisation course.","description":"Kumu is a powerful data visualisation platform that helps you organise complex information into interactive relationship maps. This course will teach you the significance of stakeholder maps, highlight various Kumu features and discuss the process of using external datasets in Kumu. We will show you how to create, present, share and export fully functional stakeholder maps that are simple to understand and visually appealing.","courseOutcomes":["Explain the concept of a stakeholder...","Discuss the significance of creating...","List the various types of maps that ...","Outline the process of importing an ...","Explain the concept of a stakeholder map","Discuss the significance of creating maps for organisations","List the various types of maps that can be created in Kumu","Outline the process of importing an external data set into Kumu","Recall the various features of Kumu","Summarise the process of creating a presentation in Kumu","Explain the significance of creating different views in a project","Explain the concept of a stakeholder...","Discuss the significance of creating...","List the various types of maps that ...","Outline the process of importing an ...","Explain the concept of a stakeholder map","Discuss the significance of creating maps for organisations","List the various types of maps that can be created in Kumu","Outline the process of importing an external data set into Kumu","Recall the various features of Kumu","Summarise the process of creating a presentation in Kumu","Explain the significance of creating different views in a project"],"courseDescription":"<p>Organisations use relationship maps worldwide to sort data and make the most of it. There are several types of relationship maps that you can create. This free online course will focus specifically on stakeholder maps. There are several tools for creating a relationship map but we will concentrate on Kumu because it is a relatively simple tool to learn and use. Your instructor, Danilo Oliveira Vaz, is a professional who creates professional-level relationship maps and will teach you how to use Kumu to create a stakeholder map for your organisation. He provides several examples and exercise resources to help you practice the art of creating simple stakeholder maps.</p><p>To begin, you'll discover why you should use Kumu instead of other programs. We discuss the various advantages of using Kumu and the multiple maps it supports. Investigate the purpose of each map and the overall benefits of creating maps for sorting complex information. We demonstrate how to set up an account on Kumu, create new projects and use templates for your projects. We will then examine the components of a stakeholder map and you'll learn about ‘tags’ and why they're important for data set fields. Finally, explore using Kumu's built-in features to customise the fields of your data set directly.</p><p>The ability to work with external data sets is a feature that makes Kumu stand out amongst other platforms. We will illustrate linking and importing external data into Kumu in detail. Next, you'll see Kumu's various sorting options, including 'size by', 'colour by' and other advanced options. Then, you'll learn about ‘views’ and how to create multiple perspectives within a single project. You'll also discover how to add collaborators to a project and each contributor's various roles in a project. Finally, the instructor will demonstrate how to create presentations using the maps you make in Kumu. If you want to learn all the fundamentals of creating stakeholder maps, this course is for you. Take advantage of this opportunity and enrol right away.</p><a href=\"https://alison.com/resume/courses/4591\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4591\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Stakeholder Maps","description":"This module will teach you how to create stakeholder maps using Kumu in a comprehensive manner. You will learn the importance of creating maps as well as how to use them in organizations. A step-by-step illustration of the stakeholder mapping process will be provided. Various other features of Kumu will also be explained.","topics":["Fundamentals of Stakeholder Maps - Learning Outcomes","Introduction to Kumu","Working with External Datasets","Sharing and Expanding","Fundamentals of Stakeholder Maps - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Stakeholder Mapping With Kumu - Course Assessment"]}]}