{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2178","title":"Starting with Angular 5","totalEnrolled":"2,338","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Free online tutorial course about the structure and building blocks of coding with Angular 5.","description":"This free online course on Getting started with Angular 5 will teach you about the basics of coding with Angular 5. The course will teach you about the angular components and its structure. You will also learn about the services and modules used by Angular, how to use them to create stylish and functional web pages as well as how routing works in Angular.","courseOutcomes":["Recognise how to build a webpage wit...","Describe the building blocks of Angu...","Explain the various type of Angular ...","Describe how routing works on Angula...","Recognise how to build a webpage with both form and function","Describe the building blocks of Angular","Explain the various type of Angular services and what they are capable of","Describe how routing works on Angular","Define directives and pipes and their role in coding on angular","Recognise how to build a webpage wit...","Describe the building blocks of Angu...","Explain the various type of Angular ...","Describe how routing works on Angula...","Recognise how to build a webpage with both form and function","Describe the building blocks of Angular","Explain the various type of Angular services and what they are capable of","Describe how routing works on Angular","Define directives and pipes and their role in coding on angular"],"courseDescription":"<p>This free online course on Getting started with Angular 5 will provide you with an understanding of the structure of Angular 5 and how to use it to code and build a quality web page. You will learn about using the Angular CLI tool to help install Angular and set up a project as well as how to explain the structure and building blocks of Angular. You will also learn about the class file and the template file of a component in Angular.</p><p>Furthermore, in this free online course you will be learning how to explain the navigation features of Angular routing and will learn about Angular services such as the getMovies( ) and getCharacters( ) services. Next, will you will be learning about designing stylish web pages that have a functional and user friendly layout. The course will also teach you about the three type of directives: directives with templates, students directives, and attributes directives. By studying this online course, you will be introduced to the pipes and how they can deliver a better UI.</p><p>Finally, this Angular 5 online course wraps up with the Angular forms where you will learn about the reactive forms and template-driven forms. Get started this online course today and learn to code a web page with Angular 5.</p><a href=\"https://alison.com/resume/courses/2178\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2178\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Angular 5 Update","description":"In this module, Angular 5 Update, students will go over the various course objectives and have an overview of what will go into learning about Angular. This module will breakdown how this course works and what students can expect. The module will go over many of the various updates that are new to Angular 5.","topics":["Angular 5 Update","Angular 5 Update - Assessment"]},{"name":"Module","details":"Let's Get Started","description":"In this module, Let's Get Started, students will learn about using the Angular CLI tool to help install Angular and set up a project. It will also go over how the Angular CLI tool can help do some heavy lifting when coding a project in Angular. Students will gain an understanding of the structure and building blocks of Angular.","topics":["Let's Get Started","Let's Get Started - Assessment"]},{"name":"Module","details":"Angular Component","description":"In this module, Angular Component, students will learn about the many components of Angular. Students will learn about the application structure of Angular and how it can be viewed as a component tree. The module breaks down the class file and template file of a component. The module will then provide a demonstration.","topics":["Angular Components","Angular Component - Assessment"]},{"name":"Module","details":"Angular Routing","description":"In this module, Angular Routing, students will learn about the navigation features of Angular routing. The module will show students how to implement routes like URL links. Students will also learn how to do this securely. Students will learn about the included services such as router module in this module.","topics":["Angular Routing","Angular Routing - Assessment"]},{"name":"Module","details":"Angular Services","description":"In this module, Angular Services, students will learn about services. The module starts by breaking down the structure of a service. The module then covers the getMovies( ) and getCharacters( ) services, how to add them to their respective list components and how to properly execute them with a lifecycle event in Angular.","topics":["Section Introduction","Accessing Services","Angular Services - Assessment"]},{"name":"Module","details":"Angular Modules","description":"In this module, Angular Modules, students will learn about the different classes of Angular Modules. Students will learn about the properties of a module including declarations, exports, and imports. This topic will also cover the different types of view classes for a module, like components, directives, and pipes.","topics":["Angular Modules","Angular Modules - Assessment"]},{"name":"Module","details":"Styling Angular","description":"In this module, Styling Angular, students will learn about Material Components. Students will lean how to use these components for the purpose of styling an designing web-pages that work on desktop and mobile. They will used these tools to design a page that looks good while having a functional layout.","topics":["Styling Angular","Styling Angular - Assessment"]},{"name":"Module","details":"Directives and Pipes","description":"In this module, Directives and Pipes, students will learn about directives and pipes, and how they both relate to components. Students will learn about the three type of directives, directives with templates, students directives, and attributes directives. This module will also provide an introduction to pipes and how they can deliver a better UI.","topics":["Directives and Pipes","Directives and Pipes - Assessment"]},{"name":"Module","details":"Angular Forms","description":"In this module, Angular Forms, students will learn about how forms work in Angular. Students will learn about approaching forms in Angular in two different ways. This module will also introduce students to the Angular Forms Module. Students will also learn about reactive forms and template-driven forms.","topics":["Angular Forms","Angular Forms - Assessment"]},{"name":"Module","details":"Course Conclusion","description":"In this module, Course Conclusion, the course concludes with a quick summary and review of the course before the final assessment.","topics":["Course Conclusion","Course Conclusion - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Starting with Angular 5 - Final Assessment"]}]}