{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3814","title":"Styling Websites with CSS","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online CSS course will equip you with the knowledge and skills to style websites using CSS.","description":"This free online course will equip you with the practical knowledge and techniques required to style websites using CSS. We will start with the basics of CSS and how to set it up. The course will then show you how to create and manipulate elements such as borders, apply colours, insert background images, implement transition effects, margins and padding. We will also explain essential features such as pseudo-elements.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>We’ve put together this free online CSS styling course to upskill website designers and creators who would like to design or redesign professional websites using CSS. The course will take you through the basics of CSS and how to set it up before explaining the meanings and functions of selectors, properties, values and units, how to do comments and implement colours to elements in CSS. We also explore the functions of margins and padding, differences between classes and IDs and the roles of grouping and nesting in styling websites. Manipulating text properties and borders is the next bit of content that we will discuss. Then we will explore some other themes, including the various types of pseudo-classes, shorthand properties, and how to implement background images to the scene.</p><p>Our focus will then shift to pseudo-elements and the manipulation thereof, and one of the most critical sections where we will explore layouts. Getting the website layout right is a vital part of the user experience. Some of the layout types you will become familiar with are the static layout, relative layout, and absolute layout, to mention a few. Styling individual elements add a terrific aesthetic to websites. This CSS tutorial will show you how to float and clear properties and create rounded corners for elements in CSS. We will also cover creating shadows, advanced selectors and -colours, how to use the attribute selector, transitions and transformations, and how to apply different CSS rules to different devices using media queries.</p><p>Styling a website is very important because it provides a good user experience, making the website and pages aesthetically pleasing to users. This, in turn, will determine how often people visit your website and how long they stay on your website. A well-styled website can create a good impression on prospective customers and help website visitors access and navigate your website easily. Suppose you are a website development professional or otherwise involved in programming. In that case, knowing how to use CSS to style websites will give your career a significant boost, and it might just lead to new job opportunities.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}