{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4057","title":"Swift Programming Language for Mac and iOS","totalEnrolled":"1,205","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to work with Swift, an open-source programming language for Mac and iOS, with this free online development course.","description":"In this course, you will learn to work with Swift, a programming language for Mac and iOS, and one of the core foundations of application development worldwide. We will introduce you to variables and conditional statements. You will also learn to work with functions and classes using Swift. The demos provided will provide you with a deep understanding of the language and enable you to start your coding career immediately.","courseOutcomes":["Define ‘Swift’ and identify its char...","Define ‘variables’ and ‘constants’ a...","Identify conditional statements and ...","Describe For Loops and While Loops a...","Define ‘Swift’ and identify its characteristics","Define ‘variables’ and ‘constants’ and explain how to use them in Swift","Identify conditional statements and explain how to create them in Swift","Describe For Loops and While Loops and explain how to create them using Swift","Outline ‘switch’, ‘break’ and ‘continue’ statements and explain how to use them in Swift","Describe how to create functions and classes in Swift","Explain the method for creating enumerators using Swift","Define ‘Swift’ and identify its char...","Define ‘variables’ and ‘constants’ a...","Identify conditional statements and ...","Describe For Loops and While Loops a...","Define ‘Swift’ and identify its characteristics","Define ‘variables’ and ‘constants’ and explain how to use them in Swift","Identify conditional statements and explain how to create them in Swift","Describe For Loops and While Loops and explain how to create them using Swift","Outline ‘switch’, ‘break’ and ‘continue’ statements and explain how to use them in Swift","Describe how to create functions and classes in Swift","Explain the method for creating enumerators using Swift"],"courseDescription":"<p>Swift has wide usage and is a programming language used in Mac and iOS systems. Other prominent Swift usage applications include web browsers, as is the case with Mozilla’s Firefox, blog CMS management, WordPress and streaming on platforms like SoundCloud. Discover all the main aspects of the programming language Swift and its processes in this course. The step-by-step demonstrations in each lesson explain how to create and apply these processes using the language and provide general explanations and definitions for programming and development. In addition, the course material includes illustrations of the print line, variables and constants with demos on each using the Swift language. You will also explore typecasting and the instructions on how to use Swift for adding variables into strings.</p><p>An ‘array’ stores any kind of element. The course will explain arrays and demonstrate the easy creation of an array using Swift. Conditional statements and their importance in programming are included, with a demonstration provided. ‘Loops’ are defined, with tutorials on the For Loop, For-In-Loop, While Loop and Do-While Loops. Switch, break, continue statements, functions, function parameters and function return statements are also presented and demonstrated. We cover the processes in detail, with definitions and demonstrations for each. You will investigate classes, class constructors and the method for creating them. Finally, we teach you to create enumerations, explain their significance and provide detailed instructions on making them using Swift.</p><p>Swift is an increasingly popular programming language for iOS and Mac and has become one of the core foundations of application development worldwide. This should come as no surprise given the popularity of Mac and iOS devices. The iOS app store alone holds a large chunk of the global apps market. This course teaches you all you need to start or advance your development and programming with Swift. The course is a step-by-step how-to guide. Each subject covered includes an implementation demonstration, which ensures that you learn the correct methods and add the acquired skills to your coding repertoire. In addition, we provide a link to the source files found on GitHub in the course ‘resources’ section. The assessment at the end of the course will test your knowledge of the course material. So enrol now and benefit from the comprehensive programming and development lessons offered.</p><a href=\"https://alison.com/resume/courses/4057\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4057\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Swift Variables and Conditional Statements","description":"In this module, you will be introduced to Swift, and learn about its wide-ranging applications in the Development world. You will also receive detailed explanations and demonstrations on Variables and adding them into Strings, Loops, and Conditional Statements using Swift Language.","topics":["Swift Variables and Conditional Statements - Learning Outcomes","Swift Variables and Constants","Swift Arrays and Conditional Statements","Introduction to Swift Variables and Conditional Statements - Summary"]},{"name":"Module","details":"Working with Swift Functions and Classes","description":"In this module, you will learn about Functions, Classes, and Enumerations. The module includes how-to demos on each as well. You will learn how to create Functions, Return Statements, and add Function Parameters, Class Constructors, and Enumerators in Swift.","topics":["Working with Swift Functions and Classes - Learning Outcomes","Creating Functions","Creating Classes","Working with Swift Functions and Classes - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Swift Programming Language for Mac and iOS - Course Assessment"]}]}