{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3359","title":"Tableau Software","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Deliver more compelling presentations and reports with charts and maps created inTableau with this free online course.","description":"This online course teaches you how to use and create visualization tools with Tableau. We examine the differences between Tableau and Excel. The course offers video demonstrations so you can learn at your own pace to become familiar with the functions and layout of Tableau, which can help you shine in presentations and reports as you draw on visual displays that impress and inform. This course can help anyone looking to move upwards at work.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you tired of manually creating charts, presentations and email updates in three different applications for a report that you need to recreate every week or month? What if there were a tool that combined all of that automatically? This course introduces you to Tableau, a visualization tool. We take you through the program’s layout and compare it to Microsoft Excel’s. Experience with Excel or any similar software might help you as this course outlines their shared functionalities and highlights differences that might impact your end result. We help you discover the built-in functions and conditional formatting that can improve your charts and data.</p><p>We begin with an overview of the various charts, maps and tables that are available to you in Tableau. However, before we jump into the user interface, we explain the nature of each chart and identify the specific types of analysis that can be completed with the available data. We then provide simple step-by-step instructions on how to create these tools using Tableau and explore more advanced versions of these charts as you study everything from horizontal bar charts to column charts with specialized shapes.</p><p>The course covers Tableau’s ability to easily manipulate and examine data. We demonstrate how to make table calculations such as percent difference, percent of total and rank. Interested in changing the look of your chart? We show you the steps to take to include suitable colours and images before demonstrating how to keep and exclude data before exporting it to your local machine and beyond. The course finishes with attention to animating your charts, which can add some flair to any professional context. This introduction to Tableau provides a solid understanding of the program’s ability to enhance your next report or presentation. Sign up today to set yourself apart from the competition.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}