{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/5179","title":"Technical SEO Training","totalEnrolled":"6,528","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the technical side of search engine optimisation with this free online SEO training course taught by Blue Array.","description":"This training course from industry leaders Blue Array takes a deep dive into the ins and outs of the technical side of search engine optimisation (SEO). We explain step by step how to change language on websites to make them easier for consumers to find. This course is a great starting point for anyone who wants to turn their technical skills into an exciting and in-demand career. Sign up to look under the hood of online content and master SEO.","courseOutcomes":["Analyse a website from a technical p...","Select which tools to use to interpr...","Evaluate and ‘crawl’ a website in th...","Identify what areas to check in orde...","Analyse a website from a technical perspective","Select which tools to use to interpret data","Evaluate and ‘crawl’ a website in the easiest and most efficient way possible","Identify what areas to check in order to comply with the ‘Google Page Experience’ update","Select appropriate structured data","Define and resolve ‘thin’ and ‘duplicate’ content","Recognise common security issues and explain how to fix them","Evaluate your internal linking to improve your website’s ranking","Analyse a website from a technical p...","Select which tools to use to interpr...","Evaluate and ‘crawl’ a website in th...","Identify what areas to check in orde...","Analyse a website from a technical perspective","Select which tools to use to interpret data","Evaluate and ‘crawl’ a website in the easiest and most efficient way possible","Identify what areas to check in order to comply with the ‘Google Page Experience’ update","Select appropriate structured data","Define and resolve ‘thin’ and ‘duplicate’ content","Recognise common security issues and explain how to fix them","Evaluate your internal linking to improve your website’s ranking"],"courseDescription":"<p>This course provides a high-level view of the technical side of search engine optimisation (SEO) and lays out a number of jargon terms and definitions. We then explore a wide range of important topics such as images, internal linking and ‘crawling’ technology (which includes a module created by our friends at Sitebulb).</p><p>The course then investigates deeper aspects of technical SEO, including accessibility and security. Within each topic, we’ll cover basic and advanced concepts and provide the opportunity to test your knowledge with periodic quizzes. Each module has been designed to offer the best possible knowledge on which to base further learning and breaks complicated, technical processes down into easy-to-understand steps.</p><p>This SEO training course has been created by the experienced technical team at Blue Array with a wide audience in mind as it combines an introductory overview with deeper level analysis. In today's global digitised economy, competition for online attention is fierce so this course teaches you how to work with websites to make them easier for consumers to find with various search engines. Sign up to master SEO and add a useful new skill to your professional portfolio.</p><a href=\"https://alison.com/resume/courses/5179\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5179\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Technical SEO - Part 1","description":"This first module of the Technical SEO Training sets the scene for the course by focusing on some high-level topics, that are required for the best understanding of the remainder of this course such as how search works from a technical perspective and crawling technology.","topics":["Technical SEO Part 1 - Learning Outcomes","Introduction to the Course and Technical SEO","A Technical View of How Search Works","Useful Tools","Crawling Technology","Technical SEO Part 1 - Lesson Summary"]},{"name":"Module","details":"Technical SEO - Part 2","description":"This second module within the Technical SEO Training covers more advanced topics within this core area. The topics covered within will help you build on the understanding that has been developed within the first module of this course. We’ll touch on Page Experience, Schema, Status codes, Content, and On-Page signals.","topics":["Technical SEO Part 2 - Learning Outcomes","Page Experience","Schema and Structured Data","Status Codes","Content and On-page","Internal Linking","Technical SEO Part 2 - Lesson Summary"]},{"name":"Module","details":"Technical SEO - Part 3","description":"This is the third and final module within this Technical SEO Training. Here, we cover some more advanced technical topics. These will build on the previous modules, and you’ll be able to run your own technical audit by the end! We’ll touch on Crawlability, Images, Security, and Accessibility.","topics":["Technical SEO Part 3 - Learning Outcomes","Crawlability","Images Optimisation","Security Considerations","Accessibility","The Technical Audit Process","Technical SEO Part 3 - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Technical SEO Training - Course Assessment"]}]}