{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/2271","title":"Tensor Flow Machine Learning Models","totalEnrolled":"1,060","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about building machine learning models, data pipelines and text processing in this free online course.","description":"This free online course on Tensor Flow machine learning models will introduce you to the key operations on tensors in the context of deep learning. You will also be introduced to data pipeline building for Tensorflow and text processing with Tensorflow. You will also be introduced to the different methods TensorFlow API can be used to build machine learning models as well as the concept and importance of saving and restoring models.","courseOutcomes":["Discuss the key operations in neural...","Explain momentum-based strategies an...","Analyze the mathematical foundations...","Explain the two distinct ways of cre...","Discuss the key operations in neural networks and their functions","Explain momentum-based strategies and its applications","Analyze the mathematical foundations of deep learning","Explain the two distinct ways of creating data sets","Explain the process of using TensorFlow API to build a deep learning model for regression problems","Discuss how to build models for structured data using TensorFlow API","List and explain the types of feature columns","Define model summary","Discuss the key operations in neural...","Explain momentum-based strategies an...","Analyze the mathematical foundations...","Explain the two distinct ways of cre...","Discuss the key operations in neural networks and their functions","Explain momentum-based strategies and its applications","Analyze the mathematical foundations of deep learning","Explain the two distinct ways of creating data sets","Explain the process of using TensorFlow API to build a deep learning model for regression problems","Discuss how to build models for structured data using TensorFlow API","List and explain the types of feature columns","Define model summary"],"courseDescription":"<p>This free online course in Tensor Flow machine learning models will begin by introducing you to the mathematical aspects of deep learning. You will also be introduced to the tensors encountered in machine learning practice, the key tensor operations in deep learning and the basics of training and regularization in deep learning. This course explains how to build input pipelines for TensorFlow and the various methods of creating datasets.</p><p>The course then introduces the process for text processing with Tensorflow. You will also learn about the concept of tokenization, the function of tokenizers, embedding, text operations and the conversion of strings. Next, you will learn how to load text into datasets, encode datasets into numbers, and how to build a vocabulary set.</p><p>The course then explains how to build a neural network model for an image classification task using Tensorflow Keras API. You will also learn about the feed-forward neural network and the fashion MNIST data set. This course analyzes the process and significance of building models for structured data using TensorFlow API. You will also learn about the types of feature columns and demonstrate how to transform a column from the data frame.</p><a href=\"https://alison.com/resume/courses/2271\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2271\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Pipelines and Text Processing","description":"In this module, you will be introduced to the key operations on tensors in the context of Deep Learning. You will also be introduced to data pipeline building for Tensorflow and text processing with Tensorflow.","topics":["Data Pipelines and Text Processing - Learning Outcomes","Mathematical Fundamental of Deep Learning","Building Data Pipelines for Tensorflow I","Building Data Pipelines for Tensorflow II","Building Data Pipelines for Tensorflow III","Text Processing with Tensorflow","Data Pipelines and Text Processing - Lesson Summary"]},{"name":"Module","details":"Building Machine Learning Models","description":"In this module, you will be introduced to the different methods TensorFlow API can be used to build machine learning models. You will also be introduced to the concept and importance of saving and restoring models.","topics":["Building Machine Learning Models - Learning Outcomes","Classify Image","Regression","Classify Structured Data","Text Classification","Underfitting and Overfitting","Save and Restore Models","Building Machine Learning Models - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Tensor Flow Machine Learning Models - Final Assessment"]}]}