{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3764","title":"The Basics of Decision Formulas","totalEnrolled":"1,415","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn powerful formulas and to use Excel's built-in functions to calculate & solve problems in this free online course","description":"How much time would you save if you could look up and track all of your key indicators in one place? If you are grappling with this question, look no further than this free online course. We will explain the process of using Microsoft Excel to visualize data, using formulas that deliver real-time analysis and insights. We will also show you how to apply advanced formulas in Excel to create powerful dashboards for taking meaningful decisions.","courseOutcomes":["Identify the need for thinking diffe...","Discuss the procedure for using the ...","Summarize the various development pr...","Identify the multiple tips for formu...","Identify the need for thinking differently","Discuss the procedure for using the camera tool in Excel","Summarize the various development principles","Identify the multiple tips for formula editing in Excel","Describe the working principle behind the Excel Calculation Engine","Recognize the ways of writing better formulas in Excel","Explain the various LOOKUP functions used in Excel","Outline the methods of using array formulas in Excel","Identify the need for thinking diffe...","Discuss the procedure for using the ...","Summarize the various development pr...","Identify the multiple tips for formu...","Identify the need for thinking differently","Discuss the procedure for using the camera tool in Excel","Summarize the various development principles","Identify the multiple tips for formula editing in Excel","Describe the working principle behind the Excel Calculation Engine","Recognize the ways of writing better formulas in Excel","Explain the various LOOKUP functions used in Excel","Outline the methods of using array formulas in Excel"],"courseDescription":"<p>Formulas are mathematical expressions that can execute computations, return data, modify the contents of other cells, test conditions, and more. When using formulas to solve problems, you can use a comprehensive range of razor-sharp instruments available on programs like MS Excel. Mastering Excel formulas can require years of trial and error, advice from colleagues and online resources. It's a long process with erratic results. This course will give you a headstart by showing you how to interpret and use Excel formulae and functions to visualize trends, insights, and correlations. This course places emphasis on the importance of thinking differently about problems, which are usually taught in Excel through repetition. You will comprehend the need to start thinking differently about challenges if you'd like to build fantastic formals and solutions in Excel.</p><p>The next section of the course covers the most common criticisms about the need to follow unique approaches to Excel. We will explain why moving away from the old and obsolete manner of using Excel towards new improvised techniques for dealing with various types of problems is crucial. Once we have done this, we'll show you how to use the camera tool in Microsoft Excel. Next, we'll explore adding photos of Excel tables, charts, ranges, and single cells to your dashboard using the tool. The following section describes the guiding concepts for creating dashboards and data visualizations in Excel. We will show you how transparency, developing memory, and efficacy can help you think in new ways. Additionally, we will present the rules and calculating procedure of Excel using preset settings. You will also study a range of techniques and tactics for working more successfully and efficiently with formulas.</p><p>The final section of this course explains how Excel uses a calculation engine to integrate multiple inputs to execute calculations on a spreadsheet. We will explain how Excel goes through all of your functions and dependencies and how they interact and form the calculation chain. Additionally, we'll provide tips and tricks for writing better formulas. We will equip you with methods to search for a specific value in a column to return a value from a different column in the same row using the Vertical Lookup (VLOOKUP) function. Lastly, we will take you through the method for doing numerous calculations on one or more array objects. 'The Basics of Decision Formulas'; is an informative course that illustrates the essential ideas of performing significant calculations and enlightens you on the methods of showing and exploring data. Sign up now if you'd like to take your decision-making skills to the next level!</p><a href=\"https://alison.com/resume/courses/3764\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3764\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Formulas Functions in Excel Dashboards","description":"This module highlights the methods of using formulas in excel dashboards to take meaningful decisions. You will learn a variety of tricks for dealing with formulas and explaining them more clearly, and the process of using the funnel in a reverse funnel metaphor.","topics":["Formulas Functions in Excel Dashboards - Learning Outcomes","Approaching Problems in a Novel Way","Working with Formulas","Advanced Formulas for Dashboards and Decisions","Formulas Functions in Excel Dashboards - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Basics of Decision Formulas - Course Assessment"]}]}