{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4147","title":"The Ultimate Blueprint for WordPress","totalEnrolled":"1,455","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the process of building simple yet beautiful websites with Wordpress Blueprint in this free online course.","description":"This free online course will teach you effective methods to build high-quality websites without the need for coding or web design experience. We explain, step-by-step, how to set up your WordPress site and customize its appearance and content. This course is suitable for anyone who wants to easily build beautiful websites so sign up to take control of the publishing process and carve out your own corner of cyberspace.","courseOutcomes":["Discuss how to create pages and post...","Compare the two...","Analyze how to create custom menus a...","Define how to correctly use post cat...","Discuss how to create pages and posts","Compare the two","Analyze how to create custom menus and navigation systems that both visitors and search engines will find useful","Define how to correctly use post categories and tags","Discuss why these can cause you problems with search engines if used incorrectly","Understand the inner workings of WordPress for fixing, troubleshooting and building websites","Discuss how to create pages and post...","Compare the two...","Analyze how to create custom menus a...","Define how to correctly use post cat...","Discuss how to create pages and posts","Compare the two","Analyze how to create custom menus and navigation systems that both visitors and search engines will find useful","Define how to correctly use post categories and tags","Discuss why these can cause you problems with search engines if used incorrectly","Understand the inner workings of WordPress for fixing, troubleshooting and building websites"],"courseDescription":"<p>Discover how easy it is to quickly build amazing websites using WordPress, a free content-management system with a choice of templates that you can customize to suit your needs. This free online course is for anybody who is interested in website design but lacks coding or design experience. We guide you through setting up your WordPress site, choosing its appearance and filling it with relevant and compelling content.&nbsp;</p><p>WordPress is unique in the sense that you don’t need any particular software or equipment, just an internet connection and an interest in web design. The classic ‘80s film ‘Field of Dreams’ claimed, “If you build it, they will come.” Unfortunately, this is not the case in web design and so we break down how to get found with Google using search engine optimization (SEO). This knowledge can bring many visitors to your page and represents a crucial marketable skill for the digital age.</p><p>WordPress is both easy for those starting out and powerful enough for more experienced developers. It is available in 180 languages and has millions of websites, blogs, online stores and applications. The platform can be hosted on any server and accessed in any browser. This versatility lets your imagination run wild as you build these features with your newfound skills. Wordpress allows you to self-publish so sign up to take control of this powerful and open-sourced platform and make your mark on the world.</p><a href=\"https://alison.com/resume/courses/4147\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4147\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Ultimate WordPress Guide for Beginners","description":"This module will teach you about all things to do with the open-source content management system called WordPress. We will guide you on how to get started building websites from installing and setting it up.","topics":["The Ultimate WordPress Guide for Beginners - Learning Outcomes","WordPress Course Introduction","WordPress Platform Walkthrough","WordPress Website Themes Walkthrough","WordPress Website Editing Walkthrough","WordPress Website SEO Optimization","The Ultimate WordPress for Beginners - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Ultimate Blueprint for WordPress - Course Assessment"]}]}