{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3995","title":"The Fundamentals of Spreadsheet Modelling","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create spreadsheet models for cash flow, net present value (NPV) and pricing in this free online course.","description":"Have you ever undertaken a complex financial analysis that involved an iterative calculation process? In this free online Microsoft Excel tutorial, you will learn how to use the software to make such calculations easier and faster. You will study how to create MS Excel spreadsheet models to help compute a range of calculations for the purposes of financial management and comparisons of potential investment options for informed decision-making.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The modern business environment is full of challenges and investors are continuously searching for viable investment opportunities to maximise returns on their capital. So, how does one decide on what type of business to engage with when faced with several options? In this free online Microsoft Excel certification, you will learn how to develop Excel spreadsheet models that help in this decision-making process. Firstly, you will be taken through the principles of spreadsheet model building and the key elements that should appear in every spreadsheet model. After that, you will be introduced to the different types of financial models and the risks involved in developing and using these models. The key preliminary steps that should be undertaken before building a model will then be explored. Your training is then put into practice by carrying out an exercise that will help you understand these steps better. This will pave the way for the topic of pricing a model, where you will study the relationship between price and demand of a product or service and how to set different price points to optimize returns without losing business to competitors. You will go through several examples and an exercise to help cement your learnings.</p><p>The Microsoft Excel training then uncovers the methods used to create cash flow models, and you will appreciate the challenges faced in building such models. The main MS Excel functions used in this process will be presented to you, and a recommendation will be made on the type of formulas to use, depending on the version of Excel you have. With this knowledge, you will then study the factors to consider when creating an income statement and balance sheet. An exercise on developing a cash flow model combined with an income statement and a balance sheet will be done. The exercise’s workings and answers are then presented to you for you to check your understanding before moving on to spreadsheet models for a project lifecycle which focuses on periods of a year and longer.&nbsp;</p><p>The last part of this Microsoft Excel course discusses valuation models and how to select a discount rate to calculate the net present value (NPV) of a project or business. The leading causes of problems in NPV models will be presented as well as the concept of forecasting. You will then learn how to compare projects and different investment options with the help of another set of examples. This Microsoft Excel training course is specially designed for practising finance staff, managers, investment analysts and business people. The skills obtained here will help you make quicker and better investment decisions in your businesses. For students of business finance and management, enrolling in this course will lay a firm foundation for your career as you continue to grow through learning and practice.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}