{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4444","title":"The Complete Guide to UI/UX Wireframing","totalEnrolled":"3,913","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides the skills used to create paper and digital wireframe designs using various software.","description":"This short, simple course will guide you through all you need to know to make creative and straightforward wireframes for your projects. Explore the role of wireframes in projects, wireframe elements and their resources. We use Illustrations to guide you through creating paper and digital wireframes. Various tools, like Adobe Photoshop and XD, will also be used to help you master the skills to develop well-defined and imaginative wireframes.","courseOutcomes":["Explain the purpose of wireframing a...","List the various types of wireframes...","Indicate the various benefits of wir...","List the equipment required for pape...","Explain the purpose of wireframing a project","List the various types of wireframes","Indicate the various benefits of wireframing","List the equipment required for paper wireframing","Recall some tools used for creating digital wireframes","Explain the process of creating a wireframe using Adobe Photoshop","Discuss the various benefits of using templates for wireframing","Explain the purpose of wireframing a...","List the various types of wireframes...","Indicate the various benefits of wir...","List the equipment required for pape...","Explain the purpose of wireframing a project","List the various types of wireframes","Indicate the various benefits of wireframing","List the equipment required for paper wireframing","Recall some tools used for creating digital wireframes","Explain the process of creating a wireframe using Adobe Photoshop","Discuss the various benefits of using templates for wireframing"],"courseDescription":"<p>Wireframing is the process of careful planning and designing of the layout of screen elements for a project. It is the most important step in the design of a screen. It allows you to carefully and strategically design the information hierarchy, making it easier to position the layout according to how you want your user to process the information. Wireframing also provides a visual understanding of a webpage or any other project before you complete the page. This practice is used mainly by user interface and experience (UI/UX) designers in their projects. This course covers all the elements of wireframing, providing the necessary information and skills to create an easy-to-understand and well-defined wireframe for any project, whether it’s a website, mobile or desktop app.</p><p>First, we will introduce you to the two kinds of wireframes, paper and digital. You will learn about the most common and essential elements placed in a wireframe, like buttons and images. Then, we examine the various resources required to create paper wireframes. We demonstrate some examples and show how to use a template to design paper wireframes. The following section focuses entirely on digital wireframes. We share a list of the various tools like Wireframe CC that you can use to create digital wireframes. We provide a comprehensive explanation of each tool with the help of various examples and illustrations. You will discover the various features offered by each tool and the level of complexity involved in working with each.&nbsp;</p><p>The final section will focus on Photoshop. Photoshop is a graphics design program used by UI/UX designers all around the globe. It offers impressive features to create all sorts of graphic work and illustrations. This section features the processes involved in creating a wireframe in Adobe Photoshop. Furthermore, we explain the various tools and artboards in Adobe Photoshop and Adobe XD. We intend to provide you with all the necessary information and the practical skills to create intelligently designed and sophisticated wireframes. If you are keen on getting involved in the UI/UX design field or are a curious and creative person who wants to learn something new and exciting, then take advantage of this opportunity and enrol on this course today.</p><a href=\"https://alison.com/resume/courses/4444\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4444\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Wireframing","description":"This module will teach you the basics of wireframing. The two wireframing methods, paper wireframing and digital wireframing, will be discussed. There will be an explanation of the various elements and resources used for paper wireframing. With the help of examples, various digital tools such as Wireframe CC and Adobe Xd will also be demonstrated.","topics":["Fundamentals of Wireframing - Learning Outcomes","Paper Wireframes","Digital Wireframes","Fundamentals of Wireframing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Complete Guide to UI/UX Wireframing - Course Assessment"]}]}