{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3548","title":"Top 25 Excel Formulas","totalEnrolled":"5,514","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master Excel’s formulas and advanced functions to create better reports with this free online MS Excel course.","description":"Improve your ability to analyze numerical data with this free online Excel course that teaches you how to use this Windows, Android, MacOS and iOS spreadsheet program. This Excel tutorial will teach you how to use the logical, financial, text, lookup and reference functions along with how to track changes, modify templates, macros and external data sources. This course allows you to get the most out of this powerful program in a practical way.","courseOutcomes":["Identify the main logical and financ...","Compute values using the ‘if’ functi...","Indicate arguments as true or false ...","Compare the uses of logical function...","Identify the main logical and financial functions in a spreadsheet","Compute values using the ‘if’ function","Indicate arguments as true or false using the ‘and’ function","Compare the uses of logical functions ‘and/if’, ‘iferror’ and ‘xor’","List the uses of financial functions: present Value, future value, payment, price and yield","Analyze data and information with the use of financial functions","Identify and use the financial functions applicable in accounting","Identify the applications of ‘text’, ‘lookups’ and ‘reference’ functions in Excel","Arrange data in a user-friendly format","Classify data according to specified categories or values","Summarize findings for meaningful reporting","Compare the features of ‘lookup’ functions","Select the right tabs and perform different tasks in Excel","Identify the main logical and financ...","Compute values using the ‘if’ functi...","Indicate arguments as true or false ...","Compare the uses of logical function...","Identify the main logical and financial functions in a spreadsheet","Compute values using the ‘if’ function","Indicate arguments as true or false using the ‘and’ function","Compare the uses of logical functions ‘and/if’, ‘iferror’ and ‘xor’","List the uses of financial functions: present Value, future value, payment, price and yield","Analyze data and information with the use of financial functions","Identify and use the financial functions applicable in accounting","Identify the applications of ‘text’, ‘lookups’ and ‘reference’ functions in Excel","Arrange data in a user-friendly format","Classify data according to specified categories or values","Summarize findings for meaningful reporting","Compare the features of ‘lookup’ functions","Select the right tabs and perform different tasks in Excel"],"courseDescription":"<p>Microsoft Excel organizes your data and saves you time by using its built-in functions to make calculations and create charts and graphs. This free online Excel course provides a hands-on tutorial on how to use twenty-five advanced functions in the following categories: logical, functional, text, lookup and reference. What are the ‘logical’ functions in Excel? What Excel functions are used in accounting? What is the use of the ‘lookup’ function? Our step-by-step explanation will introduce you to each function and its arguments and syntax as we explain how and where to use each formula. This course demonstrates the role of ‘logical’ functions in decision-making, whether you’re comparing marks scored by students or deciding who gets a sales bonus.</p><p>We then move on to some key financial functions that can execute a variety of calculations and are commonly used in business and even in our personal lives and these functions are taught step-by-step. The second module of the course begins with the explanation of the ‘text’ and ‘concatenation’ functions. How do you use the ‘text’ functions in Excel? Is it possible to join the text of two or more cells in Excel? Working with arrays of data can be time-consuming and make one prone to mistakes, and the content on ‘lookup’ and ‘reference’ functions will teach you how to use ‘vlookup’ and ‘hlookup’ to automatically perform tasks to save time and avoid errors. It also provides practical training on how to meaningfully compare rows and columns in a spreadsheet.</p><p>This Excel tutorial helps you to track changes in Excel while you modify templates, macros and external data sources. We take you through the general features of Excel to add advanced skills skill-set as Excel skills are highly valued in any environment where you are working with large data sets. Spreadsheets are a staple tool of many fields, from business to education and science and beyond, and improving your Excel skills by enrolling in this Top 25 Excel Formulas course can launch your career to new heights.</p><a href=\"https://alison.com/resume/courses/3548\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3548\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Logical and Financial Functions","description":"Microsoft Excel is used by many people around the globe. It has many features and functions that enable quick analytics for business and research. In this module, you will be introduced to some of the key logical and financial functions. You will learn how to display text in these functions and how to use these functions to calculate values on spreadsheets. You will also understand the meaning of arguments for a function.","topics":["Learning Outcomes – Logical and Financial Functions","Course Introduction and Logical Functions","Financial Functions","Lesson Summary – Logical and Financial Functions"]},{"name":"Module","details":"Text, Lookup and Reference Functions, Bonus Selection","description":"Excel has several powerful functions that enable efficient and user friendly management and presentation of a large range of data. In this module you will be introduced to the basic functions in text and lookups. These functions are useful for analysts, report making, data verification, auditing and in many other fields. This nodule also offers a bonus selection of some useful functions of Excel such as creating and modifying templates, working with different workbooks and external data sources.","topics":["Learning Outcomes – Text, Lookup and Reference Functions, Bonus Selection","Text Functions","LOOKUP and Reference Functions","Bonus Selection","Lesson Summary – Text, Lookup and Reference Functions, Bonus Selection"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}