{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3804","title":"Tricks and Techniques of Logo Design","totalEnrolled":"4,781","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course analyzes steps involved in the logo design process, working with photoshop, and finding clients.","description":"Tricks and Techniques of Logo Design is a free online course that teaches powerful tips for effective logo design. Discover some advanced typography techniques. In this course, you will learn how to clean up your design using photoshop. Different techniques of automatically converting raster pixel images into vector shapes objects will be discussed. Learn the tricks to finding your clients and how much you should charge. Start this course today!","courseOutcomes":["Analyze six steps involved in the lo...","Outline how to gather information fr...","Identify the right questions to ask ...","Discuss logo design process, using A...","Analyze six steps involved in the logo design process","Outline how to gather information from your clients","Identify the right questions to ask your logo design clients","Discuss logo design process, using Adobe Illustrator","Explain how to properly align objects when using illustrator to design your logo","Explains how to find your clients and how much you should charge","State how to attain and maintain your target audience","Analyze six steps involved in the lo...","Outline how to gather information fr...","Identify the right questions to ask ...","Discuss logo design process, using A...","Analyze six steps involved in the logo design process","Outline how to gather information from your clients","Identify the right questions to ask your logo design clients","Discuss logo design process, using Adobe Illustrator","Explain how to properly align objects when using illustrator to design your logo","Explains how to find your clients and how much you should charge","State how to attain and maintain your target audience"],"courseDescription":"<p>Who are the businesses that fail to survive and who are the ones that taste success? Many entrepreneurs who have made extra attempts to create a strong visual brand identity in the market have become successful. So, making good visual communication with people is necessary to run a successful business. This is the reason that modern entrepreneurs pay so much emphasis on creating unique visuals. Tricks and Techniques of Logo Design is a free online course that teaches powerful tips for effective logo design. It analyzes six steps involved in the logo design process. You will learn how to gather information from your clients, the right questions to ask your logo design clients, and how to brainstorm ideas. This course evaluates some graphics fundamentals. The difference between Raster graphics and Vector graphics will be discussed.</p><p>In this course, you will learn about grouping/ungrouping, locking/unlocking, stacking, and duplicating objects. It analyzes how to work with colors inside an illustrator when designing your logo. The elements of design are the fundamental aspects of any visual design which include shape, color, space, form, line, value, and texture. This course teaches you how to build colour schemes and palettes. You will learn about resolutions and resizing when designing a logo with photoshop. This course introduces you to different effects and ideas when designing your logo. How to export the final version of your logo both from illustrator and photoshop to other formats will be discussed in this course. You will be taught how to manually trace pixels to create vector shapes. This course will introduce you to photoshop layers and how they function. In this course, you will understand how to create variations on your logo.</p><p>Finally, a logo is an essential part of doing business in the market where many competitors seek the attention of the customers. A logo becomes an effective marketing tool to take a company’s products and services to the people and targeted customers. But such advantages are accessible only when a logo design is professional. This course gives you hands-on knowledge on how to clean up your design using photoshop. It outlines the different ways of automatically converting the raster pixel images into vector shapes objects. You will learn about paths and anchor points. You will discover some logo inspiration sites, logo resource sites, and logo blogs. This course will lead you to the criteria of marketing your skills, the range with which you should charge your client as a beginner. This course will teach you how to properly align and space objects when using illustrator. This course will be of immense benefit to business owners, graphic designers, freelancers, brand influencers, and digital promoters. Register for this course Today!</p><a href=\"https://alison.com/resume/courses/3804\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3804\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Logo Design Process","description":"This module introduces six steps involved in the logo design process. Learn how to gather information from your clients, the right questions to ask your logo design clients, and how to brainstorm ideas. This module evaluates some graphics fundamentals. You will learn how to move your ideas to the computer and some of the intricacies of logo design.","topics":["Introduction to Logo Design Process - Learning Outcomes","Getting Started With Design Process","Logo Design Process","Graphics Fundamentals","Alternatives For Logo Design","Introduction to Logo Design Process - Lesson Summary"]},{"name":"Module","details":"Techniques Involved Using Different Elements","description":"In this module, you will be introduced to Adobe Illustrator. You will learn how to properly align and space objects when using illustrator to design your logo. This module teaches you how to build colour schemes and palettes. You will learn some advanced typography techniques. This module teaches you how to handle and format text in photoshop.","topics":["Techniques Involve Using Different Elements - Learning Outcomes","Getting Started With Illustrator","Formatting In Illustrator","Typography Techniques","Getting Started With Photoshop","Formatting on Photoshop","Techniques Involve Using Different Elements - Lesson Summary"]},{"name":"Module","details":"Conversion and Commercials","description":"This module introduces how to clean up your design using photoshop. You will learn different ways of automatically converting the raster pixel images into vector shapes objects. It explains how to find your clients and how much you should charge. You will learn how to attain and maintain your target audience.","topics":["Conversation and Commercials - Learning Outcomes","Clean Up With Photoshop","From Pixel Image to Vector Object","Saving To Different File Formats","Additional Resources","Commercials of Logo Design","Conversation and Commercials - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Tricks and Techniques of Logo Design - Course Assessment"]}]}