{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4485","title":"UI/UX Design using Adobe XD","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover the hidden secrets of becoming a great UI/UX designer using Adobe XD in this free online course.","description":"Do you want to design user (UI) interfaces and user experiences (UX) but aren't sure where to begin? There's no need to look elsewhere! This course will teach you everything you need to know to become a savvy UI/UX designer. You'll learn UI/UX design from the ground up with Adobe XD, the powerful all-purpose graphic design software used to create prominent websites and apps. This course debunks the myth that design is only for a selected few.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘UI/UX’ is an abbreviation for user interface and user design, which generally refers to the look and feel of a website, app or visual content displayed on various platforms. UI/UX designers bring the virtual world to life. This course provides website designers, app designers or anyone interested in learning UI/UX design with the skills and knowledge needed to deliver an exceptional user experience. Learn to create user-friendly interfaces that allow users to understand and navigate through web pages and applications easily. We begin by introducing you to Adobe XD. Discover how to download the design software to your computer, overview the user interface and learn about the three function modes in Adobe XD. These include the ‘design’ mode, ‘prototype’ mode and ‘share’ mode. Learn about artboards and how to save an Adobe XD asset to your computer and the design cloud.</p><p>This course will teach you how to create design layers, lock, hide, group them for clarity and ungroup them. Explore how to use the ‘grid’ tool to align page elements, copy and paste appearances and invite a team member to work on a design project. Then we will introduce you to Adobe XD shapes. Here you'll learn how to create various shapes and manipulate them with the ‘resize’ tool and apply fills and borders. Research the Boolean operations needed to create complex shapes, add drop shadows and blend modes and masks to your design. Finally, you will learn how to use the ‘vector’ tool to create illustrations and the ‘text’ tool to create typography. We'll show you how to import images into your design, use components and plugins to speed up the workflow and export an Adobe XD asset. You will understand how to design prototypes, websites and iOS applications.</p><p>A UI/UX designer's primary responsibility is to create interactive visuals with smooth design principles for websites and web apps in order to provide a positive user experience. This Alison course will provide you with hands-on experience with UI/UX design using Adobe XD software. Learn everything you need to know to design an ideal website, illustration, prototypes and an iOS application. If you've been looking for the perfect course to kickstart your career as a UI/UX designer, look no further. Take this course right away and learn a new skill.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}