{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4079","title":"Understanding Spreadsheets","totalEnrolled":"1,643","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basic and advanced features, functions and formulas in Google Sheets with this free online course.","description":"In this free online course, you are going to learn how to create and use spreadsheets. Spreadsheets are essential in organizing in categorizing data into a logical format. You can use them for accounting and calculation purposes, business data storage, generating reports, and more. In this free online course, you will learn the basics of Google Sheets and how to use the various functions to analyze your data with ease.","courseOutcomes":["Identify the prerequisite for creati...","Explain how to create a spreadsheet ...","Recognize the Functions of Sum and C...","List and explain the features of a G...","Identify the prerequisite for creating a Google spreadsheet","Explain how to create a spreadsheet from your Gmail account","Recognize the Functions of Sum and Count formula and state how to use the Sum function to get the total of a given range of data","List and explain the features of a Google spreadsheet","Discuss how to protect cells and sheets from being manipulated","Describe how to share a spreadsheet with others in both private and public mode","Identify and explain some of the valuable functions in a spreadsheet","List the steps involved in filtering and sorting data","Identify the prerequisite for creati...","Explain how to create a spreadsheet ...","Recognize the Functions of Sum and C...","List and explain the features of a G...","Identify the prerequisite for creating a Google spreadsheet","Explain how to create a spreadsheet from your Gmail account","Recognize the Functions of Sum and Count formula and state how to use the Sum function to get the total of a given range of data","List and explain the features of a Google spreadsheet","Discuss how to protect cells and sheets from being manipulated","Describe how to share a spreadsheet with others in both private and public mode","Identify and explain some of the valuable functions in a spreadsheet","List the steps involved in filtering and sorting data"],"courseDescription":"<p>This free online course will teach you how to create a Google spreadsheet from your Gmail account. You will only need to have a Gmail account to access the program. That's right - you do not need any special software to create a Google spreadsheet. Spreadsheets are valuable tools for accountants, teachers, engineers, sales personnel, market researchers, and many more professionals. Google Sheets is one of the most widely cloud-based spreadsheet programs, and it is used across all disciplines and professions. We will show you all the different features and options in a spreadsheet, the cells, the rows and columns, and more. They are used to organize, analyze and store data in a tabular format. We will show you how to use various functions such as sum and count. You will also learn how to do conditional summations. In addition, the course will demonstrate how to use the sumproduct formula to bridge a long process of summing and then multiplying before getting the final summation. We'll also show you how to cut words from left, right, middle, and more.</p><p>This course is designed to teach you the basics and advanced formulas in spreadsheets and analyze data in the most effective ways. You will learn how to import data from one sheet to another seamlessly. You will also learn how to filter and sort data in ascending or descending order. Have you ever wondered how to merge multiple data without having to worry about misplacing your data? Well, this course will teach you how to merge multiple data accurately without losing anything. You will also learn to keep specific rows and columns visible on your screen when scrolling across the sheets by freezing the rows and columns. We will then demonstrate sharing spreadsheets with others and deciding whether or not they can comment, edit or simply view the shared sheet. Data manipulation is almost inevitable in shared sheets, so to prevent a given data from being changed, you will need to protect the cell that contains the data. We will show you how to protect your data from being changed from the original value. You will also learn to check the edit history and see changes made in any particular cell or sheet. Finally, you will learn some useful shortcuts that will help you achieve results faster and save you a lot of time.</p><p>Google Sheets is undoubtedly the most widely used data analysis tool. However, many people lack the basic knowledge required to utilize this tool effectively. By taking this course, you will learn and familiarize yourself with many fantastic features embedded in the Google spreadsheet, making it seamless and straightforward to use. This course is for anyone who would like to master spreadsheets and effortlessly analyze any data. You do not need any prior knowledge of spreadsheets to take this course. So, what are you waiting for? Start this course today and start your journey to becoming a spreadsheet master.&nbsp;</p><a href=\"https://alison.com/resume/courses/4079\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4079\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Getting Started with Basic Functions","description":"In this module, you will learn how to create a spreadsheet from your Gmail account, the basics of Google spreadsheet, and how it works. Then you will learn the basic functions in a spreadsheet such as SUMIFS, COUNT, etc., and how to use these functions to achieve results. You will also learn how to use functions to manage data and information.","topics":["Getting Started with Basic Functions - Learning Outcomes","Getting Started","Basic Functions","Getting Started with Basic Functions - Lesson Summary"]},{"name":"Module","details":"Advanced Functions and Extra Tips","description":"In this module, you are going to get acquainted with the advanced functions in a spreadsheet, such as IMPORTRANGE, how to merge multiple tabs into one, sharing sheets with others, freezing rows and columns, shortcuts, and how to protect your data from being manipulated by an external source.","topics":["Advanced Functions and Extra Tips - Learning Outcomes","Advanced Functions","Extra Tips for Mastering Spreadsheets","Advanced Functions and Extra Tips - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Spreadsheets - Course assessment"]}]}