{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3911","title":"Understanding the Essentials of Excel Data Visualization","totalEnrolled":"990","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will show you how to turn data into storylines and display them in innovative Excel visuals.","description":"Although the phrase \"A picture is worth a thousand words\" is almost a century old, its value still holds today. This is because visual information accounts for more than 90% of all data transmitted to the human brain. As a result, visual imagery is a powerful tool for communicating both abstract and tangible concepts. This course will show you how to make the best use of your data and findings by visually displaying them in Microsoft Excel.","courseOutcomes":["Define the concept of data visualiza...","Discuss the differences between Data...","Explain the principles of data visua...","State the guidelines for tables and ...","Define the concept of data visualization","Discuss the differences between Data graphics and infographics","Explain the principles of data visualization","State the guidelines for tables and charts","Describe the procedure of adding a developer tab and a camera tool","Outline the pros and cons of sparklines and heatmaps","Summarize the different types of KPI charts","Identify the process of creating infographics in Excel","Indicate the process of creating a Checkbox and a Tornado Drilldown Dashboard","Define the concept of data visualiza...","Discuss the differences between Data...","Explain the principles of data visua...","State the guidelines for tables and ...","Define the concept of data visualization","Discuss the differences between Data graphics and infographics","Explain the principles of data visualization","State the guidelines for tables and charts","Describe the procedure of adding a developer tab and a camera tool","Outline the pros and cons of sparklines and heatmaps","Summarize the different types of KPI charts","Identify the process of creating infographics in Excel","Indicate the process of creating a Checkbox and a Tornado Drilldown Dashboard"],"courseDescription":"<p>Did you know that the human brain has a highly advanced capability to spot patterns based on position, size, colour, and shape, allowing mental shortcuts? Data visualization enables us to identify significant patterns and connections. If you want to understand better the graphical representation of data and how to use the best interactive media to bring your data story to life, this course is for you. You will learn about visualization concepts such as similarity, closure, common grouping, continuation, colour variation, spatial position and associated attributes. We'll also highlight the differences between data graphics and infographics.</p><p>The course then moves on to the principles of data visualization. You will learn underlying visual complexity should match the complexity of the presentation on a one-to-one basis to eradicate confusion and misinterpretation. After that, we will explore chart and table layout models and the stages of the data visualization process. In addition, you will learn how to set up Excel in a specific way. We will start with the installation of two different features, the camera tool and the developer tab.</p><p>The course proceeds by demonstrating how to use Excel to create and customize various charts. You'll discover how to use the Conditional Formatting tab in Excel to display the high, low, and negative points with a Sparkline and create a heatmap. Then you'll learn about KPI (Key Performance Indicator) charts and their components. This will include their performance and context and the methods of creating infographics for further reports. Finally, we will show you ways of combining some interactive data visualization features in Excel. Discover how to efficiently interpret and visualize data using Microsoft Excel and related technologies.</p><a href=\"https://alison.com/resume/courses/3911\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3911\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Data Visualization Model in Excel","description":"The steps of the data visualisation process are outlined in this module. You'll learn how to create and configure numerous charts and also the methods of choosing the ideal graphic for your data.","topics":["Data Visualization Model in Excel - Learning Outcomes","Introduction to Data Visualization","Data Visualization in Excel","Data Visualization Model in Excel - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding the Essentials of Excel Data Visualization - Course Assessment"]}]}