{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1601","title":"Understanding Systems Analysis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about structured system analysis for investigating problems and identifying solutions with this course.","description":"This free online Systems Analysis course will teach you how to meet your organization’s informational, operational, and management requirements when reengineering a process. Systems analysis is the methodical investigation of a problem and the identification and ranking of alternative solutions to the problem. With this course, you will learn how to develop information systems in an efficient and effective manner.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Systems development consists of the steps undertaken to create, modify, or maintain an organization’s Information System. With this course, you will learn about systems development and the systems development life cycle(SDLC). You will study the key points of ISO-9000-3 and Capability Maturity Model and look into business process engineering which addresses all of the processes in the organization, including the information systems processes. This course will also discuss change management and the users' participation in development and change processes.<br><br>A systems survey is initiated when an organization’s IT strategic plan prescribes a development or when a user requests the development or modification of a new system. This course will discuss a system survey and outline its goals. You will study the three aspects of feasibility and learn why there is a need for obtaining approvals. This course will also discuss the structure of Systems Analysis, its goals, and the studies carried out within it.<br><br>This course will carefully guide you through systems development by showing you how to determine a reported problem existence and nature. Once you learn how to determine the scope of the problem, you will be able to propose a course of action that might solve the problem as well as determine the feasibility of any proposed development. So, check out the course today and start learning how to find more feasible solutions to the problems in your organization.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}