{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4159","title":"Understanding Java for Oracle Certification","totalEnrolled":"1,608","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online programming course equips you with the knowledge you need for Oracle certification in Java.","description":"This course has been designed to arm you with the necessary and required Java programming knowledge needed for Oracle certification. It teaches how to set up Java on Windows, Mac, and Linux operating systems using Eclipse. By taking this course, you will learn Java programming basics such as conditional statements and loops, networking and multi-threading. Don't delay. Enrol today and become confident in your programming skills using Java.","courseOutcomes":["Explain how to install Eclipse on Wi...","State the reason for testing codes...","Discuss the importance of comments i...","Distinguish between the various data...","Explain how to install Eclipse on Windows, Mac, and Linux OS","State the reason for testing codes","Discuss the importance of comments in writing codes","Distinguish between the various data types","Recall the various types of operators used in Java","Discuss the types of loop control statements used in Java","Explain the functions of an applet in Java programming","Recall the procedures for passing values to functions","Distinguish between the various types of streams for file input in Java","Discuss the role of classes in Java programming","Explain the functions of the throws keyword in Java programming","State the function of the “this keyword” in Java programming","Distinguish between various data structures used in Java programming","Summarize the client and server set up process in Java programming","Explain how to create a class that runs as a thread in Java","Explain how to install Eclipse on Wi...","State the reason for testing codes...","Discuss the importance of comments i...","Distinguish between the various data...","Explain how to install Eclipse on Windows, Mac, and Linux OS","State the reason for testing codes","Discuss the importance of comments in writing codes","Distinguish between the various data types","Recall the various types of operators used in Java","Discuss the types of loop control statements used in Java","Explain the functions of an applet in Java programming","Recall the procedures for passing values to functions","Distinguish between the various types of streams for file input in Java","Discuss the role of classes in Java programming","Explain the functions of the throws keyword in Java programming","State the function of the “this keyword” in Java programming","Distinguish between various data structures used in Java programming","Summarize the client and server set up process in Java programming","Explain how to create a class that runs as a thread in Java"],"courseDescription":"<p>This free online course has been designed to arm programmers with the knowledge of Java they need for Oracle certification. In the introduction, you will learn how to set up Java on Windows, Mac, and Linux operating systems using Eclipse software. You then move onto Java programming basics, including printing to the console, creating comments, and understanding variables, data types, operators, numbers, strings and arrays. Next, you will study the conditional statements (such as if and switch), loops (while, do-while and for) and regular expressions used in Java programming.</p><p>You then go on to learn the functions of applets (little applications) in Java programming. See how to pass values to functions, and explore byte, character, and standard streams. Next, you will be shown how to list directories and create folders in Java. Learn the functions of classes including keyword, inheritance, override and abstraction. Study exceptions and how to create your own. You will learn the properties of data structures including the stack data structure, vectors, properties, and hashtables as well as sets, bitsets, and lists. Finally, you will be introduced to networking in Java programming and be shown how to set up client and server files as well as how to create a class that runs as a thread. Learn about multithreading and mouse and keyboard events such as keypressed, keytyped and keyreleased.</p><p>Java is a simple and efficient general-purpose language used in computer programming, and it is a portable, object-oriented, interpreted language. Java can be used to develop desktop and mobile applications, and do big data processing. This free online course is focused on teaching Java for Oracle certification to programmers and developers. Sign up now and begin learning today at your own pace with no registration or monthly subscription fees.</p><a href=\"https://alison.com/resume/courses/4159\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4159\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction, Setting Up and Basics","description":"In this module, you will learn how to setup java on windows, Mac, and Linux OS using eclipse, you will be introduced to some basics of java programming and data types, you will learn about the types of operators used in java, and you will also learn about various conditionals and loop statements used in java programming","topics":["Introduction, Setting Up and Basics - Learning Outcomes","Introduction and Setting Up","Java Programming Basics","Conditional Statements and Loops","Introduction, Setting Up and Basics - Lesson Summary"]},{"name":"Module","details":"Java Methods, File IO, Classes and Exceptions","description":"In this module, you will be introduced to methods and file IO, you will learn the functions of the applet in java programming, you will also learn about byte stream and standard stream, you will be shown how to list directories and create folders and you will also learn about classes, modifier types, and user-created exceptions.","topics":["Java Methods, File IO, Classes and Exceptions - Learning Outcomes","Methods and File IO","Classes and Exceptions","Java Methods, File IO, Classes and Exceptions - Lesson Summary"]},{"name":"Module","details":"Java Data Structures, Networking and Multithreading","description":"In this module, you learn the properties of data structures used in Java, some of which include the stack and vector data structure, you will be introduced to networking in java, you will learn how to set up the client and server connection. You will also learn about mouse events and as well as keyboard events and their types in Java programming.","topics":["Java Data Structures, Networking and Multithreading - Outcomes","Data Structures and Collections","Networking and Multithreading","Java Data Structures, Networking, Multithreading - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Java for Oracle Certification - Course assessment"]}]}