{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3442","title":"Unity 2D and C# for Beginner Game Developers","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to create a 2D computer game in Unity and dive into the world of C# scripting with this free gaming course.","description":"This course will teach you everything from installing Unity to exporting your game. We will start at the very beginning - downloading and setting up this cross-platform game engine - and then go through the Unity interface. You don't need to have any programming experience, as we will help you every step of the way. Create a real game scene, which includes C# scripting, and share your work with the world. Enrol today for free to get started!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free programming course, you will learn about all the basic tools needed to create your first 2D game with Unity, a popular cross-platform game engine. We will explore functions in the main interface, game assets and animation of characters, as well as game logic. You will get to know the Unity interface and tools that are used to interact with objects, and you will find out where to search for and how to import game assets such as backgrounds and characters. The Unity library gives you access to thousands of beautifully designed objects, and you will learn how to work with them. This software enables you to create and import your own objects into a game and, since no game object is good without movement, we also cover animation. Animation is essential for any game, so we will show you how to animate a character in Unity, which includes animation components and sprite animation. These tools will help you bring all of your scenes to life.</p><p>You will also learn the basics of C# and we will teach you how to make a character jump, move and collect coins. C# is a programming language that is used for making games in Unity, so you need to understand it in order to create a game so you will get all the useful information needed to program a 2D game. Even if you have no coding experience, learning will still be simple and easy. We will cover the basics of C# and focus on a few useful pieces of code that you can implement in your next project. You will find out how to work with UI (user interface) and you will discover how to display player scores, points or coins collected. By the end of this course, you will be confident in the basics of coding and game development.</p><p>The course is project-based as this is the best way to learn about this gaming engine and C#. You will not just be learning programming concepts: you will apply them immediately to your game as you go. For anyone interested in creating computer games, Unity is a fantastic platform that enables you to make production-quality games. If you know this tool, you can create games for Windows, MacOS, iOS, Android, and Web from a single source! If you are a beginner developer who wants to use Unity for his or her masterpiece but knows nothing about it, this free course is perfect for you. So, why wait? Start learning today, get inspired, familiarize yourself with the basics of 2D game development in Unity, and transform your vision into a two-dimensional reality.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}