{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4608","title":"Using Google Sheets for Productivity","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Enhance workplace productivity and collaboration by mastering Google Sheets in this free online course.","description":"Spreadsheets are great tools for organising information and boosting productivity. Google Sheets is an online-based spreadsheet application whose ease of use, multi-platform support and facilitation of collaboration among users has increased its popularity. In this course, you will be introduced to Google Sheets and learn to carry out multiple operations, including cleaning and formatting data and using tools and functions.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Tools like spreadsheets have found various applications in business and personal life as they are used to organise and present information effectively. You could easily automate routine tasks by mastering these applications, boosting productivity. Google Sheets is a handy spreadsheet application that you can access on any device worldwide. Since multiple users can view and edit sheets simultaneously, it is an excellent collaboration tool. This course aims to help you master the Google Sheets application for greater productivity and better collaboration.</p><p>Spreadsheets are useful in storing and manipulating data. Their applications include creating simple household budgets to performing complex arithmetic and visualisations from big data. Google Sheets has an additional benefit of being cloud-based, making it the go-to application for seamlessly collaborating with family or colleagues. This course will help you gain mastery of the web-based application, making you significantly more productive and a much better collaborator. You will first learn about the processes involved in creating and sharing sheets. Then explore how to navigate the application and share your documents using the various available options. Compare Google Sheets to other applications and their different formatting and editing options. Learn to protect your documents, create named ranges, charts, pivot tables and so on.</p><p>Next, you will discover functions and learn how to simplify the process of cleaning and manipulating data on your sheets using only formulas. Here, you will learn mathematical, text, date, filter, ‘lookup’ and ‘info’ functions. Finally, you will apply your Google Sheets knowledge to create a spreadsheet for automatically computing and tracking mortgage payments. The knowledge from this course applies to personal life or business ventures of any scale. Enrol now and master one of the most popular productivity tools in only three hours!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}