{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3924","title":"Using CSS to Create Responsive Grid and Flexbox Websites","totalEnrolled":"332","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to build a CSS grid and flexbox website with a responsive navigation bar in this free online course.","description":"This free online course will teach you the difference between CSS grid and CSS flexbox websites. We’ll show you how to incorporate the two for a successful web design journey and experience. In doing so, you’ll overcome the challenges and flaws that characterized building with CSS before the advent of CSS flexbox and CSS grid. You'll learn the easiest way to design your website without relying heavily on floats and their rigorous process.","courseOutcomes":["State the difference between CSS gri...","Explain the basic structure of a CSS...","List the main tags within the HTML i...","Discuss how to create a responsive n...","State the difference between CSS grid responsive website and CSS flexbox responsive website","Explain the basic structure of a CSS flexbox responsive website","List the main tags within the HTML in CSS Flexbox responsive navigation bar","Discuss how to create a responsive navigation bar","Recognize how to update the website background-colour","Describe how to apply styling to your web pages","Identify how to add a border to distinguish the sitting of each element in the CSS grid website section","Explain how to create responsive web pages with different contents using flexbox","State the difference between CSS gri...","Explain the basic structure of a CSS...","List the main tags within the HTML i...","Discuss how to create a responsive n...","State the difference between CSS grid responsive website and CSS flexbox responsive website","Explain the basic structure of a CSS flexbox responsive website","List the main tags within the HTML in CSS Flexbox responsive navigation bar","Discuss how to create a responsive navigation bar","Recognize how to update the website background-colour","Describe how to apply styling to your web pages","Identify how to add a border to distinguish the sitting of each element in the CSS grid website section","Explain how to create responsive web pages with different contents using flexbox"],"courseDescription":"<p>In today’s internet-driven economy, the appearance and performance of an organization’s website is a crucial factor that will determine its ability to attract and retain visitors. Therefore, as a web designer, you must make the components of the website fully responsive. This free online course will show you how to tweak many features for your websites to make them fully responsive for your users.</p><p>You’ll learn how to build a website from scratch using CSS flexbox and CSS grid. The CSS flexbox responsive navbar is built with mobile users in mind. This is why one of the objectives of this course is to break down the complex structure of building a website and make it mobile-friendly. You will learn how to set up the index file, write the java scripts and form the web structure. We’ll show you how to create the index.html file and open up loops on where to build the main structure of the website. The arrangement of the structures determines the webpage, and the designer defines what the output looks like. This course will teach you the styling of the webpage. You will learn how to generate the background colours on the webpage. We’ll also show you how to arrange items and do the sizing on the page. The course also covers how to mix up fitting colours for the webpage background from some websites and how to set up fonts and their sizes. We’ll show you how to eliminate unwanted default stylings and how to build a responsive navigation function. By the end of this course, you should also know how to create a toggle for expanding the hidden items in the navigation menu for a smaller screen and how to make it clickable. Aside from the main menu, you will also learn how to create a submenu and how to minimize and open it up. You can always make every adjustment needed on the webpage by altering the scripts written as the codes used are dynamic.</p><p>Next, you will build a CSS grid-based website. We’ll show you how to set up the basic structure of the CSS grid and how to create and save the stylesheet. In addition, we’ll show you how to create a webpage from the HTML page. You’ll learn how to create the header, the main content, the left side, the right side, and the footer depending on the choice of the webpage design. Having reached this point, we’ll show you how to set up and do the styling of the main page structure. Like the Java scripts, the course also covers how to build a responsive navigation bar. You will learn to create the outlook of the webpage when it shrinks or expands and to set up the grid structure. We’ll demonstrate how to populate content within the web page and apply some styling to update the content’s structure. Sign up now to take your web design skills to the next level!</p><a href=\"https://alison.com/resume/courses/3924\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3924\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"CSS Flexbox Responsive Website","description":"In this module, you will learn the step-by-step procedures for building a CSS flexbox responsive website from scratch. You will learn to structure the website with menus and submenus and you will be able to place items in the order you so desire. You will learn how to create a fully responsive navigation bar.","topics":["CSS Flexbox Responsive Website - Learning Outcomes","Website Planning and Setting up","Creating a responsive Navbar and Submenu","CSS Flexbox Responsive Website - Lesson Summary"]},{"name":"Module","details":"CSS Grid Responsive Website","description":"In this module, you are going to learn how to develop a fully responsive navigation menu without having to apply JavaScript. You will learn how to set up the main page structure for the CSS grid and make the contents responsive. Then you will learn how to add a border to distinguish where each one of the elements should sit.","topics":["CSS Grid Responsive Website - Learning Outcomes","Introduction and Setting Up","Creating a Navbar and Content Section","CSS Grid Responsive Website - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Using CSS to Create Responsive Grid and Flexbox Websites - Course assessment"]}]}