{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1505","title":"Visual Basic - Working with Collections and Event-Driven Programming - Revised","totalEnrolled":"1,656","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about collections, LINQ, enumerations and event-driven programming with this free Visual Basic course.","description":"This free online Visual Basic course focuses on how to implement collections and event-driven programming. Visual Basic is a system developed by Microsoft and is now one of the most widely used computer programs in the world. With this course, you will learn how to use collections in Visual Basic, the differences between generic and non-generic collections, and how to create your own Visual Basic dictionary.","courseOutcomes":["Use collections...","Create a dictionary in Visual Studio...","Define the difference between generi...","Define what LINQ stands for...","Use collections","Create a dictionary in Visual Studio","Define the difference between generic and non-generic collections","Define what LINQ stands for","Explain the difference between query syntax and method syntax","Describe what enumeration is","Define what event-driven programming consists of","Handle exceptions that occur within an application","Build applications that will not crash through the use of the ‘Try Catch' ‘End Try1 code block","Take control of adding or removing event handlers to specific events","Use collections...","Create a dictionary in Visual Studio...","Define the difference between generi...","Define what LINQ stands for...","Use collections","Create a dictionary in Visual Studio","Define the difference between generic and non-generic collections","Define what LINQ stands for","Explain the difference between query syntax and method syntax","Describe what enumeration is","Define what event-driven programming consists of","Handle exceptions that occur within an application","Build applications that will not crash through the use of the ‘Try Catch' ‘End Try1 code block","Take control of adding or removing event handlers to specific events"],"courseDescription":"<p>This course will first teach you how to work with collections. You will analyze the difference between generic and non-generic collections and learn how to use each of them in your code. You will then study language integrated query (LINQ) including the differences between method syntax and query syntax, and when to use each in your program. The modules will also cover enumerations and their functions.</p><p>You will then learn how to easily handle exceptions that occur within your application. The course will discuss event-driven programming and teach you how to take control when adding and removing event handlers to specific events. You will also learn how to build applications that will not crash through the use of the \"\"Try Catch End Try\"\" code block. Finally, you will master how to decode your program when compilation errors occur.</p><p>Visual Basic has made it much easier to develop application software for Microsoft Office, and corporations and government agencies alike now use it to automate certain tasks. This makes knowledge of Visual Basic a valuable skill. So, check out the course today and start strengthening your skills as a software developer. Once you have completed the assessment in your own time, consider opting for a certificate to prove your qualification.</p><a href=\"https://alison.com/resume/courses/1505\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1505\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Collections, Linqs and Enumerations","description":"This module will show how to work with collections. You will learn the difference between generic and no-generic collections and how to use each of them in your code. You will also learn about LINQ and the types of LINQ used in Visual Basic. Finally, you will be taught about Enumerations and their functions in the programming language.","topics":["Collections, Linqs and Enumerations - Learning Outcomes","Working with Collections","Working with LINQ","Enumerations and the Select Case Decision Statement","Collections, Linqs and Enumerations - Lesson Summary"]},{"name":"Module","details":"Event-Driven Programming and Handling Exceptions","description":"This module will teach you about gracefully handling exceptions that occur within your application. You will be informed on event-driven programming and how to take control of adding and removing event handlers to specific events. Importantly, you will learn about the Try Catch' and 'End Try' block code and when to use it when you are writing your code.","topics":["Event-Driven Programming and Handling Exceptions - Learning Outcomes","Gracefully Handling Exceptions","Understanding Events And Event-Driven Programming","Where To Go From Here","Event-Driven Programming and Handling Exceptions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Visual Basic - Working with Collections and Event-Driven Programming - Final Assessment"]}]}