{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1504","title":"Visual Basic - Working with Classes, Scope and Namespaces","totalEnrolled":"1,678","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use classes, scopes and namespaces in Microsoft Visual Basic, an event-driven programming language.","description":"This free video-based course teaches you about working with classes, scope, and namespaces in the Visual Basic (VB) programming language. Learn how VB helps developers create programs that act as front-ends for databases. Delve into VB’s classes and methods, the differences between them, and their functions. You will also learn about working with the .NET framework class library, an essential part of Visual Basic.","courseOutcomes":["Explain how to use the existing .NET...","Describe the nature of classes and h...","Define how to use the properties and...","Define what happens when there are n...","Explain how to use the existing .NET framework class library efficiently","Describe the nature of classes and how to create an instance of a class","Define how to use the properties and methods of a class","Define what happens when there are no more references to an object","Describe how to change the default namespace for your project","Distinguish the difference between an executable assembly and a library assembly","Explain how to add a reference to a class defined in the .NET framework class library","Explain how you work with arguments that you pass into your application","Define the difference between the debug and release versions","Explain how to use the existing .NET...","Describe the nature of classes and h...","Define how to use the properties and...","Define what happens when there are n...","Explain how to use the existing .NET framework class library efficiently","Describe the nature of classes and how to create an instance of a class","Define how to use the properties and methods of a class","Define what happens when there are no more references to an object","Describe how to change the default namespace for your project","Distinguish the difference between an executable assembly and a library assembly","Explain how to add a reference to a class defined in the .NET framework class library","Explain how you work with arguments that you pass into your application","Define the difference between the debug and release versions"],"courseDescription":"<p>The first module of this course will introduce you to the nature of classes and how to create an instance of a class. You will study methods, scopes and modifiers, and learn that the codes you write in your methods are defining the classes of your application. The course will then teach you the purpose of these features, which can help you add a more advanced look to your application for the end user.</p><p>Next, you will learn how to work with My Namespace, with files and folders on the computer, command line arguments into your command window application, and configuration files. The course will teach you how to change the default Namespace for your project, familiarise you with the .NET framework class library, and discuss the references associated with it. You will also study the difference between the debug and release versions of your application.</p><p>Visual Basic can help you build type-safe and object-oriented applications. It helps developers target Windows, Web and mobile devices with the benefit of security and language interoperability. This video-based Visual Basic course will show you how to use exciting sets of tools to build engaging and useful applications. So check out the course today, and learn the fast and easy way to create .NET framework-based applications.</p><a href=\"https://alison.com/resume/courses/1504\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1504\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Classes, Scope and Modifiers","description":"In this module, you will be introduced to classes, the nature of classes and how to create an instance of a class. You will also learn about methods, scopes, and modifiers. The purpose of these features is to add a more advanced look to the end product of your application for the end user.","topics":["Classes, Scope and Modifiers - Learning Outcomes","Understanding Classes","More about Classes and Methods","Understanding Scope and Accessibility Modifiers","Classes, Scope and Modifiers - Lesson Summary"]},{"name":"Module","details":"Working with Namespaces","description":"This module will show you how to work with Namespaces. You will learn how to change the default namespace for your project. You will also learn about the .NET framework class library and references associated with the .NET framework class library. This module will also teach you the difference between the debug and release version of your application.","topics":["Working with Namespaces - Learning Outcomes","Understanding Namespaces and Working with the .Net Class Library","Getting Familiar with the My Namespace","Creating and Adding References to Assemblies","Working with Namespaces - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Visual Basic - Working with Classes, Scope and Namespaces - Final Assessment"]}]}