{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3510","title":"VMware vSphere 4.1: Configuring and Securing Virtual Machines","totalEnrolled":"799","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes the steps for configuring and securing VMware, as well as the components of VMware.","description":"This course covers the fundamental techniques required to configure and secure a VMware environment including disaster recovery and backup. It gives you an understanding of licensing, and different components of the VMware vSphere suite of applications. You will learn about the terminologies of virtualization technology and the components of vSphere 4.1.","courseOutcomes":["Define a virtual switch and state it...","Define a port and it uses...","Define what a VMkernel Port is and e...","Identify the risks involved when per...","Define a virtual switch and state its function","Define a port and it uses","Define what a VMkernel Port is and explain its functions","Identify the risks involved when performing an installation/upgrade/replacement","State necessary precautions when upgrading your storage on both human and electronic component terms","Explain how to clone a VM, create a VM template, and deploy VMs from a template","Demonstrate an understanding of shared storage, including SANs and NAS","Define a virtual switch and state it...","Define a port and it uses...","Define what a VMkernel Port is and e...","Identify the risks involved when per...","Define a virtual switch and state its function","Define a port and it uses","Define what a VMkernel Port is and explain its functions","Identify the risks involved when performing an installation/upgrade/replacement","State necessary precautions when upgrading your storage on both human and electronic component terms","Explain how to clone a VM, create a VM template, and deploy VMs from a template","Demonstrate an understanding of shared storage, including SANs and NAS"],"courseDescription":"<p>If asked to configure virtual machines vSphere, how do you get started? This course outlines how to configure Windows Server and Linux VMs for maximum performance, availability, and security. It introduces you to creating and modifying virtual networks via GUI or the vSphere client. After installing ESXi, it is essential to configure its management network. See how to use the command SU (substitute user) to create a shell under the root user. It is important you learn how to create, and modify virtual networks using CLI because it is faster and it saves time. Storage concepts, ISCSI storage, fibre channel devices, VMSF data storage, and your NAN storage will also be discussed. Once RAW LUNs is presented to an ESXi host, it can be used as a storage container for virtual machine data. You will learn about the steps involved in creating and viewing a VMSF Datastore.</p><p>This course provides you with practical information and easy-to-learn modules that teach you how to secure your vSphere machines. Learn about NFS components, as well as how to address and access control with NFS on Linus. See how to create two different interface NFS data storages. This course outlines the purpose of raw device mapping (RDM). Learn how to use RDM to store shared data directly on a LUN in your SAN. The material explains standard licensing, virtual standard installation and inventory within the virtual center. It analyzes managing virtual servers as well as how to plan the vCenter server deployment. It also outlines the requirements for cloning Virtual Machines on a standalone ESX/ESXi. This course further explains how you can troubleshoot the vCenter serve. Study how to handle startup and shutdown situations on virtual machines. This module describes the Start/Stop VMs during the off-hours feature, which starts or stops VMs on a schedule.</p><p>Finally, learn how to enforce VM security, including SSH Access and vCenter. Configuration, deployment, optimization, and troubleshooting techniques required to manage vSphere 4.1 are covered. This course will teach you how to secure, protect, and optimize Windows Server and Linux virtual machines The important process of controlling user access and password, active directory integration, managing firewalls, and also SSH access will be analyzed. With ESX only, you master how to run elevated privileges, the switch user, the sudo, and the set UID. You will also learn about the special modes of sudo setuid, and setgid so as to manage your users and permissions. This course is intended for IT professionals with Linux experience who want to learn more about permissions. The course will be helpful in preparing for the Certified Virtualization Expert (CVE) exam from VMware.</p><a href=\"https://alison.com/resume/courses/3510\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3510\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Configuring Networks","description":"In this module, you will be introduced to networking. You will learn about virtual networks, creating and modifying virtual networks when using GUI or the command line. It is essential to configure a management network. This module explains the basic networking terms that you need to know.","topics":["Configuring Networking - Learning Outcomes","Creating and Modifying Networking","Creating & Modifying Virtual Networks Using CLI","Configuring Networking - Lesson Summary","Configuring Networks  - Assessment"]},{"name":"Module","details":"Configuring Storage","description":"In this module, you will be introduced to storage and how it relates to virtual infrastructure. This module will introduce you to storage concepts, the ISCSI Storage, fibre channel devices, vmsf data storage, and your NAN storage. You will also learn about Raw Device Mapping.","topics":["Configuring Storage - Learning Outcomes","Storage Concepts","iSCSI Storage (GUI & Command Line)","Fibre Channel Storage","VMSF Datastores (GUI & Command Line)","NAS Storage and NFS Datastores (GUI & Command Line)","Raw Device Mapping (RDM)","Configuring Storage - Lesson Summary","Configuring Storage - Assessment"]},{"name":"Module","details":"vCenter Server 4.1 Licensing","description":"This module introduces standard licensing, virtual standard installation & inventory when looking for items in the virtual center. It analyzes managing virtual servers and then planning for the vCenter server deployment. This module further explains how you could troubleshoot the vCenter server, the licensing, and data-based issues.","topics":["vCenter Server 4.1 Licensing - Learning Outcomes","VMware Licensing","vCenter Server Installation","vCenter Server Inventory","Managing vCenter Server","Planning vCenter Server Deployment","Troubleshooting vCenter Server and Database","vCenter Server 4.1 Licensing - Lesson Summary","vCenter Server 4.1 Licensing - Assessment"]},{"name":"Module","details":"VM Creation Configuration, and Snapshots","description":"This module introduces the process of creating a VM. The process of creating multiple VM along with how to make use of templates with contents will be discussed. You will learn about Virtual appliances in making use of your favourite VMware Converter. Some special tricks needed when making use of virtual machines will be outlined.","topics":["VM Creation Configuration Snapshot - Learning Outcomes","Creating a Virtual Machine","Create Multiple VMs, Templates, & Clones","Virtual Appliances","VMware Converter (P2V - V2V)","Managing VMs","Virtual Machine Startup/Shutdown","Virtual Machine Snapshots","Web Access Management","Virtual Machine Troubleshooting & Best Practices","VM Creation Configuration Snapshot - Lesson Summary","VM Creation Configuration, and Snapshots - Assessment"]},{"name":"Module","details":"Security and Permissions","description":"This module introduces the important process of controlling user access & password. You will also learn about active directory integration, managing firewalls, and SSH access. With ESX only, you will learn how to run elevated privileges, the switch user, the sudo, the set UID. This module further explains VM safe and vShield zones.","topics":["Security and Permissions - Learning Outcomes","Controlling User Access and Passwords","ESX/ESXi Active Directory (AD) Integration","Managing Firewalls","SSH Access","Running Elevated Commands (su, sudo, setuid/setgid)","VMsafe and vShield Zones","Security and Permissions - Lesson Summary","Security and Permissions - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["VMware vSphere 4.1: Configuring and Securing Virtual Machines - Course assessment"]}]}