{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3503","title":"VMware vSphere 5.5: Storage, VM Creation and Security","totalEnrolled":"406","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about storage concepts, managing virtual machines, and configuration of vApps from this free online VMWare course.","description":"In this free online course, you will learn how to create and manage multiple virtual machines (VM) which will enable you to configure virtual machines with multiple virtual disks. Delve deep into the world of VMWare vSphere 5.5 by refining your skills and explore how to work with network-attached storage (NAS), virtual machine file system (VMFS - 5), fibre channel storage, and other storage options available in vSphere.","courseOutcomes":["Discuss how to import virtual applia...","Recall how to convert an existing VM...","Recall how to extend a VMDK file usi...","List the ways in which storage can b...","Discuss how to import virtual appliances using the OVF or OVA format","Recall how to convert an existing VM into a template and convert the template to a VM","Recall how to extend a VMDK file using a disk path","List the ways in which storage can be assessed in vSphere","Compare SAN and NAS in vSphere","List the vSphere family of storage API and explain them","Analyze the architecture of ESX/ESXi and iSCSi environment","Demonstrates how to verify VMkernel port, the configuration of the networking and the iSCSi software through the command line","Describe how to upgrade from VMFS -3 to VMFS - 5","Describes the process for joining the ESXi host to the active directory to enable the use of active directory authentication when logging on locally to the ESXi host","Explain data encryption","Discuss how to import virtual applia...","Recall how to convert an existing VM...","Recall how to extend a VMDK file usi...","List the ways in which storage can b...","Discuss how to import virtual appliances using the OVF or OVA format","Recall how to convert an existing VM into a template and convert the template to a VM","Recall how to extend a VMDK file using a disk path","List the ways in which storage can be assessed in vSphere","Compare SAN and NAS in vSphere","List the vSphere family of storage API and explain them","Analyze the architecture of ESX/ESXi and iSCSi environment","Demonstrates how to verify VMkernel port, the configuration of the networking and the iSCSi software through the command line","Describe how to upgrade from VMFS -3 to VMFS - 5","Describes the process for joining the ESXi host to the active directory to enable the use of active directory authentication when logging on locally to the ESXi host","Explain data encryption"],"courseDescription":"<p>VMware is a powerful tool with many different configurations to manage Virtual Machines and this VMware vSphere 5.5 free online course focuses on the aspects of storage, VM Creation and security. The start of this VMware course covers vSphere storage and you will learn all about how to configure your host so that it can use and manage different types of storage, the storage APIs for multipathing (PSA), Array Integration (VAAI), Storage awareness, data protection and site recovery manager. It outlines the internet small computers systems interface (iSCSI) and illustrates the architecture of an iSCSI setup. You will learn about solid-state disk (SSD), its special capabilities and benefits as well. What can you do with a network file system (NFS) volume, in comparison to a storage area network logical unit number (SAN LUN)? Absolutely everything, except boot from LUN. This course explores the components of NFS as well as addressing and access control with NFS on Linux. You will learn how to mount an existing NFS datastore to the host, all about the virtual machine file system (VMFS – 5), how to view and create a VMFS 5 datastore and the process for upgrading a VMFS 3 to VMFS 5.</p><p>Every virtual machine needs a network interface card that can connect and participate in a network. This is called a vNIC by VMware. These entities can be created on each virtual machine and there are different types of vNICs that can be created on a virtual machine. This section of the course teaches you the factors to be considered when choosing a suitable type of vNIC beyond the type of guest OS on the virtual machine and also analyzes the various vNIC types and post-conversion steps on how to set new IPs or a new vNIC. Discover how to create a VMDK stub file when one is corrupt or missing, multiple VMs and templates, how to deploy a VM from a template, the customization specification manager, cloning, importing virtual appliance in open virtualization format (OVF/OVA) and how to export a VM to an OVF format. The last section of content covers the configuration and use of vApps. Topics covered are VMware converter 5.5, the four steps for hot cloning in a converter, how to join the ESXi host to the active directory and use active directory authentication when logging on locally to the ESXi host and you will know exactly what to do in order to configure the ESXi firewall via the vSphere client.</p><p>Working knowledge of the storage, VM Creation and security components of VMWare vSphere 5.5 is crucial to getting the most out of this powerful platform. If you are interested in Virtual Machines and their capabilities or work in IT Management, -Administration or -Infrastructure, then this VMWare vSphere 5.5: Storage, VM Creation and Security course could be the skills you need to boost your career.</p><a href=\"https://alison.com/resume/courses/3503\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3503\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Configuring Storage","description":"In this module, you will be introduced to storage APIs and a virtual machine file system (VMFS-5). It gives an overview of the internet small computers systems interface (iSCSi) and how to troubleshoot iSCSi software initiator. Also, this module describes the process for configuring an NFS datastore; through the web client and through the CLI.","topics":["Configuring Storage - Learning Outcomes","Storage Concept","ISCSI Storage (GUI & Command Line)","Fibre Channel Storage","VMFS Datastores (GUI & Command Line)","NAS Storage and NFS Datastores (GUI & Command Line)","Raw Device Mapping (RDM)","Solid State Disks (SSD)","Storage & Management Solutions","Configuring Storage - Lesson Summary","Configuring Storage - Assessment"]},{"name":"Module","details":"VM Creation, Configuration, and Snapshots","description":"In this module, you will be introduced to methods for creating multiple virtual machines (VM) and how to deploy a VM from the template. It analyzes the customization specification manager and VMware converter 5.5. Also, this module specifies the process for managing VMs and illustrates how to use raw device mapping (RDM).","topics":["VM Creation, Configuration, and Snapshots - Learning Outcomes","Creating a VM","Create Multiple VMs, Templates & Clones","Virtual Appliances","Configuration and Use of vApps","VMware Converter (P2V – V2V)","Managing VMs","Virtual Machine Startup/Shutdown","Virtual Machine Snapshots","Virtual Machine Troubleshooting & Best Practices","VM Creation, Configuration, and Snapshots - Lesson Summary","VM Creation, Configuration, and Snapshots - Assessment"]},{"name":"Module","details":"Security and Permissions","description":"In this module, you will be introduced to controlling user assess and passwords in EXSi. It describes the process for joining the ESXi host to the active directory. Also, this module explains data encryption and encryption of the communication pathways.","topics":["Security and Permissions - Learning Outcomes","Controlling User Access and Passwords","ESXi Active Directory (AD) Integration","Managing Firewalls & Certificates","vCloud VMsafe and vShield","Security and Permissions - Lesson Summary","Security and Permissions - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["VMware vSphere 5.5: Storage, VM Creation and Security - Course Assessment"]}]}