{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3506","title":"VMware vSphere 5 - Network Configuration, Storage, and VM Creation","totalEnrolled":"549","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course helps organizations avoid potential challenges or problems within their networks.","description":"Today, almost every business process is done on a computer and the storage devices attached to these computers are configured in several different ways and made accessible by users. This free online VMWare vSphere 5 - Network Configuration, Storage, and free online VM Creation course focuses on network security, how storage integrates with the Virtual Infrastructure, the many methods of network configuration, and concept of Virtual Machines.","courseOutcomes":["Explain the networking terms in Crea...","Describe the Networking CLI Commands...","Explain the steps involved in using ...","Distinguish between Hardware and Sof...","Explain the networking terms in Creating and Modifying Virtual Networks","Describe the Networking CLI Commands","Explain the steps involved in using Port Mirroring","Distinguish between Hardware and Software Initiators","Recognize the importance of the Virtual Machine File System","List the types of Virtual NICs","Distinguish between Clones and Templates","Unpack the types of Hot and Cold VM Migrations","Describe the process involved in Enabling VM Startup/Shutdown","Explain the networking terms in Crea...","Describe the Networking CLI Commands...","Explain the steps involved in using ...","Distinguish between Hardware and Sof...","Explain the networking terms in Creating and Modifying Virtual Networks","Describe the Networking CLI Commands","Explain the steps involved in using Port Mirroring","Distinguish between Hardware and Software Initiators","Recognize the importance of the Virtual Machine File System","List the types of Virtual NICs","Distinguish between Clones and Templates","Unpack the types of Hot and Cold VM Migrations","Describe the process involved in Enabling VM Startup/Shutdown"],"courseDescription":"<p>If you need a comprehensive guide to supporting the flow of traffic through a network, then this VMWare vSphere 5 - Network Configuration, Storage, and VM Creation free online course is exactly where you should start. This course also enables you to enhance network security and -stability and configuration management to keep accurate network configuration records and to help organizations avoid potential challenges or problems within their networks. A Virtualization Platform attempts to present a generic hardware interface to a virtual guest and VMware vSphere 5.0 is an industry-leading Virtualization Technology Platform used by many organizations.</p><p>This VMWare vSphere 5 course covers topics like Network Configuration, Configuring Storage, VM Creation, Configuration, and Snapshots. You will learn how to use the Network Configuration Manager and Configuration Tools to provide automated data tracking and reporting. This is important to do because it allows administrators to spot any configuration changes and potential threats or issues. It is also an easy way to make bulk changes, such as a network-wide password change in a situation where passwords are compromised. Storage Concepts deals with understanding how storage integrates with the virtual infrastructure and the course explains this along with Internet Small Computer Systems Interface (iSCSI) that uses the TCP/IP protocol to enable long-distance IP routing without the requirement of any external gateway hardware. The purpose of Virtual Machine Creation is to provide a platform-independent programming environment that executes in the same way, regardless of the underlying hardware or operating system, and the final part of this course comprehensively covers this. The course concludes by discussing all concepts related to VM Creation such as how to create Multiple VMs, Templates and Clones, Virtual Appliances, VMware Converter, Configuration and Snapshots.</p><p>This in-depth course empowers you to use the VMWare vSphere 5 platform in order to manage this technology efficiently and effectively. If you use VMWare in your current role or are a student needing to enhance your skills, then you should enrol in this VMWare vSphere 5 - Network Configuration, Storage, and VM Creation free online course.</p><a href=\"https://alison.com/resume/courses/3506\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3506\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Network Configuration","description":"In this module, you will learn how to configure networks. Network configuration is the process of assigning network settings, policies, flows, and controls. Learn also how to create and modify virtual networks using CLI as well as vSphere Distributed Virtual Switches.","topics":["Configuring Networking - Learning Outcomes","Creating and Modifying Virtual Networks","vSphere Distributed Virtual Switches","Creating and Modifying Virtual Networks Using CLI","Configuring Networking - Lesson Summary","Configuring Networking Assessment"]},{"name":"Module","details":"Configuring Storage","description":"In this module, you will learn about configuring storage. Get to study the basic storage terms and how the Internet Small Computers Systems Interface provides access to storage across a TCP/IP network. Also, you will learn about the Virtual Machine File System volumes.","topics":["Configuring Storage - Learning Outcomes","Storage Concepts","iSCSI Storage (GUI & Command Line)","Fibre Channel Storage","VMFS Datastores (GUI & Command Line)","NAS Storage and NFS Datastores (GUI & Command Line)","Raw Device Mapping (RDM)","Configuring Storage - Lesson Summary","Configuring Storage Assessment"]},{"name":"Module","details":"VM Creation, Configuration, and Snapshots","description":"In this module, you will learn about VM Creation, Configuration, and Snapshots. It starts by explaining Virtual Appliances and how to make good use of them. Learn about Virtual Machine Startup/Shutdown.","topics":["VM Creation, Configuration, and Snapshots - Learning Outcomes","Creating a Virtual Machine","Create Multiple VMs, Templates & Clones","Virtual Appliances","VMware Converter (P2V – V2V)","Managing Virtual Machines","Virtual Machine Startup/Shutdown","Virtual Machine Snapshots","vSphere Web Client","Virtual Machine Troubleshooting & Best Practices","VM Creation, Configuration, and Snapshots - Lesson Summary","VM Creation, Configuration, and Snapshots Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["VMware vSphere 5 - Network Configuration, Storage, and VM Creation - Course Assessment"]}]}