{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3487","title":"VMware vSphere 4.1: Planning, Installing and Administering Virtual Machines","totalEnrolled":"523","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free beginner’s system administration course describes the steps for planning, installing and administering VMware.","description":"‘vSphere 4.1; Planning, Installing, & Administering VM’ is a free online course for beginners that introduces you to virtual machines. To get started, you must install VMware Tools in the guest operating system. This course provides an overview of installing and configuring a vSphere environment. Learn how to configure hostname resolutions and manage ESX/ESXi.","courseOutcomes":["Describe the VMware virtual cloud ne...","data center architecture...","Describe ESX/ESXi data center compon...","Explain ESX/ESXi center key features...","Describe the VMware virtual cloud network and the ESX/ESXi","data center architecture","Describe ESX/ESXi data center components and their main functions","Explain ESX/ESXi center key features and benefits","Identify networking problems based on reported symptoms","Discuss how to validate and troubleshoot the reported networking problem","Analyze storage failure scenarios using a logical troubleshooting methodology","Explain how to troubleshoot vSphere cluster failure scenarios and analyze possible causes","Identify and validate VMware ESXi host and VMware vCenter server problems","Describe the VMware virtual cloud ne...","data center architecture...","Describe ESX/ESXi data center compon...","Explain ESX/ESXi center key features...","Describe the VMware virtual cloud network and the ESX/ESXi","data center architecture","Describe ESX/ESXi data center components and their main functions","Explain ESX/ESXi center key features and benefits","Identify networking problems based on reported symptoms","Discuss how to validate and troubleshoot the reported networking problem","Analyze storage failure scenarios using a logical troubleshooting methodology","Explain how to troubleshoot vSphere cluster failure scenarios and analyze possible causes","Identify and validate VMware ESXi host and VMware vCenter server problems"],"courseDescription":"<p>Have you ever wondered how you can automatically install the Windows agent on all machines or how to fix error issues encountered when logging on to the VCM server? ‘VMware vSphere 4.1; Planning, Installing, and Administering Virtual Machines’ is a free course that gives you an overview of installing and configuring a vSphere environment. You will quickly become familiar with the core features of vSphere, along with how to install and configure them. This course is designed for beginners, and no prior experience working with vSphere is required. In this course, you will see how the methodology of VMware is designed in a way that you can learn it, do it, and know it. You will get to understand the challenges, needs, and requirements in the marketplace with regards to different virtualization products including all of your cloud products.</p><p>The course covers how to configure the hostname resolution and NTP server. It defines a hostname, an IP address, as well as shows how to configure the DNS and NTP settings. It will also explore how to plan the deployment of ESX and ESXi. Completing this course will help you identify the physical requirements before installation. You will learn how to create and configure virtual machines. The steps for installing vCenter, as well as the concept of vSphere Client, will also be covered. You will be guided through every step on the process of installing, and configuring ESXi and vSphere for a development and testing lab. This course helps the learner develop an understanding of how to verify that the ESXi host is accessible from vCenter server or vSphere Client. This tutorial gives you a step-by-step guide on the ESX/ESXi server health check. With the growing popularity of VMware Infrastructure &amp; ESX Server, numerous third-party tools are available for ESX Server. In this course, examine how to use several tools to administer the VMware environment.</p><p>Finally, you might have observed that the management agents synchronize VMware components. It also allows you to access the ESXi host through the vSphere Client or vCenter Server, you will learn all it is to manage the ESX/ESXi infrastructure. You will learn about the basic Linux command and its importance. This course develops your skills and competence in using the command-line interface, the Log files, and other tools to analyze and solve issues. For instance, if a user can not connect to the host through the vSphere client, that host is connected and available in vCenter. Completing this course will help you learn about troubleshooting the vSphere client. It explains how to resolve issues related to multiple vSPhere Client errors, such as error messages when trying to log in using vSphere Client. This course will be of significant interest to system administrators, system engineers, support, and technical staff responsible for installation.</p><a href=\"https://alison.com/resume/courses/3487\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3487\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Course Introduction and Methodology","description":"This module introduces its learners to security insights you might not see in other perspectives. In this module, you will get to understand the current components of the marketplace with regards to the virtualization of products.","topics":["Course Introduction and Methodology - Learning Outcomes","Introduction","Overview of Virtualization","Course Introduction and Methodology - Lesson Summary","Course Introduction and Methodology - Assessment"]},{"name":"Module","details":"Planning and Installing ESX/ESXi","description":"In this module, you will be introduced to planning the ESX/ESXi overall deployment aspect along with the deployment guidelines for vSphere 4. The module also introduces ESXi/ESX installation and how to configure the hosting resolution and NTP server.","topics":["Planning and Installing ESX/ESXi - Learning Outcome","Planning the ESX/ESXi Deployment","Deployment Guidelines","vSphere Hypervisor (ESXi) Installation","ESX Installation","Configuring Hostname Resolution and NTP Server","Troubleshooting ESX/ESXi","Planning and Installing ESX/ESXi - Lesson Summary","Planning and Installing ESX/ESXi - Assessment"]},{"name":"Module","details":"Using Tools to Administer VMware","description":"In this module, you will be introduced to using tools to administer the VMware environment. Now that ESX/ESXi has been installed, you will learn about what to do next. The module also introduces various tools that are available to help manage the VMware environment.","topics":["Using Tools to Administer VMware - Learning Outcome","Overview of 3rd Party Tools","ESX/ESXi Management","Linux Command Review","Troubleshooting the vSphere Client (VIC)","Using Tools to Administer a VMware - Lesson Summary","Using Tools to Administer VMware - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["VMware vSphere 4.1; Planning, Installing and Administering vMachines - Course Assessment"]}]}