{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3482","title":"vSphere 4: Course Guide, ESX, and Storage","totalEnrolled":"207","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course describes steps on how to perform various computing operations using vSphere 4 virtualization.","description":"Virtualization is becoming increasingly more important in the broader computing society. It allows for data redundancy along with a convergence of virtualized storages, machines, and networking. Applications that serve as a platform for virtualization are an integral part of the modern world and this free online course will teach you all about the workings, applications, and management of vSphere 4 and virtual machines.","courseOutcomes":["List packages supported by the Netwo...","Discuss scriptable commands that can...","Discuss different VM third-party too...","Analyze Command Line Editors (CLE) t...","List packages supported by the Network File Systems (NFS)","Discuss scriptable commands that can be used on a Linux operating system","Discuss different VM third-party tools along with their functions on virtual machines","Analyze Command Line Editors (CLE) together with the commands used in them","Discuss the conventions used in this course's lab manual together with their uses on virtual machines","Describe how to use DRAC 4 on a Dell 1850 to manipulate physical servers","Discuss the different ways of connecting to the course terminal server","Analyze the relevant virtualization technologies for vSphere 4 and ESX","List packages supported by the Netwo...","Discuss scriptable commands that can...","Discuss different VM third-party too...","Analyze Command Line Editors (CLE) t...","List packages supported by the Network File Systems (NFS)","Discuss scriptable commands that can be used on a Linux operating system","Discuss different VM third-party tools along with their functions on virtual machines","Analyze Command Line Editors (CLE) together with the commands used in them","Discuss the conventions used in this course's lab manual together with their uses on virtual machines","Describe how to use DRAC 4 on a Dell 1850 to manipulate physical servers","Discuss the different ways of connecting to the course terminal server","Analyze the relevant virtualization technologies for vSphere 4 and ESX"],"courseDescription":"<p>vSphere 4: Course Guide, ESX, and Storage is a free online course that is specially designed as an introductory course for anyone interested in virtual machines (VMs). The course uses the popular VMware computing virtualization platform for descriptions of tools used in other virtual machine types and they have far-reaching benefits for all types of data and users. One of which is the role VMs play in saving data through multiple automatic backups and rapid disaster recovery techniques. Increased diversity and complexity of data has given rise to the global explosion of data around us causing a need for more company computer systems per employee which further increases overhead cost. VMs can be used to solve this problem by allowing multiple systems to operate from the same console and at the same time.</p><p>The fundamental workings of virtual machines can be properly mastered through different key concepts analyzed in this course and you will acquire relevant practical skills for troubleshooting various errors that may be encountered in vSphere 4. If you are more advanced, this course can serve as a refresher on aspects related to the usability of ESX servers and their many components. This vSphere course also provides two alternatives for manipulating the different tools and many services of ESX for vSphere. These alternatives are the Command Line Interface (CLI) and the Graphical User Interface (GUI). Discussions then include the multiple possible approaches to the usability of virtual machines such as a data center view for a user connected by a keyboard and screen into a data centre mainframe. By the end of your studies, you will be able to categorize different guidelines for deploying vSphere 4, the ways of managing an ESX server, and the benefits of the multiplicity of operating systems on single machines along with a good overview of what the global standards for virtualization are. The course content specifically also explores the commands used for different operating systems run on VMs, covering Microsoft’s Windows and the Unix-based Linux which will help you be well-rounded and ready for multiple operating system (OS) problems encountered on the most common OSs.</p><p>Virtual computing and virtual machines has made managing IT networks significantly better and easier. If you are in IT management, network security or IT infrastructure or work with virtual machines then you should enrol for this course and learn about the planning, installation, and management of vSphere 4 and ESX 4.</p><a href=\"https://alison.com/resume/courses/3482\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3482\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Methodology and Virtualization Overview","description":"In this module, you will learn about the course methodology and alternative certification available in VMware. You will also learn about an overview of machine virtualization with reasons for doing so covering its many advantages and different applications.","topics":["Course Methodology and Virtualization Overview - Learning Outcomes","Course Introduction and Methodology","VMware Certifications","Accessing the Student FTP Site","RDP Connection for Labs","Virtualization Overview","Course Methodology and Virtualization Overview - Lesson Summary","Course Methodology and Virtualization Overview - Assessment"]},{"name":"Module","details":"ESX Planning, Installation, and Management","description":"In this module, you will learn about the steps for planning, installing, and managing ESX Servers for vSphere 4. Also, you will learn about the conventions used in the vSphere 4 lab manual for practice. You will also learn about the processes of using DRAC 4 and DRAC 5.","topics":["ESX Planning, Installation, and Management - Learning Outcomes","Planning and Installing ESX - Introduction","vSphere 4 - Deployment Guidelines","Lab Manual Conventions","Using DRAC 4","Using DRAC 5","Installing ESX","ESX Management","Configuring Hostname Resolution and NTP","Troubleshooting ESX Servers","ESX Planning, Installation, and Management - Lesson Summary","ESX Planning, Installation, and Management - Assessment"]},{"name":"Module","details":"Tools to Administer ESX","description":"In this module, you will learn about the different tools used to create, modify, and adjust ESX on vSphere 4. You will also learn about different methods and processes that require such tools for the operation of virtual machines. Also, you will learn about many third-party tools used with ESX.","topics":["Tools to Administer ESX - Learning Outcomes","Third-Party Tools","Third-Party Tools - Demonstration","ESX Configuration Commands","Command Line Commands","Configuring Virtual Networks","Creating and Modifying Virtual Networks from Command-Line","Tools to Administer ESX - Lesson Summary","Tools to Administer ESX - Assessment"]},{"name":"Module","details":"Configuring Storage","description":"In this module, you will learn about storage concepts for ESX servers on vSphere 4 covering iSCSI storage and fibre channel storage. You will also learn about data stores along with how to manage and partition data storage disks on different types of virtual machines.","topics":["Configuring Storage - Learning Outcomes","Storage Concepts","iSCSI Storage","Fiber Channel Storage","VMFS Datastores","Disk Partitioning","NAS Storage and NFS Datastores","Setting up Windows NFS Server","Raw Device Mapping","Configuring Storage - Lesson Summary","Configuring Storage - Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["vSphere 4: Course Guide, ESX, and Storage - Course Assessment"]}]}