{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4443","title":"Website Design in Adobe XD","totalEnrolled":"1,607","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to design complex websites in Adobe XD using advanced animation and techniques with this free online course.","description":"This course will teach you how to design websites using Adobe XD. You will learn simple steps to create design briefs and do competitor analyses of other websites to improve your designs. Understand the significance of mood boards, drawing wireframes and sharing your web projects using Adobe XD. Start this course today and learn how to design advanced interactive and responsive websites without a single line of programming code using Adobe XD.","courseOutcomes":["Describe how to create a mood board ...","Discuss how to design a brief for yo...","Recognise a style guide for any webs...","Explain the importance of a wirefram...","Describe how to create a mood board using Adobe XD","Discuss how to design a brief for your website using Adobe XD","Recognise a style guide for any website","Explain the importance of a wireframe","Describe how to prepare designs for your website","List the steps to adjust your website from a regular web version to a responsive version using Adobe XD","Indicate how to share your designs with clients or developers using Adobe XD","Outline the processes involved in exporting your assets using Adobe XD","Describe how to create a mood board ...","Discuss how to design a brief for yo...","Recognise a style guide for any webs...","Explain the importance of a wirefram...","Describe how to create a mood board using Adobe XD","Discuss how to design a brief for your website using Adobe XD","Recognise a style guide for any website","Explain the importance of a wireframe","Describe how to prepare designs for your website","List the steps to adjust your website from a regular web version to a responsive version using Adobe XD","Indicate how to share your designs with clients or developers using Adobe XD","Outline the processes involved in exporting your assets using Adobe XD"],"courseDescription":"<p>This free online course teaches you to design a sample travel agency website using Adobe XD using simple guidelines and easy to follow steps. We begin by creating a design brief in Adobe XD and using it to explore your target audience. Then we study how to do a competitor analysis and see what other travel agency websites are doing correctly or incorrectly to avoid or adopt their decisions in your design. Discover how to create mood boards for your project using Adobe XD. We discuss finding templates of mood boards to download from the course instructor’s website. Several handy tips on how to create paper wireframes for your website and export them into Adobe XD will be outlined. You will also learn how to make paper wireframes for the navigation, homepage, destination page and special offers page of your sample website.</p><p>The course will then teach you how to put your collections of images, icons, colours, font, font sizes and combinations into a style guide using Adobe XD. Your clients can quickly glance at all the elements you used in your design using the style guide. Next, you will study how to design wireframes in Adobe XD and explore ways to turn your paper wireframes into wireframes to share with clients and acquire proper feedback. We demonstrate ways to group your items and elements in the artboard of Adobe XD and you will discover how to design dropdowns, sidebars, hover effects and son on for your websites. We also provide you with comprehensive guidelines on how to animate and make your web pages interactive and adapt them to different screen sizes.</p><p>Furthermore, you will explore tips on sharing prototypes of your web pages with your clients, teammates and other developers. Anyone with a basic knowledge of Adobe XD will find this course easy to follow. Upon completion, you will be confident to design intricate websites without using any code in Adobe XD and employ advanced animation and techniques. The instructor has over ten years of experience in teaching how to design websites and applications. Over the last five years, he has created over 500 design products and improved the lives and workflows of over 100 000 designers worldwide. So use his experience to your advantage and sign up for this course today!</p><a href=\"https://alison.com/resume/courses/4443\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4443\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Research and Wireframes in Adobe XD","description":"In this module, you will be introduced to Adobe XD. You will learn how to create a design brief, do competitor analysis of your competitors' websites and also create mood boards using Adobe XD. Then, you will discover how to design paper wireframes and export them into Adobe XD. Creating style guides and wireframes will also be discussed.","topics":["Research and Wireframes in Adobe XD - Learning Outcomes","Project Introduction and Research","Paper Wireframes","Creating Wireframes in Adobe XD","Research and Wireframes in Adobe XD - Lesson Summary"]},{"name":"Module","details":"Creating Designs and Exporting Assets","description":"In this module, you will learn how to design web pages using Adobe XD. You will also cover design dropdowns, sidebars, animation, etc. Then, you will study how to adapt your web pages to different screen sizes. Also, you will be taught how to connect your web pages and share them with your clients and developers using Adobe XD.","topics":["Creating Design and Exporting Assets - Learning Outcomes","Creating Design","Responsive Design","Sharing the Design","Exporting the Assets and Conclusion","Creating Design and Exporting Assets - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Website Design in Adobe XD - Course Assessment"]}]}