{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/1661","title":"Windows 10 App Development - Navigation and Layout","totalEnrolled":"3,587","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use layout controls and implement navigation in MS Visual Studio with this free app development course.","description":"This tutorial teaches you about app navigation and layout. You will study the layout controls used to create a simple hamburger-style navigation in a Windows 10 application and the methods that can be used in Visual Studio used for navigation. You will look into the ScrollViewer and see how it is used to allow users to scroll through applications to view additional content on the current page and much more.","courseOutcomes":["Outline the layout controls used to ...","Discuss classes and methods used for...","Describe the common controls used in...","Outline the process of implementing ...","Outline the layout controls used to create a simple hamburger-style navigation in a Windows 10 application","Discuss classes and methods used for navigation on Windows applications","Describe the common controls used in XAML","Outline the process of implementing a simple hamburger navigation menu","Examine how the ScrollViewer is used for Windows 10 applications","Discuss the positioning of different shapes in Windows 10 applications","Identify how styles can be used to apply common settings across XAML controls","Describe how developers can use the users preferred theme colours in their application","Outline the layout controls used to ...","Discuss classes and methods used for...","Describe the common controls used in...","Outline the process of implementing ...","Outline the layout controls used to create a simple hamburger-style navigation in a Windows 10 application","Discuss classes and methods used for navigation on Windows applications","Describe the common controls used in XAML","Outline the process of implementing a simple hamburger navigation menu","Examine how the ScrollViewer is used for Windows 10 applications","Discuss the positioning of different shapes in Windows 10 applications","Identify how styles can be used to apply common settings across XAML controls","Describe how developers can use the users preferred theme colours in their application"],"courseDescription":"<p>In this online course, you will gain an overview of the tools that can be used in Microsoft Visual Studio to create suitable layouts and navigation for Windows 10 applications.</p><p>The course starts off explaining the layout controls that you can use to implement hamburger-style navigation for the Windows 10 application you are creating. You will learn about RelativePanel and how it is used in Windows app creation. You will also see how SplitView helps in implementing hamburger-style navigation. Then learn about the navigation classes and methods used to display pages, pass data from pages, and go through the history of visited pages.</p><p>Next, you will study common user input options that are used to create Windows 10 apps and master the process of creating a hamburger-style navigation system for your application.</p><p>In the last module, you will explore ScrollViewer and understand how it functions to allow users to scroll through apps for additional content on the current page. You will learn about the Canvas and how different shapes can be positioned in Windows 10 applications. You will also see how styles can be used to get common settings applied across many XAML controls on a single page or an entire application. Learn how you can use the preferred colours that Windows 10 users have chosen in the application you have created so that it fits in with their other applications.</p><p>This course will be of great interest to developers and anyone who wants to know what is involved in creating layouts and navigation for Windows 10 applications. So, start this free online course today and in just three hours you will gain useful Visual Studio skills. Once you have finished the modules, apply for optional certification.</p><a href=\"https://alison.com/resume/courses/1661\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1661\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"XAML Layout and Navigation","description":"In this module you will learn about the layout controls that can be used to build hamburger style navigation for Windows 10 applications. You will learn how the RelativePanel is used for Windows apps. You will learn how SplitView can help you implement hamburger navigation. You will learn about the navigation classes and methods that are used to display pages, pass data from one page to another and go through the history of pages that have been visited.","topics":["XAML Layout and Navigation Learning Outcomes","XAML Layout - RelativePanel and SplitView","Working with Navigation","XAML Layout and Navigation Lesson Summary"]},{"name":"Module","details":"Common XAML Controls and Hamburger Menu","description":"In this module you will learn about common user input options that can be used to create Windows 10 applications. You will also learn about the process of creating a simple hamburger style navigation system that can be used in most Windows 10 applications.","topics":["Common XAML Controls and Hamburger Menu Learning Outcomes","Common XAML Controls and Hamburger Menu","Common XAML Controls - Part 2","Common XAML Controls and Hamburger Menu Lesson Summary"]},{"name":"Module","details":"ScrollViewer, Shapes, Styles and Themes","description":"In this module you will learn about the ScrollViewer and how it is used to allow users to scroll through applications to see additional content on the current page. You will learn about the Canvas layout control and how different shapes can be positioned in Windows 10 applications. You will learn about how styles allow you to get common settings that you want to apply across multiple XAML controls on a single page or across an entire application. You will learn about how you can utilize the pre","topics":["ScrollViewer, Shapes, Styles and Themes Learning Outcomes","ScrollViewer, Canvas, Shapes and Styles","XAML Themes","ScrollViewer, Shapes, Styles and Themes Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Windows 10 App Development - Navigation and Layout - Course Assessment"]}]}