{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4478","title":"WordPress Fundamentals - Content Management System (CMS)","totalEnrolled":"2,478","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the fundamentals of WordPress and learn their practical implications in this free online web development course.","description":"This WordPress course covers all the important aspects of this website-developing platform. Explore WordPress solutions for your business or project. We will outline the steps to install WordPress and help you understand its basic principles and methods to start building your own website. You will also discover more about the platform’s management and its dashboard. Learn the basics of this popular content management system (CMS).","courseOutcomes":["Contrast WordPress.com and WordPress...","Identify the steps to begin working ...","Recognize the WordPress installation...","Recognize and explain the various as...","Contrast WordPress.com and WordPress.org on the basis of their advantages and disadvantages","Identify the steps to begin working on a WordPress site","Recognize the WordPress installation procedure on a localhost","Recognize and explain the various aspects of WordPress dashboard","Outline the various panels of WordPress","Describe the method of submitting WordPress to various search engines","Indicate the method of adding XML map to Google Search Engine console","Indicate the process of creating and adding menus present on WordPress","Compare WordPress posts and WordPress pages","Define the process of adding custom links and categories to the WordPress menus","Evaluate the working with sidebars and widgets on WordPress","Contrast WordPress.com and WordPress...","Identify the steps to begin working ...","Recognize the WordPress installation...","Recognize and explain the various as...","Contrast WordPress.com and WordPress.org on the basis of their advantages and disadvantages","Identify the steps to begin working on a WordPress site","Recognize the WordPress installation procedure on a localhost","Recognize and explain the various aspects of WordPress dashboard","Outline the various panels of WordPress","Describe the method of submitting WordPress to various search engines","Indicate the method of adding XML map to Google Search Engine console","Indicate the process of creating and adding menus present on WordPress","Compare WordPress posts and WordPress pages","Define the process of adding custom links and categories to the WordPress menus","Evaluate the working with sidebars and widgets on WordPress"],"courseDescription":"<p>With the advent of eCommerce, the need to make new websites has grown exponentially. People use the internet more than ever before, especially with the onset of the COVID-19 pandemic. It is now commonly understood that developing websites is a crucial skill. When it comes to website development, people usually look for accessible platforms on which they can build their websites with feasibility and ease. Although many such platforms exist, none are as reliable as WordPress. With this in mind, the website experts at Digital Partner have prepared this concise and comprehensive course that includes all the fundamental and essential aspects of building a website using WordPress.&nbsp;</p><p>Starting with a brief introduction to WordPress, the course compares the advantages and disadvantages of WordPress.com and WordPress.org. It considers these platforms as the most influential platforms while building a website. This course contains two modules and provides well-documented training material in all its topics. Explore the method of working with a WordPress site in ten basic steps. The topics will demonstrate the step-by-step process of WordPress installation on both localhost and live server. Similarly, they will discuss the critical aspects of WordPress management: submission of WordPress to search engines, adding the meta tag to the site, using the method of plugin search for plugin installation, manual installation of WordPress and the uninstalling process of WordPress.</p><p>The course will help you to comprehend various aspects of the WordPress dashboard: WordPress pages, WordPress posts, customization, widgets, navigation menus and custom links. It teaches you to add and remove widgets from the sidebar and how to create the navigation and dropdown menus. The primary motive for this easy-to-follow course is to make the concept of learning WordPress easy for any beginner. So take the opportunity and enrol in this course today!</p><a href=\"https://alison.com/resume/courses/4478\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4478\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"WordPress Fundamental Concepts","description":"You will be introduced to the differences between WordPress.org and WordPress.com. You will also learn about the steps required to start working on a WordPress site. You will learn about the WordPress installation on localhost by MAMP. In addition, WordPress installation method on a live server is also given with the basics of WordPress dashboard.","topics":["WordPress Fundamental Concepts - Learning Outcomes","Introduction to WordPress","Working with the Real WordPress","WordPress Installation on a Localhost","WordPress Fundamental Concepts - Lesson Summary"]},{"name":"Module","details":"WordPress Essentials","description":"In this module, you will be introduced to WordPress management after its implementation and submission to the three renowned search engines. A description of WordPress plugin installations on the Admin panel is also given. Additionally, you will learn about working with different WordPress aspects i.e.pages and posts, menus, and sidebars widgets.","topics":["WordPress Essentials - Learning Outcomes","Managing WordPress After Implementation","Installing the WordPress Plugins","Dealing With WordPress Widgets","WordPress Pages and Posts","WordPress Essentials - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["WordPress Fundamentals - Content Management System (CMS) - Course Assessment"]}]}