{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/4434","title":"WordPress, Divi and Elementor","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"A free online web development course that explains how to build professional WordPress websites using different themes.","description":"This web design course teaches you how to design a website independently. It begins by guiding you through the process of purchasing a domain name and web hosting service. Next, we will introduce you to Divi and Elementor, website building tools with simple interfaces. Discover how to build a unique and beautiful website complete with a theme and multiple pages. These eCommerce and publishing skills suit any entrepreneur or professional writer.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Imagine having a blank scrapbook and then filling it with your favourite pictures in addition to some exciting text. You add a name on the cover page of the scrapbook and are ready to share this with others. Building a website from scratch can be as thrilling. In this space, WordPress is a popular choice for creating a website. WordPress is open-source software that manages content for websites. We begin by answering some basic questions. How much does it cost to build a website? What does it mean to have a domain name and web hosting service? This course will simplify the website designing experience for you. You do not need any coding skills to use the page builder tools described here. The first module of the course will introduce you to Divi. Divi is a complete design framework that allows you to construct or fashion a fabulous website with a few clicks.</p><p>How do you make a WordPress site with a Divi theme? The hands-on videos in the course will explain how you can set up a homepage using a Divi theme. You will learn to add sections and pages, finalize a menu and customize the header and footer for your website. Using Divi’s visual drag-and-drop builder and responsive editing is a matter of practice. You will learn to design a professional website by combining and arranging different elements available in Divi. In the second module of the course, we will introduce you to Elementor. Elementor is a drag-and-drop website builder plugin. It enables you to create professional websites, such as a landing page, a page for business and services, an eCommerce site or a blog page. You can build and customize every part of your website with Elementor’s visual builder. You can achieve this all with zero coding.</p><p>Elementor offers a complete open-source approach with no limits on design. You will learn to construct high-end web pages as you progress through each video in the course. You will master the skill to edit a website live by simultaneously checking how it looks on the front-end. What does a successful website need? A web design has a few essential elements like content, usability, aesthetics, visibility and interaction. Explore how to address these elements as you grasp the key features of web page builders. This expertise will be helpful if you are either designing for yourself or others. It will provide you with suitable control over how your website looks and works. You will save time and money, benefiting you and your organization by acquiring additional information technology capability. Enrol today and start designing an attractive website with confidence.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}