{"subjectName":"IT","subjectDescription":"IT is one of our most popular categories, with in-depth courses and tutorials across all aspects of information technology. Sign up today to learn about cryptocurrency, blockchain, computer networking and server management. You can take free classes for in-demand languages like Python, JavaS... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/it.jpg","resumeLink":"https://alison.com/resume/courses/3966","title":"Zbrush -Sculpturing a Female Head","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free course will show you how to sculpt a stunning female head with Zbrush - the ultimate digital modelling tool.","description":"Are you new to the world of 3D modelling? This free course is your best chance to get to the bottom of this exciting field. We will show you all the ins and outs of the industry-leading modelling software Zbrush. By the end of this course, you will be familiar with the interface and navigation of Zbrush. You will learn all the methods, menus, functions, and techniques of Zbrush to sculpt an impressive Female Head. Let's get creative!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Zbrush is a specialized 3d modelling software used widely by professionals and amateur hobbyists alike for organic modelling or sculpting. Many creative professionals aspire to master this remarkable tool, but what they don’t know is that it is straightforward to use and beginner-friendly. Zbrush offers many options and tools to craft and curate creative projects. This course will help you get familiar with Zbrush by showing you how to navigate and use Zbrush by sculpting an impressive female head.</p><p>Starting with the basics, we will guide you through all the features, options, essential tools, and techniques of Zbrush. Once you’re through the overview of the interface, you will be comfortable using this software. The easy tutorials in this course will help you unleash your creativity, guiding you through the process of sculpting and modelling in Zbrush. By the time you’re done, you will be able to model and sculpt an impressive high poly Female head from a sphere.</p><p>If you’ve always wanted to learn digital sculpting in Zbrush, but don’t know where to start, look no further than this course. Apart from what Zbrush offers for beginners, this course will also be valuable for professional designers or digital artists who want to refresh their digital sculpting skills or improve them. Enrol now and learn all the handy tricks, techniques, and tools Zbrush has to offer.&nbsp;</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}