{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3602","title":"7-Day Pilates Challenge: 15-Minute Workouts","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Increase your core strength, improve flexibility and shape your body with the help of this free online Pilates course.","description":"Are you ready to dive into the world of Pilates? This 7-day challenge will help you fall in love with this popular physical fitness system which, with some dedication and will, will soon become a part of your daily fitness routine. These 15-minute videos consist of workouts designed for any age and fitness level but before your first session, you will be introduced to the guiding principles of Pilates. Enroll and enjoy!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course, you will discover the amazing benefits of Pilates, a physical fitness system created by Joseph Pilates. Even though it was developed in the early 20th century, the benefits on physical and mental health remain the same. More and more people are using these methods to improve their core strength, flexibility, posture and mood. This 7-day challenge will show you how ‘addictive’ Pilates can be, and how you can shape your body and have fun at the same time in just 15 minutes a day. In the first module, we will cover the nine principles that were formed as this fitness system gained momentum in the last century. Breathing, concentration, control and centering are just some of them, as well as rhythm and flow, which create smooth, graceful and functional movements.</p><p>In the next module, the first four days of this 7-day pilates challenge are covered. In the first video, you will do roll down, single leg circles, spine stretch, and side-bend exercises. Sounds good? If so, you will love the second day, where you will do routines called ‘marching’, ‘toe taps’, ‘hundred’, ‘bridging’ and ‘spine stretch’. Following that, you will learn more complex exercises like opposite arm leg lift, side-lying inner tight lift, spine twist, ab curl, oblique reach, side leg lift, swan, breaststroke, and saw. The last module focuses on the last three days of this challenge, and here you will enjoy exercises that could become some of your favorites: single leg stretch, oblique lift, and side bend. We will wrap up everything with hip circles, sidekicks, and clam workouts.</p><p>No matter if you’ve already done Pilates or you are a total beginner, you will be delighted with the effect of these videos. It is no secret why Pilates is popular across the world: it decreases stress, is safe if done correctly, the exercises are low impact, and people of every age can enjoy it. What you are about to do is included in programmes many fitness centres, private studios, rehabilitation clinics and even hospitals use. If you want to become fit and strong, or if you simply want to maintain your good shape and you enjoy the feeling physical activity gives you, this course is for you. The best thing of all is, a minimum amount of accessories is needed to enjoy Pilates and its benefits. If you have a mat, towel and pillow, you are good to go. So, why wait? Enroll in this free course today, invest in your physical and mental well-being, roll out your mat and enjoy this 7-day Pilates challenge!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}