{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5282","title":"A Comprehensive Guide to Personal Protective Equipment","totalEnrolled":"491","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to properly use Personal Protective Equipment (PPE) to stay safe at work.","description":"PPE is an acronym for personal protective equipment. It might not come to mind when it comes to dressing to impress but it is extremely important. PPE is clothing or equipment meant to protect employees from chemical, biological and physical threats on the job. This course is designed to equip you with the technicalities involved in the use and maintenance of PPE as well as the knowledge of regulatory standards governing it.","courseOutcomes":["Define personal protective equipment...","Explain why personal protective equi...","Discuss the role of PPE in protectio...","Identify the types of PPE suitable f...","Define personal protective equipment","Explain why personal protective equipment is important","Discuss the role of PPE in protection from inhalation of hazardous materials","Identify the types of PPE suitable for different body parts","Recognise how to do a risk assessment to find dangers that could potentially pose a risk","Maintain different PPE in order to get maximum protection","Summarise the role of PPE in the health sector","Define personal protective equipment...","Explain why personal protective equi...","Discuss the role of PPE in protectio...","Identify the types of PPE suitable f...","Define personal protective equipment","Explain why personal protective equipment is important","Discuss the role of PPE in protection from inhalation of hazardous materials","Identify the types of PPE suitable for different body parts","Recognise how to do a risk assessment to find dangers that could potentially pose a risk","Maintain different PPE in order to get maximum protection","Summarise the role of PPE in the health sector"],"courseDescription":"<p>Almost every workplace has one or more potentially hazardous situations to be aware of. These hazards can be chemical, medicinal, radiological, physical, or electrical and they can cause workplace injuries and illnesses. In order to prevent these injuries, organisations need to establish safety regulations that involve the use of personal protective equipment(PPE). But what is PPE? In simple terms, PPE is all of the clothing and other equipment such as gloves and earplugs that protect you from harm or infection at work. Knowing and understanding the proper usage of PPE, therefore, can draw the line between life and death. This course covers the various aspects of PPE from its importance to its maintenance and everything in between. You’ll learn about the role of PPE in protection against different types of hazards such as biological hazards, hazardous materials and more. Upon that, we'll discuss various types of PPE and further elaborate on why they are needed.</p><p>To get the most out of personal protective equipment (PPE), you must be able to analyse the hazard and understand which PPE will be appropriate for that specific scenario. We will show you how to carry out hazard analysis and how to select applicable PPE for the right situation. PPE is a final resort in the event of a hazard and it should be kept in the finest condition possible. What can be done to ensure the proper use of personal protective equipment? Explore the maintenance procedure of different equipment and how to use them in order to get maximum protection. Furthermore, we’ll examine some of the legislations regarding the use, maintenance and source of PPE. We cover the PPE legislations of 1992, 2016, 2018 and 2021. Thereafter, you’ll learn about the roles and duties of employers in the use of PPE in the workplace.</p><p>Next, we discuss the role of PPE in the healthcare sector including how PPE can help in combating Covid-19. It is essential to know how to put on and take off PPE gears. It is also crucial for the wearer to know the safe disposal techniques of PPE. Finally, we’ll teach you the safe handling techniques and procedures of PPE. The risk to healthcare workers has increased rapidly throughout the COVID-19 pandemic. Therefore the use of personal protective equipment (PPE) in every professional setting is critical since it helps avoid injuries, diseases and deaths. In light of this, this course would be important for anyone working in the health sector and learners who wish to learn more about personal protective equipment(PPE). In many high-risk workplaces, wearing personal protective equipment (PPE) is essential for success. Enrol today and learn how to stay safe for free!</p><a href=\"https://alison.com/resume/courses/5282\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5282\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Personal Protective Equipment","description":"In this module, we'll discuss the importance of wearing PPE and the various types of PPE. You'll learn how to assess the hazards analysis and how to select applicable PPE according to different situations. Upon that, we'll examine some of the regulations regarding personal protective equipment (PPE) and the role of PPE in the healthcare sector.","topics":["Personal Protective Equipment - Learning Outcomes","The Importance of PPE","Use and Maintenance of PPE","Legislations of PPE","Personal Protective Equipment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - A Comprehensive Guide to Personal Protective Equipment"]}]}