{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4934","title":"A Guide to Becoming a Laboratory Technician","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about good laboratory practices and the roles and duties of a laboratory technician in this free online course.","description":"Laboratory technicians are professionals that perform varieties of laboratory-based investigations through scientific procedures. They receive, label and analyse types of specimens and then design and execute standard procedures for testing them under defined conditions. In this course, we teach you the roles of a laboratory technician, various laboratory approaches and how to use and maintain laboratory equipment.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The work of laboratory technicians greatly aids the accurate diagnosis and treatment of patients. They assist researchers and test subjects in their work, performing analyses on human fluids and tissues. What qualifications must a laboratory technician possess to be considered competent? This course provides a complete guide, covering all you need to know about the roles and responsibilities of an effective laboratory technician. We start by discussing their duties, clinical laboratories' purposes and subcategories, rules, regulations and standards. On top of that, you'll learn about the various departments that are within a medical laboratory.</p><p>Laboratory wares and equipment are essential in conducting various tests and investigations to obtain accurate and reliable data. Some equipment can have a whopping price tag and therefore must be maintained and handled with extreme care. Explore the types and functions of laboratory equipment such as test tubes, pipettes, beakers, burettes, flasks and many more. We also differentiate between the degree of the measurement precision of the lab wares. You'll learn about the correct procedures for cleaning equipment, the types of microscopes, their components, and how to maintain and use them. After that, we examine the different types of solutions and the methods of diluting a solution. You'll understand the techniques of minimising harmful substances and the sterilisation and disinfection procedures in the laboratory.</p><p>The body has a sophisticated mechanism for responding to and healing injuries. ‘Haemostasis’ is the name given to this process. You'll study the process and factors involved in haemostasis, its disorders and the methods used to measure coagulation and clotting. We discuss the body's system to combat and eliminate harmful and unwanted organisms, the concept of immunology, its diseases and more. You'll also learn about the urinary system, kidney diseases and how urine and blood specimens are collected. Research the critical terms in microbiology, parasitology and the types of parasites that can affect human beings. Lastly, we teach you about potential hazards, how to prevent them and how to conduct a quality assurance program in a clinical laboratory. Without lab workers, there wouldn't be specialists to collect samples properly, conduct tests and conduct research. We have designed this course for all who want to learn the necessary skills to become a laboratory technician. You can learn how to perform laboratory procedures in healthcare or research facilities. Enrol now and learn for free.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}