{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4253","title":"Advanced Diploma in Cognitive Behavioural Therapy","totalEnrolled":"9,732","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the background of CBT and the mental health challenges it treats with this free online psychology course.","description":"There are numerous psychological problems that human beings suffer from, including stress, depression, anxiety and eating disorders. Over the years, research has been conducted to come up with solutions and treatments for these conditions. One of the effective methods is the use of cognitive behavioural therapy (CBT). In this free online course, you will learn about CBT, its history and how it can be used as a treatment.","courseOutcomes":["Summarize the basic principles that ...","List the key principles and assumpti...","Contrast acceptance and commitment t...","State the factors to consider when c...","Summarize the basic principles that make up CBT therapy","List the key principles and assumptions of behavioural neuroscience","Contrast acceptance and commitment therapy (ACT) with CBT","State the factors to consider when carrying out a case formulation","Outline the most frequently used psychometric tests in CBT","Define cognitive distortion and state its various types","Explain how CBT can be used to improve relationships","Identify the three aspects to address when treating addiction","Summarize the basic principles that ...","List the key principles and assumpti...","Contrast acceptance and commitment t...","State the factors to consider when c...","Summarize the basic principles that make up CBT therapy","List the key principles and assumptions of behavioural neuroscience","Contrast acceptance and commitment therapy (ACT) with CBT","State the factors to consider when carrying out a case formulation","Outline the most frequently used psychometric tests in CBT","Define cognitive distortion and state its various types","Explain how CBT can be used to improve relationships","Identify the three aspects to address when treating addiction"],"courseDescription":"<p>Firstly, you will be taken through a brief history of cognitive behavioural therapy, key figures in CBT development, and the primary methods used by practitioners. After that, you will learn about the key principles and assumptions behind behavioural neuroscience, and look at the various neurotransmitters in the human body and their roles. Then, discover acceptance commitment therapy (ACT), behavioural therapy and cognitive analytic therapy, which are similar to CBT. The structure of CBT will be revealed, followed by the use of CBT in the treatment of eating disorders and depression. You will learn about the different types of eating disorders, how negative thought patterns contribute to their maintenance, and how CBT practitioners treat them.</p><p>Next, you study the use of CBT in treating stress, anxiety and insomnia. In addition to solving a wide range of conditions, CBT is also used for improving interpersonal relationships. In this regard, you will discover why an individual might seek out CBT to help strengthen their interpersonal connections. Furthermore, you will study the use of CBT in treating addictions: Learn the definition of addiction, different types and how a therapist structures an addiction intervention therapy programme. Finally, you will learn about pursuing a career as a CBT therapist, the formal training that one should undergo, and the key considerations to bear in mind when deciding whether to work in the private or public sector, or both.</p><p>Knowledge of CBT is essential for those aspiring to pursue a career as a professional therapist. It is also useful for practising therapists, psychiatrists, counsellors, psychologists, and general medical practitioners who want to expand their understanding of mental health.</p><a href=\"https://alison.com/resume/courses/4253\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4253\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Cognitive Behavioural Therapy (CBT)","description":"This module will introduce you to a brief history of CBT and key figures in CBT development. You will also learn about behavioural neuroscience, acceptance commitment therapy, behavioural therapy and cognitive analytic therapy. Finally, you will study the structure of CBT therapy.","topics":["Fundamentals of CBT - Learning Outcomes","What is CBT?","Behavioural Neuroscience","Acceptance Commitment Therapy","The Structure of CBT Therapy","Fundamentals of CBT - Lesson Summary"]},{"name":"Module","details":"Applications of Cognitive Behavioural Therapy (CBT)","description":"In this module, you will learn about how CBT can treat eating disorders, depression, stress and anxiety. You will also study the use of CBT in improving relationships and treating addiction. Finally, you will learn how to pursue formal training and work as a CBT therapist.","topics":["Applications of CBT - Learning Outcomes","Using CBT in the Treatment of Eating Disorders","CBT in the Treatment of Depression","CBT in the Treatment of Stress and Anxiety","How CBT Can Be Used To Improve Relationships","How CBT Can Be Used To Treat Addiction","Working as a CBT Therapist","Applications of CBT - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Cognitive Behavioural Therapy - Course Assessment"]}]}