{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2291","title":"Advanced Diploma in Brain and Behaviour","totalEnrolled":"9,289","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the various cognitive processes in the brain, that influence human behaviour, in this free online course.","description":"This free online course will give you a better understanding of how the different parts of the brain interact to carry out a variety of mental processes such as thinking, learning, decision making and more. This course will also feature the different methodologies adopted by neuroscientists in studying the activities in the human brain. Anyone who has an interest in neuroscience, psychology or any related fields, will benefit from this course.","courseOutcomes":["Identify the major structures and co...","Identify the common types of brain d...","Discuss the methods used for structu...","Define the concepts of sensation and...","Identify the major structures and components of the brain","Identify the common types of brain disorders and their causes","Discuss the methods used for structural analysis of the brain","Define the concepts of sensation and perception","Explain the functions of the different sensory systems","Define the various models of attention","Outline the different types of memory systems","Outline the neural models of language comprehension","Discuss the propositions of the theory of mind","Examine the regions of the brain that influence mental states","Identify the major structures and co...","Identify the common types of brain d...","Discuss the methods used for structu...","Define the concepts of sensation and...","Identify the major structures and components of the brain","Identify the common types of brain disorders and their causes","Discuss the methods used for structural analysis of the brain","Define the concepts of sensation and perception","Explain the functions of the different sensory systems","Define the various models of attention","Outline the different types of memory systems","Outline the neural models of language comprehension","Discuss the propositions of the theory of mind","Examine the regions of the brain that influence mental states"],"courseDescription":"<p><span style=\"font-weight: 400;\">In this free online course, you will learn how the different cognitive processes of the different regions in the brain interact to carry out various mental processes such as; memory formation, learning, attention, decision making and many more. The course begins by examining some techniques and methods that are commonly used in studying a normal brain and those used in studying a damaged brain.</span></p><p><span style=\"font-weight: 400;\">Next, the various parts of the brain and their functions are explained in detail. The inner workings of neurons, as well as the nervous system, are also discussed. The neuroscience of sensation and perceptions, which analyzes the importance and peculiarities of each of the various sense organs, will be explained. The topics will focus on the neural mechanisms behind attention, memory, emotions and language.</span></p><p><span style=\"font-weight: 400;\">The final part of the course will discuss the neuroscience of social cognition which highlights the mental processes that enable proper social interactions between humans. This course will be of interest to students studying neuroscience, psychology or any related field. It will also be beneficial to those who simply want to better understand how the brain works to improve their knowledge. Start this course today.</span></p><a href=\"https://alison.com/resume/courses/2291\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2291\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cognitive Neuroscience","description":"This module presents an introduction to the subject of cognitive neuroscience; neurons and the nervous system. You will also learn about the origins of some of the latest, well-known techniques used in brain analysis today.","topics":["Cognitive Neuroscience - Learning Outcomes","History of Cognitive Neuroscience","Philosophy of Neuroscience","Structure and Functions of Neurons","Neuronal Communication","The Nervous System","Cognitive Neuroscience - Lesson Summary"]},{"name":"Module","details":"The Human Brain","description":"In this module, The Human Brain, you will learn about the various structures, functionalities and components that make up the human brain. You will also learn about common deficits that occur as a result of damages to these brain regions.","topics":["The Human Brain - Learning Outcomes","The Cerebral Cortex","Methods in Cognitive Neuroscience","Studying The Damaged Brain","Structural Analysis of the Brain","The Human Brain - Lesson Summary"]},{"name":"Module","details":"Sensation and Perception","description":"This module examines the neuroscience behind sensation and perception as part of the primary functions of the brain. You will learn how these brain functions influence social interactions and behaviour.","topics":["Sensation and Perception - Learning Outcomes","Neuroscience of Sensation and Perception","Somatosensory and Visual Perception","Sensory and Perceptual Processing","Sensation and Perception - Lesson Summary"]},{"name":"Module","details":"Attention Systems","description":"In this module, the various systems involved in the ability to consciously or unconsciously express attention are explained. You will also learn about the causes of some common attention disorders.","topics":["Attention Systems - Learning Outcomes","The Anatomy of Attention","Models of Attention","Neural Mechanisms of Attention","Mechanisms of Attention","Networks of Attention","Attention Systems - Lesson Summary"]},{"name":"Module","details":"First Course Assessment","description":"This module is the first assessment, which enables you to review your learning so you can determine your knowledge and understanding of module 1 - 4 of the course.","topics":["First Assessment"]},{"name":"Module","details":"Memory Systems","description":"In this module, you will learn about the neural basis and mechanisms behind memory. You will also learn about the processes involved in forming different types of memory.","topics":["Memory Systems - Learning Outcomes","Memory","Mechanisms of Memory","The Medial Temporal Lobe","Long Term Memory and Memory Consolidation","Memory Systems - Lesson Summary"]},{"name":"Module","details":"Neuroscience of Emotions","description":"In this module, you will learn about the neuroscience of emotions and how they affect other cognitive processes. You will learn how emotion influences learning, attention, perception and social interactions in general.","topics":["Neuroscience of Emotions - Learning Outcomes","Emotions","Categorizing Emotions","Emotions and Cognitive Processes","Influence of Emotions on Attention and Perception","Cognitive Control of Emotions","Neuroscience of Emotions - Lesson Summary"]},{"name":"Module","details":"Neuroscience of Language","description":"In this module, you will examine the neuroscience of language and how it interacts with other cognitive functions, such as reading, talking, writing, socialising. You will also learn about the neural structures that enable language comprehension.","topics":["Neuroscience of Language - Learning Outcomes","Language","Language Comprehension","Word Processing","Neuroscience of Language - Lesson Summary"]},{"name":"Module","details":"Neuroscience of Social Cognition","description":"In this module, learn about the cognitive processes that facilitate social behaviour and the role of the prefrontal cortex in social cognition. You will study the various regions of the brain that influence mental states and social cognition in general.","topics":["Neuroscience of Social Cognition - Learning Outcomes","Social Cognitive Neuroscience","Theory of Mind","Mental State Attribution and Autism","Social Knowledge in Social Cognition","Neuroscience of Social Cognition - Lesson Summary"]},{"name":"Module","details":"Second Course Assessment","description":"This module is the second assessment, which enables you to review your learning so you can determine your knowledge and understanding of module 5 - 8 of the course.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Diploma in Brain and Behaviour - Course Assessment"]}]}