{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2969","title":"Advanced Cardiac Life Support (ACLS)","totalEnrolled":"51,008","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Successfully complete this free online course on ACLS and apply for a certificate to become globally accredited.","description":"This free online course takes you through the stages of advanced cardiac life support (ACLS), enabling you to recall vital information in stressful situations when every moment counts. Complete this course and apply for certification to gain international accreditation. The course takes you through each stage of ACLS, from approaching an individual in trouble to post-cardiac arrest care. These are life-saving skills that will always be in demand.","courseOutcomes":["Summarize the intended use of advanc...","Explain how to determine if an indiv...","Detail the steps in the chain of sur...","Explain the anatomy and physiology o...","Summarize the intended use of advanced cardiovascular life support (ACLS)","Explain how to determine if an individual is conscious or unconscious","Detail the steps in the chain of survival","Explain the anatomy and physiology of the heart","List equipment used in airway management","Summarize the principles of early defibrillation","List the symptoms of bradycardia and tachycardia","Explain how to care for acute coronary syndrome","Explain the process for performing one-person basic life support (BLS) on an adult","Summarize the steps taken to perform successful airway management","List the proper steps for using an automated external defibrillator","Understand and recognize ACLS core rhythms","Summarize the intended use of advanc...","Explain how to determine if an indiv...","Detail the steps in the chain of sur...","Explain the anatomy and physiology o...","Summarize the intended use of advanced cardiovascular life support (ACLS)","Explain how to determine if an individual is conscious or unconscious","Detail the steps in the chain of survival","Explain the anatomy and physiology of the heart","List equipment used in airway management","Summarize the principles of early defibrillation","List the symptoms of bradycardia and tachycardia","Explain how to care for acute coronary syndrome","Explain the process for performing one-person basic life support (BLS) on an adult","Summarize the steps taken to perform successful airway management","List the proper steps for using an automated external defibrillator","Understand and recognize ACLS core rhythms"],"courseDescription":"<p>The principles of advanced cardiac life support (ACLS) and the initial assessment of someone in need of help are the crux of the free online course. You will learn about basic life support (BLS), from the chain of survival to the guideline changes, and both mouth-to-mask and bag-mask ventilation. You will progress to learn about advanced life support, including the physiology and anatomy of the heart, airway adjuncts and the ACLS survey.</p><p>The material then takes you through the principles of early defibrillation and the steps of using an automated external defibrillator (AED). You will learn about systems of care and explore a number of cases in which ACLS should be used, including respiratory arrest, ventricular fibrillation, bradycardia and tachycardia. Finally, you will learn a number of practical ACLS skills to advance your training.</p><p>This certification course also comes with a handbook to help you further your learning. Complete this course and purchase a certificate to gain access to free international accreditation. These crucial skills are especially relevant to those working in fields like nursing, and caring for the elderly and vulnerable. You will then learn about our newest section to our ACLS handbook, which covers the core ACLS rhythms and their interpretations.</p><a href=\"https://alison.com/resume/courses/2969\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2969\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"ACLS Introduction and Basic Life Support","description":"In this module you will be introduced to the principles of Advanced Cardiac Life Support (ACLS) and the initial assessment process. You will also learn about basic life support, changes to the ACLS guidelines made in 2015, and when to use both mouth-to-mask and bag-mask ventilation.","topics":["ACLS Introduction and Basic Life Support - Learning Outcomes","Introduction to ACLS","ACLS Basic Life Support","ACLS Introduction and Basic Life Support - Lesson Summary"]},{"name":"Module","details":"Advanced Cardiac Life Support and Early Defibrillation","description":"In this module you will learn more about ACLS, including the anatomy and physiology of the heart, airway management and basic and advanced airway adjuncts, as well as the principles and benefits of early defibrillation and the criteria for using an automated external defibrillator.","topics":["Advanced Cardiac Life Support and Early Defibrillation - Learning Outcomes","Advanced Cardiac Life Support","Principles of Early Defibrillation","Advanced Cardiac Life Support and Early Defibrillation - Lesson Summary"]},{"name":"Module","details":"Systems of Care and ACLS Cases","description":"In this module you will learn about systems of care as well as how to treat various types of ACLS cases, including respiratory arrest, ventricular fibrillation, bradycardia and tachycardia.","topics":["Systems of Care and ACLS Cases - Learning Outcomes","Systems of Care","ACLS Cases","Systems of Care and ACLS Cases - Lesson Summary"]},{"name":"Module","details":"ACLS Skills Training","description":"In this module you will learn what steps to take when performing one-person and two-person basic life support for both adults and infants, as well as airway management.","topics":["ACLS Skills Training - Learning Outcomes","ACLS Skills Training","ACLS Skills Training - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Advanced Cardiac Life Support (ACLS) Course Assessment"]}]}