{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5057","title":"An Introduction to Aromatherapy","totalEnrolled":"3,141","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore aromatherapy and learn to make essential oil blends for your health and wellbeing in this free online course.","description":"Delve into the world of aromatherapy and discover potent healing properties in plants. In this course, we examine various essential oils and their medicinal uses. You will learn different methods used to extract oil from plants and how to apply them to treat ailments safely. Everyone can benefit from this course, whether learning for home use or as a medical professional seeking to add natural solutions to your practice. Enrol today!","courseOutcomes":["Define ‘aromatherapy’...","Explain how essential oils are produ...","Discuss the different methods of ess...","Match different essential oils with ...","Define ‘aromatherapy’","Explain how essential oils are produced","Discuss the different methods of essential oil application","Match different essential oils with the ailments they treat","List all the tools and ingredients required to make essential oils for home use","Differentiate between single oils and blends","Recall safety guidelines for essential oil preparation","Define ‘aromatherapy’...","Explain how essential oils are produ...","Discuss the different methods of ess...","Match different essential oils with ...","Define ‘aromatherapy’","Explain how essential oils are produced","Discuss the different methods of essential oil application","Match different essential oils with the ailments they treat","List all the tools and ingredients required to make essential oils for home use","Differentiate between single oils and blends","Recall safety guidelines for essential oil preparation"],"courseDescription":"<p>Did you know that essential oils, often used in spa treatments and perfumery, can also be used to sterilise wounds, treat infection and even reduce wrinkles? Discover a myriad of plants with aromatic properties that you can use for beauty and medicine. Your course instructor, Amer Taha, is a medical expert and a health coach. He designed this short course for the everyday person and students of naturopathic healing.</p><p>To begin, he defines ‘aromatherapy’ and explains what essential oils are. Then you'll explore oil extraction methods, quality and how to store them properly together. Practising safety is pertinent when it comes to using these essential oils. When inhaled, the aromatic compounds can play an important part in boosting the body's natural healing functions. However, when misused, essential oils can harm the human body. We therefore cover all relevant safety measures in detail.</p><p>Next, we will review over thirty-five essential oils, the best methods to extract them, their various uses and how to add them to products and carrier oils for proper application. You will learn the importance of dilution, blending and various substitutes for each plant oil. If you seek natural remedies to improve your overall health and wellbeing, this course is for you. Sign up today and start learning!</p><a href=\"https://alison.com/resume/courses/5057\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5057\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Aromatherapy Workshop","description":"This module will explore aromatherapy and essential oils. Starting with their definitions, we will discuss oil quality and proper storage. You will learn about safety when using these oils, and the methods of their application. We will examine over thirty-five essential oils and their uses.","topics":["Learning Outcomes - Aromatherapy Workshop","Introduction to Aromatherapy","Essential Oils","Uses of Essential Oils","Lesson Summary - Aromatherapy Workshop"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment - An Introduction to Aromatherapy"]}]}