{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4664","title":"An Introduction to Spiritual Life Coaching","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the activities of a spiritual life coach and the seven dimensions of wellness in this free online course.","description":"A spiritual life coach helps people transform their lives by altering how they act on a deeper level. This free online course will explore the activities performed by spiritual life coaches and how to begin a career as a life coach. You will study the seven dimensions of spiritual healing and various strategies to market and grow this business. Gain an awareness of developing spiritual wellbeing for yourself and your clients!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you had to go through a phase in your life where you didn't understand what you wanted for yourself or the goals you wanted to pursue? This unsettled feeling often occurs when people fail to feed their inner needs of spirituality, happiness and peace. As a result, they feel lost and have a 'blurry vision' of themself. This spiritual life coaching course will help you understand your spiritual needs and how to fulfil them as you direct a plan to move towards your goals. Explore the spiritual, psychological and emotional needs of humans and their fundamental spiritual needs.</p><p>Everything you need to know about spiritual life coaches, including their traits and activities, is contained in this course. We explain modern and proven ways to help people decide the purpose of their life and attain their objectives with the help of spiritual life coaches and provide various examples. If you choose to pursue a career as a spiritual life coach yourself, you'll discover how to empower your clients and restore their confidence. We discuss advanced coaching and spiritual healing techniques in detail. We analyse chakra, reiki, crystal and other spiritual healing modalities. Finally, we outline various ethical guidelines and codes of conduct for spiritual life coaches.</p><p>Every company's growth necessitates a meticulously devised growth strategy and well-executed marketing campaigns. We explain what marketing is and how it can do wonders for a life coaching business. We explore essential processes like sub-contracting your services, becoming an employer and successful tendering that will help you take your business to new heights. Anyone who wants to learn about spiritual healing or intends to kickstart their career as a spiritual life coach will benefit from this course. Take advantage of this opportunity and enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}