{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4824","title":"Anatomy of Spinal Cord","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches about the levels of spinal cord injuries, types of lesions, signs and typical syndromes.","description":"This course, 'Anatomy of Spinal Cord' by Dr Saqib Mansoor, will cover the spine's levels and motor neuron lesions to help you identify the extent and nature of spinal cord injuries. In the section on clinical features of the spinal cord, you will learn about the causes of the critical abnormalities and syndromes of the spine. This short course will benefit all those associated with medicine and or the healthcare industry.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Anatomy is the science that details the internal structure of the living body. The spinal cord is an essential organ of the body, a column of nerves that connects our brain to the rest of the body. It helps in movement and balance and serves as a communication channel, where the nerve cells play a crucial role. The nerve cells or neurons carry the signals from the brain to the muscles and other organs. In this short course, Dr Saqib Mansoor, your tutor, will acquaint you with the cross-sectional levels of the spine. It begins by answering some basic questions about the four divisions of the spinal cord, the central canal and what is the white and grey matter? The first module also covers the lesions of the upper and lower motor neurons. A lesion is any abnormal change or damage to tissue. You will learn about the differences between the upper and lower motor lesions and their stages.</p><p>Next, we will dive into the different signs associated with the lesions of the motor neurons. Have you heard of the Babinski sign? How is the Chaddock sign different from the Oppenheim sign? Where do we examine Gordon's reflex? The video lessons will answer these questions and more. We explore the lumbar puncture or spinal tap with diagrams and easy-to-understand language. We identify its goal and the contraindications of a lumbar puncture. The basics of spine anatomy examine all the linkages between lesions, levels and their effect on the spine functions. The next module focuses on the clinical spine and begins with a lesson on syringomyelia. What is the main sign of syringomyelia and its causes? You will learn about its symptoms that vary across patients.</p><p>The subsequent topics research the common syndromes of the spinal cord. You will learn about the neurological conditions associated with spinal cord injury and the causal factors of anterior cord or central cord syndrome. What are the clinical features of Brown-Sequard syndrome? We will discuss this in detail. The spinal cord controls our voluntary and involuntary movements: any injury to the spine can impact some critical organ functions so it is essential to know its anatomy. Medical students and practitioners of healthcare will benefit from this course as they will learn about the spinal anatomy and the typical syndromes associated with the spine. This knowledge is practical when you have to evaluate a patient and enables you to come up with a better-directed diagnostic evaluation. Enrol now for this short and fascinating online course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}