{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4760","title":"Applications of Radiography","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course introduces you to the concept of Radiography and its applications in a simple way.","description":"Radiography is one of the most widely used and trusted techniques to provide images of the body in the modern medical system. Discovered in the late 1800s, radiographic techniques and tools are today the preferred method to diagnose and treat patients. This is an introductory course with the right opportunity for anybody interested to understand the subject. It helps you to become familiar with the world of radiographic science and its uses.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Medical science has come a long way. One of the prime factors behind today's cutting-edge treatment is the discovery, development and application of radiography tools and techniques. Radiography is the most accepted method in modern medical science for using human body images to analyse conditions. It has gained popularity and acceptance as an effective system of diagnosing disease among the medical fraternity. This course is a must if you are interested in radiography or radiology and want to become acquainted with all it entails before studying it further.</p><p>Divided into two modules, the primary goal of this course is to provide you with an in-depth overview of radiography, the science behind it with all its elements and uses. Each module covers various topics that offer you a comprehensive understanding of radiology, from its history to its concepts, practices and precautions. The lessons also make you aware of the related health and safety issues related to radiography. We will test you at the end of the course on your knowledge and understanding of the subject matter through several evaluation questions.</p><p>'Applications of Radiography' is an ideal course for beginners. It is an orientation course in radiography or radiology. If you aspire to become a radiologist, are curious to learn more about the science behind radiology or are a paramedic or practitioner who wants to refresh their knowledge of the subject, this course is perfect for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}