{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3675","title":"Applied Behaviour Analysis","totalEnrolled":"22,854","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how Applied Behaviour Analysis analysis is used to treat children with Autism in this free online course.","description":"Applied Behaviour Analysis (ABA) is considered the Gold standard for treating children with Autism Spectrum Disorder. This free online course will introduce you to ABA, the theories that guide it and its rules and techniques. This course also contains detailed demonstrations of how you can use different ABA techniques like chaining and patterning. These techniques improve motor skills, language skills, cognitive function and visuospatial skills.","courseOutcomes":["Explain Applied Behaviour Analysis a...","Discuss the Antecedent-Behaviour-Con...","Identify the rules and foundational ...","Discuss the use of ABA in improving ...","Explain Applied Behaviour Analysis and its importance in treating Autism","Discuss the Antecedent-Behaviour-Consequence model","Identify the rules and foundational techniques of ABA","Discuss the use of ABA in improving language and motor skills","Summarise the Picture Exchange Communications System","Explain how ABA can be used in improving cognitive skills","Identify various ABA techniques for improving cognitive skills","Define visuospatial skills","Describe ABA techniques for improving visuospatial skills","Discuss how ABA treatment can be generalised","Explain Applied Behaviour Analysis a...","Discuss the Antecedent-Behaviour-Con...","Identify the rules and foundational ...","Discuss the use of ABA in improving ...","Explain Applied Behaviour Analysis and its importance in treating Autism","Discuss the Antecedent-Behaviour-Consequence model","Identify the rules and foundational techniques of ABA","Discuss the use of ABA in improving language and motor skills","Summarise the Picture Exchange Communications System","Explain how ABA can be used in improving cognitive skills","Identify various ABA techniques for improving cognitive skills","Define visuospatial skills","Describe ABA techniques for improving visuospatial skills","Discuss how ABA treatment can be generalised"],"courseDescription":"<p>This course covers Applied Behaviour Analysis (ABA) theories and techniques and how its methods like Matrix and Number Theory are employed in improving a child’s language, cognitive, motor and visuospatial skills. It begins by introducing Applied Behaviour Analysis and explaining the Antecedent-Behaviour-Consequence (ABC) model – a guiding principle of ABA. The course proceeds to cover rules and foundational techniques of ABA. Next, illustrations are made of how ABA could improve motor skills and how methods like the Picture Exchange Communication System could improve language skills.</p><p>The second half of the course explains and demonstrates how ABA techniques like Matrix, Chaining, Follow the Rule, and Sequencing can be used to improve cognitive function in children with Autism. The course then introduces techniques like the Number Concept, Patterning, Gradation, and Block Design. It demonstrates with videos how these techniques can improve a child’s visuospatial skills. The course concludes by teaching how to ensure teachings from ABA sessions could help a child when they face similar situations in real life.</p><p>Various medical institutions recognise Applied Behaviour Analysis as the standard for treating Autism. Autism makes handling children more difficult and makes children deficient in skills needed to navigate parts of everyday life. This course provides valuable insights into the behaviours of children with Autism. It demonstrates how one can improve essential skills to help children with Autism lead more normal lives. If you are a parent or an individual tasked with caring for Autistic children, this course is for you. Start now and learn to treat Autism in three hours.</p><a href=\"https://alison.com/resume/courses/3675\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3675\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"ABA Theory and Components","description":"This module introduces Applied Behaviour Analysis (ABA) as a concept and explains some of its guiding principles and some of its techniques. It also explains how ABA can be used to improve motor and language skills.","topics":["ABA Theory and Components - Learning Outcomes","Introduction","ABA Components and Techniques","ABA Theory and Components - Lesson Summary"]},{"name":"Module","details":"ABA Cognitive Skills and Visuospatial Techniques","description":"This module demonstrates how ABA techniques like Chaining and Sequencing can be used to improve cognitive skills in Autistic children; and how techniques like Gradation and Patterning are used to improve visuospatial skills. It also teaches how to ensure lessons learned from ABA sessions are applied to general situations.","topics":["ABA Cognitive Skills and Visuospatial Techniques - Learning Outcomes","Cognitive and Visuospatial Skills","Generalisation in ABA Theory","ABA Cognitive Skills and Visuospatial Techniques - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Applied Behavior Analysis - Course Assesment"]}]}