{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2784","title":"Assessment of Physical and Cognitive Work","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about assessing physical and cognitive labour, and different workplace environments in this free online course.","description":"This free online course on the assessment of physical and cognitive work introduces you to the different instruments used for assessment; electromyography (EMG), electroencephalography (EEG), electrocardiogram (ECG), and eye tracking. You will learn about the thermal, visual and auditory environments of a workplace and how they impact employees’ productivity. The course starts with the different instruments used for ergonomic analysis.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Assessment of Physical and Cognitive Work begins by introducing you to the different instruments used for ergonomic analysis or ergonomic risk assessment. You will learn the basics of electromyography (EMG) and how it is interpreted, plus about the different types of EMG: classical neurological and kinesiological. Electroencephalography (EEG), electrocardiogram (ECG), and eye tracking as other instruments for ergonomics analysis are also covered.</p><p>This course then introduces you to the assessment of mental workload. You will learn about the three types of assessments used: primary and secondary task performance measures, physiological measures, and subjective rating techniques. Then see how neuroergonomics - which aims to design more efficient and safer working conditions – has a vital role in assessing physical and cognitive work. You will also study the importance of the psychosocial aspect of overall workplace analysis.</p><p>Lastly, this course will introduce you to the different types of working environments that affect an individual's performance and wellbeing. These environments are thermal, visual and auditory. Discover thermal, rational, empirical and direct indices as well as the concept of ‘thermal comfort’. You will finally study elements of the visual environment as well as how the auditory landscape and noise pollution can have an effect on hearing and productivity at the workplace.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}