{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5223","title":"Signs of Substance Abuse and What to Do","totalEnrolled":"2,980","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the effects of substance abuse and lays out the treatment options available to addicts.","description":"This healthcare course discusses commonly misused narcotics substances and the disorders linked to them. We lay out the health risks associated with substances like cocaine and heroin and discuss various approaches to treating addiction to them. We also examine the UK’s laws and regulations related to narcotics. Narcotic abuse is a serious personal and private problem so sign up for this drug addiction course to learn how to prevent and treat it.","courseOutcomes":["Outline commonly misused substances ...","Describe different types of substanc...","Discuss the importance and principle...","Summarise the impact of substance mi...","Outline commonly misused substances and disorders related to them","Describe different types of substances as well as their long and short-term effect on mental health","Discuss the importance and principles of prevention for substance abuse","Summarise the impact of substance misuse in the workplace","Discuss the policies regarding substance misuse at the workplace","Outline a variety of treatment options as well as psychoeducation for substance abuse","Describe the laws and various acts related to substance misuse","Explain the causes and effects of substance abuse on youth","Outline commonly misused substances ...","Describe different types of substanc...","Discuss the importance and principle...","Summarise the impact of substance mi...","Outline commonly misused substances and disorders related to them","Describe different types of substances as well as their long and short-term effect on mental health","Discuss the importance and principles of prevention for substance abuse","Summarise the impact of substance misuse in the workplace","Discuss the policies regarding substance misuse at the workplace","Outline a variety of treatment options as well as psychoeducation for substance abuse","Describe the laws and various acts related to substance misuse","Explain the causes and effects of substance abuse on youth"],"courseDescription":"<p>This course lays out the symptoms arising from the abuse of various narcotic substances and the mental health disorders associated with them. We explain some critical factors that drive substance misuse and discuss the signs of addiction and ways to prevent it. We then lay out the effects of specific substances on mental health in the long and short term and compare legal and illegal substances.</p><p>The course explores prevention principles and explains how to recognise signs of substance abuse. We demonstrate how a reduction of drug intake lowers the health risks involved. We then examine some common workplace policies regarding substance misuse designed to protect employee health and safety. The course then examines the major elements of such policy and establishes the need to review and monitor them regularly. We provide a range of treatment options used to treat addiction.</p><p>Our final section covers the UK laws and various Acts related to substance abuse, starting with the Misuse of Drug Act’s classification of various narcotic and psychoactive substances. We examine the causes and effects of substance abuse among the youth to provide a holistic understanding of drugs as a public health problem. Our analysis includes details on specific substances such as cocaine and heroin. This healthcare and social work course suits anyone who wants to learn more about drug addiction and its treatment. Sign up to learn how to support those struggling with substance abuse and help them find the right treatment option.</p><a href=\"https://alison.com/resume/courses/5223\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5223\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Substance Misuse","description":"This module will introduce us to substance misuse and its effects on individuals. Following this, we will examine the potential health risks of a wide range of substances. In addition, we will learn about laws and acts of substance, along with penalties and regulations.","topics":["Fundamentals of Substance Misuse - Learning Outcomes","Introduction to Substance Misuse","Overview of Substance","Prevention and Awareness","Substance Misuse at Workplace","Substance Misuse Policy","Treatment of Substance Addiction","Laws and Acts on Substances","Substance Misuse and Youth","Fundamentals of Substance Misuse - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}