{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5191","title":"Basics of Coaching Weight Loss","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to become a fitness coach and help clients to eat healthily and lose weight in this free online course.","description":"This course explores the science of nutrition and health to train you to become a top-notch fitness coach who helps clients to reach their desired weight. We provide weight loss strategies and answer questions related to diet and wellness. With today’s rise of obesity caused by lack of exercise and poor dietary habits, trained professionals who can help clients reclaim their health are in high demand. So sign up to become a weight loss coach.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you want to help clients regain their fitness, lose fat and build muscle? The global rise in illnesses related to obesity has created a demand for weight loss coaches and this fitness course provides the information required to lose weight. We start off by laying out the right questions to ask clients before drawing up their diet plans. We explain how to set appropriate calorie targets and describe smart eating methods in detail. The course debunks misinformation and myths related to nutrition and weight loss and provides tools to help you and your clients establish better eating and exercise habits.</p><p>Do you feel overwhelmed by the amount of dietary information out there? This course goes through scientifically proven dietary methods that can assist in planning and timing meals efficiently. We have all been through ‘plateaus’ in our quest for weight loss. We demonstrate how to make the necessary adjustments to your diet and exercise regimen to overcome obstacles and be in shape.</p><p>Fitness coaches sometimes perform the task of personal trainers and provide their clients with diet plans designed to achieve optimal athletic performance. This course analyses various dietary plans that can help athletes meet their potential, including the ‘bulking’ phase and strength and endurance training. Part of your job as a fitness coach requires the setting of goals that are tailored to their individual requirements and circumstances. We discuss how to set ‘Specific, Measurable, Achievable, Relevant and Time-bound’ (‘SMART’) goals by interviewing clients and assessing their needs. Weight and fitness impacts quality of life and more and more people want to improve their fitness to look and feel their best. Enrol in this course to become a weight loss coach and help your clients attain their fitness goals.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}