{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2971","title":"Basic Life Support (BLS)","totalEnrolled":"101,636","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to save someone’s life in a crisis with this free online certificate course on basic life support (BLS).","description":"This course covers the basic steps in administering cardiopulmonary resuscitation (CPR) and basic life support measures (BLS) to adults, children and infants, depending on how many rescuers are available. We explain various first-aid manoeuvres, the use of automated external defibrillators (AEDs) and how to open patients' airways. The course qualifies you to gain international accreditation that signals your ability to save lives in a crisis.","courseOutcomes":["Examine the adult ‘chain of survival...","Describe the details of the 2020-202...","Discuss how to perform adult mouth-t...","Outline ‘bag-mask’ ventilation in tw...","Examine the adult ‘chain of survival’ and its pediatric counterpart","Describe the details of the 2020-2025 guideline changes in basic life support","Discuss how to perform adult mouth-to-mask ventilation","Outline ‘bag-mask’ ventilation in two-rescuer CPR for adults","Break down one-rescuer and the two-rescuer BLS for children","Demonstrate how to open a child’s airway","Outline the steps of performing CPR on children","Explain the one-rescuer and the two-rescuer BLS for infants between 0 to 12 months old","Identify the AED steps for children and infants","Deliver mouth-to-mouth rescue breathing","Perform mouth-to-mouth rescue breathing on adults and older children","Provide mouth-to-mouth and nose-rescue breathing for infants","Examine the adult ‘chain of survival...","Describe the details of the 2020-202...","Discuss how to perform adult mouth-t...","Outline ‘bag-mask’ ventilation in tw...","Examine the adult ‘chain of survival’ and its pediatric counterpart","Describe the details of the 2020-2025 guideline changes in basic life support","Discuss how to perform adult mouth-to-mask ventilation","Outline ‘bag-mask’ ventilation in two-rescuer CPR for adults","Break down one-rescuer and the two-rescuer BLS for children","Demonstrate how to open a child’s airway","Outline the steps of performing CPR on children","Explain the one-rescuer and the two-rescuer BLS for infants between 0 to 12 months old","Identify the AED steps for children and infants","Deliver mouth-to-mouth rescue breathing","Perform mouth-to-mouth rescue breathing on adults and older children","Provide mouth-to-mouth and nose-rescue breathing for infants"],"courseDescription":"<p>This Basic Life Support (BLS) course outlines the international basic life support guidelines, based on the latest 2020-2025 ILCOR recommendations, and compares them to the 2015-2020 version.We explore the details and categories that changed in delivering BLS and CPR to people of all ages and break down these life-saving techniques into easy steps.</p><p>We then discuss what to do once you arrive at the scene, alone or as part of a group. We show you how to check for responsiveness, use automated external defibrillators (AEDs) and open the patient’s airways if they’re struggling to breathe. We also take you through mouth-to-mouth and mouth-to-mask ventilation.</p><p>The course is free and can be accessed anytime and anywhere as you learn at your own pace. The skills you pick up here could help you save a life one day so sign up to qualify for international accreditation that indicates that you have received this valuable training. The certificate you earn here could help you become your workplace’s safety officer but its true value lies in the knowledge that you could protect those around you in an emergency, including those involving children that occur in the home.</p><a href=\"https://alison.com/resume/courses/2971\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2971\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"General Concepts of Basic Life Support","description":"This module will explain the general concepts of basic life support. We will include the keys for basic life support and the changes made in the basic life support guidelines from 2010 to 2015. We will also examine how to provide high-quality CPR and how to start the chain of survival in adults, children and infants. We will also cover BLS/CPR for adults and evaluate the steps towards providing CPR to an adult.","topics":["General Concepts Of Basic Life Support - Learning Outcomes","2020 BLS Guideline Changes","Initiating Chain of Survival","General Concepts of Basic Life Support","One Rescuer BLS/CPR for Adults","Two-Rescuer BLS/CPR for Adults","Adult Mouth-to-Mask and Bag-Mask Ventilation","Use of Automated External Defibrillator","General Concepts of Basic Life Support - Lesson Summary"]},{"name":"Module","details":"BLS and AED for Infants and Children","description":"This module will define the similarities between the BLS guidelines for adults and children. We will discuss how to perform BLS for children if there is one rescuer available and when there are two rescuers available. We will also examine the child ventilation algorithm and describe what to do if you find yourself alone with an infant in need of CPR. The course will also describe how to administer an AED to children and infants.","topics":["BLS and AED for Infants and Children - Learning Outcomes","BLS for Children 1 – 8 Years","One and Two-Rescuer BLS for Children","Child Ventilation","One and Two-Rescuer BLS for Infants (0 to 12 months old)","AED for Children and Infants","BLS and AED for Infants and Children - Lesson Summary"]},{"name":"Module","details":"BLS Skills Videos and Airway Management","description":"This module will indicate how to perform CPR/BLS to both adults and infants whether there is one rescuer or two rescuers at the scene. We will examine how to use an AED for adults and infants and how to perform the head-tilt chin-lift maneuver. This module will also identify how to perform the mouth to mask rescue breathing and how to deliver mouth to mouth for adults and older children.","topics":["BLS Skills Videos and Airway Management - Learning Outcomes","Mouth-to-Mouth Rescue Breathing","Rescue Breathing","Relief of Choking For Adults, Children and Infants","BLS Skills Videos","BLS Skills Videos and Airway Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basic Life Support (BLS) Course Assessment"]}]}