{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5252","title":"Basics of Motivational Interviewing","totalEnrolled":"1,372","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"See the techniques for creating powerful motivational interviews that change clients' lives in this free online course.","description":"This course teaches therapists and health practitioners how to encourage behavioral change through motivational interviewing (MI). We explore approaches to psychotherapy developed by Stephen Rollnick and William R. Miller to assist people in changing through their own motivations. This course focuses on helping therapists and practitioners develop and maintain MI skills, and assisting patients adhere to treatment recommendations.","courseOutcomes":["Explain the concepts and uses of mot...","List the four principles of motivati...","Identify the steps involved in micro...","List the six levels of training sugg...","Explain the concepts and uses of motivational interviewing","List the four principles of motivational interviewing","Identify the steps involved in micro-counseling skills","List the six levels of training suggested by Bill Miller and Theresa Moyers","Define cognitive dissonance theory","State the circumstances that are the best fitting for GMI (group motivational interviewing)","Discuss the practitioner's roles in different stages of change","Explain the concepts and uses of mot...","List the four principles of motivati...","Identify the steps involved in micro...","List the six levels of training sugg...","Explain the concepts and uses of motivational interviewing","List the four principles of motivational interviewing","Identify the steps involved in micro-counseling skills","List the six levels of training suggested by Bill Miller and Theresa Moyers","Define cognitive dissonance theory","State the circumstances that are the best fitting for GMI (group motivational interviewing)","Discuss the practitioner's roles in different stages of change"],"courseDescription":"<p>Research indicates that motivational interviewing (MI) is as good as or better than cognitive behavioral therapy (CBT) and pharmacotherapy, as well as superior to non-treatment controls for reducing alcohol and drug use in individuals. This course is designed to teach therapists and practitioners the fundamentals of motivational interviewing, a client-centered approach to psychotherapy pioneered by Stephen Rollnick and William R. Miller. We begin by covering the fundamentals of MI, such as its principles, approaches, and history.</p><p>MI practice necessitates the skillful application of a variety of strategies and techniques, one of which is OARS (open-ended questions, affirming, reflective listening, and summarizing), a quick and easy way to remember the basic approach used in MI. You will learn how to encourage behavioral change in patients by assisting them in exploring and resolving their ambivalence about the change. You will also learn about stages of change and the possibilities of group-based MI. Finally, you study motivational interviewing theories and MI in various health settings as well as how to develop and maintain your MI skills.</p><p>This course focuses on using MI to assist therapists and practitioners in developing rapport with patients in the early stages of counseling relationships. The knowledge gained will assist therapists in dealing with one of the most difficult but rewarding challenges: helping people change long-standing habits that pose significant health risks. Take this course today and advance your career in motivational therapy.</p><a href=\"https://alison.com/resume/courses/5252\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5252\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of Motivational Interviewing","description":"In this module, you will be introduced to the principles of Motivational Interviewing, you will learn about OARS, the concept of change, and the theories of MI, as well as the application of MI in various health settings, and the possibilities of group-based MI","topics":["Basic Concepts of Motivational Interviewing - Learning Outcomes","Introduction to Motivational Interviewing","Motivational Interviewing Skills","Theories of Motivational Interviewing","Motivational Interviewing and Global Based MI","Basic Concepts of Motivational Interviewing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Motivational Interviewing - Course Assessment"]}]}