{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5288","title":"Basics of Safeguarding Children","totalEnrolled":"6,743","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn important strategies to protect children from various forms of abuse with this free online course.","description":"Children are most susceptible to becoming victims of abuse. This short course discusses the importance of safeguarding children, the laws against sexual abuse in the UK and the principles of child protection. Discover the common types of child and sexual molestation, the signs and impacts of abuse, and preventative measures to safeguard minors. The steps to take after a referral, including risk assessment and disclosure, are also explained.","courseOutcomes":["Recall some myths and truths about s...","Discuss the importance of safeguardi...","Explain the UK's Children Act and th...","List various types of child abuse...","Recall some myths and truths about safeguarding children","Discuss the importance of safeguarding training","Explain the UK's Children Act and the child protection system in England","List various types of child abuse","Identify the signs and impact of sexual abuse on children","Outline the steps to take after an abused child has been referred to childcare services","Summarise what to do when a child discloses abuse to you","Recall some myths and truths about s...","Discuss the importance of safeguardi...","Explain the UK's Children Act and th...","List various types of child abuse...","Recall some myths and truths about safeguarding children","Discuss the importance of safeguarding training","Explain the UK's Children Act and the child protection system in England","List various types of child abuse","Identify the signs and impact of sexual abuse on children","Outline the steps to take after an abused child has been referred to childcare services","Summarise what to do when a child discloses abuse to you"],"courseDescription":"<p>Everyone should have a measure of responsibility for the safety and well-being of children whether you are a parent or not. This course has been developed to teach you the essence of safeguarding children by explaining critical laws and guidance pertaining to the United Kingdom, proven prevention strategies and real-life events or case studies.</p><p>In the first section, you will learn what safeguarding is, why it's so important, and what common misconceptions and facts there are regarding this subject. We also cover the history of child protection in the UK, including the investigations and events that led to the passage of laws protecting children from unsafe working environments. Then, we will review the children's protection systems in England before exploring the UK Children Act.</p><p>Safeguarding children requires an awareness of child abuse, its signs, and the harm causes. The second section focuses on child and sexual abuse. You will learn about child sexual exploitation, its effects, and preventative measures.&nbsp; Finally, we discuss what steps to take once abuse has been uncovered including responding to disclosures, steps after a referral, and recordkeeping. This course provides valuable insight into the complex topic of safeguarding children. Sign-up today and start learning.</p><a href=\"https://alison.com/resume/courses/5288\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5288\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Protecting Children","description":"This module will provide you with an overview of safeguarding children. You will also explore the history of child protection in the UK. Then, you will learn about child and sexual abuse, the signs and effects and how to keep children safe. Also, you will learn what to do after receiving a referral to social services and how to handle disclosures.","topics":["Protecting Children - Learning Outcomes","Safeguarding Laws and Policies","Child and Sexual Abuse","Safeguarding Assessments","Protecting Children - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Basics of Safeguarding Children - Course Assessment"]}]}