{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5259","title":"Basics of Nurse Prescribing","totalEnrolled":"2,500","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how trained, qualified nurses prescribe medication to treat illnesses in this free online healthcare course.","description":"Did you know that qualified nurses require special training to prescribe medications? This healthcare course explores the legal basis that lets nurses offer prescriptions to patients. We show you how medication management is used to treat various diseases. We also cover palliative care and teach you how to prescribe drugs for children and older people. The course identifies the challenges faced by nurses and explains how to overcome them.","courseOutcomes":["Discuss the legislation that has ena...","List the causes of anxiety and the a...","Differentiate between ‘acute’ and ‘c...","Identify the prescriptions recommend...","Discuss the legislation that has enabled nurses to prescribe medication","List the causes of anxiety and the available treatments","Differentiate between ‘acute’ and ‘chronic’ liver diseases","Identify the prescriptions recommended for common microbial conditions","Summarise the issues to consider while prescribing medications for older people","Describe the barriers nurses have to overcome to be able to legally write prescriptions","Discuss the legislation that has ena...","List the causes of anxiety and the a...","Differentiate between ‘acute’ and ‘c...","Identify the prescriptions recommend...","Discuss the legislation that has enabled nurses to prescribe medication","List the causes of anxiety and the available treatments","Differentiate between ‘acute’ and ‘chronic’ liver diseases","Identify the prescriptions recommended for common microbial conditions","Summarise the issues to consider while prescribing medications for older people","Describe the barriers nurses have to overcome to be able to legally write prescriptions"],"courseDescription":"<p>Are you a nurse and want to learn how to write prescriptions as part of your responsibilities? This course from Skill Up lays out the basics of prescribing medications for nurses. We begin by discussing the important legislation that permits nurses to prescribe medicines. We then explore medicine management, clinical pharmacokinetics and drug interactions. We also discuss adult anxiety disorders and demonstrate how to diagnose and treat them.</p><p>The course explains how the healthcare industry differentiate between ‘acute’ and ‘chronic’ liver diseases, their causes and medicinal treatments. We then investigate common microbial conditions, cardiac problems and treatments for heart failure. We then move on to medications that can be used to treat neurological problems in patients of any age.&nbsp;</p><p>We examine ‘palliative care’, which is an extensive area of medicine that covers healthcare provided to vulnerable people like pregnant women, the elderly and children. Finally, the course explores the role nurses play in modern medicine and focuses on their ability to legally write prescriptions. Though there are some barriers to overcome as you acquire the necessary training, nurses can reach their full potential in the healthcare industry by learning how to prescribe medication. Sign up for this course to take your nursing career to the next level as you receive the training required to legally write prescriptions.</p><a href=\"https://alison.com/resume/courses/5259\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5259\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Nurse Prescribing Workshop","description":"This module will examine the laws that permit nurses to prescribe certain medications. Medicine management, drug interactions and anxiety disorders are areas we will explore; you will discover different diseases, their symptoms and various treatments available that nurses can prescribe. Then, we will discuss the challenges of nurse prescribing.","topics":["Learning Outcomes - Nurse Prescribing Workshop","Introduction to Nurse Prescribing","Pharmacological Management","Prescribing for Common Conditions","Lesson Summary - Nurse Prescribing Workshop"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment - Basics of Nurse Prescribing"]}]}