{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4745","title":"Becoming a Paediatrician: Basic Guide","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about a paediatrician's core responsibilities as well as paediatrics subspecialities in this free online course.","description":"Do you enjoy caring for babies, children or teens? If you do, then a career as a paediatrician might be right for you. In this course, we will guide you through the steps to becoming a paediatrician. You will learn about the roles and responsibilities of a paediatrician and paediatric surgeon in the diagnosis and treatment of a wide range of illnesses in children while maintaining the paediatric ethics and laws.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The word ‘paediatrics’ means ‘healer of children’ and paediatricians are the doctors or healthcare professionals who treat children. They have a vital role in managing the physical, mental and emotional wellbeing of a child and providing preventive healthcare services. They also ensure that a medically or mentally challenged child gets all the medical care they require to stay healthy. In addition, they work diligently to support families and manage the fear, vulnerability and anxiety parents feel when their children are sick. According to their psychology, they must be empathetic to children and communicate with them accordingly. If you have a passion for babies and children and have the patience to analyse and diagnose their problems, then a career in paediatrics might be for you. This course provides guidelines on becoming a paediatrician and shows you what these healthcare professionals do daily.</p><p>Next, we will give you a thorough introduction to paediatrics and the responsibilities of a paediatrician or paediatric surgeon. You will explore basic child anatomy and medical terminology. We will help you develop the knowledge and skills to assess different medical conditions and formulate a plan to investigate and treat disorders effectively. There are subspecialties of paediatrics to diagnose and treat various physiological, genetic or nutritional disorders. We will teach you how to recognise the symptoms of several ailments such as gastrointestinal infections, neurological problems, cancer and more. Finally, we will research paediatric ethics and the children's laws governing the doctor-patient relationship.</p><p>Paediatrics is a rewarding career. Recently, a survey revealed a shortage of healthcare experts at hospitals worldwide. Nearly 1.7 billion children and adolescents do not have access to primary life-saving surgery because of the skill gap in different fields of paediatrics or the lack of surgeons. The scope for growth for healthcare professionals interested in paediatrics is vast. This course will guide you through the path of becoming a paediatrician and provide you with insights into the different specialities. The knowledge gained from this course will enable you to choose the particular area you might find the most interesting. If you are not a doctor but wish to make a career in child health, this course will be your first step. Register today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}