{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5121","title":"Becoming a Domiciliary Care Support Worker","totalEnrolled":"8,006","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online homecare training course explains how to safely support the infirm with their daily household tasks.","description":"‘Domiciliary care workers’ are trained carers who support the infirm at home by performing daily household tasks that maintain their quality of life. Do you find fulfilment in assisting people in need? Have you considered a career in homecare? We teach you how to provide quality services to those in need and provide today’s best homecare practices before examining the UK’s laws designed to protect the wellbeing and dignity of those in your care.","courseOutcomes":["Recall who provides and receives dom...","List the core elements that are requ...","Describe the factors to consider whe...","Outline how to carry out a RIDDOR re...","Recall who provides and receives domiciliary care support","List the core elements that are required to manage health and safety in the home","Describe the factors to consider when identifying individuals who are at particular risk","Outline how to carry out a RIDDOR report of an accident","Distinguish between people ‘infected’ or ‘colonised’ with methicillin-resistant Staphylococcus aureus (MRSA)","Discuss how MRSA and blood-borne viruses are spread and how to practice good hand hygiene","Analyse how the National Early Warning Score (NEWS) work and how it is used","Outline the six simple physiological parameters that form the basis of the scoring system ‘NEWS’","Indicate how to perform CPR","Outline the seven Caldicott Principles","Summarise how to communicate effectively","Recall who provides and receives dom...","List the core elements that are requ...","Describe the factors to consider whe...","Outline how to carry out a RIDDOR re...","Recall who provides and receives domiciliary care support","List the core elements that are required to manage health and safety in the home","Describe the factors to consider when identifying individuals who are at particular risk","Outline how to carry out a RIDDOR report of an accident","Distinguish between people ‘infected’ or ‘colonised’ with methicillin-resistant Staphylococcus aureus (MRSA)","Discuss how MRSA and blood-borne viruses are spread and how to practice good hand hygiene","Analyse how the National Early Warning Score (NEWS) work and how it is used","Outline the six simple physiological parameters that form the basis of the scoring system ‘NEWS’","Indicate how to perform CPR","Outline the seven Caldicott Principles","Summarise how to communicate effectively"],"courseDescription":"<p>Anyone at any stage of life - including those with learning disabilities, mental health issues, sensory impairment or physical disabilities - could require domiciliary care. Are you passionate about providing care for people in their homes? As a domiciliary care worker, you are responsible for supporting individuals and assisting them with their daily household chores, personal care and any other activity that allows them to maintain their independence and quality of life. In this course, we train you in homecare and examine the domiciliary care minimum standards issued by the United Kingdom’s Department of Health. We then compare ‘shared lives’ carers and ‘personal assistants’.</p><p>The course then explores the UK’s health and safety guidelines pertaining to domiciliary care and explains how to identify individuals who are at risk. Accidents may occur during work activities, resulting in injuries or even death, and we lay out the procedures to follow in order to report the incident. We will show you how to report serious workplace accidents, occupational diseases and specified dangerous occurrences (or 'near misses') following ‘Reporting of Injuries, Diseases and Dangerous Occurrences Regulations’ (RIDDOR) standards. We outline when and how to make a RIDDOR report and how to determine if an accident that led to a death or injury is work-related. You will study the types of reportable injuries, how to prioritise risk control measures and what is considered an ‘infectious waste’.</p><p>Understanding the nature of diseases alerts us to their presence and can help us control their spread. We examine Methicillin-Resistant Staphylococcus Aureus (MRSA) and blood-borne viruses and how they are spread. You will then be taught how to employ hand hygiene techniques and prevent the spread of infection. We outline the ‘National Early Warning Score’ (NEWS), a tool developed by the Royal College of Physicians used to improve the detection and response to clinical deterioration in adult patients. We demonstrate how to carry out cardiopulmonary resuscitation (CPR). Finally, we discuss medication management and administration, how to communicate effectively, the Mental Capacity Act and the ‘Dementia and the Deprivation of Liberty Safeguards (DoLS). No prior knowledge is necessary to take this course. These skills provided in this training course can be used to protect the wellbeing and dignity of infirm loved ones and caregiving offers a rewarding career to those with compassion.</p><a href=\"https://alison.com/resume/courses/5121\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5121\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Domiciliary Care Worker","description":"In this module, you’ll be introduced to domiciliary care practice. You’ll learn some management techniques and how to report accidents. We'll educate you on blood-borne viruses and how to prevent their spread. We'll teach you about NEWS(National Early Warning Score), medication administration, the Caldicott principles, and effective communication.","topics":["Domiciliary Care Worker - Learning Outcomes","Management of Health and Safety for Domiciliary Carers","CSTF Infection and Basic Life Support","Medication Management, CSTF and Mental Health Care","Domiciliary Care Worker - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Becoming a Domiciliary Care Support Worker - Course Assessment"]}]}