{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5163","title":"Becoming a Birth Doula","totalEnrolled":"2,525","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains how a professional birth doula assists their clients before, during and after labour.","description":"Pregnancy and childbirth are overwhelming times for parents and they need all the care and support available to make birth a safe, healthy and fulfilling experience. A doula is a trained childbirth professional that can provide such support. In this course, we lay out the roles of a birth doula during pregnancy, childbirth and the postpartum period to provide the training you require that improves both your medical and communication skills.","courseOutcomes":["Describe the roles of a birth doula...","Identify the sexual and reproductive...","Explain how a woman/person becomes p...","Discuss the common symptoms of pregn...","Describe the roles of a birth doula","Identify the sexual and reproductive parts of the female anatomy","Explain how a woman/person becomes pregnant and how babies grow","Discuss the common symptoms of pregnancy and how to manage them","Define ‘body mass index’ (BMI)","Explain how to care for a pregnant woman/person during labour","Indicate how to screen newborn babies for disorders and how to care for them","Outline common maternal mental health disorders","Summarise how to support grieving parents as a birth doula","List the different methods of contraception","Identify the types and styles of communication","Describe the roles of a birth doula...","Identify the sexual and reproductive...","Explain how a woman/person becomes p...","Discuss the common symptoms of pregn...","Describe the roles of a birth doula","Identify the sexual and reproductive parts of the female anatomy","Explain how a woman/person becomes pregnant and how babies grow","Discuss the common symptoms of pregnancy and how to manage them","Define ‘body mass index’ (BMI)","Explain how to care for a pregnant woman/person during labour","Indicate how to screen newborn babies for disorders and how to care for them","Outline common maternal mental health disorders","Summarise how to support grieving parents as a birth doula","List the different methods of contraception","Identify the types and styles of communication"],"courseDescription":"<p>Childbirth can be a blissful and cherished moment while also being overwhelming and unsettling as it brings discomforting physical changes. These can include contractions, back pain, swollen breasts, the frequent need to urinate and more. Pregnant women/persons require care, support and medical attention to endure such a difficult and daunting time. Due to its rough periods, pregnancy may demand the skills and experience of a birth doula. A birth doula is a childbirth professional who provides informational, emotional and physical support before and after labour. This course explains the roles and responsibilities of a birth doula and why a pregnant woman/person might need them.</p><p>Understanding how a woman/person's body functions during pregnancy are crucial for both a birth doula and an expectant parent. We describe the anatomy of females' sexual and reproductive parts and explain infertility, menopause, how to fall pregnant, how babies grow and the progressive changes that occur in a body during pregnancy. Workplace stress can be harmful to a foetus, depending on the gestation age of its parent, and we demonstrate how to determine when a pregnant woman/person should take a break from work and focus on their pregnancy. As a birth doula, paying attention to a pregnant woman's/person's diet is critical because anything they eat can affect the foetus. Some therapies can assist a person in getting through the phases of pregnancy. We provide dietary information concerning pregnancy, complementary therapies, and exercises to help a prospective parent.</p><p>We then explore pregnancy symptoms and how to manage them before describing various clinical tests performed on pregnant women/persons. You will learn how newborn babies are screened and cared for. The course then examines the postpartum period and outlines how a woman/person recuperates after labour, how newborn babies are screened and more. It is critical for couples to plan out their desired number of children and the spacing and timing of their births. Such family planning can prevent unplanned pregnancies and the health and financial risks they create. We provide the nitty gritty of family planning and explain how to communicate effectively before going through the birth doula's code of ethics. This course has no prerequisites and provides the training required to become a professional doula, a career path that is growing in importance and popularity as many pregnant women/persons require their assistance to get through the difficult stages of pregnancy and labour. Sign up to acquire the birth coaching skills you need to work as a birth companion.</p><a href=\"https://alison.com/resume/courses/5163\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5163\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pregnancy and Childbirth","description":"In this module, you’ll be introduced to the role of a birth doula and how women get pregnant. We’ll teach you body mass index, the symptoms of pregnancy and how to care for a pregnant woman during labour. Learn how newborn babies are screened, how to support grieving parents as a birth doula, methods of contraception, how to communicate and more.","topics":["Pregnancy and Childbirth - Learning Outcomes","The Body of a Pregnant Woman","The Care of the Mother and Baby","Grief, Family Planning, Communication and Ethics","Pregnancy and Childbirth - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Becoming a Birth Doula - Course Assessment"]}]}