{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5211","title":"Becoming a Care Assistant","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become a caregiver with this free online course that explains how to provide health and social care to the infirm.","description":"A care assistant may be called a ‘caregiver’, ‘social care worker’, ‘healthcare assistant’ or simply a ‘carer’. They support their clients depending on their needs. Do you enjoy making a real difference in people's lives? This course provides the basic skills needed to become a competent caregiver. We lay out safeguarding principles, compare health and social care and explain how to protect the wellbeing and dignity of those in your care.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Elderly, sick and disabled people often require care and support to live happily. Compassionate and well-organised professional care assistants support people in this position to help them lead fulfilling lives. They help clients keep track of care plans and meet all necessary requirements to ensure that they are well cared for without complications. Their day-to-day tasks include assisting clients with prescribed medication, mobility, personal care and hygiene. This course teaches you the duties and responsibilities of a care assistant and explains how to deliver top-notch care services to clients.</p><p>The course distinguishes between the three elements of health care and the four aspects of social care provided by care assistants. We then identify who provides social care services to service users and the steps taken to do so. Care assistants who work with food must adhere to food safety and hygiene practices. This is because all food handlers are required by law to understand and implement food hygiene practices in order to protect the food they serve from contamination. We examine the laws that govern food safety in the United Kingdom, how these laws are enforced by food safety officers, what is expected of food business owners under these laws and what might happen when they contravene the laws. We also discuss food poisoning, its cause, symptoms and control measures.</p><p>The course explains the concept of equality, the duties of a health and social care worker, the relevant codes of conduct and how to safeguard vulnerable individuals. We establish the importance of communication and outline how to identify vulnerable children. We show you how to make decisions for people that face difficulty in making their own, the principles of service delivery and legal responsibilities in health and social care. Lastly, we define common medical terms and lay out the important roles technology plays in health care. There are no prerequisites for taking this course and it is designed for all learners. A career in health and social care allows you to help people who are infirm, elderly or sick. Sign up to turn your compassion into a career and make a real difference in the lives of vulnerable people while protecting their wellbeing and dignity.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}