{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2972","title":"Bloodborne Pathogens (BBP)","totalEnrolled":"19,651","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to identify and treat bloodborne pathogens and confers global accreditation.","description":"This course on bloodborne pathogens (BBP) trains you to address health concerns by detecting and responding to germs in people’s blood. This training is required annually by the U.S. Occupational and Safety Health Administration (OSHA). We show you how to identify BBPs and respond appropriately, often with a referral. Complete this course and apply for certification to gain international accreditation that signals your ability to work with blood.","courseOutcomes":["Identify sources of bloodborne patho...","Explain the risks involved when work...","Outline how to appropriately clean u...","Explain the importance of personal p...","Identify sources of bloodborne pathogens (BBPs)","Explain the risks involved when working with blood","Outline how to appropriately clean up blood and blood-containing fluids","Explain the importance of personal protective equipment (PPE) for preventing transmission of BBPs","Describe how BBPs are transmitted","Break down how to avoid exposure to BBPs from the use of ‘sharps’","Highlight how to respond after exposure","Establish a core sense of responsibility among participants to prevent exposure to BBPs","Identify sources of bloodborne patho...","Explain the risks involved when work...","Outline how to appropriately clean u...","Explain the importance of personal p...","Identify sources of bloodborne pathogens (BBPs)","Explain the risks involved when working with blood","Outline how to appropriately clean up blood and blood-containing fluids","Explain the importance of personal protective equipment (PPE) for preventing transmission of BBPs","Describe how BBPs are transmitted","Break down how to avoid exposure to BBPs from the use of ‘sharps’","Highlight how to respond after exposure","Establish a core sense of responsibility among participants to prevent exposure to BBPs"],"courseDescription":"<p>This course provides an overview of bloodborne pathogens (BBPs) and lays out the objectives of regular BBP training. We guide you through an ‘exposure control plan’ (ECP) that directs healthcare workers’ response to pathogens. We describe different types of BBP by examining common examples like HIV and hepatitis B and C. The course goes through the four main response steps to pathogen exposure and covers universal precautions, handwashing protocols and standard precautionary actions.</p><p>We then take you through safety procedures that protect you from the transmission of BBPs. We study appropriate personal protective equipment (PPE), the safe disposal of ‘sharps’ (like scalpels and hypodermic needles) and the various facility policies and measures that an employer should have in place for cleaning up blood and bodily fluids. We delve into the Occupational and Safety Health Administration (OSHA) in the United States to explain who is subject to them and what their regulations entail.</p><p>This course is of interest to health professionals who need to address their own health concerns while caring for others. We explain how to reduce the chances of disease transmission in the line of duty while you protect yourself and others from possible infection, including co-workers, patients and family members. This knowledge protects you and lets you do your job without fear or interruption and is required if you work in a lab or medical environment. Blood work is an important part of modern medicine so sign up for this course to add this crucial skill to your portfolio and an international accreditation to your resume.</p><a href=\"https://alison.com/resume/courses/2972\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2972\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Bloodborne Pathogens (BBP)","description":"This module covers the following aspects of Bloodborne Pathogens (BBP): An Introduction to Bloodborne Pathogens, Protecting Yourself from Bloodborne Pathogens, Response to Blood Exposure, Cleaning up the Mess and Reporting Exposure to Blood.","topics":["Bloodborne Pathogens (BBP) - Learning Outcomes","Course Overview","Introduction to Bloodborne Pathogens","Protect Yourself from Bloodborne Pathogens","Getting into Contact with Blood","Cleaning Up the Mess","Reporting Exposure to Blood","Next Steps","Bloodborne Pathogens (BBP) - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["BBP Course assessment"]}]}