{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3734","title":"Building Healthy Daily Habits","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to adopt healthy daily habits for a more rewarding life with this free online course,","description":"Daily habits are often labelled as the driving force behind self-improvement. You might already have set daily habits, but some of these habits might be holding you back. This free online course will teach you how to build a great life, from cellphone hygiene to portion sizes, by adopting positive habits. By taking control of your life and daily habits, your creativity will blossom, and you will lead a happy and successful life.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you struggling to lead a happy and successful life? Obtaining this success may be as simple as adopting good wellness habits into your life. In this course, you will learn to manage different areas of your life using the techniques created by personal development expert TJ Walker. One tool that you will study is the Selfie Speak Programming model. Walker developed this recording technique to introduce new daily habits in life and help people achieve their goals. There’s no need to worry if you don’t have any prior knowledge of audio production on a smartphone.</p><p>This course is perfect for beginners. We will show you how to use simple tools and tips for common recording problems you may experience. The most simple tool discussed in this course is your smartphone and the applications that already come with your device. You will also learn about the positive benefits of a sense of accomplishment, and you can quickly achieve a positive sense of self as you wake up in the morning.</p><p>You will take a deep dive into the two types of consumption in your life that are holding you back: entertainment and food. You will learn why the daily habit of watching hours and hours of news could be holding back your creativity. We will show you how to handle your email address by learning who you should be sharing it with and who you should not. How often do you check your phone in a single day? This course covers which apps you should keep on your device and why you should frequently use the power button. We will then study the food you put into your body and how that has changed throughout history. This includes the rise of calorie intake for most, obesity, and the number one cause of obesity: giant portion sizes. We also cover how to avoid overeating in restaurants in this section. As you continue your studies in this course, you will become more aware of ways to lead a healthy life outside of the food you consume. You will learn methods to motivate yourself to work out daily. You will also learn how to get a full night’s sleep without any distractions from electronics. This course finishes with clutter and how you can avoid filling your house with useless junk. This section includes the Marie Kondo method of decluttering, why you should avoid storage bins and organise your work desk for maximum success. You will develop a solid understanding of how simple habits make up your life and affect your creativity and ability to succeed. Start this course today to learn how to incorporate positive daily routines in your life and achieve the success you always wanted to achieve.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}