{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5484","title":"Coaching Health and Wellness","totalEnrolled":"848","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to help clients achieve their fitness goals with the coaching tips and techniques in this free online course.","description":"This coaching course explains how to become the best possible fitness coach to help others achieve their health and fitness aspirations. We provide you with the tools required to mentor clients and help them pursue physical, mental and emotional wellbeing. We show you how to develop a solid rapport with clients and draw up personal diet and exercise programmes that leave them satisfied. Sign up to become the ultimate fitness and wellness coach!","courseOutcomes":["Outline the roles and responsibiliti...","Describe how diet can impact a perso...","Explain the role of calories in main...","Discuss the importance of the right ...","Outline the roles and responsibilities of a health and wellness coach","Describe how diet can impact a person's health both negatively and positively","Explain the role of calories in maintaining a healthy body weight","Discuss the importance of the right food choices for a better life","List the most common types of diets that are being practised today","Describe the importance of the relationship between the client and the trainer","Explain the science behind a successful weight-loss or muscle-gain programme","Discuss the importance of cardio exercise in maintaining a healthy lifestyle","List the fundamentals of a resistance training programme","Analyse the importance of good habits and why they matter","Describe the crucial role that mental health plays in an individual's wellbeing","Outline the roles and responsibiliti...","Describe how diet can impact a perso...","Explain the role of calories in main...","Discuss the importance of the right ...","Outline the roles and responsibilities of a health and wellness coach","Describe how diet can impact a person's health both negatively and positively","Explain the role of calories in maintaining a healthy body weight","Discuss the importance of the right food choices for a better life","List the most common types of diets that are being practised today","Describe the importance of the relationship between the client and the trainer","Explain the science behind a successful weight-loss or muscle-gain programme","Discuss the importance of cardio exercise in maintaining a healthy lifestyle","List the fundamentals of a resistance training programme","Analyse the importance of good habits and why they matter","Describe the crucial role that mental health plays in an individual's wellbeing"],"courseDescription":"<p>Are you looking to become a fitness trainer but don’t know where to start? If so, this course on coaching health and wellness provides you with the training and information you need to kickstart your journey to becoming a fitness trainer. We start by examining a fitness coach's roles and responsibilities along with explaining what it means to be truly ‘healthy’. We also go through various aspects of nutrition and identify its best possible sources.</p><p>Are you overwhelmed by the many diets on the market and don’t know which one to follow? The course examines the popular diets and compares their pros and cons. We also investigate the many exercise methods available for both weight loss and muscle gain. We then move on to the ‘wellness’ part of the course and emphasise mental health by providing effective tools that can help clients work and sleep better.</p><p>The best fitness coaches know how to tailor the fitness programmes according to individual client’s needs and aspirations. We provide you with the tools required to understand the client’s goals and develop the best possible relationship with them for the long term. With more and more people around the world trying to look and feel better, having the right tools as a fitness coach can offer a huge advantage. This coaching course trains you to become a top-notch fitness coach that stands apart from the competition. Sign up to learn how to coach clients to lose fat, build muscle and eat and sleep better to cultivate a ‘healthy mind in a healthy body’.</p><a href=\"https://alison.com/resume/courses/5484\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5484\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Role of Diet","description":"In this module, we will go through the importance of diet and its effects on health. We will dissect the various nutrients found in day-to-day foods that can be a source of good or bad health. We will also look at the various types of diets that are being used along with their pros and cons to see which one can be of benefit to each individual.","topics":["The Role of Diet - Learning Outcomes","Health and Wellness Introduction","How Diet Affects Your Health","Calories and Body Weight","The Right Food Choices","Types of Food and Their Benefits","Common Types of Diets","The Client-Coach Relationship","The Role of Diet - Lesson Summary"]},{"name":"Module","details":"The Role of Exercise","description":"This module will be dissecting the role of exercise in the health and wellness of individuals. We will go through the importance of the client-trainer relationship to achieve health goals and how to design the best possible plans for muscle growth or weight loss. We also look into methods to improve mental health and ways to be better coaches.","topics":["The Role of Exercise - Learning Outcomes","The Science of Successful Weight loss","Diet and Muscle Gain","The Importance of Cardio","Fundamentals of Resistance Training","Flexibility and Stretching","Why Habits Matter","The Importance of Mental Health","Coaching Tools","The Role of Exercise - Learning Outcomes"]},{"name":"Module","details":"Course assessment","description":"","topics":["Coaching Health and Wellness - Course assessment"]}]}