{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5134","title":"Consent Training in Healthcare","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online patient care course covers the basics of consent in healthcare settings and the UK laws that govern it.","description":"In healthcare settings, patients, service users and clients must agree to their treatment and care. This course helps you understand the key principles of valid consent. We explain when permission is needed and when it isn't, which requires that you determine a patient's best interests as you assess their mental capacity. Explore the UK laws related to consent and the best ways of handling any complaints to protect the rights of your patients.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Every patient has the right to receive information and ask questions before any procedure or treatment. The consent process ensures that healthcare providers outline all the relevant information about the circumstances, tests required and treatment options before the patient decides what to do. Ethical and legal regulations oversee the legal rights of a patient. This course explores the consent mandated for minors or adults, both young and old, who lack decision-making capacity. Clinicians and healthcare providers must adequately understand their roles and responsibilities regarding the correct process of obtaining consent within the boundaries set by the law.</p><p>We introduce you to the fundamentals of informed consent and lay out the ethical and legal considerations of obtaining it before performing any medical procedures. We demonstrate how to apply the concept of ‘Gillick competence’, which is used in medical law to determine whether a minor can agree to their own medical treatment without the requirement for parental permission or knowledge. The primary purpose of the consent process is to protect the patient. This course answers questions such as 'can consent given be withdrawn before treatment starts?', 'can patients refuse treatment?' or 'what support is available for people who cannot consent?'.&nbsp;</p><p>The delivery of healthcare is complex. Informed consent is fundamental to safe healthcare practices and lets professionals avoid being implicated in situations with potentially severe legal and health ramifications. We go through the legal responsibilities of healthcare professionals, attorneys and decision-makers as they pertain to the rights of patients. We examine the UK’s Health &amp; Social Care Act 2012, Care Act 2014, Mental Capacity Act 2005 and the role of the Office of the Public Guardian. This course is ideal for healthcare and social care specialists who want a deeper understanding of consent and care provision. Anyone interested in knowing what needs to be considered to obtain valid consent should take this course, which has no entry requirements. Enrol today to fully understand your role in the process of obtaining patient consent.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}