{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1960","title":"Coronavirus - What you need to know","totalEnrolled":"160,204","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers essential aspects of the coronavirus Covid-19 (over 670 M infected/over 6,8 M deaths)","description":"This free online course on the novel coronavirus (Covid-19) focuses on the history, transmission, symptoms, possible treatment, and potential prevention of the novel coronavirus. As part of the international response, Alison created this free online course on what people need to know about the novel coronavirus, its background, and how to deal with the threat it poses to you and your family. Last updated: April 2023.","courseOutcomes":["Outline the origins, effects and tre...","Identify the signs and symptoms of t...","Describe the protocols for containin...","Outline the protocols for treating n...","Outline the origins, effects and treatment of the novel coronavirus","Identify the signs and symptoms of the infection","Describe the protocols for containing and limiting the transmission of the novel coronavirus","Outline the protocols for treating novel coronavirus infections","Discuss World Health Organization's recommendations and precautions for helping prevent the transmission of novel coronavirus infections","Recall the multiple varients and how they were named","Outline the origins, effects and tre...","Identify the signs and symptoms of t...","Describe the protocols for containin...","Outline the protocols for treating n...","Outline the origins, effects and treatment of the novel coronavirus","Identify the signs and symptoms of the infection","Describe the protocols for containing and limiting the transmission of the novel coronavirus","Outline the protocols for treating novel coronavirus infections","Discuss World Health Organization's recommendations and precautions for helping prevent the transmission of novel coronavirus infections","Recall the multiple varients and how they were named"],"courseDescription":"<p>This free online novel coronavirus introductory course focuses on the history, symptoms, transmission, and prevention of the Covid-19 virus that they had not previously identified in humans. Coronaviruses (CoV) are a large family of viruses that cause illnesses ranging from the common cold to more severe diseases, such as Middle East Respiratory Syndrome (MERS-CoV) and Severe Acute Respiratory Syndrome (SARS-CoV). Coronaviruses are zoonotic, meaning they are transmitted between animals and people.</p><p><br>The course discusses how this virus outbreak had severe consequences for the health of individuals infected and the implications for the public health resources of communities and countries where the outbreak occurred. Common signs of infection include respiratory symptoms, fever, cough, shortness of breath, and breathing difficulties. In addition, the infection can cause pneumonia, severe acute respiratory syndrome, kidney failure, and even death in more severe cases.</p><p><br>The course was a unique initiative based on information provided by the World Health Organisation (WHO), Geneva, Switzerland, and the CDC (Centre of Disease Control, USA). This course was part of an innovative Alison endeavour to develop a rapid response to a global learning certification system to combat pandemic diseases. This free course will be regularly updated as the virus progresses and new VOCs (variants of concern) are tracked. Alison has made this PDF Certification course available free of charge worldwide to encourage knowledge, awareness and understanding of the virus and its threat. By taking this course, you can maintain the latest updates on how to best deal with the danger Covid-19 poses to you and others and follow updated protocols to keep everyone safe. So, why wait? Start the course today, and in 1-2 hours, you will have gained the knowledge to help protect you, your family and your community from contracting and transmitting this virus.</p><p>This course was last updated in April 2023.</p><a href=\"https://alison.com/resume/courses/1960\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1960\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Coronavirus - Background, Symptoms and Treatment","description":"In this module, Background, Symptoms and Treatment, you will learn about the origins of the novel coronavirus and its symptoms. You will also learn about how the novel coronavirus infection can be transmitted to others and you will receive guidelines on how the outbreak is currently being treated. In addition, this module presents the most recent developments and outlines the international responses to this emerging viral infection from the CDC, WHO and the commercial airline industry.","topics":["Coronavirus - Background, Symptoms and Treatment - Learning Outcomes","Coronavirus - Background and Symptoms","Coronavirus - Transmission and Treatment","Coronavirus Developments","Coronavirus - International Response","Coronavirus - Background, Symptoms and Treatment - Lesson Summary"]},{"name":"Module","details":"Coronavirus - Advice for the Public","description":"In this module, Advice for the Public, you will learn vital information on how to help protect yourself and your community from becoming infected with the novel coronavirus. You will also be given guidelines on how to practise food safety and take precautionary measures if shopping or working in wet markets in China or Southeast Asia. You will also learn about WHO guidelines for travel, what to do if you suspect you or someone else may be infected, and myths surrounding Covid-19.","topics":["Coronavirus - Advice for the Public - Learning Outcomes","Coronavirus - Protect Yourself and Others from Getting Sick","Coronavirus - Guidelines on Food Safety and Wet Markets","Coronavirus - Guidelines for International Travel","Coronavirus - Advice for the Public - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Coronavirus - What You Need to Know: Course Assessment"]}]}