{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2968","title":"CPR, AED and First Aid","totalEnrolled":"222,639","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online certificate course teaches you how to use CPR, AED and first aid to save lives.","description":"This training course begins with first aid basics such as how to check responsiveness and recognize common symptoms before we show you how to treat injuries and cardiac arrest. We explain how to handle choking and how to perform cardiopulmonary resuscitation (CPR) or use an automated external defibrillator (AED). This course offers global accreditation of your new life-saving skills so sign up to become a qualified safety officer.","courseOutcomes":["Define ‘first aid’ and list the item...","Discuss personal protective equipmen...","Identify medical problems, their cau...","Examine causes, symptoms and how to ...","Define ‘first aid’ and list the items found in a first-aid kit","Discuss personal protective equipment (PPE), scene safety and hand-washing","Identify medical problems, their causes, symptoms and first-aid procedures","Examine causes, symptoms and how to care for individuals with medical problems","Explain how to handle traumatic injuries","Outline symptoms and how to provide first aid to an individual with environmental injuries or illnesses","Analyze how to provide CPR on choking infants","Highlight the symptoms of choking in infants, children and adults","Describe chest compressions and mask-use for children, infants and adults","Discuss giving breaths and activating emergency medical services (EMS)","Define ‘first aid’ and list the item...","Discuss personal protective equipmen...","Identify medical problems, their cau...","Examine causes, symptoms and how to ...","Define ‘first aid’ and list the items found in a first-aid kit","Discuss personal protective equipment (PPE), scene safety and hand-washing","Identify medical problems, their causes, symptoms and first-aid procedures","Examine causes, symptoms and how to care for individuals with medical problems","Explain how to handle traumatic injuries","Outline symptoms and how to provide first aid to an individual with environmental injuries or illnesses","Analyze how to provide CPR on choking infants","Highlight the symptoms of choking in infants, children and adults","Describe chest compressions and mask-use for children, infants and adults","Discuss giving breaths and activating emergency medical services (EMS)"],"courseDescription":"<p>This course opens by explaining how to provide first aid to people with different emergencies, including medical problems, traumatic injuries and environmental injuries. We define ‘first aid’ and outline its basic steps before delving into the contents of a standard first-aid kit. We introduce you to the cardiopulmonary resuscitation (CPR) technique, which combines both ‘rescue breathing’ and chest compressions to rescue people in medical distress.</p><p>The course then discusses choking since it is the most common incident that can occur at home or the workplace. We show you how to perform first aid on choking infants, children and adults. We then widen our analysis of CPR and demonstrate how to safely apply and use automated external defibrillators (AED) to get hearts beating regularly during cardiac events.</p><p>This course trains you to provide first aid for common accidents, illnesses, medical problems and more. We help you to learn life-saving skills at your own pace so sign up to acquire international accreditation that tells people you know how to save lives in a crisis. This course can help to keep you and your loved ones safe at home and also qualifies you to be your office’s safety officer, something every workplace needs.</p><a href=\"https://alison.com/resume/courses/2968\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2968\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"First Aid for Injuries and Illness","description":"This module will examine the definition of first aid and the components inside the first aid kit. We will define handwashing, the emergency system dispatcher guide and explain when to remove your gloves after administering first aid. We will also explain the causes and symptoms of medical problems and how to give first aid to people suffering from traumatic injuries and environmental injuries.","topics":["First Aid for Injuries and Illness - Learning Outcomes","First Aid","Medical Problems","Traumatic Injuries","Environmental Injury and Illnesses","First Aid for Injuries and Illness - Lesson Summary"]},{"name":"Module","details":"Choking Treatment","description":"This module will explain what cardiopulmonary resuscitation is comprised of, give a brief outline of when cardiopulmonary resuscitation and automated external defibrillators may be required and explain how to perform them on choking victims. We will analyze the symptoms of choking, how to perform chest compressions, giving breath and how to relieve choking in infants, children and adults.","topics":["Choking Treatment - Learning Outcomes","Adult CPR, AED and Choking","Child CPR, AED and Choking","Infant CPR and Choking","Skills Training Videos","Choking Treatment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["CPR, AED & First Aid course assessment"]}]}