{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5431","title":"Dementia Care and Management","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online caregiving course teaches you about dementia and explains how to care for those suffering from it.","description":"Dementia is a loss of cognitive function and can develop at any age. It can be a difficult and overwhelming journey for those affected by it and their loved ones. This psychology course discusses the causes of dementia and how it affects the brain, memory and ability to use language. We outline the requirements of a person with dementia and explain how to manage their care and support them in the home or as a professional caregiver in the UK.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Dementia is a debilitating condition that affects millions of people worldwide and is increasingly being recognised as a major public health concern. It can have an enormous impact on a person's identity, ability to function and relationships both in the home and in wider society. There is no cure for dementia. Primary care that includes comprehensive assessment and dementia-specific treatment is a crucial component of managing dementia. While other treatments may also be available, the progressive nature of the disease requires a combination of care, support and other interventions to effectively manage symptoms. The World Health Organization (WHO) has included dementia in its Mental Health Gap Action Programme (mhGAP) and recognises the need for improved healthcare training resources for care providers. In this caregiving course, we cover various aspects of dementia including its assessment, care, causes and management. We then describe the psychosocial impact of dementia on the patient's family and caregivers.</p><p>The course discusses the different types of dementia such as Alzheimer's disease, vascular diseases, Lewy Body Dementia, Frontotemporal dementia, Parkinson's disease and more. We break down the psychological processes associated with these diseases. We then dispel some common misconceptions about dementia and explain how the condition progresses differently in individual cases. We study the risk factors that influence the occurrence of dementia and show you how to prevent or delay its onset. The course describes the common needs of people with dementia that go unmet and provides ways to support people with dementia and support them in a way that preserves as much of their quality of life as possible. Dementia is caused by diseases that damage the brain. The specific symptoms that someone with dementia experiences depends on which parts of the brain are affected. We provide a brief overview of the specific regions of the brain that are associated with memory loss, reasoning, decision-making, language and social skills. The course then links impairments commonly seen in cases of dementia with the relevant part of the brain.</p><p>Family members and caregivers play an important role in caring for people suffering from dementia and the course teaches you how to manage stress and provide person-centered support. We then describe the legal rights of individuals with dementia and the various healthcare services available through the UK government. If you are caring for someone with dementia, it can affect your ability to work and earn a living. To help with this, we show you how to confirm your eligibility for receiving a carer's allowance. People with dementia may require round-the-clock monitoring and assistance to create a safe environment, manage aggressive or agitated behaviour and meet their needs. This caregiving course provides guidance on how to provide care and support for a person with dementia and helps you to understand their perspective and experience. Don't let dementia care overwhelm you any longer. Whether you intend to become a professional caregiver working in adult care or want to make sure you give a loved one with dementia the best support you can, this course is for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}