{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4317","title":"Dental Assistant Fundamentals","totalEnrolled":"6,526","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about the career path, roles and duties of a dental assistant in a dental office.","description":"Looking to become a dental aide? Are you curious about the day-to-day activities of a dental assistant? This course will introduce you to the interpersonal skills, functionalities, roles and responsibilities of a dental assistant in a dental office. You will gain an understanding of some dental procedures such as teeth whitening and infection control. Various dental terminologies and instruments will also be examined.","courseOutcomes":["Recognise the responsibilities and r...","Differentiate between dental technic...","Identify the professional attitudes ...","Recall general dentistry instruments...","Recognise the responsibilities and roles of a dental assistant","Differentiate between dental technicians and dental hygienists","Identify the professional attitudes of a dental assistant","Recall general dentistry instruments and their uses","Discuss the management of a dental office","Analyse the personal characteristics of a dental assistant","Describe what the professional appearance of a dental assistant should be","Distinguish the components of dental equipment","Explain some dental procedures such as restorative and prosthodontic techniques and more","Recognise the responsibilities and r...","Differentiate between dental technic...","Identify the professional attitudes ...","Recall general dentistry instruments...","Recognise the responsibilities and roles of a dental assistant","Differentiate between dental technicians and dental hygienists","Identify the professional attitudes of a dental assistant","Recall general dentistry instruments and their uses","Discuss the management of a dental office","Analyse the personal characteristics of a dental assistant","Describe what the professional appearance of a dental assistant should be","Distinguish the components of dental equipment","Explain some dental procedures such as restorative and prosthodontic techniques and more"],"courseDescription":"<p>A dental assistant is a member of a dental team who contributes immensely to the team delivering dental treatment and services. During dental operations, the dental assistant aids dentists or other dental auxiliaries by providing the dental operator with the proper dental procedure instrument to give efficient dental care. The function of a dental assistant extends beyond just delivering the dental operator tools during procedures. By studying this course, you will gain an in-depth understanding of the role and responsibilities of a dental assistant as well as the career path, skills and education required for this profession. Basic knowledge of dental terminologies and instruments is necessary to support dental operators or other dental auxiliaries during procedures.&nbsp;</p><p>Dental office management relies on the teamwork of several professionals who manage patients, beginning with their first office visit. It is essential to have an efficient system for scheduling, billing, medical records and other facets of modern dental care to ensure that patients will continue with the same dental office for years. In light of this, we examine how to efficiently manage a dental office to help you run it smoothly. Working in an oral health care setting requires you to be intelligent and diligent and will require you to avoid attires that will reduce your functionalities in the dental office. We explore the professional way to dress, so you contribute to delivering effective dental treatment and services.</p><p>Next, we guide you on performing infection control to reduce the number of microorganisms and infections in an oral health setting. Furthermore, we will illustrate some dental surgical equipment and how to sterilise the equipment. We outline how to file records of patients, equipment and dental supplies. We explore the types of radiation exposure common in an oral health setting. Learn about radiology as well as paediatric dentistry. No prior knowledge is necessary and we have designed this course for anyone who wishes to become a dental assistant in oral health practice. Would you like to work alongside a dentist? Then enrol and start this course today.</p><a href=\"https://alison.com/resume/courses/4317\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4317\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Responsibilities of a Dental Assistant","description":"In this module, you will be introduced to the role and responsibilities of a dental assistant. You will learn about oral terminologies, dental instruments and their uses as well as effective dental office management. Upon that, you will be taught paediatric dental practice and infection control in a dental office.","topics":["Responsibilities of a Dental Assistant - Learning Outcomes","Dental Instruments and Dental Office Management","Paediatric Dentistry, Infection Control and Instruments","Responsibilities of a Dental Assistant - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Dental Assistant Fundamentals - Course Assessment"]}]}