{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5375","title":"Deprivation of Liberty Safeguards - DoLS Training","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how the UK Deprivation of Liberty Safeguards (DoLS) protect people’s health and rights in this free online course.","description":"This caregiving course explains how the Deprivation of Liberty Safeguards (DoLS) are applied in hospitals or care homes in the UK and outlines the responsibilities of key stakeholders in the application process. We provide an overview of the DoLS, the Mental Capacity Act and other related legislation. We also cover the different types of authorisation and assessment processes used to protect the wellbeing and dignity of vulnerable people.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The Deprivation of Liberty Safeguards (DoLS) are an aspect of the Mental Capacity Act of 2005 enacted in the United Kingdom. They are designed to protect the most vulnerable members of society in hospitals and care homes and play a significant role in preventing the illegal detention or mistreatment of people who lack the mental capacity required to make their own decisions. This safeguarding and social work course provides the training required to begin your career as a DoLS assessor and also suits anyone who looks after an elderly or mentally incapacitated person.</p><p>We begin by explaining what ‘deprivation of liberty’ means, when it should be used and how to avoid it. We then summarise the DoLS provisions and explore their background. The course then examines the Mental Capacity Act and lays out its five principles, code of practice and other related laws. We provide an in-depth understanding of the authorisation processes for deprivation of liberty and compare standard and urgent authorisation.</p><p>Before the supervisory authority grants a DoLS request, it must undertake six critical evaluations. This section of the course describes these assessment measures and explains how to perform them. Finally, we explore the roles of different DoLS professionals, including the Approved Mental Health Professional, the Independent Mental Capacity Advocate, the Court of Protection, the Care Quality Commissions and others. The industry experts at Course Gate have developed this course to help you understand DoLS and advance your caregiving and social work career. Sign up today to learn how the UK’s Mental Capacity Act of 2005 protects the health, wellbeing and dignity of society’s most vulnerable people.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}