{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1347","title":"Diploma in Caregiving","totalEnrolled":"324,192","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Sharpen your caregiving skills in this free online course to provide professional care to clients or family members.","description":"This course focuses on the practical, legal and ethical issues you face while providing care to the sick and elderly. We help you develop the skills required to become an effective caregiver, which involves assisting loved ones and clients with meals, personal care, transportation and other physical and emotional needs. We explain how to deal with dementia while managing the impact of age, disease and injury to bring comfort to those in need.","courseOutcomes":["Outline the fundamental roles and re...","Describe the various legal issues th...","Describe how to identify, treat and ...","Identify the correct actions to take...","Outline the fundamental roles and responsibilities of a care worker","Describe the various legal issues that a caregiver must consider when working with a client","Describe how to identify, treat and prevent the spread of a range of medical conditions","Identify the correct actions to take in the event of various medical emergencies","Outline the fundamental roles and re...","Describe the various legal issues th...","Describe how to identify, treat and ...","Identify the correct actions to take...","Outline the fundamental roles and responsibilities of a care worker","Describe the various legal issues that a caregiver must consider when working with a client","Describe how to identify, treat and prevent the spread of a range of medical conditions","Identify the correct actions to take in the event of various medical emergencies"],"courseDescription":"<p>This course begins by introducing you to the roles and responsibilities of caregivers. We study the legal and ethical issues involved in the caregiving process. You will also learn how to communicate with individuals with disabilities before covering stress management, body mechanics and organizational skills. This course also discusses the purpose of observing, reporting and documenting the condition of those in your care. We establish the importance of cultural awareness and cultural competency to create a respectful work environment. The course examines various ailments and illnesses you may encounter and describes their treatment and prevention.</p><p>The term 'dementia' refers to a spectrum of brain disorders of varying intensity that hamper thought and memory. This course examines dementia and Alzheimer's disease and trains you to cope with such conditions sensitively. We also show you how to work with patients' families. The course then studies how ageing affects the body, the emotional impact of disease and traumatic injuries and the steps involved in preparing for a patient's death.</p><p>Caring for the aged and people suffering from physical and emotional disabilities requires compassion and understanding. This course provides the knowledge and skills needed to provide effective care to any client or family member in your charge, including the ability to deal with emergencies calmly. Sign up for this course to boost your caregiving skills in just a few short hours. Whether you intend to look after a loved one yourself or want to become a professional caregiver, this course helps you take care of those who need it most.</p><a href=\"https://alison.com/resume/courses/1347\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1347\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Fundamentals of Caregiving","description":"4 units of interactive presentations: Roles and Responsibilities of Carers; Legal and Ethical Issues in Caregiving; Communications and the Caregiving Process; Communicating with Individuals with Disabilities. This module includes learning outcomes and lesson summary topics.","topics":["The Fundamentals of Caregiving - Learning Outcomes","The Roles & Responsibilities of Carers","Legal & Ethical Issues in Caregiving","Communications & the Caregiving Process","Communicating with Individuals with Disabilities","The Fundamentals of Caregiving - Lesson Summary"]},{"name":"Module","details":"Fundamental Skills in Caregiving","description":"3 units of interactive presentations: Stress Management and Organizational Skills; Observing, Reporting and Documenting; Cultural Differences and Caregiving. This module includes learning outcomes and lesson summary topics.","topics":["Fundamental Skills in Caregiving - Learning Outcomes","Stress Management & Organizational Skills","Observing, Reporting & Documenting","Cultural Differences & Caregiving","Fundamental Skills in Caregiving - Lesson Summary"]},{"name":"Module","details":"Infections, Nutrition & Food Safety","description":"4 units of interactive presentations: Fighting Infection; Common Conditions: TB, Lice and Scabies; Nutrition and Hydration; Food Safety. This module includes learning outcomes and lesson summary topics.","topics":["Infections, Nutrition & Food Safety - Learning Outcomes","Fighting Infections","Common Conditions: TB, Lice & Scabies","Nutrition & Hydration","Food Safety","Infections, Nutrition & Food Safety - Lesson Summary"]},{"name":"Module","details":"Emergencies, Falls & Fire Safety","description":"3 units of interactive presentations: Planning for Emergencies; Medical Emergencies; Falls and Fire Safety. This module includes learning outcomes and lesson summary topics.","topics":["Emergencies, Falls & Fire Safety - Learning Outcomes","Planning for Emergencies","Medical Emergencies","Falls & Fire Safety","Emergencies, Falls & Fire Safety - Lesson Summary"]},{"name":"Module","details":"Diploma in Caregiving - First Assessment","description":"This assessment will test your knowledge of the following modules from the Diploma in Caregiving course: Module 1: The Fundamentals of Caregiving; Module 2: Fundamental Skills in Caregiving; Module 3: Infections, Nutrition & Food Safety; Module 4: Emergencies, Falls & Fire Safety. You can repeat this assessment in order to pass it.","topics":["Diploma in Caregiving - First Assessment"]},{"name":"Module","details":"Understanding Dementia","description":"4 units of interactive presentations: What is Dementia?; Defining Alzheimer's Disease; The Philosophy of Dementia Care; Working With Patients’ Families. This module includes learning outcomes and lesson summary topics.","topics":["Understanding Dementia - Learning Outcomes","What is Dementia?","Defining Alzheimer's Disease","The Philosophy of Dementia Care","Working With Patients’ Families","Understanding Dementia - Lesson Summary"]},{"name":"Module","details":"Working with Clients with Dementia","description":"3 units of interactive presentations: Communicating with Clients with Dementia; Behavior Traits of Clients with Dementia; Planning Activities for Clients with Dementia. This module includes learning outcomes and lesson summary topics.","topics":["Working with Clients with Dementia - Learning Outcomes","Communicating with Clients with Dementia","Behavior Traits of Clients with Dementia","Planning Activities for Clients with Dementia","Working with Clients with Dementia - Lesson Summary"]},{"name":"Module","details":"How Ageing Effects the Body","description":"4 units of interactive presentations: Human Body (Heart, Lungs, Brain and Nervous System); Human Body (Skin and Bones); Human Body (Stomach, Intestines, Kidneys and Bladder); Human Body (Immune System, Diabetes and Senses). This module includes learning outcomes and lesson summary topics.","topics":["How Ageing Effects the Body - Learning Outcomes","Human Body: Skin & Bones","Human Body: Stomach, Intestines, Kidneys & Bladder","Human Body: Immune System, Diabetes & Senses","Human Body: Heart, Lungs, Brain & Nervous System","How Ageing Affects the Body - Lesson Summary"]},{"name":"Module","details":"Traumatic Injuries & Preparing for Death","description":"4 units of interactive presentations: Spinal Cord Injuries and Paralysis; Traumatic Brain Injuries and Strokes; Emotional Impact of Disease and Traumatic Injuries; Preparing for Death. This module includes learning outcomes and lesson summary topics.","topics":["Traumatic Injuries & Preparing for Death - Learning Outcomes","Spinal Cord Injuries & Paralysis","Emotional Impact of Disease & Traumatic Injuries","Preparing for Death","Traumatic Brain Injuries & Strokes","Traumatic Injuries & Preparing for Death - Lesson Summary"]},{"name":"Module","details":"Diploma in Caregiving - Second Assessment","description":"This assessment will test your knowledge of the following modules from the Diploma in Caregiving course: Module 6: Understanding Dementia; Module 7: Working with Clients with Dementia; Module 8: How Aging Affects the Body; Module 9: Traumatic Injuries & Preparing for Death. You can repeat this assessment in order to pass it.","topics":["Diploma in Caregiving - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Caregiving - End of Course Assessment"]}]}