{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1260","title":"Diploma in Workplace Safety and Health","totalEnrolled":"107,735","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to ensure a safe and productive workplace for your employees with this free workplace health and safety course","description":"With this free online course in workplace safety and health, you and your supervisors and managers will learn how to develop a culture of safety among employees, along with higher productivity and greater employee satisfaction. This is essential for modern businesses that need to implement workplace safety and health policies to ensure compliance with legislation, promote employee well-being, and foster a productive work environment.","courseOutcomes":["Explain the purpose of a behavior-ba...","Distinguish between the roles and re...","Identify factors that can cause inci...","Explain the concept of workstation e...","Explain the purpose of a behavior-based safety program","Distinguish between the roles and responsibilities of a supervisor and an employee","Identify factors that can cause incidents","Explain the concept of workstation ergonomics concerning people and their work","Describe how to prevent back injury problems in the workplace","Recognize the signs of drug use and how to deal with someone you suspect is under the influence of alcohol or other drugs","Explain health and safety legislation in schools, as well as specific duties and responsibilities","Describe how to prepare for an emergency, how to report accidents and create a safety statement","Explain the roles of safety representatives and a safety committee within the school system","Explain the purpose of a behavior-ba...","Distinguish between the roles and re...","Identify factors that can cause inci...","Explain the concept of workstation e...","Explain the purpose of a behavior-based safety program","Distinguish between the roles and responsibilities of a supervisor and an employee","Identify factors that can cause incidents","Explain the concept of workstation ergonomics concerning people and their work","Describe how to prevent back injury problems in the workplace","Recognize the signs of drug use and how to deal with someone you suspect is under the influence of alcohol or other drugs","Explain health and safety legislation in schools, as well as specific duties and responsibilities","Describe how to prepare for an emergency, how to report accidents and create a safety statement","Explain the roles of safety representatives and a safety committee within the school system"],"courseDescription":"<p>This workplace safety course begins by introducing you to behavior-based safety and how to develop a culture of safety among employees. You will learn how to recognize the signs of drug use and how to implement workplace policies to maintain a drug-free workplace. The lessons will also cover workstation ergonomics where you will learn tips and techniques on maintaining good posture at workstations. This will ensure long-term comfort and back safety for all concerned.<br><br>As you progress with the course, you will gain a thorough understanding of key safety aspects such as risk analysis, hazard identification and control, and safety education and training. We will also make sure that you learn best practice policies for the implementation of effective safety programs. To provide a better overview of these lessons, we will also take a case study that focuses on the management of health and safety in schools.<br><br>Sometimes, people panic when emergencies at work arise. But if you have an in-depth knowledge of the important aspects of workplace safety and health, then this panic can be averted. This is why the Diploma in Workplace Safety and Health is crucial for anyone wishing to attain certification or gain a greater understanding of health and safety management. So check out the free online course and create a better environment in your workplace now.</p><a href=\"https://alison.com/resume/courses/1260\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1260\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Basics of Behaviour Based Safety","description":"In this module, you are given an introduction to behaviour based safety. You will learn what behaviour is and what is involved in behaviour based safety. You will also learn how a behaviour based safety programme forms part of a wider safety culture.","topics":["The Basics of Behaviour Based Safety - Learning Outcomes","Introduction to Behaviour Based Safety","Safety Cultures and The Safety Cycle","The Basics of Behaviour Based Safety - Lesson Summary"]},{"name":"Module","details":"The Team and Behaviour Based Safety","description":"In this module, you will learn about the roles and responsibilities of the supervisor and employee when it comes to behaviour based safety. You will learn about factors that cause incidents and influence behaviour and about the importance of observing behaviour. You will discover how effective reinforcement and motivational techniques encourage good behaviour. You will learn how transactional analysis can be a useful tool for supervisors and team leaders.","topics":["The Team and Behaviour Based Safety - Learning Outcomes","Your Role as a Supervisor or Team Leader","Understanding Your Team and Its Behaviour","Motivating Your Team","The Team and Behaviour Based Safety - Lesson Summary"]},{"name":"Module","details":"Diploma in Workplace Safety and Health - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Workplace Safety and Health - First Assessment"]},{"name":"Module","details":"Introducing Workstation Ergonomics","description":"In this module, you will be introduced to ergonomics, and to the factors affecting workstation ergonomics. This module will explain what ergonomics is and how it can be used to improve the way you use your computer workstation. BY studying this module, you will be able to identify the key factors that affect workstation ergonomics.","topics":["Introducing Workstation Ergonomics - Learning Outcomes","Introduction to Ergonomics","Factors Affecting Workstation Ergonomics","Introducing Workstation Ergonomics - Lesson Summary"]},{"name":"Module","details":"Designing an Ergonomic Workstation","description":"In this module, you will learn about using a visual display unit (VDU) and other equipment. You will be able to recognise the key factors for effective VDU use and you will also learn to identify the types of equipment that can create an ergonomic workstation.","topics":["Designing an Ergonomic Workstation - Learning Outcomes","Using a VDU Effectively","Equipment for an Ergonomic Workstation","Designing an Ergonomic Workstation - Lesson Summary"]},{"name":"Module","details":"Physical and Environmental Ergonomic Factors","description":"In this module, you will learn about the physical and environmental factors affecting workstation ergonomics. You will be able recognise the physical and environmental factors that impact on an ergonomic workstation. This module presents a case study concerning ergonomic workstation design which will help you learn to choose appropriate solutions to ergonomic problems in a workplace.","topics":["Physical and Environmental Ergonomic Factors - Learning Outcomes","Physical Ergonomic Factors","Environmental Ergonomic Factors","Case Study – Ergonomics","Physical and Environmental Ergonomic Factors - Lesson Summary"]},{"name":"Module","details":"Musculoskeletal Disorders (MSDs)","description":"In this module , you will learn about recognizing and preventing MSDs. This module also features a case study concerning the prevention of MSDs in the workplace which will allow you to examine a realistic situation in the workplace. You will learn to choose appropriate solutions to prevent MSDs in the workplace.","topics":["Musculoskeletal Disorders (MSDs) - Learning Outcomes","Recognizing Musculoskeletal Disorders (MSDs)","Preventing Musculoskeletal Disorders (MSDs)","Case Study - Musculoskeletal Disorders (MSDs)","Musculoskeletal Disorders (MSDs) - Lesson Summary"]},{"name":"Module","details":"Diploma in Workplace Safety and Health - Second Assessment","description":"You must score 80% or more in this assessment.","topics":["Diploma in Workplace Safety and Health - Second Assessment"]},{"name":"Module","details":"The Basics of Back Safety","description":"In this module, you will learn about how back injury problems can occur in the workplace. This module will teach you about how ergonomics can reduce back injuries. Discover job-specific hazards and different types of control.","topics":["The Basics of Back Safety - Learning Outcomes","Back Safety - The Basics","Taking Care of Your Back","Minimising the Risks","The Basics of Back Safety - Lesson Summary"]},{"name":"Module","details":"Diploma in Workplace Safety and Health - Third Assessment","description":"You must score 80% or more to pass this statement.","topics":["Diploma in Workplace Safety and Health - Third Assessment"]},{"name":"Module","details":"Promoting a Drug-Free Workplace","description":"In this module, you will learn about the signs of drug misuse at work and how drug use can impact on business. Find out how to recognise the stages of addiction and about the most commonly used drugs and learn about the benefits of a drugs misuse policy and the importance of education.","topics":["Promoting a Drug-Free Workplace - Learning Outcomes","Drugs and the Workplace","Promoting a Drug-Free Workplace - Lesson Summary"]},{"name":"Module","details":"Diploma in Workplace Safety and Health - Fourth Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Workplace Safety and Health - Fourth Assessment"]},{"name":"Module","details":"Introduction to Safety and Health Legislation and General Duties","description":"This module will introduce you to the legislation that is in place to protect children in school. You will learn about the general duties that must be carried out to guarantee the safety of students.","topics":["Introduction to Safety and Health Legislation and General Duties - Learning Outcomes","Safety and Health Legislation","Duties and Responsibilities","Safety Statement","Introduction to Safety and Health Legislation and General Duties - Lesson Summary"]},{"name":"Module","details":"Risk Assessment","description":"In this module, you will learn about identifying hazards and assessing risks within a school. You will also learn about putting measures in place to reduce or eliminate these risks.","topics":["Risk Assessment - Learning Outcomes","What is a Hazard?","Types of Hazards","What is Risk?","Measuring Risk","Assessing Risk","Controls","Working Safely","Risk Assessment - Lesson Summary"]},{"name":"Module","details":"Emergency Planning, Reporting Accidents/Dangerous Occurrences","description":"In this module, you will learn about planning for emergencies and how to prepare and reaction to accidents. You will also learn how to report accidents.","topics":["Emergency Planning, Reporting Accidents/Dangerous Occurrences - Learning Outcomes","Emergency Planning","Accidents and Dangerous Occurences","An Accident Report Scenario","Emergency Planning, Reporting Accidents/Dangerous Occurrences - Lesson Summary"]},{"name":"Module","details":"Safety and Health Management System","description":"In this module, you will learn about the key elements of a Safety and Health Management System. You will also learn about the role of a safety committee and the main entitlements of a safety representative.","topics":["Safety and Health Management System - Learning Outcomes","Safety and Health Management","Safety Committee","Safety and Health Management System - Lesson Summary"]},{"name":"Module","details":"Diploma in Workplace Safety and Health - Fifth Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Workplace Safety and Health - Fifth Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Workplace Safety and Health - Final Assessment"]}]}