{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1240","title":"Diploma in Health Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about important global issues affecting diet, nutrition, and women's health with this free online course.","description":"This free online Diploma in Health Studies course will give you a comprehensive understanding of diet and nutrition, important global health-related subjects, and their impacts worldwide. With poor health and diet issues continuing to affect millions of people around the world, this knowledge can be of great assistance to you and the people you care about. So, enrol today and learn about something really meaningful in just a few short hours.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This health studies course will give you a clearer understanding of healthcare and global health practices. You will first learn about macronutrients such as carbohydrates, proteins, and fats as well as the various minerals that the body needs. Here, you gain a strong understanding of what these nutrients are and where they come from. You will also study the dietary needs of an individual and the recommended ratio of fats, carbohydrates, and proteins in a healthy diet.<br><br>Next, you will learn about the process and stages of human development, the factors that affect it over a lifetime, and how it is measured. You will also study how family and community resources affect the development of an individual over their lifetime. The course will then discuss global health issues, including HIV and AIDS and the common misconceptions about these diseases.<br><br>By taking this free health studies course, you will gain a much stronger understanding of the considerations you need to make when deciding what to eat. This simple course is ideal for students, health professionals and volunteers, those involved in community work, and for anyone with an interest in global health issues. They say that you are what you eat. Check out this course today, and learn how to improve your health in no time.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}