{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5048","title":"Diploma in Dual Diagnosis Treatment","totalEnrolled":"1,067","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the impact and treatments of a combination of substance abuse and mental disorders in this free online course.","description":"‘Dual diagnosis’ is a condition where mental disorders and substance abuse problems simultaneously appear. Also referred to as ‘co-occurring disorders’ (COD), this condition can severely impact the mental health of those affected. It is therefore prudent to understand such a dual diagnosis and how to deal with it. This course outlines the symptoms, impacts and treatments of dual diagnosis and trains you to help the community.","courseOutcomes":["Discuss the menace of drug abuse and...","Describe addiction and related menta...","Identify multiple psychological, soc...","Outline the best models, tools and i...","Discuss the menace of drug abuse and its various side effects","Describe addiction and related mental and physical health issues in detail","Identify multiple psychological, social, cultural and behavioural causes of substance abuse","Outline the best models, tools and interventions for treating substance abuse and related mental conditions","Indicate various psychological, medical, socio-cultural and behavioural approaches and therapies in treating substance abuse and mental health","Summarise the key findings of neuroplasticity, epigenetics and neurophysiology for overcoming addictions and mental health issues","Discuss how each dynamic of life is needed to be built into training and recovering from substance abuse","Recognise skills to deliver brief and early interventions to people struggling with substance abuse and mental health issues","Discuss the menace of drug abuse and...","Describe addiction and related menta...","Identify multiple psychological, soc...","Outline the best models, tools and i...","Discuss the menace of drug abuse and its various side effects","Describe addiction and related mental and physical health issues in detail","Identify multiple psychological, social, cultural and behavioural causes of substance abuse","Outline the best models, tools and interventions for treating substance abuse and related mental conditions","Indicate various psychological, medical, socio-cultural and behavioural approaches and therapies in treating substance abuse and mental health","Summarise the key findings of neuroplasticity, epigenetics and neurophysiology for overcoming addictions and mental health issues","Discuss how each dynamic of life is needed to be built into training and recovering from substance abuse","Recognise skills to deliver brief and early interventions to people struggling with substance abuse and mental health issues"],"courseDescription":"<p>Across the medical world, it has been established that addiction and mental issues often accompany and affect each other. This pathology of dual diagnosis poses a further challenge for those working or looking to work in addiction and addictive disorders. We have developed this course with the support of many in the industry and it is a perfect choice for stakeholders involved in substance abuse intervention. This course has practical-oriented training workshops which will help develop your skills to deliver the early intervention necessary for those struggling with substance abuse and mental health issues. It is an impactful, satisfying career.</p><p>With its practical dual diagnosis training, we have divided this course into different modules. It covers all the current evidence-based best practices for treating and managing all alcohol, drugs (AOD) and mental health-related addiction issues through an integrated, holistic framework. In this training, you will hear personal journeys through trauma and experience how people work through them and generate hope. As you embark on this journey, you will realise the underlying issues that drive addictive behaviour, understand the best interventions and recognise the tools and approaches required to help others, whether family members, friends or the public.</p><p>The course best suits anybody who wants to learn how to intervene with loved ones using alcohol and drugs and bring change in their life. It also caters to healthcare practitioners, social workers, therapists, counsellors and clinicians who want to update their skills in evidence-based best practices from an integrative holistic approach. It also suits those who wish to make a career in social work, counselling, therapy or support groups. If you want to make a difference in your community and believe in the value of human life and humanity, this course is for you. Join today and get ready to make an impact.</p><a href=\"https://alison.com/resume/courses/5048\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5048\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Drug Abuse and it's Effects","description":"This module is the foundation of this program and covers in detail the drugs, their effects and how it impacts the psycho-social functioning of a person. You will also look at the cycle of addiction and how people progress from experimentation to full-blown addiction and realise the risks and consequences.","topics":["Drug abuse and its Effects – Learning Outcomes","Understanding Substance Abuse, Addictions and Mental Health","Alcohol, Tobacco, Drink and Drug driving","Stimulants and community Development Response","Drug abuse and its Effects - Lesson Summary"]},{"name":"Module","details":"Addictions and Mental Health","description":"Go deep into the subject of dual diagnosis. Explore addiction and its relations with mental health issues. Understand what mental health issues are, what they look like, and how they develop. Recognise underlying issues that predispose people towards addictive behaviour and learn the mechanism behind the brain system veering towards addiction.","topics":["Addictions and Mental Health - Learning Outcomes","Interventions and Psycho Spirituality","Understanding Human Behaviour and the Driving Factors","Pleasure Unwoven and Principles of the Brain","Addictions and Mental Health - Lesson Summary"]},{"name":"Module","details":"Harm Minimisation and Optimal Health","description":"This module introduces you to the bigger picture in the fight against drug abuse and mental health. You learn about the best harm minimisation strategies and understand the benefit of optimal health for smooth brain functioning and how to use it as a tool and resource to create healthy individuals and communities.","topics":["Harm Minimisation and Optimal Health – Learning Outcomes","Ottawa charter, Drug Strategic Framework and Pharmacotherapies","Orthomolecular Science and Functional Medicine","Maintaining optimal Health","Harm Minimisation and Optimal Health - Lesson Summary","Diploma in Dual Diagnosis Treatment - Assessment 1"]},{"name":"Module","details":"Brain Works and Neurophysiology","description":"This module looks at how the brain works, the neurophysiology behind this, and how to optimise brain functions. The subjects are described through the path-breaking work of Dr. Carolyn Leaf on brain cells and memory building, Dr. McCauley's work on reward pathways, Dr. Ross on psychosis vs dissociation, and Dr. Amen’s on integrative psychiatry.","topics":["Brain Works and Neurophysiology – Learning Outcomes","Brain works – Neurophysiology","Psychosis vs Dissociation and Library of Science","Orthomolecular Science and Integrative Psychiatry","Brain Works and Neurophysiology - Lesson Summary"]},{"name":"Module","details":"Keys to Healing, Intervention and Tripod of Support","description":"In this module, unpack and work through some common themes and issues that people with dual diagnosis have to tackle and work through. Learn to apply those principles of healing to yourself and to those you care about. You will also look at brief and early interventions and set up a tripod of support for people you care about.","topics":["Keys to Healing, Intervention and Tripod of Support– Learning Outcomes","Underlying Issues that causes Anger","Dealing with Ambivalence and Internal Conflict","Negative Thinking, Neuroplasticity and Cross Cultural Issues","Intervention and Tripod of Support","Keys to Healing, Intervention and Tripod of Support - Lesson Summary","Diploma in Dual Diagnosis Treatment - Assessment 2"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Dual Diagnosis Treatment - Course Assessment"]}]}