{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1469","title":"Diploma in Occupational Hygiene","totalEnrolled":"12,381","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the best practices for ensuring occupational hygiene in the workplace and community, with this free health course.","description":"This free online Diploma in Occupational Hygiene course will teach you the processes behind anticipating, recognizing, evaluating, and controlling health hazards in the work environment. This will help you protect workers' health and well-being and safeguard the community at large. You will learn important topics on health hazards, toxicology, biological hazards, the thermal environment, how to ensure a healthy workplace environment, and more.","courseOutcomes":["Explain the functions of occupationa...","Identify examples of hazardous subst...","Explain the process of assessing hea...","Describe the types of air cleaning d...","Explain the functions of occupational hygiene","Identify examples of hazardous substances","Explain the process of assessing health risks","Describe the types of air cleaning devices","List the three physical states of matter","Define the process for sampling airborne particulates, gases, and vapours","Explain the three main categories of biological agents and the differences between them","Explain the psychological responses to the thermal environment","List the various types of non-ionising and ionising radiation","Explain how occupational hygiene affects your personal development","Explain the functions of occupationa...","Identify examples of hazardous subst...","Explain the process of assessing hea...","Describe the types of air cleaning d...","Explain the functions of occupational hygiene","Identify examples of hazardous substances","Explain the process of assessing health risks","Describe the types of air cleaning devices","List the three physical states of matter","Define the process for sampling airborne particulates, gases, and vapours","Explain the three main categories of biological agents and the differences between them","Explain the psychological responses to the thermal environment","List the various types of non-ionising and ionising radiation","Explain how occupational hygiene affects your personal development"],"courseDescription":"<p>The skin is the largest organ of the body and is made up of multiple layers of epithelial tissues, and guards the underlying muscles, bones, and internal organs. This course will teach you how different parts of the body are at risk of developing health issues due to inadequate occupational hygiene. You will learn how toxins enter the body as well as study the general approaches used to control health risks. You will also learn the most effective types of control measures used to prevent exposure to hazardous agents.<br><br>A fundamental difference between chemical and biological hazards is that biological agents, whether bacteria, viruses, or molds, have the ability in the right conditions to rapidly replicate themselves. This course will teach you about biological hazards and how chemical and biological agents can be harmful to you. You will study noise and vibrations, thermal environment, and workplace environment. You will learn how to carry out a behavioral intervention to ensure a safe working environment. In addition, you will look into careers that are associated with occupational hygiene.<br><br>The increase in industrial activities has been driving more and more employees to become exposed to hazards in the workplace. This is why it is important to know how to monitor and assess different hazards to ensure their health and safety. Taking this course will help you understand human physiology and industrial diseases. You will also learn about the fundamentals of toxicology and hazardous substances, and more! So check out this course today, and start enriching your knowledge about occupational hygiene, health and safety, and workplace safety.</p><a href=\"https://alison.com/resume/courses/1469\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1469\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Human Physiology and Industrial Diseases","description":"In this module you will learn about occupational hygiene and why it is important to recognise health hazards in the work place. You will learn the history of occupational hygiene and how different parts of the body are at risk of developing health risks due to inadequate occupational hygiene.","topics":["Human Physiology and Industrial Diseases - Learning Outcomes","Introduction to Occupational Hygiene","The Human Body – Part I","The Human Body - Part II","Human Physiology and Industrial Diseases - Lesson Summary"]},{"name":"Module","details":"Introduction to Toxicology","description":"In this module you will learn about toxicology and the three main entry routes that allow toxins to enter the body. You will learn about examples of hazardous substances and how to assess health risks in a workplace.","topics":["Toxicology and Health Risks - Learning Outcomes","Fundamentals of Toxicology","Hazardous Substances/Processes","Assessment of Health Risks","Toxicology and Health Risks - Lesson Summary"]},{"name":"Module","details":"Measurements, Monitoring, and Health Standards","description":"In this module, you will learn about the three physical states of matter. You will learn about different sampling techniques undertaken to measure airborne contaminants and the equipment used for this sampling. This module will give you information hygiene standards for chemical agents and the effects of exposure to certain parts of the body. You will also learn about biological monitoring and health surveillance and the reasons why they should be implemented in the workplace.","topics":["Measurements, Monitoring, and Health Standards -  Learning Outcomes","Measurement of Airborne Contaminants – Part I","Measurement of Airborne Contaminants – Part II","Measurement of Airborne Contaminants – Part III","Hygiene Standards and Occupational Exposure Limits","Biological Monitoring and Health Surveillance","Measurements, Monitoring, and Health Standards - Lesson Summary"]},{"name":"Module","details":"Controlling Risks to Health","description":"In this module you will learn about the general approaches to the control of risks to health and the most effective type of control measures to use in order to prevent exposure to hazardous agents. You will learn about the important features of ventilation and general principles associated with their design. This module will also present you with information on asbestos, including types of asbestos, and the harm it can cause to the human body.","topics":["Controlling Risks of Health in Occupational Hygiene - Learning Outcomes","General Approaches to Control Health Risks","Ventilation – Part I","Ventilation – Part II","Asbestos","Controlling Risks of Health in Occupational Hygiene - Lesson Summary"]},{"name":"Module","details":"Diploma in Occupational Hygiene - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Occupational Hygiene - First Assessment"]},{"name":"Module","details":"Biological Hazards, Noise and Vibration","description":"In this module, you will learn about biological hazards and how chemical and biological agents can be harmful to you. You will also learn about how to control the level of noise and vibrations that you associate with to prevent you from excessive exposure to them.","topics":["Biological Hazards, Noise, and Vibration - Learning Outcomes","Biological Hazards – Part I","Biological Hazards – Part II","Noise and Vibration – Part I","Noise and Vibration – Part II","Biological Hazards, Noise, and Vibration - Lesson Summary"]},{"name":"Module","details":"Thermal Environment, Ionization, and Ergonomics","description":"In this module, you will be introduced to the way human bodies can react to the thermal environment and how to maintain a healthy workplace environment. This module will also give you information on ionising and non-ionising radiation and their attributes. You will also learn about ergonomics and the areas of the body that are affected from unsafe manual handling.","topics":["Thermal Environment, Ionising, and Ergonomics - Learning Outcomes","Thermal Environment: Principles, Evaluation, and Control – Part I","Thermal Environment: Principles, Evaluation, and Control – Part II","Lighting and Non-Ionising Radiation","Ionising Radiation","Ergonomics","Thermal Environment, Ionising, and Ergonomics - Lesson Summary"]},{"name":"Module","details":"Working in Occupational Hygiene","description":"In this module you will learn about how your behaviour and culture can affect the workplace in occupational hygiene. You will learn the steps that are necessary to carry out a behavioural intervention to ensure a safe working environment. This module will give you information on work-related stress, what causes this stress and how to manage it. Finally, this module will inform you on careers that are associated with occupational hygiene.","topics":["Working in Occupational Hygiene - Learning Outcomes","Behaviour and Culture","Work-Related Stress","Careers in Occupational Hygiene - Part I","Careers in Occupational Hygiene - Part II","Working in Occupational Hygiene - Lesson Summary"]},{"name":"Module","details":"Diploma in Occupational Hygiene - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Occupational Hygiene - Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Occupational Hygiene - Final Assessment"]}]}