{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3315","title":"Diploma in Firefighting and Shipboard Safety","totalEnrolled":"1,720","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you about the principles of shipboard safety and fighting fires on ships.","description":"This free online course discusses different aspects of shipboard safety relevant to crew members, managers, owners and other stakeholders in the maritime industry. It also broadly analyzes crucial elements of successful firefighting techniques on board different watercraft. A combined understanding of the aspects and elements discussed in this course is crucial to the success of safe sea transportation. Begin your learning journey today!","courseOutcomes":["Recall the objective of conducting d...","Relate the shipmaster, officers, and...","Outline shipboard emergency alarms a...","List the necessary chemical elements...","Recall the objective of conducting drills for emergencies","Relate the shipmaster, officers, and the night order book to keeping a proper night lookout","Outline shipboard emergency alarms and signals required on board","List the necessary chemical elements required for a fire to take place","Identify the firefighting strategies and procedures for combating shipboard fires","Explain fixed firefighting systems on board ships and their usage","Discuss the relevance of different approvals from coast guard publications in preventing fires on smaller vessels","Recall the objective of conducting d...","Relate the shipmaster, officers, and...","Outline shipboard emergency alarms a...","List the necessary chemical elements...","Recall the objective of conducting drills for emergencies","Relate the shipmaster, officers, and the night order book to keeping a proper night lookout","Outline shipboard emergency alarms and signals required on board","List the necessary chemical elements required for a fire to take place","Identify the firefighting strategies and procedures for combating shipboard fires","Explain fixed firefighting systems on board ships and their usage","Discuss the relevance of different approvals from coast guard publications in preventing fires on smaller vessels"],"courseDescription":"<p>It is estimated that more than 50% of packed goods and bulk cargoes transported by sea today can be regarded as dangerous, hazardous or harmful to the Earth’s environment. The cargoes concerned include products that are transported in bulk, such as solid or liquid chemicals, and other types of materials. Gases and products for and from the oil-refining industry and their wastes also belong to this harmful category. According to records, between 10% and 15% of cargoes transported in packed form, including shipborne barges on barge-carrying ships, are considered harmful transport goods. Freight containers, bulk packaging, portable tanks, tank-containers, intermediate bulk containers, unit loads and other cargo transport units fall under this criterion as well. This course seeks to explore the standardized concepts of shipboard safety involved in transporting these harmful materials across the sea. Furthermore, the course explains the workings of different shipboard equipment in managing the successful stowage of such hazardous materials on board different watercraft. Also, the course identifies the hazardous areas of shipboard work and various safe work practices to be adhered to while working on board ships.</p><p>Ships are known to be dangerous and regularly feature in the local newspapers for spilling oil, running aground or creating a collision. But this is the bigger picture. Behind this are people who are working 24/7 to successfully take these monsters across the oceans with million-dollar cargoes on board. Combating storms, piracy and being alone as a tiny spec in the vast ocean are the main dangers crew members face. Fewer than 30 people are on board such dangerous watercraft. This includes people of different cultural groups who speak different languages and come with varying skills and levels of education. This is the reason why more than 80% or more of all accidents happen – due to human error. &nbsp;The “human element” is a popular discussion point among shippers, mariners and other maritime stakeholders trying to explain why we behave in a particular manner during hazardous situations on board ships. Furthermore, this has motivated the need to be prepared for fires and other emergencies, while always trying to follow correct work procedures that may prevent such occurrences.</p><p>This course from Alison is designed to discuss different aspects of shipboard safety relevant to stakeholders in the maritime industry. It broadly analyzes crucial elements of successful firefighting techniques on board different watercraft before, during and after voyages. A combined understanding of the aspects and elements discussed in this course is crucial for the success of maritime safety for all. Workers in specialized companies dealing in shipping businesses will learn discipline and proper organization for ship safety. Therefore, students, mariners, maritime enthusiasts and anyone interested in learning about shipboard safety cannot afford to miss this course. Passengers and other interested individuals who care about preserving lives and property in transit have real-life case studies to learn from in this course. Those who work for agencies that are responsible for overseeing legislation and conventions related to maritime transport would also benefit from taking this course. Register for this course today to improve your understanding of firefighting and shipboard safety.</p><a href=\"https://alison.com/resume/courses/3315\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3315\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"General Safety","description":"In this module, you will learn about different precautions and necessary methods for ensuring the general safety of the crew members, cargo, and ships against dangers on voyages. You will also learn about emergency procedures, hazardous areas in ships, and procedures for working on ship decks during bad weather.","topics":["General Safety - Learning Outcomes","Introduction to General Safety","Hazardous Area in Ships and Safe Working Practice","Emergency Procedures - Entering Enclosed or Confined Spaces","Lifting Heavy Loads and Handling Tools","Working on the Deck and Bad Weather","Working with Electrical Equipment","Ship Specific Hazards and Water Transportation","General Safety - Lesson Summary"]},{"name":"Module","details":"Observing Safe Working Practices","description":"In this module, you will learn about the importance of adhering to safe working practices relevant to shipboard safety. You will also learn how best to handle shipboard hazards alongside the implementation of job safety planning.","topics":["Observing Safe Working Practices - Learning Outcomes","Introduction to Safe Working Practices","Controlling Shipboard Hazards","Electrical Hazards","Chemicals","Areas of Entrapment - Tanks and Confined Spaces","Pre-Job Safety Planning","Occupational Safety and Health Hazards","Observing Safe Working Practices - Lesson Summary"]},{"name":"Module","details":"Value of Training and Drills","description":"In this module, you will learn about safety drills being part of standard emergency preparations including appropriate ways of organizing such safety drills for best results. You will also learn about the functionalities of SCRBs, EPIRB, and SART in different shipboard situations.","topics":["Value of Training and Drills - Learning Outcomes","Introduction to Value of Training and Drills","Examining Value of Training and Drills","Abandon Ship Drills","Value of Training and Drills - Lesson Summary"]},{"name":"Module","details":"Hazardous Materials","description":"In this module, you will learn about the IMDG code used in transporting hazardous materials together with the implementation of US laws for the transportation of such materials. You will also learn about the requirements for towing hazardous cargoes on tugs and barges.","topics":["Hazardous Materials - Learning Outcomes","Introduction to Hazardous Materials","Labelling","Hazardous Materials Carried on Tugboats","Hazardous Materials - Lesson Summary"]},{"name":"Module","details":"Communications","description":"Learn about the different modes of communications used on board ships alongside the basic communication devices for shipboard use. Also, learn about techniques covering proper listening, speaking, writing, as well as barriers to these techniques.","topics":["Communications - Learning Outcomes","Introduction to Communications","Barriers to Effective Communications","Ship Operations, Ship Systems, and Emergency Situations","Guidelines for Report Writing","Cultural Diversity and Communications","Effective Communication Processes","Importance of Feedback","Communications - Lesson Summary"]},{"name":"Module","details":"On Board Interactions","description":"Learn about different forms of effective interactions between shipboard personnel for a smooth voyage on sea. You will also learn about instructions, correct language use, and specific communication between special personnel.","topics":["On Board Interactions - Learning Outcomes","Introduction to On Board Interactions","Communication Prior To Departure","Communication Techniques","Understanding Cognitive Brain Functioning","Five Cs of Communication","On Board Interactions - Lesson Summary"]},{"name":"Module","details":"Diploma in Firefighting and Shipboard Safety - First Assessment","description":"You must score 80% or more to pass this assessment. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["First Assessment"]},{"name":"Module","details":"Emergency Equipment","description":"Learn about different ship alarms and signals covering on board emergency situations. Also, learn about the applications and purposes of signalling equipment alongside those of different personal protective equipment used by maritime stakeholders.","topics":["Emergency Equipment - Learning Outcomes","Introduction to Emergency Equipment","Emergency Alarms and Signals","Signaling Equipment and Pyrotechnics","Personal Protective Equipment: Utilization and Purpose","Emergency Equipment - Lesson Summary"]},{"name":"Module","details":"Life Saving Appliances (LSA)","description":"Learn about life-saving appliances used in ensuring the survival of staff, craft, boats, and the ship itself in different emergencies. Also, get to discuss rescue operations and techniques covering the fundamental principles of survival.","topics":["Life Saving Appliances (LSA)  - Learning Outcomes","Introduction to Life Saving Appliances (LSA)","Launching Appliances and Arrangements","Life Raft Launching Appliances","GMDSS Radio Systems","Operation of Survival Craft and Rescue Boats","Rescue Operation and Techniques","Life Saving Appliances (LSA)  - Lesson Summary"]},{"name":"Module","details":"Fire Prevention","description":"Learn about the protection of watercraft against fires before, during, and after voyages. You will also learn about the importance of crew education in protecting against large fires affecting ships, cargoes, equipment, and crew on board.","topics":["Fire Prevention - Learning Outcomes","Introduction to Fire Prevention","Ship Construction Arrangement","Frequent Causes of Fire on Board","Fire Prevention Principles","Functions of Gas Measuring and Similar Instruments","Measurement of Oxygen Concentrations","Process of Permit, Entry, and Rescue","Fire Prevention - Lesson Summary"]},{"name":"Module","details":"Firefighting Equipment","description":"In this module, you will learn about firefighting equipment alongside fire detection systems on board ships with their respective alarms. You will also learn about portable fire extinguishing systems and high-expansion systems used in ship machinery spaces and pump rooms.","topics":["Firefighting Equipment - Learning Outcomes","Introduction to Firefighting Equipment","Portable Firefighting Appliances","Fixed Fire Extinguishing Systems","High-Expansion System for Machinery Spaces/Pump Rooms","Fire Pumps, Fire Hose, and Other Equipment","High and Low Velocity Fog","HALON and AFFF","Novec-1230","Dry Powder System","Firefighting Equipment - Lesson Summary"]},{"name":"Module","details":"Firefighting Equipment on Smaller Vessels","description":"This module introduces you to personal protective equipment for firefighting and the basic characteristics of outfits required by the SOLAS on board smaller vessels.","topics":["Firefighting Equipment on Smaller Vessels - Learning Outcomes","Firefighting Equipment on Smaller Vessels","Personal Protective Equipment for Firefighting","Breathing Apparatus","Operation and Maintenance of Firefighting Appliances and Equipment","Firefighting Equipment on Smaller Vessels - Lesson Summary"]},{"name":"Module","details":"Firefighting Principles","description":"You will be introduced to firefighting principles for small and extensive fires. Get to study the emergency signals on board ships along with the fire control plans and muster lists.","topics":["Learning Outcomes - Fire Fighting Principles","Introduction to Firefighting Principles","Fire Control Plan and Muster List","Personnel Safety Measures","Firefighting Drills","Firefighting Strategies and Procedures","Lesson Summary - Fire Fighting Principles"]},{"name":"Module","details":"Action in the Event of ER Fire","description":"You will be introduced to the concept of the source of ignition. You will learn how to prevent fires as well as the emergency actions to take in case of a fire outbreak in ship engine rooms.","topics":["Learning Outcomes – Action in the Event of ER Fire","Engine Room Fires","Fighting Fire in Machinery Space","Firefighting in Accommodation","Non-Cargo Space Fire on Deck","Lesson Summary - Action in the Event of ER Fire"]},{"name":"Module","details":"Diploma in Firefighting and Shipboard Safety - Second Assessment","description":"You must score 80% or more to pass this assessment. Remember, if you do not achieve the required standard after the first attempt, you can re-take the assessment until a successful outcome is achieved.","topics":["Second Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Firefighting and Shipboard Safety - Final Assessment"]}]}