{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1267","title":"Diploma in Human Nutrition","totalEnrolled":"135,289","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improving your overall health and wellness is easy with this free online health and nutrition course.","description":"This free online course in Human Nutrition is a comprehensive introduction to the role of nutrition in our growth and development throughout our lives. With the huge rise in diet-related illnesses such as obesity, type II diabetes, and cardiovascular disease, we face important choices in terms of food and nutrition on a daily basis. This course will help you make better choices that will ensure good health and wellness.","courseOutcomes":["Discuss the various nutrients that p...","Explain the functions of the human d...","Discuss in detail the various groups...","Outline three main types of amino ac...","Discuss the various nutrients that provide the essential components for our bodies","Explain the functions of the human digestive system","Discuss in detail the various groups of carbohydrates","Outline three main types of amino acids","Describe the process of protein synthesis, the levels of protein structure and the various protein functions","Discuss the roles fatty acids play as well as the eicosanoid compounds derived from fatty acids","Explain the various carbohydrate, lipid and protein metabolism pathways","List and describe various vitamins and minerals such as vitamin C, vitamin E and selenium","Describe the structure and functions of antioxidants","Discuss the various nutrients that p...","Explain the functions of the human d...","Discuss in detail the various groups...","Outline three main types of amino ac...","Discuss the various nutrients that provide the essential components for our bodies","Explain the functions of the human digestive system","Discuss in detail the various groups of carbohydrates","Outline three main types of amino acids","Describe the process of protein synthesis, the levels of protein structure and the various protein functions","Discuss the roles fatty acids play as well as the eicosanoid compounds derived from fatty acids","Explain the various carbohydrate, lipid and protein metabolism pathways","List and describe various vitamins and minerals such as vitamin C, vitamin E and selenium","Describe the structure and functions of antioxidants"],"courseDescription":"<p>There are three energy-yielding macronutrients that our bodies need to consume on a daily basis to maintain important functions such as growth and energy production. These are carbohydrates, proteins, and lipids. This human nutrition course online discusses these nutrients that provide the essential components for our bodies.<br><br>The human digestive system plays a complex and wonderful bodily function which will be covered in this human nutrition online course. You will also learn the various groups of carbohydrates, lipids, and proteins including their metabolic pathways and functions. The lessons will also cover the three main types of amino acids, the roles and the eicosanoid compounds derived from fatty acids, the various vitamins and minerals, and the structure and functions of antioxidants.<br><br>This Diploma course is rich with insights on human nutrition and the roles macronutrients and micronutrients play in maintaining good health. It will benefit health-conscious individuals and healthcare professionals who would like to learn more about how to live a healthier life. They say that you are what you eat, so take charge of your wellbeing today with this nutrition and human health online course.</p><a href=\"https://alison.com/resume/courses/1267\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1267\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Human Nutrition","description":"In this module, you will learn about different terms associated with nutrition. You will be introduced to different types of nutrients and how food energy is measured. You will also discover various non-nutritive compounds that provide health benefits.","topics":["Introduction to Human Nutrition - Learning Outcomes","The Basics of Human Nutrition","Calories and Food Energy","Phytochemicals, Zoochemicals and Functional Foods","Introduction to Human Nutrition - Lesson Summary"]},{"name":"Module","details":"Nutrition and Science Research","description":"This module will teach you about the various methods of nutrition research and about how research results are analysed, published and interpreted.","topics":["Nutrition and Science Research - Learning Outcomes","Epidemiology","In Vitro and Animal Studies","Clinical Trials","Nutrition Research Statistics and Publishing","Nutrition and Science Research - Lesson Summary"]},{"name":"Module","details":"Diploma in Human Nutrition - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Human Nutrition - First Assessment"]},{"name":"Module","details":"Introduction to the Human Digestive System","description":"In this module, you will learn about the human digestive system and the processes involved in digestion.The three main food types will be explained to you: Carbohydrates, Lipids and Protein. You will also learn about vitamins.","topics":["Introduction to the Human Digestive System - Learning Outcomes","Introduction to the Human Digestive System","The Energy Cycle","Food","Vitamins","Ingestion","Swallowing","Temporary Storage","Introduction to the Human Digestive System - Lesson Summary"]},{"name":"Module","details":"Digestion, Absorption, Elimination and Protection","description":"In this module, you will learn about how food is processed in the body through Digestion, Absorption, Elimination and Protection You will learn how waste materials are eliminated from the human body. You will also learn about the protection mechanisms of the digestive system.","topics":["Digestion, Absorption, Elimination and Protection - Learning Outcomes","Digestion","Absorption","Elimination","The Reticuloendothelial System","The Mammary Gland","Digestion, Absorption, Elimination and Protection - Lesson Summary"]},{"name":"Module","details":"Diploma in Human Nutrition - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Module 6: Diploma in Human Nutrition - Second Assessment"]},{"name":"Module","details":"Introduction to Carbohydrates","description":"In this module, you will learn about carbohydrates. You will be shown the formulas associated with carbohydrates and you will discover the different types of carbohydrates. Finally, you will be taught about alternative sweeteners and complex carbohydrates.","topics":["Introduction to Carbohydrates - Learning Outcomes","Introduction to Carbohydrates","Simple Carbohydrates","Alternative Sweeteners","Oligosaccharides and Polysaccharides","Introduction to Carbohydrates - Lesson Summary"]},{"name":"Module","details":"Introduction to Proteins","description":"In this module, you will learn about proteins, amino acids and their structures. You will learn about the process of protein synthesis.and about levels of protein structure and various protein functions.","topics":["Introduction to Proteins - Learning Outcomes","Amino Acids","Protein Synthesis, Structure and Functions","Protein Quality and Protein-Energy Malnutrition","Introduction to Proteins - Lesson Summary"]},{"name":"Module","details":"Introduction to Lipids","description":"This module will teach you all about lipids. You will be introduced to different fatty acids and the naming systems for fatty acids. You will learn about the food sources of fatty acids and about essential fatty acids and eicosanoids.","topics":["Introduction to Lipids - Learning Outcomes","Lipids and Fatty Acids","Fatty Acid Naming and Food Sources","Essential Fatty Acids and Eicosanoids","Phospholipids and Triglycerides","Sterols","Introduction to Lipids - Lesson Summary"]},{"name":"Module","details":"Diploma in Human Nutrition - Third Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Human Nutrition - Third Assessment"]},{"name":"Module","details":"Introduction to Macronutrient Metabolism","description":"In this module you will learn about metabolism, in specific the anabolic and catabolic processes and how they relate to metabolism. You will learn about oxidation and reduction and the two common co-factors and their functions.","topics":["Introduction to Macronutrient Metabolism - Learning Outcomes","Metabolism Basics","Cofactors","Introduction to Macronutrient Metabolism - Lesson Summary"]},{"name":"Module","details":"Carbohydrate Metabolism Pathways","description":"In this module, you will learn about monosaccharide metabolism and the processes glycogenesis and glycogenolysis. You will learn about glycolysis and the transition reaction. This module will also discuss the citric acid cycle and the electron transport chain. Anaerobic respiration is also covered.","topics":["Carbohydrate Metabolism Pathways - Learning Outcomes","Monosaccharide Metabolism","Glycogenesis and Glycogenolysis","Glycolysis","Transition Reaction","The Citric Acid Cycle","Electron Transport Chain","Aerobic Glucose Metabolism Totals and Anaerobic Respiration","Carbohydrate Metabolism Pathways - Lesson Summary"]},{"name":"Module","details":"Lipid Metabolism Pathways","description":"In this module, you will learn about lipolysis. You will learn about the process of fatty acid oxidation. This module also focuses on fatty acid synthesis, ketone synthesis and cholesterol synthesis.","topics":["Lipid Metabolism Pathways - Learning Outcomes","Lipolysis","Fatty Acid Oxidation","Fatty Acid Synthesis, Ketone Body Synthesis and Cholesterol Synthesis","Lipid Metabolism Pathways - Lesson Summary"]},{"name":"Module","details":"Protein Metabolism Pathways","description":"In this module, you will learn about different protein metabolism pathways. Transamination, deamination, gluconeogenesis and protein degradation are key processes that will be discussed.","topics":["Protein Metabolism Pathways - Learning Outcomes","Transamination and Deamination","Gluconeogenesis","Protein Turnover/Degradation","Protein Metabolism Pathways - Lesson Summary"]},{"name":"Module","details":"Diploma in Human Nutrition - Fourth Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Human Nutrition - Fourth Assessment"]},{"name":"Module","details":"Introduction to Vitamins and Minerals","description":"In this module, you will learn about vitamins and minerals. You will learn about different categories of minerals such as fat-soluble and water-soluble vitamins.You will also learn about the two schools of thought on how to cover vitamins and minerals in nutrition classes.","topics":["Introduction to Vitamins and Minerals - Learning Outcomes","Vitamins","Minerals","Introduction to Vitamins and Minerals - Lesson Summary"]},{"name":"Module","details":"Antioxidants","description":"In this module, you will learn about antioxidant minerals and vitamins. You will learn about free radicals, reactive oxygen species (ROS) and oxidative stress. You will learn about the components of antioxidant enzymes and the antioxidant network. You will also learn whether too much antioxidants can cause harm.","topics":["Antioxidants - Learning Outcomes","Introduction to Antioxidants","Free Radicals and Oxidative Stress","What is an Antioxidant?","Meaningful Antioxidants","Too Much Antioxidants A Good Thing?","Antioxidants - Lesson Summary"]},{"name":"Module","details":"Vitamin E","description":"In this module, you will learn about different forms of vitamin E. You will learn about vitamin E absorption, metabolism and excretion.Discover the food sources of vitamin E and vitamin E deficiency and toxicity. You will also learn about the dietary reference intake decisions and international units.","topics":["Vitamin E - Learning Outcomes","Introduction to Vitamin E","Alpha-Tocopherol - Natural vs. Synthetic","Vitamin E Absorption, Metabolism and Excretion","Dietary Vitamin E, Vitamin E Deficiency and Toxicity","Vitamin E DRI & IUs","Vitamin E - Lesson Summary"]},{"name":"Module","details":"Vitamin C","description":"In this module, you will learn about vitamin C absorption, transport, recycling and tissue accumulation. You will learn about the enzymatic functions of vitamin C and about vitamin C deficiency and toxicity. Linus Pauling's work relating to vitamin C will also be examined.","topics":["Vitamin C - Learning Outcomes","Introduction to Vitamin C","Vitamin C Absorption and Tissue Accumulation","Enzymatic Functions","Vitamin C Deficiency, Toxicity, Linus Pauling and the Common Cold","Vitamin C - Lesson Summary"]},{"name":"Module","details":"Selenium","description":"In this module, you will learn about different categories of selenium. You will learn about selenoproteins and their functions and about selenium absorption and excretion. You will also learn about selenium toxicity and selenium's questionable deficiency.","topics":["Selenium - Learning Outcomes","Selenium","Selenoproteins","Selenium Absorption, Excretion and Toxicity","Selenium - Lesson Summary"]},{"name":"Module","details":"Diploma in Human Nutrition - Fifth Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Human Nutrition - Fifth Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Human Nutrition - Final Assessment"]}]}