{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1250","title":"Diploma in Food Safety","totalEnrolled":"72,059","courseIncludes":["15-20 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Ensure proper staff hygiene and pest prevention with the food safety practices taught in this free online course.","description":"This free online food safety course will teach you proper food handling practices that will protect your food-service operation. As many as 582 million people experience food-borne diseases every year. Hence, food safety is extremely important to food-related businesses of any size. This course will ensure when working with food, you are able to prevent foodborne illness, contamination, allergic reactions and the spread of disease.","courseOutcomes":["Manage systems for good personal hyg...","Control food allergens and food haza...","Maintain an effective incident manag...","Explain the characteristics of poorl...","Manage systems for good personal hygiene","Control food allergens and food hazards within the business","Maintain an effective incident management system","Explain the characteristics of poorly constructed water wells","Design and operate a system to minimize the risk of pest-infestation in both product and facility","Follow safe practices in food preparation areas to avoid accidents","Understand the role and influence the manager has on the rest of the food safety operation team","Manage systems for good personal hyg...","Control food allergens and food haza...","Maintain an effective incident manag...","Explain the characteristics of poorl...","Manage systems for good personal hygiene","Control food allergens and food hazards within the business","Maintain an effective incident management system","Explain the characteristics of poorly constructed water wells","Design and operate a system to minimize the risk of pest-infestation in both product and facility","Follow safe practices in food preparation areas to avoid accidents","Understand the role and influence the manager has on the rest of the food safety operation team"],"courseDescription":"<p>This course will first introduce you to the principles behind good personal hygiene and its management. You will study the importance of water quality and learn about the regulations and customer requirements related to water quality, ice, and steam. The course will also cover the subject of pest control and product contamination control where you will learn corrective actions that need to be taken to minimize the risk of pest infestation.<br><br>You will then study the correct sanitization and personal cleanliness guidelines that should be followed by employees as well as how to put together a cleaning schedule. You will study food purchasing, receiving, storage, preparation, and sanitation and learn the causes and prevention of unsafe food, foodborne illnesses, and food service accidents. You will then study the role of management in the food-service industry and the \"lead by example\" concept. Finally, you will learn the importance of proper staff training as well as inspections for the consistency of sanitation standards.<br><br>Maintaining a top quality food business while ensuring unsurpassed hygiene is a big responsibility. By learning the best practices and procedures taught in this free online Diploma in Food Safety course, you will help ensure that you meet this responsibility. The course is specifically designed for aspiring food safety managers working in food processing plants, restaurants, and any food service operation, and aims to make learning about this important subject as clear as possible. Check out the course today, and bring your professional skills to the next level.</p><a href=\"https://alison.com/resume/courses/1250\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1250\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Personal Hygiene and Water Quality","description":"In this module, you will learn about the principles and reasons for good personal hygiene and how to manage systems for personal hygiene. The importance of reporting illnesses will be discussed. You will learn the importance of water quality as well as the regulations and customer requirements related to water quality, ice and steam. You will also learn about water wells and plumbing systems.","topics":["Introduction to Personal Hygiene and Water Quality - Learning Outcomes","Personal Hygiene - Part 1","Personal Hygiene - Part 2","Personal Hygiene - Part 3","Water Quality - Part 1","Water Quality - Part 2","Introduction to Personal Hygiene and Water Quality - Lesson Summary"]},{"name":"Module","details":"Introduction to Control Measures","description":"This module will discuss how the various methods of pest control as well as how products should be stored and managed to prevent contamination.","topics":["Introduction to Control Measures - Learning Outcomes","Pest Control - Part 1","Pest Control - Part 2","Product Contamination Control - Part 1","Product Contamination Control - Part 2","Product Contamination Control - Part 3","Introduction to Control Measures - Lesson Summary"]},{"name":"Module","details":"Control of Food Hazards and Incident Management","description":"In this module, you will learn about different types of food safety hazards and how best to deal with them. You will be introduced to food allergens and procedures that need to be followed when working with allergens and equipment used near allergens. Incident management will also be covered.","topics":["Control of Food Hazards and Incident Management - Learning Outcomes","Control of Food Hazards: General and Specific - Part 1","Control of Food Hazards: General and Specific - Part 2","Control of Food Hazards: Allergens","Incident Management - Part 1","Incident Management - Part 2","Control of Food Hazards and Incident Management - Lesson Summary"]},{"name":"Module","details":"Diploma in Food Safety - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Food Safety - First Assessment"]},{"name":"Module","details":"Personal Cleanliness and Health in the Food Service Industry","description":"In this module, you will learn about personal cleanliness guidelines that should be followed by employees in the food service industry.. The importance of cleanliness to the food service will be discussed. You will also be shown how a cleaning schedule list is put together and about correct sanitation.","topics":["Personal Cleanliness and Health in the Food Service Industry - Learning Outcomes","Introduction to Personal Cleanliness","Hotel Cleanliness","Guidelines for Manual Cleaning","Personal Cleanliness and Health in the Food Service Industry - Lesson Summary"]},{"name":"Module","details":"Sanitary Food Handling in the Food Service Industry","description":"This module will cover one of the most important aspects of Food Safety - Sanitary Food Handling. You will begin by learning about inspection and grading and about what to expect when receiving foods from a supplier. You will learn about the correct temperatures food should be stored at as well as the general guidelines for storing and preparing foods.","topics":["Sanitary Food Handling in the Food Service Industry - Learning Outcomes","Purchasing and Receiving Foods","Storing and Preparing Foods","Sanitation Procedures","Sanitary Food Handling in the Food Service Industry - Lesson Summary"]},{"name":"Module","details":"Food Safety in the Food Service Industry","description":"This module focuses on the causes of unsafe food and how to avoid them. You will learn about food poisoning and how it can be caused. Importantly, you will discover how food infections occur, their symptoms and which foods they affect.","topics":["Food Safety in the Food Service Industry - Learning Outcomes","Causes of Unsafe Foods","Food Borne Illnesses","Food Safety in the Food Service Industry - Lesson Summary"]},{"name":"Module","details":"Diploma in Food Safety - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Food Safety - Second Assessment"]},{"name":"Module","details":"Food Service Accidents","description":"In this module, you will learn about protecting employees and others from food service accidents. Critically, you will be shown how to avoid certain accidents in addition to the importance of first aid training. The thoery of the Heimlich maneuver will be shown to you.","topics":["Food Service Accidents - Learning Outcomes","Burns, Muscle Strains and Falls","Cuts and Equipment Accidents","Fire and First Aid","Food Service Accidents - Lesson Summary"]},{"name":"Module","details":"The Role of Management in the Food Service Industry","description":"This module will demonstrate to you the role of management in the food service industry. You will become familiarised with the \"lead by example\" concept. You will learn how important it is to train your staff correctly and the procedure of accident reports. You will learn the importance of inspections for the consistency of sanitation standards.","topics":["The Role of Management in the Food Service Industry - Learning Outcomes","The Role of Managers","Incidents and Inspections","The Role of Management in the Food Service Industry - Lesson Summary"]},{"name":"Module","details":"Diploma in Food Safety - Third Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Food Safety - Third Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Food Safety - Final Assessment"]}]}