{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1692","title":"Diploma in Mental Health","totalEnrolled":"147,561","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to manage mental wellbeing with this free online mental health diploma course that explores human psychology.","description":"This psychology diploma course covers a range of mental health issues. Raising public awareness of such issues has become an important global healthcare goal over the last several decades. We examine the causes, symptoms and treatments of various forms to let you understand how to preserve your own mental health and even help those around you. We use real-world examples to ground your new understanding of theory in practice.","courseOutcomes":["Define ‘normal’ behaviour...","Describe various neurotic and psycho...","Outline therapeutic and drug interve...","Cite the causes, signs and symptoms ...","Define ‘normal’ behaviour","Describe various neurotic and psychotic behavioural tendencies","Outline therapeutic and drug interventions used to treat such disorders","Cite the causes, signs and symptoms of burnout","Lay out types of depression","Describe the preconditions, signs and types of suicidal ideation and behaviours","Highlight the most common precipitating factors of violence","Explain the methods used to manage a violent patient, either armed or unarmed","Identify what drives the effect of a particular substance on an individual","Compare the long- and short-term effects of substance abuse","Discuss stress management techniques and their use in mental health treatment","Define ‘normal’ behaviour...","Describe various neurotic and psycho...","Outline therapeutic and drug interve...","Cite the causes, signs and symptoms ...","Define ‘normal’ behaviour","Describe various neurotic and psychotic behavioural tendencies","Outline therapeutic and drug interventions used to treat such disorders","Cite the causes, signs and symptoms of burnout","Lay out types of depression","Describe the preconditions, signs and types of suicidal ideation and behaviours","Highlight the most common precipitating factors of violence","Explain the methods used to manage a violent patient, either armed or unarmed","Identify what drives the effect of a particular substance on an individual","Compare the long- and short-term effects of substance abuse","Discuss stress management techniques and their use in mental health treatment"],"courseDescription":"<p>Mental health problems afflict roughly one in four adults and also affect those around them. This psychology diploma course studies the issues of stigma and discrimination and establishes the importance of promoting mental wellbeing.</p><p>The course begins by showing you how to tell people who exhibit ‘normal’ behaviour apart from those suffering mental distress. We also explain how to identify a range of neurotic and psychotic behavioural tendencies. The course then moves on to the sensitive topic of suicide. We teach you how to identify the signs of suicidal thoughts and offer preventative measures that could save a life. We also cover a range of personality disorders, phobias, neurotic behaviours and the complex questions surrounding substance abuse.</p><p>This course is not aimed just at mental health counselors and other healthcare or social work professionals, but is also helpful for anyone who has experienced mental health issues personally or from a loved one. It also suits anyone who is interested in the mind, how it works and how it breaks down. Sign up to greatly improve your chances of helping someone deal with serious mental health issues (including possibly yourself).</p><a href=\"https://alison.com/resume/courses/1692\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1692\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Mental Health - Behavior","description":"This module will teach you about how society can define behavioral norms. You will learn about behavior and cultural differences as well as defense mechanisms used in everyday interactions. You will learn how rationalization can reduce stress and gian indepth knowledge about schizophrenia.","topics":["Module 6: Learning Outcomes","Introduction","Behavior","Human Behavior Defense Mechanisms","Neurotic and Psychotic Behavior","Schizophrenia","Personality Disorders","Therapeutic Intervention","Module 6: Lesson Summary"]},{"name":"Module","details":"Mental Health - Burnout and Depression","description":"This module will teach you about the two major types of depression. You willl learn the symptoms of severe depression and the signs to look out for. You will also gain insight into managing depression. This module will also inform you on what causes burnout and will teach you the techniques to prevent burnout.","topics":["Module 7: Learning Outcomes","Causes of Burnout","Signs and Symptoms of Burnout","Depression","Module 7: Lesson Summary"]},{"name":"Module","details":"Diploma in Mental Health - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mental Health - First Assessment"]},{"name":"Module","details":"Mental Health - Understanding Suicide","description":"In this module, you will gain an indepth insight into the different types of suicide. You will learn about the signs to look out for and the conditions that are likely to cause suicide. This module will teach you about myths and facts that surround suicide and inform you on the methods to manage a potential suicide victim.","topics":["Module 9: Learning Outcomes","Suicide and Types of Suicide Behavior","Myths and Facts about Suicide","Immediate Danger Signs of Suicide Intent","Module 9: Lesson Summary"]},{"name":"Module","details":"Mental Health - Violent and Hostile Behavior","description":"This module will teach you about the most common factors in violent behavior. You will learn about the methods that are used to manage a violent patient who is unarmed and also the methods to use if a violent patient is armed.","topics":["Module 10: Learning Outcomes","Management of Violent or Hostile Behavior","Management of Violent or Armed Behavior","Module 10: Lesson Summary"]},{"name":"Module","details":"Mental Health - Substance Abuse","description":"In this module, you will gain an insight into the various types of substance abuse. You will learn how to identify symptoms for different substance abuse and how to treat a substance abuser. You will also learn about tolerance levels for each individual and how the list of substances commonly inhaled changes constantly.","topics":["Introduction to Substance Abuse","Opioids (Narcotics) Use","Alcohol as a Central Nervous System Depressant","Module 11: Learning Outcomes","Barbiturates and Sedatives as Central Nervous System Depressants","Central Nervous System Stimulants","Central Nervous System Stimulants: LSD and Inhalants","Module 11: Lesson Summary"]},{"name":"Module","details":"Diploma in Mental Health - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mental Health Studies - Second Assessment"]},{"name":"Module","details":"Relaxation And Cognitive Techniques","description":"In this module, you will learn how relaxation can help to reduce stress through different coping strategies. You will learn how imagery can be used in relaxation techniques as an effective way to reduce stress.","topics":["Relaxation and Cognitive Techniques  - Learning Outcomes","Developing Cognitive Coping Skills","Autogenic Training, Imagery, and Progressive Relaxation","Other Relaxation Techniques","Relaxation and Cognitive Techniques - Lesson Summary"]},{"name":"Module","details":"Exercise And DIY Strategies","description":"Learn about the link between exercise and stress and about the different exercises that can reduce stress, as well as the long-term effects of exercise. You will learn to identify stressors in your life by gaining DIY strategies for creating a stress program.","topics":["Exercise And DIY Strategies - Learning Outcomes","Exercise And Health","DIY Strategies In Stress Management","Exercise And DIY Strategies - Lesson Summary"]},{"name":"Module","details":"Diploma in Mental Health - Third Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Mental Health - Third Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Mental Health - Final Assessment"]}]}