{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4298","title":"Diploma in Medical Secretary","totalEnrolled":"17,521","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the administrative skills you need to work as a medical secretary in this free online healthcare support course.","description":"Are you curious about the requirements for becoming a medical secretary? This course introduces you to the profession’s job profile, qualities required and responsibilities. We explore the filing systems used in medical offices and establish the importance of medical record-keeping. We explain the jargon and terminology used in medicine before outlining the role of information technology in protecting patients’ confidentiality.","courseOutcomes":["State the role and responsibilities ...","List the filing systems used in a me...","Discuss patient confidentiality in t...","Outline the purpose and benefits of ...","State the role and responsibilities of a medical secretary in a medical establishment","List the filing systems used in a medical office","Discuss patient confidentiality in the healthcare industry","Outline the purpose and benefits of medical record-keeping","Define important medical terms and jargon","Describe the role of computers and information technology in a medical office","Identify potential health risks and hazards found in a medical establishment","Highlight the management of medical supplies and inventories","Master the communications skills used in a medical office","State the role and responsibilities ...","List the filing systems used in a me...","Discuss patient confidentiality in t...","Outline the purpose and benefits of ...","State the role and responsibilities of a medical secretary in a medical establishment","List the filing systems used in a medical office","Discuss patient confidentiality in the healthcare industry","Outline the purpose and benefits of medical record-keeping","Define important medical terms and jargon","Describe the role of computers and information technology in a medical office","Identify potential health risks and hazards found in a medical establishment","Highlight the management of medical supplies and inventories","Master the communications skills used in a medical office"],"courseDescription":"<p>Medical secretaries play an important role in any medical environment. They are patients’ first point of contact and are responsible for scheduling appointments and providing support to help doctors provide the best level of medical care. This course lays out the various job roles and responsibilities of a medical secretary in any medical establishment. We teach you how to manage appointment bookings before examining some filing systems used in medical offices. Patients should see medical secretaries as someone they can confide in so we establish the importance of patient confidentiality.</p><p>Medical secretaries also organise, update and store records, which include patients’ confidential information, diagnoses, treatment and more. These details are stored in different formats so we compare physical and electronic storage methods. Medical jargon can be confusing at times so this course outlines various medical terminologies and identifies the root, suffix and prefix of important terms. Technology has improved modern medical administration and medical secretaries require basic computer knowledge to store and process data. We course thus examines the role of computers and information technology in healthcare management.</p><p>As a medical secretary, you may encounter potential health risks and hazards. We explain how to safely and legally dispose of clinical waste and handle patients' specimens like urine, blood and saliva. The course guides you through the process of creating a safe working environment. The course provides important administrative skills like inventory management and effective workplace communication before considering professional dynamics like phone etiquette and dress code. This course is designed for anyone who has an interest in becoming a medical secretary. Do you want to play an important role in healthcare administration? Sign up to take the first step towards becoming a medical secretary.</p><a href=\"https://alison.com/resume/courses/4298\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4298\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Medical Secretary Role and Healthcare Industry","description":"In this module, you will be introduced to the roles and responsibilities of a medical secretary in a medical office as well as the establishments you can work in as a medical secretary. Thereafter, you will learn about filling systems, their importance and the important strategies you can use to schedule appointments effectively.","topics":["Medical Secretary Role and Healthcare Industry - Learning Outcomes","Introduction, Job Role and Responsibilities","How to Manage Appointment Scheduling","Filing Systems in Medical Offices","Patient Confidentiality in the Healthcare Industry","Medical Secretary Role and Healthcare Industry - Lesson Summary"]},{"name":"Module","details":"Medical Record Management and IT in Healthcare","description":"In this module, you will be introduced to the definition, purpose, benefits and history of medical records and how to manage medical records. This module discusses medical terminologies and jargon, how to identify medical terminologies and understand their meaning as well as the suffixes and prefixes attached to their root words.","topics":["Medical Record Management and IT in Healthcare - Learning Outcomes","Definition, Purpose and Benefits of Medical Records","Understanding Medical Terminology and Jargon","IT and Computer Usage in Healthcare Administration","Information Technology and Computers","Medical Records Management","Medical Record Management and IT in Healthcare - Lesson Summary"]},{"name":"Module","details":"Health, Safety and Communication in Medical Office","description":"In this module, you will learn about medical safety etiquettes for a safe working environment and how to provide quality service to patients. You will be shown some potential risks and hazards to health and safety. You will also learn how to manage medical supplies and inventories, as well as how to communicate effectively in a medical office.","topics":["Health, Safety and Communication in Medical Office - Learning Outcomes","Health and Safety in a Healthcare Setting","Supplies and Inventory Management and Administration","Communication Skills in a Medical Office","Professional Conduct in Medical Office","Health, Safety and Communication in Medical Office - Lesson Summary"]},{"name":"Module","details":"Medical Ethics, Billing and Career Prospects","description":"In this module, you will be introduced to the brief history of medical ethics and the Hippocratic oath as well as the importance of medical ethics and code of conduct. Thereafter, you will learn about medical coding and billing process as well as the career information and prospects of a medical secretary.","topics":["Medical Ethics, Billing and Career Prospects - Learning Outcomes","Law, Medical Services and Ethics","Clinical Coding, Billing in Medical Administration","Career Information and Prospects","Medical Ethics, Billing and Career Prospects - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Medical Secretary - Course Assessment"]}]}