{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4256","title":"Diploma in Cognitive Behavioural Therapy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the fundamentals of cognitive behavioural therapy in this free online course to treat a host of mental disorders.","description":"Cognitive behavioural therapy (CBT) is a psychiatric treatment that helps patients suffering from various mental conditions, including anxiety, phobias and depression. This diploma course provides a comprehensive overview of CBT’s theoretical background, the problems that it can treat and how its techniques work in practice. We can help anyone interested in learning how this groundbreaking treatment can support clients' mental health.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Today's world is full of stress-inducing situations caused by factors such as work, time limitations, family trouble and so on. If not managed well, stress can lead to depression and anxiety. Over the years, psychiatrists have developed treatments for those who suffer from such conditions, including cognitive behavioural therapy (CBT). This diploma course takes you through the history of CBT, the conditions it treats and the processes involved. We examine the underlying principles that inform various approaches to psychotherapy. The course then explores basic counselling skills, procedures and the code of ethics and professional standards required of psychotherapists. We include several practical exercises to help you understand these concepts. We explain case formulation, irrational beliefs and the ‘antecedents, behaviour, consequences’ (ABC) Model, followed by a step-by-step demonstration of a CBT session.</p><p>The course takes you through basic CBT techniques used to challenge negative thoughts and cognitive distortions. We study the use of CBT in treating depression, anxiety and phobias while investigating their causes and symptoms. We then examine the treatment’s role in addressing anger issues and insomnia. Finally, the course examines dialectical behaviour therapy (DBT) and solution-focused therapy (SFT) to help you understand how they differ from CBT before laying out their histories and procedures.</p><p>These psychiatric conditions can negatively impact patients’ quality of life and even their physical health, leading to the possible onset of lifestyle diseases and eventually death. Patients should seek professional help as soon as symptoms are detected to prevent further degeneration. This course is aimed at psychotherapists, psychiatrists and medical practitioners who would like to enhance their skills to bring comfort to those suffering mentally. It also suits psychology and medical students or anyone with a particular interest in counselling.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}