{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1405","title":"Diploma in Physical Therapy Aide","totalEnrolled":"36,903","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online diploma course shows you how to support the treatment of physical therapy patients as an assistant.","description":"This course teaches you how to help patients improve their mobility and manage pain and other chronic conditions. A physical therapist aide plays an essential role in helping patients recover from injuries. This course identifies the function of different parts of the human body and provides techniques to help them to recover and strengthen. Physical therapists require these skills and we explain how aides support them in this important work.","courseOutcomes":["Outline the history of physical ther...","List the different facilities in whi...","Explain the terms for positions and ...","Identify the range of motion for dif...","Outline the history of physical therapy","List the different facilities in which a physical therapy aide can work","Explain the terms for positions and orientation of the patient and describe those positions","Identify the range of motion for different joints in the body","Describe neurological illnesses that physical therapy can help alleviate","Discuss different methods for transferring a patient to and from chairs, beds, wheelchairs, etc","Employ equipment to assist with gait training","Identify the correct body mechanics for lifting activities","Outline the history of physical ther...","List the different facilities in whi...","Explain the terms for positions and ...","Identify the range of motion for dif...","Outline the history of physical therapy","List the different facilities in which a physical therapy aide can work","Explain the terms for positions and orientation of the patient and describe those positions","Identify the range of motion for different joints in the body","Describe neurological illnesses that physical therapy can help alleviate","Discuss different methods for transferring a patient to and from chairs, beds, wheelchairs, etc","Employ equipment to assist with gait training","Identify the correct body mechanics for lifting activities"],"courseDescription":"<p>This course begins with an overview of the history of physical therapy and lays out the differences between a physical therapist and a physical therapy aide. We describe career opportunities and outline the skills required to complete the daily work of a physical therapist and therapy aide. We provide some important medical technology and examine the general equipment used in physical therapy before explaining the use of orthotics. We also study the treatments for common medical disorders, including elbow range of motion (ROM) impairment and different forms of modality and ways to increase mobility, like ice massages.</p><p>The course then investigates the basic structure and function of the human body, including the different types of muscle tissue and common cardiopulmonary pathologies. We lay out the difference between the axial and appendicular skeleton. We then show you how to correctly turn and position the patient and include tips for lifting and ‘scooting’ transfers. You will also learn about pressure ulcers and bed mobility. Finally, we cover therapeutic exercise techniques, agents and modalities ranging from the use of crutches to hydrotherapy.</p><p>You can protect yourself and your patients from injury by learning the different methods for transferring them to and from chairs, beds and wheelchairs. The different therapeutic exercises provided by this course can help your patients to recover and regain full use of their bodies. This course describes the day-to-day work of a therapy aide and the traits that might make you good at this rewarding job so sign up to gain a valuable new skill that can enable you to help others.</p><a href=\"https://alison.com/resume/courses/1405\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1405\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Physical Therapy","description":"This module introduces you to physical therapy including the history of physical therapy and the difference between a physical therapist and a physical therapy aide.","topics":["Introduction to Physical Therapy: Learning Outcomes","The Profession of Physical Therapy","Current Practice for Physical Therapists","Introduction to Physical Therapy: Lesson Summary"]},{"name":"Module","details":"Career Opportunities and Skill Sets","description":"In this module, you will learn about career opportunities and skill sets involved in the role as a physical therapist. You will also learn about the day to day work of a therapy aide.","topics":["Career Opportunities and Skill Sets: Learning Outcomes","Fields of Work for Physical Therapists","Skill Sets for Physical Therapist Aide","Pain Scale for Physical Therapy Patient","Career Opportunities and Skill Sets: Lesson Summary"]},{"name":"Module","details":"Medical Terminology","description":"In this module, you will learn about medical technology as well as general equipment used in physical therapy and what Orthotics is used for.","topics":["Medical Terminology: Learning Outcomes","Introduction to Medical Terminology","General Equipment for Physical Therapy","Orthotics: AFO and KAFO","Medical Terminology: Lesson Summary"]},{"name":"Module","details":"Treatment of Common Medical Disorders","description":"In this module, you will learn about treatments of common medical disorders including various range of motions, such as elbow ROM, and different forms of modality such as ice massages.","topics":["Treatment of Common Medical Disorders: Learning Outcomes","Introduction to Treatment of Common Medical Disorders","Treatment using Modalities","Range of Motion (ROM)","Treatment of Common Medical Disorders: Lesson Summary"]},{"name":"Module","details":"Diploma in Physical Therapy Aide - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["First Assessment - Introduction to Physical Therapy Aides"]},{"name":"Module","details":"Basic Structure and Function of the Human Body","description":"This module teaches you about the basic structure and function of the human body including different types of muscle tissue, common cardiopulmonary pathologies, and the difference between the axial skeleton and the appendicular skeleton.","topics":["Basic Structure and Function of the Human Body: Learning Outcomes","Musculoskeletal System","Cardiopulmonary System","Neurological System & Neurological Illnesses","Skeletal & Muscle System","Basic Structure and Function of the Human Body: Lesson Summary"]},{"name":"Module","details":"Turning and Positioning the Patient","description":"In this module, you will learn about Turning and Positioning the Patient including tips for lifting and methods for scooting transfers. You will also learn about pressure ulcers and bed mobility.","topics":["Turning and Positioning the Patient: Learning Outcomes","Introduction to Turning and Positioning the Patient","Body Mechanics: Lifting","Transfers: Safely Moving Patients","Turning and Positioning the Patient: Lesson Summary"]},{"name":"Module","details":"Therapeutic Exercises, Agents and Modalities","description":"In this module, you will learn about therapeutic exercises, agents and modalities ranging from the use of crutches to hydrotherapy.","topics":["Therapeutic Exercises, Agents and Modalities: Learning Outcomes","Physical Therapy Agents and Modalities","Assisting with Gait Training","Therapeutic Exercises","Therapeutic Exercises, Agents and Modalities: Lesson Summary"]},{"name":"Module","details":"Diploma in Physical Therapy Aide - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Second Assessment - Treatment and Movement of a Patient"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Physical Therapy Aide - Course Assessment"]}]}