{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1333","title":"Diploma in Pharmacy Technician","totalEnrolled":"113,261","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the principles of pharmacy practice and common disorders of the human body with this free online course.","description":"This free online Pharmacy Technician course teaches you about the work of a pharmacy technician. Pharmacy technicians play an important role in dispensing the correct medication to their patients. This course teaches pharmacotherapy for different systems in the human body, including the endocrine, genitourinary, and sensory systems, important health and safety practices, and the importance of preserving patient confidentiality.","courseOutcomes":["Explain the role of the pharmacy tec...","Describe four systems of measurement...","Distinguish among bacteria, viruses,...","Identify the role of the Infection C...","Explain the role of the pharmacy technician as a member of the customer care team in a pharmacy.","Describe four systems of measurement commonly used in pharmacy and convert units from one system to another.","Distinguish among bacteria, viruses, fungi, and protozoa.","Identify the role of the Infection Control Committee within a hospital.","List some conditions and disorders of the male reproductive system.","Identify different forms of contraceptive products and the side effects of using each contraceptive.","Discuss the most effective ways of quitting smoking.","Define the difference between hypothyroidism and hyperthyroidism.","Explain the role of the pharmacy tec...","Describe four systems of measurement...","Distinguish among bacteria, viruses,...","Identify the role of the Infection C...","Explain the role of the pharmacy technician as a member of the customer care team in a pharmacy.","Describe four systems of measurement commonly used in pharmacy and convert units from one system to another.","Distinguish among bacteria, viruses, fungi, and protozoa.","Identify the role of the Infection Control Committee within a hospital.","List some conditions and disorders of the male reproductive system.","Identify different forms of contraceptive products and the side effects of using each contraceptive.","Discuss the most effective ways of quitting smoking.","Define the difference between hypothyroidism and hyperthyroidism."],"courseDescription":"<p>This course will first introduce you to the different types of pharmacies, including community and institutional pharmacies, and the roles and responsibilities of each pharmacy. You will then learn the four systems of measurement commonly used in pharmacy and how to convert units from one system to another. You will also be taught how to dispense medication, avoid medical errors, and generate prescriptions.<br><br>This pharmacy technician training course will then discuss the common disorders that affect the nervous, sensory, and genitourinary systems, including their treatments. You will also learn about the disorders of the male reproductive system as well as the different forms of contraceptive products and their side effects. The final section of this course explains the different aspects and roles of the cardiovascular, respiratory, gastrointestinal, and endocrine systems. You will learn about the composition of blood, lung diseases and treatments, and vitamins and their benefits.<br><br>Our body is a complex and wonderful creation, but it can still suffer from common diseases or grave illnesses without any warning signs. With this pharmacy technician study guide, you will learn how to help treat and control these ailments. Learners who are interested in working in the pharmaceutical industry or those wanting to learn more about human disorders or illnesses, as well as their treatments, will really benefit from this free online course. So, check out the course now, and boost your career development today.</p><a href=\"https://alison.com/resume/courses/1333\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1333\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Studying Pharmacology","description":"In this module, you will be introduced to pharmacology and learn about the key terms and practices that will be used and discussed throughout with course.","topics":["Studying Pharmacology - Learning Outcomes","Introduction to Pharmacology","Drugs in the Body","Studying Pharmacology - Lesson Summary"]},{"name":"Module","details":"Principles of Pharmacy Practice","description":"In this module, learn about the principles of practice including the development of drugs, pharmacy laws, and different pharmaceutical measurements.","topics":["Principles of Pharmacy Practice - Learning Outcomes","The Profession of Pharmacy","Pharmacy Law, Regulations, and Standards","Drug Development","Routes of Drug Administration and Dosage Formulations","Pharmaceutical Measurements and Calculations","Principles of Pharmacy Practice - Lesson Summary"]},{"name":"Module","details":"Professionalism in the Pharmacy","description":"In this module, learn about safety measures when dispensing medication to patients, such as medical and medication errors. This module also teaches you how to communicate with patients and the future of pharmacy practices.","topics":["Professionalism in the Pharmacy - Learning Outcomes","Medication Safety","Human Relations and Communications","Your Future in Pharmacy Practice","Professionalism in the Pharmacy - Lesson Summary"]},{"name":"Module","details":"Diploma in Pharmacy Practice - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Pharmacy Practice - First Assessment"]},{"name":"Module","details":"Community Pharmacy","description":"This module will teach you all about community pharmacy including the patient profile and pharmaceutical compounding.","topics":["Community Pharmacy - Learning Outcomes","Dispensing Medications in the Community Pharmacy","The Patient Profile","The Business of Community Pharmacy","Non-sterile Pharmaceutical Compounding  - Part 1","Non-sterile Pharmaceutical Compounding - Part 2","Community Pharmacy - Lesson Summary"]},{"name":"Module","details":"Institutional Pharmacy","description":"In this module, learn about institutional pharmacy including hospital pharmacy practice, infection control, and hazardous drugs.","topics":["Institutional Pharmacy - Learning Outcomes","Hospital Medication Orders and Accreditation","Infection Control","Sterile Compounding and the ICC","Hospital Pharmacy Practice","Compounding Sterile Products","Hazardous Drugs","Institutional Pharmacy - Lesson Summary"]},{"name":"Module","details":"Diploma in Pharmacy Technician - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Pharmacy Technician - Second Assessment"]},{"name":"Module","details":"Drugs for the Nervous, Muscular, and Sensory Systems","description":"In this module, learn about nervous, muscular, and sensory diseases and the drugs and alternative therapies that are used for their treatment.","topics":["Drugs for the Nervous, Muscular, and Sensory Systems: Learning Outcomes","The Nervous System and Drug Therapy","Drugs for Psychiatric and Mood Disorders","Drugs for the Nervous, Muscular, and Sensory Systems: Lesson Summary"]},{"name":"Module","details":"Pharmacotherapy for the Nervous and Sensory Systems","description":"In this module, you will be introduced to different disorders of the nervous and sensory systems such as depression, anxiety, and eye disorders, and treatments to cure or subdue these disorders.","topics":["Pharmacotherapy for the Nervous and Sensory Systems: Learning Outcomes","Drugs for Central Nervous System Disorders","Drug Therapy for Psychiatric and Mood Disorders","The Sensory System and Drug Therapy","Pharmacotherapy for the Nervous and Sensory System: Lesson Summary"]},{"name":"Module","details":"Pharmacotherapy for the Genitourinary System","description":"In this module, you will learn about the anatomy and physiology of the male and female reproductive systems, conditions of the nervous system, and the functions of the renal system.","topics":["Pharmacotherapy for the Genitourinary System: Learning Outcomes","The Reproductive System","Menopause, Contraceptions, and STIs","The Renal System and Drug Therapy","Pharmacotherapy for the Genitourinary System: Lesson Summary"]},{"name":"Module","details":"Diploma in Pharmacy Technician - Third Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Pharmacy Technician - Third Assessment"]},{"name":"Module","details":"Pharmacotherapy for the Cardiovascular and Respiratory Systems","description":"This module teaches you about different disorders associated with the cardiovascular and respiratory systems. You will learn about drug therapy and alternative therapies to treat these disorders.","topics":["Pharmacotherapy for the Cardiovascular and Respiratory Systems: Learning Outcomes","The Cardiovascular System and Drug Therapy","The Blood and Drug Therapy","The Respiratory System and Drug Therapy","COPD and Other Lung Diseases","Cough, Cold, and Allergy","Pharmacotherapy for the Cardiovascular and Respiratory Systems: Lesson Summary"]},{"name":"Module","details":"Pharmacotherapy for the Gastrointestinal and Endocrine Systems","description":"In this module, you will learn about the gastrointestinal and endocrine systems, including the functions of each system, disorders associated with each system, and treatments for these disorders.","topics":["Pharmacotherapy for the Gastrointestinal and Endocrine Systems: Learning Outcomes","The Gastrointestinal System and Drug Therapy","Nausea, Vomiting, and Other GI System Disorders","Nutrition and Drugs for Metabolism","The Endocrine System","Disorders of the Endocrine System","Pharmacotherapy for the Gastrointestinal and Endocrine Systems: Lesson Summary"]},{"name":"Module","details":"Diploma in Pharmacy Technician - Fourth Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Pharmacy Technician - Fourth Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Pharmacy Technician - Final Assessment"]}]}