{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1258","title":"Diploma in Nursing and Patient Care","totalEnrolled":"194,524","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to give good care to the elderly with the nursing procedures and practices in this free online nursing course.","description":"This free online course in nursing and patient care will help you boost your nursing career. Nurses and nursing teams have a vital role in the care of patients in a health care setting, and the modern nurse is a highly trained professional who works in a wide variety of areas from community nursing to surgery. This free course will equip you to help many people who need medical assistance.","courseOutcomes":["Describe the role of the nurse in pa...","List health and safety measures for ...","Describe movement and exercise routi...","Summarize the role of the nurse in d...","Describe the role of the nurse in patient care and patient hygiene","List health and safety measures for nurses","Describe movement and exercise routines that nurses can utilize for improved patient care","Summarize the role of the nurse in diet therapy","Describe the role of the nurse in the physical examination of the patient","Describe the role of the nurse in pa...","List health and safety measures for ...","Describe movement and exercise routi...","Summarize the role of the nurse in d...","Describe the role of the nurse in patient care and patient hygiene","List health and safety measures for nurses","Describe movement and exercise routines that nurses can utilize for improved patient care","Summarize the role of the nurse in diet therapy","Describe the role of the nurse in the physical examination of the patient"],"courseDescription":"<p>To help you learn how to properly care for elderly patients, you will first study the categories of human needs, the equipment used for patient care, and the guidelines for bed-making. You will then study the importance of patient personal hygiene, focusing on daily baths and proper oral care. You will also learn the importance of movement and exercise and how a back massage can help patient comfort. Next, you will study environmental health and safety awareness.<br><br>The nutritional needs and metabolism of elderly patients change as they age, which is why it is important that they get a carefully planned diet. This course will teach you the factors that influence diet, the reasons why there is a need for therapeutic diet therapy, and the standard hospital diet. You will then learn how to conduct a physical examination, collect a specimen, and measure vital signs.<br><br>Learning the best nursing care practices will not only ensure the health and safety of an elderly patient, but that of a nursing practitioner too. This Diploma in Nursing and Patient Care will be of great interest to all health care professionals who want to further their understanding of this subject. Any student who is planning to pursue a career in the nursing field will also find this course of great help. So start the course today, and learn how to give better nursing care in just a few hours.</p><a href=\"https://alison.com/resume/courses/1258\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1258\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Adult Patient Care","description":"This module will walk you through the care of adult patients.","topics":["Module 1: Learning Outcomes","Categories of Basic Human Needs","Equipment for Patient Care and Guidelines for Bed-Making","Terminal Cleaning of the Patient Care Unit","Module 1: Lesson Summary"]},{"name":"Module","details":"Advanced Principles of Patient Hygiene","description":"This module will discuss the advanced principles of patient care.","topics":["Module 2: Learning Outcomes","The Purposes of Giving the Patient a Bath","Mouth Care","The Benefits of a Back Massage","Personal Care for the Adult Patient","Module 2: Lesson Summary"]},{"name":"Module","details":"Environmental Health and the Practical Nursing","description":"This module looks at the relationship between nursing practices and environmental health.","topics":["Module 3: Learning Outcomes","Environmental Health and Its Impact on the Practice Nurse","Safety Measures in the Patient Care Environment","Module 3: Lesson Summary"]},{"name":"Module","details":"Diploma in Nursing and Patient Care - First Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Nursing and Patient Care - First Assessment"]},{"name":"Module","details":"Health and Safety for Healthcare Professionals","description":"This module looks at health and safety standards for healthcare professionals.","topics":["Module 5: Learning Outcomes","Body Mechanics","Prevention of Pathogen Transmission","Module 5: Lesson Summary"]},{"name":"Module","details":"Positioning and Ambulating the Adult Patient","description":"This module discusses the positioning and ambulating of adult patients.","topics":["Module 6: Learning Outcomes","Positioning the Adult Patient","Common Positions used when Ambulating a Patient","Techniques and Actions in Ambulating an Adult Patient","Module 6: Lesson Summary"]},{"name":"Module","details":"Active and Passive Ranges of Motion in Exercise","description":"This module lays out the active and passive ranges of motion in exercise.","topics":["Module 7: Learning Outcomes","The Effects of Immobility","Exercise for the Immobile Patient","Module 7: Lesson Summary"]},{"name":"Module","details":"Diploma in Nursing and Patient Care - Second Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Nursing and Patient Care - Second Assessment"]},{"name":"Module","details":"Diet Therapy","description":"This module will walk you through the importance of diet therapy when treating patients.","topics":["Module 9: Learning Outcomes","Factors Influencing Diet","Reasons for the Therapeutic Diet","Standard Hospital Diets","The Role of the Nurse in Diet Therapy","Module 9: Lesson Summary"]},{"name":"Module","details":"Diploma in Nursing and Patient Care - Third Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Nursing and Patient Care - Third Assessment"]},{"name":"Module","details":"The Physical Examination","description":"This module will teach you about the systematic approach to conducting an effective physical examination. It also discusses the vital role of the nursing professional in preparing and supporting the patient.","topics":["Module 11: Learning Outcomes","The Function of the Physical Examination","The Role of the Practical Nurse During a Physical Examination","Positioning of the Patient During a Physical Examination","Body Systems Examined and Evaluated","Module 11: Lesson Summary"]},{"name":"Module","details":"Specimen Collection","description":"This module will teach you about specimen collection and testing, as well as discussing it's role in determining the function of vital internal organs and body components.","topics":["Module 12: Learning Outcomes","Throat Cultures","Types of Specimen Collection","Module 12: Lesson Summary"]},{"name":"Module","details":"The Physical Assessment","description":"This module will introduce you to the function and components assessed, as well as the observations made, during a physical exam.","topics":["Module 13: Learning Outcomes","The Function and Facts of a Physical Examination","Appearance and Behaviour Examination","Components of the Physical Examination","Cardiovascular, Respiratory, Gastrointestinal, and Genitourinary Systems","Musculoskeletal System and the Integumentary Systems","Module 13: Lesson Summary"]},{"name":"Module","details":"Measuring Vital Signs","description":"This module lays out how a patient's vital signs are measured through weight, blood pressure, pulse, and temperature.","topics":["Module 14: Learning Outcomes","The Measurement of a Patient's Vital Signs","Measuring Temperature, Pulse, and Respiration Rate","Blood Pressure Readings","Module 14: Lesson Summary"]},{"name":"Module","details":"Diploma in Nursing and Patient Care - Fourth Assessment","description":"You must score 80% or more to pass this assessment.","topics":["Diploma in Nursing and Patient Care - Fourth Assessment"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Nursing and Patient Care - Final Assessment"]}]}