{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5237","title":"Diploma in Veterinary Medicine","totalEnrolled":"5,494","courseIncludes":["10-15 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides the skills you need to be a veterinarian who provides great healthcare to animals.","description":"Veterinary medicine prevents, diagnoses, manages and treats illness and injury in animals. This diploma course explains how a physical examination can lead to a diagnosis. We delve into the medical history of the field and define ‘biosecurity’ and ‘infection control’. We then establish the importance of finding the correct targeted therapy and culture. Sign up to learn the basics of veterinary healthcare and use this diploma to begin your career.","courseOutcomes":["Outline the field of veterinary medi...","Explain how to successfully make a d...","Discuss all the elements of the phys...","Describe some diseases of the liver ...","Outline the field of veterinary medicine","Explain how to successfully make a diagnosis","Discuss all the elements of the physical examination","Describe some diseases of the liver and pancreas","Recognise the many diseases of the cardiovascular system","Identify diseases of the haemolymphatic and immune systems","Classify the various animal diseases of the skin, eye, conjunctiva and external ear","Discuss some diseases of animals’ mammary gland","Explain how decisions are made during veterinary emergencies","Outline the field of veterinary medi...","Explain how to successfully make a d...","Discuss all the elements of the phys...","Describe some diseases of the liver ...","Outline the field of veterinary medicine","Explain how to successfully make a diagnosis","Discuss all the elements of the physical examination","Describe some diseases of the liver and pancreas","Recognise the many diseases of the cardiovascular system","Identify diseases of the haemolymphatic and immune systems","Classify the various animal diseases of the skin, eye, conjunctiva and external ear","Discuss some diseases of animals’ mammary gland","Explain how decisions are made during veterinary emergencies"],"courseDescription":"<p>Veterinary medicine is the subspecialty of medicine that focuses on the diagnosis, prevention, management and treatment of illness and injury in animals. Veterinary medicine that focuses on disease is known as ‘veterinary epidemiology’. We begin this diploma course by explaining how to make a diagnosis by conducting a physical examination of the affected animal. We also examine methods used to maintain biosecurity and control infection, including practical antimicrobial therapeutics used to kill harmful microorganisms.&nbsp;</p><p>This course shows you how to diagnose an animal during an emergency and identifies when to hospitalise the patient. We demonstrate the importance of identifying the targeted therapy and detecting signs of nervousness and anxiety. The course lays out the symptoms and treatment of diseases of the liver and pancreas, including diseases of the alimentary tract. We then move on to diseases of the heart and circulatory system and provide clinical treatment procedures. Finally, we explain how decisions are made in veterinary emergency medicine.</p><p>This diploma course provides the tools you need to master the practical principles of veterinary medicine. You can use these techniques and insider tips to confidently launch a career in this field. We describe the everyday life of a veterinarian and provide the skills the job requires, from treating emergencies to dealing with clinical procedures. Sign up to earn a diploma that signals your aptitude and ability to provide healthcare to sick and injured animals.</p><a href=\"https://alison.com/resume/courses/5237\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5237\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Veterinary Medicine","description":"This module will begin by helping you analyse an overview of veterinary medicine. We will also help you find information on diagnostic methods. This module will look at the different types of palpation. You will find answers to questions like: \"What is history collection?\" and \"How can you perform a close physical examination?\"","topics":["Introduction to Veterinary Medicine - Learning Outcomes","Introduction to Veterinary Medicine","Making a Diagnosis","The Physical Examination","The Medical History","Biosecurity and Infection Control","Practical Antimicrobial Therapeutics","Diseases of the Alimentary Tract","Introduction to Veterinary Medicine - Learning Outcomes"]},{"name":"Module","details":"Identifying Diseases","description":"In this module, we will help you analyse diseases of the liver and pancreas. In addition, you will examine the principles of circulatory failure. You will have the opportunity to explore abnormalities of plasma protein concentration. This module will help you find answers to questions like: What are the principles of treatment? What is Uraemia?","topics":["Identifying Diseases - Learning Outcomes","Diseases of the Liver and Pancreas","Diseases of the Cardiovascular System","Diseases of the Haemolymphatic and Immune Systems","Diseases of the Respiratory System","Diseases of the Urinary System","Diseases of the Nervous System","Diseases of the Musculoskeletal System","Identifying Diseases - Lesson Summary"]},{"name":"Module","details":"Veterinary Procedures","description":"This module will begin by helping you analyse an overview of diseases of the skin, eye, conjunctiva, and external ear. We will also help you find information on mastitis. You will also analyse the importance of emergency medicine. You will have answers to questions like: What is transgaunation? Or Why is herbal medicine important?","topics":["Veterinary Procedures - Learning Outcomes","Diseases of the Skin, Eye, Conjunctiva, and External Ear","Diseases of the Mammary Gland","Decision Making in Veterinary Emergency Medicine","Veterinary Herbal Medicine","Clinical Procedures","Diagnostic Procedures","Veterinary Medicine for Exotic Pets, Zoo and Wildlife Species","Veterinary Procedures - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Diploma in Veterinary Medicine - Course assessment"]}]}