{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5444","title":"Early Childhood Effects of Digital Games","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how computer games can help or hinder childhood development in this free online child psychology course.","description":"This child psychology course covers the effect of digital gaming on young minds. We discuss the impact of responsible digital parenting on early childhood development and show you to spot the signs of gaming addiction. This course is designed for parents and those engaged in childcare and provides the skills required to help children manage technological addiction. Sign up to help children reap the benefits of gaming without too much screen time!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>How does gaming addiction affect children? This childhood development course focuses on the growing problem of digital gaming addiction in young people. With the increasing popularity of video games and the widespread use of technology, it is crucial to understand the impact of excessive gaming on young children. This practical course covers various topics, including early childhood development, the role of family and communication as well as the parenting of these ‘digital natives’.</p><p>What does too much gaming do to a child? We describe the dangers of excessive gaming and offer ways in which parents or educators can help children avoid these. This course also provides practical tips to let you predict gaming addiction. We provide expert insights to keep you up to date with the latest research on gaming addiction and its effects on growing minds. We explain how psychological and social factors contribute to excessive gaming and lay out the factors that drive the move from ‘hobby’ to ‘addiction’.</p><p>Computer games can also provide positive stimuli to children so our final section goes over the advantages and disadvantages of digital games to help you understand how to embrace technology responsibly. This practical course is designed for parents, babysitters, teachers, psychologists, childhood specialists, school counsellors or paediatricians. Our video lectures provide a comprehensive understanding of the issue and equip you with the skills and knowledge you need to address digital gaming addiction in children. Sign up to join a community of parents and professionals committed to promoting healthy digital habits in children. Games offer children rich opportunities for learning and entertainment but you may be concerned that your child is getting too attached to their screens. If so, this course is for you.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}