{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1611","title":"Elderly Care and Caring for the Disabled","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this course learn how to treat people suffering from various mental and physical health conditions, as a result of ageing and traumatic injuries.","description":"Alison's free online Elderly Care course will teach you how to treat people suffering from various mental and physical health conditions. Caregivers are highly valued and in-demand professionals who make a big difference to the health organizations they work for. With this short course, you will be able to acquire the essential skills and concepts that will take your caregiving career to the next level.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course you will learn about health conditions people suffer due to ageing: the brain, central nervous system and health conditions such as decreased sensitivity to pain, learning dysfunction and insomnia. You will learn about the heart, lungs and circulatory system and health conditions such as angina and cardiovascular disease. Moreover, you will learn skills and methods for helping clients' physical and mental health.</p><p>In addition, you will learn about the deterioration of the human body due to damage, aging and illness; different skin conditions and how to treat them; bones, joints and muscles and illnesses that effect the comfort and mobility of patients. You will learn techniques for treating patients to improve their quality of life and how various body functions deteriorate with age; symptoms, health implications and appropriate treatments. Finally, you will examine the process of dying - the physical stages of death and what to expect; how people grieve; common emotional responses by people associated with the person dying, as well as strategies and techniques for assisting people close to the dying person.</p><p>If you’re interested in caregiving as a future career, or if you’re a health professional seeking to improve your skills, then this clear and simple course is the one for you. Learn effective caregiving skills about how to treat people suffering from various mental and physical health conditions. With this free course, you’ll learn these vital skills in just 3 hours. So start this course today, and by the end of the week you’ll have developed an excellent new set of skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}