{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5243","title":"English Language for Healthcare","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn medical English to expand your career opportunities as a healthcare professional in this free online course.","description":"Fluency in English is a useful skill that increases your job opportunities across the world. This course teaches healthcare professionals how to use English in medical settings. We explain how to read, write and pronounce common medical terms. We then show you how to converse fluently in this global language and build rapport with your patients and colleagues. Sign up to boost your career as you learn how to discuss healthcare in English.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Would you like to develop your written and spoken English vocabulary to further your healthcare career? This course is designed to help you improve your understanding of English and develop your communication skills as a healthcare provider. Our video lessons present commonly used medical jargon and specialised vocabulary used by English-speaking healthcare professionals.</p><p>The course begins with an overview of the human body as we explain English anatomical terms with illustrations. We then analyse the components of the skull, the eyes and the ear before laying out the components of the vertebral column and thoracic cage (rib cage). We also go over the English terms used to describe many scientific instruments used by healthcare professionals. The course provides a list of medical terms used to discuss frequently performed laboratory tests and diagnostic techniques. We show you how to use English to describe organ systems like the digestive, cardiovascular, immune and respiratory systems.&nbsp;</p><p>Finally, we study the professional skills required to communicate effectively with your clients and colleagues. This course helps you to master the English vocabulary used by healthcare practitioners in medical settings. This will open up new career opportunities and enhance your ability to understand patients in emergency situations where effective communication might make the difference between life and death.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}