{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5426","title":"Equity, Diversity, and Inclusivity (EDI) in Adult Care","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how the values of diversity, equity and inclusivity (DEI) are respected in adult care in this free online course.","description":"The pursuit of diversity, equality and inclusion guarantee fairness and equal opportunity for all and strives to end prejudice based on the characteristics of an individual or group of people, including age. Supporting the elderly presents certain challenges and anyone working in adult care needs to understand how to create an egalitarian, diverse and inclusive environment for those in their care to make sure all are treated with respect.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Treating individuals, regardless of their differences, with dignity and respect lies at the core of diversity, equity and inclusivity (DEI) efforts. This DEI training course explores the role of these values in adult care. It starts by defining different types of approaches to adult care. We lay out the principles, theories and values of the strength-based, person-centred and dimensions approaches. We also compare the common core principles to support self-care, principles of active participation and outcomes-based practices.</p><p>The course’s next section is related to positive outcomes and wellbeing. We explain how to involve people in the design of their own healthcare plans. We show you how to manage complex and sensitive situations as you develop and implement care plans. We highlight the role of specific team members and show you how to prioritise the service users. We then examine managerial responsibilities and family, community members and volunteer involvement. The course traces the relationship between health and wellbeing and goes through their main measures and determinants.</p><p>It is important that you understand the roles that various types of relationships play in an older people’s lives as such connections affect their wellbeing and care. We provide a few basic tactics that can help you develop a positive rapport in such relationships and highlight the impact of loneliness on health and wellbeing. Our final section discusses the importance of relationships, sex, sexuality and sexual health for older people. Sign up for this course to learn how to handle sensitive issues involving the concepts of diversity, equity and inclusivity in adult care. This DEI training course helps you make sure that the elderly people in your care are treated with dignity and respect.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}