{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2218","title":"Essentials of European Medical Device Regulations (EU MDR) - 2017/745","totalEnrolled":"4,197","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course learn about the key aspects of the European Medical Device Regulations (EU MDR) - 2017/745.","description":"This free online course explains the essentials of European Medical Device Regulations (EU MDR) - 2017/745. The course provides a way for learners to study the complex and detailed regulations, including the improvements in the EU MDR, the technical files elements, post-market responsibilities, increased requirements related to market actors etc. This course will be interest to all professionals working in the medical devices' industry.","courseOutcomes":["Explain the three directives on medi...","Discuss the transformation of old EU...","Summarize the important improvements...","Differentiate the different classes ...","Explain the three directives on medical devices: IVDD, MDD & AIMDD","Discuss the transformation of old EU directives into new regulations, and their relationships","Summarize the important improvements with the new EU MDR","Differentiate the different classes of medical devices and the criteria for classification","List the 22 rules of product classification for a medical device","Interpret the route to market for medical devices in Europe","Evaluate the roles of different economic operators in EU","Describe the applications and requirements of EU-UDI","Specify the requirements on EUDAMED in EU MDR","Explain the three directives on medi...","Discuss the transformation of old EU...","Summarize the important improvements...","Differentiate the different classes ...","Explain the three directives on medical devices: IVDD, MDD & AIMDD","Discuss the transformation of old EU directives into new regulations, and their relationships","Summarize the important improvements with the new EU MDR","Differentiate the different classes of medical devices and the criteria for classification","List the 22 rules of product classification for a medical device","Interpret the route to market for medical devices in Europe","Evaluate the roles of different economic operators in EU","Describe the applications and requirements of EU-UDI","Specify the requirements on EUDAMED in EU MDR"],"courseDescription":"<p>In this free online course Essentials of European Medical Device Regulations (EU MDR) - 2017/745 you will learn about the essentials of EU MDR that will introduce you to the updates and changes in the new regulations. The course covers old European directives on medical devices, active implants, in-vitro diagnotics devices and how these will be replaced with new regulations. The course also covers the classification scheme of medical devices and the risk-based critera for that.&nbsp;</p><p>The course begins by introducing you to the important improvements and significant changes in the EU MDR. The course then covers the economic operators in the sector and their increased responsiblities with this regulation. Next, it explains the Unique Device Identifier, and reporting mechanism of data through EUDAMED.</p><p>This course will be of great interest to those working in Quality or Continuous Improvement departments in a medical devices' industry, or if you're considering working in medical devices' sector as a future career, or if you’re a medical devices' professional seeking to learn about the European Regulations. So, start this free online course today and in just 3 hours you’ll be acquainted with the basics of the European Medical Device Regulations (EU MDR) - 2017/745.</p><a href=\"https://alison.com/resume/courses/2218\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2218\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to European Regulations on Medical Devices","description":"This module explains the existing relevant European directives for the medical devices' sector in Europe and how these will be replaced with the new EU regulations. The module further elaborates the important changes, improvements, and timelines of enforcement for the new regulations. The module also incorporates important terms from the EU MDR regarding industry.","topics":["Introduction to European Regulation on Medical Devices - Learning Outcomes","The Three European Directives on Medical Devices","The Important Regulatory Changes in the European Market","Terms and Definitions","Publication of EU MDR and Important Points","Introduction to European Regulation on Medical Devices - Lesson Summary"]},{"name":"Module","details":"Essential Components of the EU MDR","description":"In this module you will learn the technical documentation required for different classes of the medical devices as per the new EU MDR, the change in archiving period, Post-market surveillance etc. The module then discusses the criteria for classification of medical devices on elements of risk for the device. The module lists the 22 rules which govern the devices classification, and also share some steps as route to the market along-with different Economic Operators' roles in the sector.","topics":["Essential Components of EU MDR - Learning Outcomes","Technical Documentation & Post-market Surveillance","Classification of Devices and Route to Market","Economic Operations & Clinical Evaluation","Essential Components of EU MDR - Lesson Summary"]},{"name":"Module","details":"Reporting Requirements and Identification","description":"In this module, the reporting mechanism and identification of the medical devices as per the new EU MDR regulations are uncovered. The identification mechanism is based on Unique device identifier (UDI) and the important elements within that. Furthermore it also covers details about reporting requirements of EUDAMED.","topics":["Reporting Requirements and Identification - Learning Outcomes","Unique Device Identifier (UDI)","European Database on Medical Devices (EUDAMED)","Reporting Requirements and Identification - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["European Medical Device Regulations - Course assessment"]}]}