{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4530","title":"Fire Safety - Essential Concepts, Prevention & Control","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the fundamentals of fire safety management in this free online training course to protect your organization.","description":"This concise course on fire safety planning, management and control is designed for people for whom fire safety management is an important part of their profession. This course includes various aspects related to fire safety such as the classification and method of using fire extinguishers and smoke alarms. You will also find discussions on two important international fire risk management standards in this course: BS 9997 and OSHA Act.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Fire disasters are well-known catastrophes throughout human history, with millions of people having faced their consequences, whether from natural or artificial sources. Throughout the evolution of human civilization, fires have caused the loss of human lives, wealth and infrastructure. Although the advancement in technology and scientific methods has brought out many positive changes in dealing with fires, there is still room for improvement. For example, the loopholes in managing and implementing the rules and regulations regarding fire safety are a big concern regarding public security in various countries. Even wealthy countries like the United States face these issues daily. The losses that occur due to fires in industrialized nations and developing countries are monetary and incur damage to basic infrastructure. Moreover, these incidents can leave an everlasting psychological impact on the victims.</p><p>Enterprises and businesses worldwide understand the importance of maintaining a robust fire safety and risk management system. For this purpose, employers will seek personnel well-versed in fire safety and risk management because these individuals understand the consequences they will face in the event of a fire. Fires are deadly for an organization's financial stability, progress and can also distort its public image. A business's reputation can be damaged due to the assumption that they were careless about their safety and their employees’ safety.</p><p>This course comprises three comprehensive modules. The first module demonstrates the basics relating to fire hazards. You will explore the three most common reasons fires occur and the important scientific principles of the ‘fire triangle’ and ‘fire tetrahedron’. Moreover, it outlines the phenomenon of combustion and the classification of flames. The second module describes fire protection, prevention and suppression systems. It classifies fire extinguishers based on their content and colour codes. A brief fire safety guide provides fire safety practices for employees and employers and outlines a fire warden’s responsibilities. The final module discusses fire safety under three international frameworks: BS 9997, the Singaporean Civil Defense Force and the USA’s Organizational Safety and Health Act (OSHA). The practical component of solving case studies will keep you engaged. If you are interested in learning about what it takes to tackle fire safety in your organization, enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}