{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3313","title":"Firefighting Prevention and Equipment on Board Ships","totalEnrolled":"941","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about precautions taken on board ships and using safety equipment for fire prevention in this free online course.","description":"‘Firefighting Prevention and Equipment on Board Ships’ is a free online course that has been specially designed for those interested in firefighting prevention techniques on board ships. The course discusses the prevention of fires using relevant equipment and explores firefighting best practices for smaller vessels. Register for this course today and begin your learning journey!","courseOutcomes":["List the necessary chemical elements...","Explain the chemistry of fire and th...","Analyze the different firefighting e...","Recall the fixed fire extinguishing ...","List the necessary chemical elements required for a fire to take place","Explain the chemistry of fire and the chemical reactions involved","Analyze the different firefighting equipment used on board ships in handling fires","Recall the fixed fire extinguishing systems fitted on ships with their respective operations","Distinguish between fire pumps, fire hoses and other equipment used for fighting fires","Describe the backfire flame control system used on motorboats and motor vessels","Outline the personal protective equipment (PPE) required for firefighting and how they are used","Discuss the relevance of different approvals from coast guard publications in preventing fires on smaller vessels","List the necessary chemical elements...","Explain the chemistry of fire and th...","Analyze the different firefighting e...","Recall the fixed fire extinguishing ...","List the necessary chemical elements required for a fire to take place","Explain the chemistry of fire and the chemical reactions involved","Analyze the different firefighting equipment used on board ships in handling fires","Recall the fixed fire extinguishing systems fitted on ships with their respective operations","Distinguish between fire pumps, fire hoses and other equipment used for fighting fires","Describe the backfire flame control system used on motorboats and motor vessels","Outline the personal protective equipment (PPE) required for firefighting and how they are used","Discuss the relevance of different approvals from coast guard publications in preventing fires on smaller vessels"],"courseDescription":"<p>Fire, though useful to man, is often found to be the cause destruction. However, fire can be safely harnessed and preventative measures can be put in place to avoid hazards. Towards this goal, human development over time has been able to lay down firefighting techniques useful to the prevention of fire outbreaks in different places. This can be observed through the many types of equipment used in preventing the need for firefighting in households and industry. Further, this has been carried on to different modes of transportation including rail, water, air and road. This course seeks to explore the aspects of firefighting related to water transport before, during and after voyages.</p><p>Fire on board watercraft is a seafarer’s worst nightmare. Towards the goal of fire prevention, it is important to know how to operate a ship safely and maintain a vigil on equipment and machinery during watchstanding. This will help avoid accidental fires that have the potential to end up becoming large fires. Such large fires, when out of control, can burn down the largest of ships to ashes. An important part of crew education is in knowing not only the firefighting equipment and systems on board, but also keeping a clean and well-organized ship. A key characteristic of a well-organized ship includes access to all its physical resources and of course well-secured cargoes. The crew must also understand how a fire can start and grow, as well as what can be done as an immediate measure to extinguish or contain such fires.</p><p>This course from Alison discusses firefighting prevention techniques on board ships covering many study levels. It analyzes practical functionalities of different firefighting equipment useful to all maritime stakeholders. Individuals partaking in different recreational activities on the water will need this enlightening course to learn about ensuring their safety when using smaller vessels. Furthermore, learners who successfully complete this course will be conversant with the most common causes of fire involved in all forms of transportation involving passengers and goods. Therefore, students, mariners, health workers, maritime enthusiasts and anyone interested in learning about firefighting tips and useful safety equipment cannot afford to miss this course. Register for this course today to improve your understanding of firefighting prevention and equipment on board ships relevant to overall shipboard safety.</p><a href=\"https://alison.com/resume/courses/3313\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3313\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fire Prevention","description":"In this module, you will learn about the protection of watercraft against fires before, during, and after voyage. You will also learn about the importance of crew education in protecting against large fires affecting ships, cargoes, equipment, and crew on board.","topics":["Fire Prevention - Learning Outcomes","Introduction to Fire Prevention","Ship Construction Arrangement","Frequent Causes of Fire on Board","Fire Prevention Principles","Functions of Gas Measuring and Similar Instruments","Measurement of Oxygen Concentrations","Process of Permit, Entry, and Rescue","Fire Prevention - Lesson Summary"]},{"name":"Module","details":"Firefighting Equipment","description":"In this module, you will learn about firefighting equipment alongside fire detection systems on board ships with their respective alarms. You will also learn about portable fire extinguishing systems and high-expansion systems used in ship machinery spaces and pump rooms. Also, you will learn about sprinkler systems and bulk carbon dioxide installations used for firefighting.","topics":["Firefighting Equipment - Learning Outcomes","Introduction to Firefighting Equipment","Portable Firefighting Appliances","Fixed Fire Extinguishing Systems","High-Expansion System for Machinery Spaces/Pump Rooms","Fire Pumps, Fire Hose, and Other Equipment","High and Low Velocity Fog","HALON and AFFF","Novec-1230","Dry Powder System","Firefighting Equipment - Lesson Summary"]},{"name":"Module","details":"Firefighting Equipment on Smaller Vessels","description":"This module introduces you to personal protective equipment for firefighting and the basic characteristics of outfits required by the SOLAS on board smaller vessels. You will learn about the control and maintenance of equipment on board smaller vessels.","topics":["Firefighting Equipment on Smaller Vessels - Learning Outcomes","Firefighting Equipment on Smaller Vessels","Personal Protective Equipment for Firefighting","Breathing Apparatus","Operation and Maintenance of Firefighting Appliances and Equipment","Firefighting Equipment on Smaller Vessels - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Firefighting Prevention and Equipment on Board Ships - Course Assessment"]}]}