{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4415","title":"Firefighter Training","totalEnrolled":"7,786","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the most important duties of firefighters and study fire safety standards.","description":"This course will help you learn about firefighters’ roles and provides essential information on health and safety issues they encounter daily. We will discuss general legislation that has arisen from various practical experiences gathered from the past. We will also go through the steps to measure fire risk and some important issues. We will discuss the safeguards to implement, control and review safety standards to help you ensure compliance.","courseOutcomes":["Define ‘fire’...","Summarize the component of the ‘fire...","Outline the six different types of f...","Discuss the duties and responsibilit...","Define ‘fire’","Summarize the component of the ‘fire triangle’","Outline the six different types of fire","Discuss the duties and responsibilities of a firefighter","Explain the health and safety measures of a firefighter","Summarize the various types of fire control systems","Explain the key consideration of risk assessment","Discuss the importance of maintaining a habit of daily assessment","Outline firefighter roles in safety arrangements","Explain how to control, monitor and review the fire safety standards","Summarize the responsibility and procedure of the evacuation process","Define ‘fire’...","Summarize the component of the ‘fire...","Outline the six different types of f...","Discuss the duties and responsibilit...","Define ‘fire’","Summarize the component of the ‘fire triangle’","Outline the six different types of fire","Discuss the duties and responsibilities of a firefighter","Explain the health and safety measures of a firefighter","Summarize the various types of fire control systems","Explain the key consideration of risk assessment","Discuss the importance of maintaining a habit of daily assessment","Outline firefighter roles in safety arrangements","Explain how to control, monitor and review the fire safety standards","Summarize the responsibility and procedure of the evacuation process"],"courseDescription":"<p>A firefighter plays a vital role in providing emergency services in any community. In this firefighter training course, you will learn what makes up the duties of a firefighter and study important details about health and safety issues. First, become familiar with the essential issues associated with this profession and understand the tidbits of firefighting. Next, you will learn something about the general legislation that has resulted from various practical encounters in history. For example, accidents related to buildings frequently occur in England. This course will help you understand the law concerning safety when building a house that was introduced in the United Kingdom in 2000.</p><p>Are you wondering about the science and chemistry of fire? This course will provide you with this basic knowledge. A fire or combustion is a result of a chemical reaction. Understanding the chemical reaction is the basis for preventing fires and extinguishing them once they have started. This course will also help you understand the different stages of fire. You will learn the steps required to measure fire risk and the vital aspects you need to consider in an assessment. Discover the importance of maintaining daily inspections to minimize the risk of fire. Investigate the safeguards to implement, control, monitor and review safety standards to ensure compliance with them. We will also discuss creating a plan that outlines the arrangements for effective fire safety management to prevent fires from occurring.</p><p>This course outlines the duties of the various positions in the fire hierarchy. Explore the overall responsibilities, procedure and things to look for during the evacuation process. Do you like the idea of knowing the different types of fire suppression systems used in various offices and homes? We will address this important topic and describe firefighting foams and chemical extinguishing agents to assist you as a safety manager in selecting an appropriate fire protection system. This course is ideal for anyone working as a firefighter who wants to improve their skills in this field. So why wait? Start your learning experience today.</p><a href=\"https://alison.com/resume/courses/4415\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4415\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Firefighter","description":"In this module, you will learn what the role of a firefighter entails, including important information on health and safety issues. We will discuss the general legislation, the imposition of which has resulted from various practical experiences in the past. This module will help you understand the different stages of fire and its chemical reaction.","topics":["Fundamentals of Firefighter - Learning Outcomes","Introduction to Firefighter","Fire Safety Legislation","Understanding Fire","Fundamentals of Firefighting - Lesson Summary"]},{"name":"Module","details":"Evacuation, Risk and Safety","description":"This module will help you learn the steps involved in measuring fire risk along with several important issues. We will discuss safety arrangements for implementing, controlling, and reviewing safety standards, as well as ensuring that standards are maintained. You will also learn what are things need to consider in the evacuation.","topics":["Evacuation, Risk and Safety - Learning Outcomes","Fire Risk Assessment","Fire Safety Arrangements","Evacuation and Safety","Fire Extinguishers","Evacuation, Risk and Safety - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}