{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4550","title":"First Aid for Pediatric Emergencies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about common pediatric emergencies and how to manage them with first aid protocols.","description":"This course on critical pediatric emergencies is specially designed for children's parents, teachers, and guardians. Its primary aim is to equip you with the necessary knowledge of pediatric emergencies so that they deescalate a hazardous incident. In addition, this course contains the methods of responding to choking, asthma, food poisoning, animal bites and fall injuries and discusses some basic aspects of pediatric medicine.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>When expecting a child, a parent's primary preoccupation is ensuring that their baby will be born healthy and without complications. While this is true for most children born today, pediatric accidents in the home can occur, which can cause fatal consequences if you do not take appropriate steps to combat these mishaps. Therefore as a parent, teacher or guardian, you must be fully aware of common pediatric emergencies and how to handle them efficiently. Consequently, we have designed this comprehensive course to help adults manage some of the most prevalent hazards in the home and school settings.</p><p>The first two topics in this course stress the importance of pediatric medicine and explain the seven classifications of this age group, along with the significant differences between adult medicine and pediatric medicine. The four critical milestones in a child's health are also included for parents to understand what a pediatrician will look for while examining their child. The course also contains two essential video tutorials that will teach you to perform cardiopulmonary resuscitation (CPR) on an infant and help protect a choking child.</p><p>We then illustrate the most commonly occurring pediatric emergencies. These include falls, injuries, cut and puncture wounds, animal bites, insect stings and electrocution, emphasising three common childhood hazards: asthma, choking and food poisoning. We will equip parents or guardians to provide medical care for their children by exploring these emergencies. While all advice in this course comes from authentic sources, you should not consider it an alternative to expert medical advice. Instead, this course will guide you through these potential emergencies to be best prepared to look after the children in your care.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}