{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4890","title":"First Aid for Mental Health","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches control practices for recovery from self-harm, suicide, drug abuse and mental problems.","description":"Anxiety and depression are common global mental health problems, while self-harm and suicide are leading causes of death among young people. This online course aims to give you an in-depth understanding of the therapies, treatments and guidelines for dealing with the symptoms and causes of mental illnesses and drug abuse. Learn how to help people recover from self-harm, prevent suicide and regain their mental health. Enrol today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Mental health is about psychology, emotions and social health. It encompasses our approach to stress and influences how we relate to the people around us and how we make decisions. Mental health problems are common and affect one out of five young people. Nevertheless, many people do not know how to provide support and use the best treatments and services that are available. First aid for mental health, popularly referred to as ‘mental health first aid’, adopts an approach that helps people seek professional assistance, offer reassurance and support and detect the signs of mental illness.</p><p>This free online course will study the characteristics of good mental health and early signs of mental health problems. Learn how to cultivate self-awareness to help you recognise and express your emotions and control your stress levels. Moreover, we will present an overview of the roles of mental health first aiders and the advantages they bring to the workforce. You will also study the causes, symptoms and treatment of childhood and adolescent psychiatric disorders such as autistic disorder, conduct disorder and mental retardation.</p><p>Furthermore, find out the causes and symptoms of stress and anxiety disorders such as acute stress disorder, generalised anxiety disorder (GAD) and post-traumatic stress disorder (PTSD). Similarly, we will carry out an in-depth study of schizophrenia and you will learn about the types, symptoms, medicines and therapies for treatments. In addition, we will discuss the approaches to suicide prevention and the medications and therapies for treating mental illness. We will also consider mental health crisis intervention and management models. By taking the course, you will learn how to help people regain their mental health and recover from self-harm and suicidal thoughts. Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}