{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3831","title":"First Aid Training in the Workplace","totalEnrolled":"26,199","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to conduct first aid, deal with workplace emergencies and potentially save a life in this free online course.","description":"First aid training in the workplace has become a necessity nowadays. This introductory course will explain how to evaluate and safely administer first aid in numerous difficult situations at work. Study incident management and basic first aid techniques before dealing with secondary illnesses and injuries like fractures and dislocations. Possessing these skills and information will help in any emergency, allowing you to confidently assist.","courseOutcomes":["Evaluate emergency situations...","Outline incident management at work...","Describe some basic first aid techni...","Identify minor injures...","Evaluate emergency situations","Outline incident management at work","Describe some basic first aid techniques","Identify minor injures","Explain secondary illnesses","Discuss how to deal with the loss of responsiveness","Classify breathing problems","Compare fractures and dislocations","Evaluate emergency situations...","Outline incident management at work...","Describe some basic first aid techni...","Identify minor injures...","Evaluate emergency situations","Outline incident management at work","Describe some basic first aid techniques","Identify minor injures","Explain secondary illnesses","Discuss how to deal with the loss of responsiveness","Classify breathing problems","Compare fractures and dislocations"],"courseDescription":"<p>Emergencies can happen at any time and in this free online first aid training course, you will develop a keen understanding of first aid and the necessary responsibilities and procedures to go through to save a life, and prevent or reduce serious injuries. In this first aid course, you will uncover the fundamentals of first aid training and learn how to manage incidents and what to do when arriving at the scene of an accident. First, the course begins with an overview, introducing first aid at work and safe practices like always keeping medical supplies available. Then, you will look at the roles and responsibilities of a worker when an incident occurs. This section will also discuss the importance of recording incidents and actions and preventing cross-infection when there is an occurrence.</p><p>Next, you will discuss the dos and don’ts in an emergency and the questions you should ask yourself: What are the dangers? Is it safe for me to go to the casualty? How do I make the area safe? You will also discuss fires and how to deal with electrical incidents. This topic includes treating burns and breaking contact with electricity safely. This health and safety course breaks down basic first aid techniques and looks at the chain of survival. You will get to know which equipment needs to be included in a first aid kit, how to bandage different wounds, and put on wound dressing properly. In the following section, you will take a look at minor injuries and compare other procedures for each. You will study the causes of abdominal pain, crush injuries, allergic reactions, and learn to deal with and treat each symptom individually. This part of the course concludes by discussing extreme environmental conditions and briefly explains how to manage someone with hyperthermia or hypothermia. The last section of content describes the treatments and procedures for managing secondary illnesses. These illnesses include various disorders and issues that could go wrong and need medical attendance before you can reach an emergency unit. These include unresponsiveness, especially when the casualty is not breathing - you will learn the procedure for CPR and what to do to keep someone alive until the emergency services arrive. The topics will describe other secondary illnesses such as asthma, croup, diabetes, and many others. You will learn what to do in this case including keeping yourself and others calm and preventing a difficult or life-threatening situation.&nbsp;</p><p>This course is for those wanting to help in an emergency and is perfect for those involved in workplace health and safety. It is for those aware of the dangers that life can impose would like to be there when a colleague or stranger needs it most. This course will equip you with correct and in-depth first aid knowledge and enrolling could save a life in a dire situation.</p><a href=\"https://alison.com/resume/courses/3831\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3831\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Workplace First Aid","description":"In this module, Introduction to Workplace First Aid, you will study incident management in the workplace and general workplace first aid. In addition, you will learn how to deal with minor injuries and some basic first aid techniques.","topics":["Introduction to Workplace First Aid - Learning Outcomes","Introduction to Workplace First Aid","Incident Management at Work","First Aid Techniques","Minor Injuries and Extreme Conditions","Introduction to Workplace First Aid - Lesson Summary"]},{"name":"Module","details":"Workplace First Aid Training - Breathing Problems, CPR & Fractures","description":"In this module, Workplace First Aid Training - Breathing Problems, CPR & Fractures, you will analyze secondary illnesses and deal with different situations. For example, you will study the loss of responsiveness and breathing problems and what to do in these situations. You will also study other injuries and learn to manage them.","topics":["Workplace First Aid Training  - Learning Outcomes","Loss of Responsiveness and CPR","How to deal with Breathing Problems","Common Secondary Illnesses","Dealing with Fractures and Dislocations","Workplace First Aid Training - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["First Aid Training in the Workplace - Course Assessment"]}]}