{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4533","title":"First Aid Procedures in the Workplace","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the knowledge needed to become a first aider and save lives at the workplace with this free online course.","description":"The act of saving a life is critical and cuts across all disciplines and spheres of life. However, high-quality life-saving skills and techniques appear to be lacking in most workplaces. We have designed this course to provide you with all the latest knowledge and procedures necessary to become an outstanding first aider so you can help save lives in the workplace, at home or in public. So become confident to save a life and enrol today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you wish to be a first medical responder and help people? This course will provide you with the tried-and-tested knowledge and skills needed to become a first responder and save lives on the job. First aid services are an essential part of our daily lives. Using first aid at work helps reduce pain and anxiety, prevent significant blood loss and preserves life. Learn the laws and legislation governing first-aid practices and the roles of a first aider, such as gathering vital information about an emergency, accessing appropriate treatment and prioritizing casualties. This course will teach you about the legal framework for workplace first aid and the essential components of a first aid kit. These include: safety pins, sterilized eye pads, bandages and disposable non-latex gloves.&nbsp;</p><p>This course explores the features of a first aid room, such as hot and cold running water, cleaning agents with disposable paper towels, refuse containers and cupboards for storing materials and equipment. We will teach you how to handle various workplace incidents and conduct primary, scene and secondary surveys. Next, we demonstrate essential techniques in workplace first aid, including the dos and don'ts in an incident. For example: don't move a victim unless their life is at stake, never attempt to reset a victim's bones, do not delay calling emergency services if the situation appears to be life-threatening and remain calm during an incident. We finally demonstrate cardiopulmonary resuscitation (CPR ), a technique used to save casualties who have difficulty breathing or are not breathing. Perform effective CPR consisting of chest compressions, opening the airway and the ‘rescue breathing’ technique.&nbsp;</p><p>Discover first aid treatments for a wide range of breathing problems such as asthma and hyperventilation. Perform secondary resuscitation in the event of a heart attack. If a casualty complains of severe chest pain, has a bleeding wound or is emotionally distressed, a first aider must call for emergency services. A first aider is responsible for providing immediate medical attention to someone who has sustained an injury or illness. In extreme cases, the prompt first-aid response may save a life. This course is designed for anyone wanting to become a skilled lifesaver and make a difference in the workplace and the world. So why put off your decision? Begin by taking this class right away.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}