{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5482","title":"Fitness Coaching Gym Workouts and Bodybuilding","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the basics of bodybuilding and learn how to employ a complete gym workout programme in this free online course.","description":"This course examines the fundamental concepts of bodybuilding, which is the use of progressive resistance exercise for aesthetic muscle hypertrophy. We explore muscle anatomy and composition to explain the science of exercise. We then investigate supplements and show you how to add them to your diet. Sign up for this course to gain practical knowledge you can use to gain muscle and learn how to set up a gym workout programme that works.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Bodybuilding’ is the use of progressive resistance training to regulate and grow one's muscles for aesthetic objectives through muscular hypertrophy: it helps you build up your muscles to look good. We begin this course by examining muscle anatomy and muscle composition. We then go on to explain the roles and responsibilities of a fitness coach. We identify the most important aspects of muscle growth and workout design. We answer questions like ‘how often should you train a muscle group?’ and ‘how important are macronutrients and why should I understand them?’.</p><p>This course explains the process of setting up and sticking to a complete gym workout programme. We outline the various exercises that help you build muscle using compound and isolated exercises. We examine the important process of recovery that will help you build muscle in your legs, back, chest, arms and other desired body parts. The course then delves into diet and supplements to help you maximise muscle hypertrophy. This part of the course answers questions like ‘what are the most important compound exercises?’ and ‘how much should I rest each muscle group before working them again?’.</p><p>This course provides the concepts you need to help clients or yourself understand the process of bodybuilding and use a gym workout programme to achieve muscle hypertrophy and look great. You can confidently use these concepts to assist both yourself and other people in drawing up effective diet plans. We cover macronutrients and ‘use recovery’ for muscle growth and walk you through each step of the process of building muscle and regaining energy. Sign up to understand the concepts of bodybuilding and create a gym workout plan that works for you and your clients.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}