{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1856","title":"Food Safety Knowledge - Basic Level Requirements","totalEnrolled":"23,388","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to handle and store your food properly to prevent food-borne illnesses with this Food Safety Knowledge course.","description":"If not handled properly, the food that you serve may cause severe discomfort, illness, and even death. This makes it crucial for everyone, particularly those in the hospitality industry, to understand that their behavior directly contributes to the safety of the food they serve. This course will teach you how to properly handle, prepare, and store food so that the meals you make and contribute to are safe for everybody who enjoys them.","courseOutcomes":["Develop and manage systems for good ...","Identify a system for reporting illn...","Describe reasons for ensuring water ...","Explain the hazards posed by specifi...","Develop and manage systems for good personal hygiene","Identify a system for reporting illness","Describe reasons for ensuring water quality","Explain the hazards posed by specific food pests and the controls required to reduce the risk","Explain the system used to monitor the effectiveness of pest controls and define corrective actions that must be taken","Describe the principles of, and reasons for, ensuring product contamination control","Explain the nature of food safety hazards and factors influencing the likelihood of their occurrence","Outline the principles and reasons for controlling food allergens","Discuss the principles and reasons for an effective incident management system","Develop and manage systems for good ...","Identify a system for reporting illn...","Describe reasons for ensuring water ...","Explain the hazards posed by specifi...","Develop and manage systems for good personal hygiene","Identify a system for reporting illness","Describe reasons for ensuring water quality","Explain the hazards posed by specific food pests and the controls required to reduce the risk","Explain the system used to monitor the effectiveness of pest controls and define corrective actions that must be taken","Describe the principles of, and reasons for, ensuring product contamination control","Explain the nature of food safety hazards and factors influencing the likelihood of their occurrence","Outline the principles and reasons for controlling food allergens","Discuss the principles and reasons for an effective incident management system"],"courseDescription":"<p>This course is compiled from the Food Safety Knowledge Network's Basic Level Requirements for Food Manufacturers. The practices outlined in the course adhere to internationally recognized standards, codes of practice, and guidelines relating to food, food production, and food safety recognized by the WHO (World Health Organization) and United Nations. The topics covered include personal hygiene, water quality, product contamination control, and pest control. The course will also cover food hazards and incident management.<br><br>Upon completion of this course, you will know the important factors that need to be considered when managing personal hygiene. You will understand the requirements needed to ensure water is of good quality and know how to control product contamination that might compromise the health of consumers. The lessons also cover the control and management steps that need to be taken in regard to pest control, prevention, and monitoring. You will also learn about the product quarantine and complaint handling processes that are essential for Incident Management.<br><br>If you are a food safety manager or run a business responsible for food safety, you will gain a lot of valuable knowledge from this course. Individuals who are planning to have a career in the food-related industry will also benefit greatly from this course. So, check out the course, start learning how to improve your food handling practices, and make the food you contribute much safer today.</p><a href=\"https://alison.com/resume/courses/1856\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1856\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Personal Hygiene and Water Quality","description":"In this module you will learn about the principles and reasons for good personal hygiene and how to manage systems for personal hygiene. You will learn about how illnesses should be reported and about importance of water quality. Find out more about regulations and customer requirements related to water quality, ice and steam and learn about water wells and plumbing systems.","topics":["Introduction to Personal Hygiene and Water Quality - Learning Outcomes","Personal Hygiene - Part 1","Personal Hygiene - Part 2","Personal Hygiene - Part 3","Water Quality - Part 1","Water Quality - Part 2","Introduction to Personal Hygiene and Water Quality - Lesson Summary"]},{"name":"Module","details":"Introduction to Control Measures","description":"In this module, you will learn about the different kinds of pests that can be hazardous to food safety. You will be shown how to manage these pests and how to safely contain any contamination.","topics":["Introduction to Control Measures - Learning Outcomes","Pest Control - Part 1","Pest Control - Part 2","Product Contamination Control - Part 1","Product Contamination Control - Part 2","Product Contamination Control - Part 3","Introduction to Control Measures - Lesson Summary"]},{"name":"Module","details":"Control of Food Hazards and Incident Management","description":"In this module you will learn about different types of food safety hazards and how best to deal with them. You will also learn about food allergens and procedures that need to be followed when working with allergens and equipment used near allergens. Finally, will also discuss incident management.","topics":["Control of Food Hazards and Incident Management - Learning Outcomes","Control of Food Hazards: General and Specific - Part 1","Control of Food Hazards: General and Specific - Part 2","Control of Food Hazards: Allergens","Incident Management - Part 1","Incident Management - Part 2","Control of Food Hazards and Incident Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Food Safety Knowledge - Basic Level Requirements - Course Assessment"]}]}