{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4499","title":"Food Safety and Hygiene","totalEnrolled":"17,598","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches good food safety practices and shows you how to professionally manage a catering area.","description":"Food contamination could lead to unpleasant outcomes ranging from severe illness to loss of business for a catering outfit or restaurant. Food procurement, handling, processing and storage must be carried out with the utmost care to prevent contamination and spoilage of food. This course explains food contamination in detail and covers the measures, tools and regulations for safely handling food and managing a hygienic cooking area.","courseOutcomes":["Identify foods with a high risk of c...","Outline the responsibilities of a fo...","Explain the importance of a food saf...","Classify causes of food poisoning...","Identify foods with a high risk of contamination and individuals vulnerable to contaminated food","Outline the responsibilities of a food supervisor","Explain the importance of a food safety management system (FSMS)","Classify causes of food poisoning","Define ‘cross-contamination’","Highlight methods for preventing food contamination","Illustrate the importance of temperature control to food safety","Identify some tools for monitoring food and kitchen temperature","Outline some proven methods of preventing food spoilage","Describe some considerations for designing functional catering premises","Identify some common pests that are likely to contaminate food","Describe the training requirements for different kinds of staff in a catering organization","Identify foods with a high risk of c...","Outline the responsibilities of a fo...","Explain the importance of a food saf...","Classify causes of food poisoning...","Identify foods with a high risk of contamination and individuals vulnerable to contaminated food","Outline the responsibilities of a food supervisor","Explain the importance of a food safety management system (FSMS)","Classify causes of food poisoning","Define ‘cross-contamination’","Highlight methods for preventing food contamination","Illustrate the importance of temperature control to food safety","Identify some tools for monitoring food and kitchen temperature","Outline some proven methods of preventing food spoilage","Describe some considerations for designing functional catering premises","Identify some common pests that are likely to contaminate food","Describe the training requirements for different kinds of staff in a catering organization"],"courseDescription":"<p>Any organization that handles or processes food, like restaurants and catering outfits, bears a profound responsibility to ensure that food remains free of contamination. Food poisoning, a consequence of food contamination, can lead to severe illness and even death so measures and regulations are required to ensure that food is prepared under hygienic conditions and kept safe. This course exposes you to the important business of keeping food and cooking spaces healthy. We provide an in-depth look at food safety and explain how a food supervisor ensures it.</p><p>The course then takes you through the food safety management system (FSMS) and ‘hazard analysis critical control point’ (HACCP), an internationally recognized method for managing food safety-related risks. We show you how to implement procedures to ensure that you maintain food and cooking spaces to the highest safety standard. You will also learn about food poisoning and methods for detecting and preventing various kinds of food contamination. We go through the risks and standard practices in food handling to ensure that you keep food in pristine condition at all times.</p><p>The course demonstrates the importance of temperature control for food safety and provides techniques and tools for monitoring food temperature. You will also learn to prevent food spoilage, manage pests and design functional catering premises. Finally, we establish the importance of training food handlers and educating them on food safety. This course is especially helpful to restaurant owners and kitchen staff but suits anyone who handles food. Sign up to learn how to professionally manage food and cooking areas in under three hours.</p><a href=\"https://alison.com/resume/courses/4499\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4499\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Food Safety and Food Poisoning","description":"In this module, you will be introduced to food safety and hygiene and will learn about high-risk foods and individuals vulnerable to food poisoning. You will also learn about the role of food supervisors and regulators in keeping food safe. Finally, you will learn about food poisoning and various methods for preventing food contamination.","topics":["Introduction to Food Safety and Food Poisoning – Learning Outcomes","Food Safety and Food Safety Management Systems","Food Poisoning and Contamination","Food Poisoning and Illness","Introduction to Food Safety and Food Poisoning – Lesson Summary"]},{"name":"Module","details":"Food Handling, Waste Disposal and Pest Management","description":"This module will introduce you to some of the risks associated with handling food, and some practices for mitigating these risks. You will learn about the importance of temperature control in food safety, and methods for monitoring temperature. You will also learn some to manage pests, prevent food spoilage, and design functional cooking premises.","topics":["Food Handling, Waste Disposal and Pest Management – Learning Outcomes","Food Handling and Temperature Control","Food Spoilage and Design Aspects","Waste Disposal and Pest Management","Food Handling, Waste Disposal and Pest Management – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Food Safety and Hygiene – Course Assessment"]}]}