{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4558","title":"Foundational Microbiology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how the living things we can't notice with the naked eye impact you and our world in this free online course.","description":"If you ever doubted the importance of understanding microscopic organisms such as viruses, COVID-19 might have changed your mind. COVID-19 is undoubtedly not the first or last virus that will impact humankind. In such uncertain times, knowledge is power and can be comforting. Do you know much about viruses? How about other microbes such as bacteria, fungi, parasites or prions. This course will equip you with facts and soothe your anxiety.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to fundamental knowledge about microbes, organisms that we can't perceive without a microscope yet influence life on earth in a tangible way. The opening content introduces you to various concepts and terms, including the idea of microorganisms, fungi and protozoa, illustrating why microbes are magical and why we should care about them. Next, you will learn about bacteria. Discover how stains indicate the type of bacteria, which determines whether you have a bacterial infection. Investigate the structure of bacteria, the interior, the making of bacterial cells, their fuel, how we use bacteria to our benefit and how they exchange deoxyribonucleic acid (DNA) with each other.</p><p>The second part of the course examines viruses. Find answers to questions about whether a particular virus is infectious, its benefits, whether it's alive, its size, how we discovered it and how we continue to find others. After that, you will explore fungi, their two main types, indoor moulds, diseases related to fungi and how global warming may impact fungal infection.</p><p>In the final part, you will consider parasites and prions. You will learn about two primary types of parasites: protozoa and helminths. You will become acquainted with diseases related to parasites and see the estimated worldwide prevalence of these diseases. Finally, the presenter discusses prions and illustrates the neurodegenerative diseases associated with prions. This foundational microbiology course provides visuals and clear examples of how these tiny organisms influence our world, making it ideal for beginners. So don't be intimated. Enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}