{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2947","title":"Fundamentals in Route-Specific Drug Delivery","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how tissue engineering can be cultivated to allow for route-specific drug delivery in this free online course.","description":"What are the multiple routes of drug admission throughout the body? In this free online biochemistry course, you study drug delivery engineering, safety protocols and the pros and cons of all manners of drug administration. Discuss the use of bacteriophages for treatment and how inhalation is used with micro-particles.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course in the ‘Fundamentals of Route Specific Drug Delivery’ will cover the foundational knowledge of route-specific drug delivery and administration as well as the properties, advantages and disadvantages of each type of delivery system used. You will begin by learning what route-specific delivery is and the controlled release (CR) systems that are used with it. You will also look at bioadhesives before tackling the various types of admissions.</p><p>Next, you will be taught about oral administration and contrast it with subcutaneous administration as well as their traditional formulations. These will form the basis for this course, along with intramuscular and transdermal delivery systems. You will learn the factors influencing the selection of delivery routes and the mechanisms involved. Permeation enhancement is a large influence within the properties of the systems chosen and used.</p><p>Finally, you will learn about inhalable carriers for inhalation administration. This is a very common form of route-delivery and is used in unison with bacteriophages for treatment as well as dry powder particle delivery, which are both heavily based on inhalation. You will finish with a comparison of intra-articular and intravenous administration techniques and the immune system. This is a fascinating topic for all interested in biology, medicine, chemistry and biochemistry; register now to boost your knowledge today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}