{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4748","title":"Fundamentals of Phlebotomy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the core concepts, skills and compliance standards for drawing blood from a vein in this free online course.","description":"We created this Phlebotomy course to provide you with the hands-on experience needed to work as a phlebotomist. This course will teach you the tasks and responsibilities of a phlebotomist, followed by information on blood composition, blood circulation and its components. Learn about the equipment required and how to perform standard venipuncture. Discover the significance of quality assurance, infection control and risk management.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The need for phlebotomists in modern medicine cannot be overstated. Between 2020 and 2030, employment for phlebotomists is expected to expand by 22%, substantially faster than the national average. This course is for anyone interested in pursuing a career in Phlebotomy. Following an overview of a phlebotomist's tasks and responsibilities, you'll learn about blood composition and circulation. Then you'll study how, apart from the heart, circulation is responsible for delivering oxygenated blood to all other parts of the body.</p><p>This course will teach you about all of the venipuncture equipment and safety precautions and guidelines to be followed, such as asking the patient if they have any allergies and avoiding the stated products. Precautions help ensure the safety of patients and staff. Next, we will teach you the procedures for conducting neat blood cultures and the several ways of controlling infections in the hospital, such as ensuring high standards of cleanliness. Finally, you will discover why quality evaluation is essential in the system and how to conduct it.</p><p>Risk management is paramount in healthcare facilities because it oversees all preventative measures implemented to reduce accidents. This training will teach you how to prevent accidents like needlestick injuries, which are the most prevalent occupational risk, and how to draw a blood sample from the wounded individual to test for infections. This course's content will bring you up to speed on modern Phlebotomy methods. Begin this course right away.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}