{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4865","title":"Basics of Sports Medicine","totalEnrolled":"2,854","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an insight into the role of medicine in the world of sports with this free online course on Alison.com.","description":"Are you looking for information on whether developing a career as a team physician is practical? Or do you want to gather knowledge on the modern role of medicine in sports? This course will take you through an in-depth analysis of the practice and application of treatment in the sporting world. From the history of sports medicine to the types of career opportunities available in this field, we cover it all so enrol now!","courseOutcomes":["Define ‘sports medicine’ along with ...","Identify the various types of career...","List the ten most common types of sp...","Discuss the most common types of med...","Define ‘sports medicine’ along with the various terms and phrases that the term encapsulates","Identify the various types of career opportunities that are available within the world of sports medicine","List the ten most common types of sports injuries along with their diagnoses and treatment options available","Discuss the most common types of medication that are available for sports injuries","Describe the role that nutrition plays in the management of weight and energy for an athlete","Identify the various medical issues faced by athletes during the course of their training","Examine an athlete's exposure to different types of conditions under which they perform their exercises and routines","List the different types of technologies available that make the diagnosis of injuries a lot quicker","Discuss the different methods used within the sports industry for performance enhancements and their potentially harmful side effects","Discuss the future of medicine in sports and the ethical aspect of medication","Define ‘sports medicine’ along with ...","Identify the various types of career...","List the ten most common types of sp...","Discuss the most common types of med...","Define ‘sports medicine’ along with the various terms and phrases that the term encapsulates","Identify the various types of career opportunities that are available within the world of sports medicine","List the ten most common types of sports injuries along with their diagnoses and treatment options available","Discuss the most common types of medication that are available for sports injuries","Describe the role that nutrition plays in the management of weight and energy for an athlete","Identify the various medical issues faced by athletes during the course of their training","Examine an athlete's exposure to different types of conditions under which they perform their exercises and routines","List the different types of technologies available that make the diagnosis of injuries a lot quicker","Discuss the different methods used within the sports industry for performance enhancements and their potentially harmful side effects","Discuss the future of medicine in sports and the ethical aspect of medication"],"courseDescription":"<p>Are you looking to develop a career in sports medicine or become a team physician? Or are you seeking information on the type of drugs and medication commonly used by athletes to overcome injuries? As medicine evolves, so do treatment options for athletes who experience a plethora of injuries and conditions requiring state-of-the-art treatment. This course introduces you to the term ‘sports medicine’ and provides a brief history of medicine in sports and how it has evolved into the vast field it is today. Then you will learn about a team physician's crucial role and responsibilities. Essential qualifications and requirements for a team physician shall also be listed and identified.</p><p>Do your medical qualifications make you a good fit for an athlete or a sports team? We explore the types of career opportunities that are available in the world of sports medicine. The modern athlete is not only limited by physical challenges but also psychological ones. We shall examine all these aspects in detail before identifying the most common types of medication used to treat the hardships of overcoming injuries. You can also never underestimate the part diet and nutrition play in an athlete's preparation. The use of science to ensure that the athlete takes in the correct level of calories, proteins and fats is paramount for optimal athletic performance. We analyse the role of diet and nutrition in ensuring a long and healthy professional career.</p><p>How do competitors handle performing at an optimal level at high altitudes? We will investigate all these climatic conditions and the effect of oxygen levels, extreme hot or cold temperatures or diet intake in various locations. Are you curious about which type of scan is necessary for a particular injury? Examine several imaging techniques at the medical community's disposal, making treatment safer and more practical for an athlete. Analyse the various types of drugs used under clandestine arrangements to enhance performance. Finally, examine the future of sports medicine as it is a continuously evolving field. With technology at the forefront of almost every area, medicine in sports is no exception. This course is here to help you get all the information you need to understand the dynamics of this field. So don't waste any more time and take your learning journey forward.</p><a href=\"https://alison.com/resume/courses/4865\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4865\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Sports and Medicine","description":"In this module, the learner will be going through the role that medicine and nutrition play in the world of sports. The past and present of sports medication shall be discussed. The various career opportunities available in sports medicine shall be identified. Critical injuries, medication, and nutrition within the sporting world shall be examined.","topics":["Sports and Medicine - Learning Outcomes","Sports Medicine","Careers in Sports Medicine","Top Ten Common Sports Injuries","Common Sports Medication","Nutrition and Weight Management","Sports and Medicine - Lesson Summary"]},{"name":"Module","details":"Exercise and Sports Science","description":"This module starts by providing an overview of the plethora of medical issues faced by athletes. A discussion on the challenges of exercising under different types of conditions shall be provided. The use of modern technology to overcome injuries shall be examined. Performance enhancement drugs and the future of sports medicine will be explained.","topics":["Exercise and Sports Science - Learning Outcomes","Medical Problems Faced by Athletes","Sports and Exercise","Medical Imaging in Sports","Performance Enhancement in Sports","The Future of Sports Science","Exercise and Sports Science - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Fundamentals of Sports Medicine - Course assessment"]}]}