{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1625","title":"Global Health Initiative: Malaria Awareness","totalEnrolled":"3,747","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about malaria and the effect it causes on our health.","description":"This global health initiative course on malaria awareness will teach you about malaria, its symptoms, risk factors, and how it can be diagnosed, treated, and prevented. Each year approximately 210 million people are infected with malaria, of which approximately 440,000 of those die from the disease. If you're travelling to a location where malaria is common, it's important to learn about the disease before your visit.","courseOutcomes":["Define the main types of malaria...","Describe the lifecycle the parasite ...","Describe the causes and symptoms of ...","Identify complications and risk fact...","Define the main types of malaria","Describe the lifecycle the parasite that transmits malaria","Describe the causes and symptoms of malaria","Identify complications and risk factors associated with malaria","Describe how malaria is diagnosed and what tests are used","Describe how malaria can be successfully prevented or treated","Define the main types of malaria...","Describe the lifecycle the parasite ...","Describe the causes and symptoms of ...","Identify complications and risk fact...","Define the main types of malaria","Describe the lifecycle the parasite that transmits malaria","Describe the causes and symptoms of malaria","Identify complications and risk factors associated with malaria","Describe how malaria is diagnosed and what tests are used","Describe how malaria can be successfully prevented or treated"],"courseDescription":"<p>Alison Global Health Initiative is a series of courses created to raise public awareness and understanding of common diseases that affect millions of people worldwide. In this course, we cover important aspects of malaria in detail. Malaria is a mosquito-borne infectious disease caused by the Plasmodium parasite. This course will define what malaria is and offers essential facts and statistics about this disease and the medical conditions it can cause. We then describe different aspects such as symptoms and risk factors associated with the disease and how malaria can be diagnosed and prevented.&nbsp;</p><p>Finally, the course describes how to treat a patient with malaria. The information in this course will be of great interest to all learners. It will be valuable to those who live in malaria areas or those going to places that will expose them to the mosquito that causes malaria. Those who want to know more about the disease and its treatment will find this course fascinating. It will also be of great interest to all healthcare professionals who would like easy access to information about malaria that they can share with their patients.</p><a href=\"https://alison.com/resume/courses/1625\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1625\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"GHI: Malaria Awareness","description":"In this module, you will learn about malaria, the symptoms and tests, global statistics of the disease, the parasite responsible for transmitting the disease, the complications, risk factors, treatment, prevention of malaria.","topics":["GHI: Malaria Awareness - Learning Outcomes","GHI: Malaria Awareness","GHI: Malaria Awareness - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Global Health Initiative: Malaria Awareness - Course Assessment"]}]}