{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5445","title":"Good Clinical Practice - ICH Guidelines E6 R2","totalEnrolled":"1,487","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain critical information about Good Clinical Practices in conducting a successful clinical in this free online course.","description":"Clinical research involving human subjects is a very sensitive matter requiring careful decision-making by those involved. In this regard, ICH Guidelines to Good Clinical Practice allow researchers to conduct clinical trials with the correct methodology. With this course, clinical research aspirants can gain detailed insight into conducting fruitful clinical research while ensuring the safety of those affected. ㅤㅤㅤㅤ","courseOutcomes":["Identify the role of ICH and the dut...","Discuss the concept of Good Clinical...","Discuss GCP requirements regarding c...","Explain the role and importance of I...","Identify the role of ICH and the duties of its working groups","Discuss the concept of Good Clinical Practice, as explained in ICH","Discuss GCP requirements regarding conducting a clinical trial","Explain the role and importance of IEC and IRB in conducting a clinical trial","Evaluate the team configuration of IECs and IRBs","Recall the primary responsibilities and procedures of IECs and IRBs","Define ICH's GCP requirements concerning communication with IRBs, and the responsibilities of trial conductors","Discuss the method of taking consent from the trial's subjects","Recognize GCP record-keeping requirements for a clinical trial","Identify the importance of quality management in conducting the trial and the role of a Clinical Research Organization in conducting the clinical trial","Indicate the responsibilities of the trial's sponsors in financing the trial's subjects","Recall how the sponsor will report any adverse events to the regulatory authorities","Outline guidelines about trial protocols and subject treatment protocol","Identify the role of ICH and the dut...","Discuss the concept of Good Clinical...","Discuss GCP requirements regarding c...","Explain the role and importance of I...","Identify the role of ICH and the duties of its working groups","Discuss the concept of Good Clinical Practice, as explained in ICH","Discuss GCP requirements regarding conducting a clinical trial","Explain the role and importance of IEC and IRB in conducting a clinical trial","Evaluate the team configuration of IECs and IRBs","Recall the primary responsibilities and procedures of IECs and IRBs","Define ICH's GCP requirements concerning communication with IRBs, and the responsibilities of trial conductors","Discuss the method of taking consent from the trial's subjects","Recognize GCP record-keeping requirements for a clinical trial","Identify the importance of quality management in conducting the trial and the role of a Clinical Research Organization in conducting the clinical trial","Indicate the responsibilities of the trial's sponsors in financing the trial's subjects","Recall how the sponsor will report any adverse events to the regulatory authorities","Outline guidelines about trial protocols and subject treatment protocol"],"courseDescription":"<p>Annually, millions of clinical researches are conducted globally across various institutions. Among these, many involve humans as test subjects. This matter raises multiple ethical concerns and questions regarding the safety of test subjects. In order to resolve these issues, it is necessary to have a complete set of guidelines that can help researchers conduct clinical trials successfully while ensuring safety. Fortunately, the International Council for Harmonization, also known as ICH, has formulated a detailed set of requirements concerning the involvement of human subjects in a clinical trial.</p><p>These guidelines are called ICH Guidelines for Good Clinical Practice (GCP). And although they have been present for a long time, clinical researchers often need help interpreting and applying them in their research practices. Seeing this, course developers at Exoexcellence Consultants came forward to design this easy bi-modular course on ICH Guidelines for Good Clinical Practice. The first module introduces enrollees to ICH, its aims, the principles of good clinical practice, and the roles and responsibilities of an Institutional Review Board.</p><p>The second module mentions the core requirements of conducting a successful clinical trial. In this regard, they will obtain an explanation of ICH requirements about the roles of trial investigators and sponsors, taking consent from the trial subjects, quality management of the trial and financing, and enacting a flawless trial protocol. Moreover, the last topic of this course mentions all the essential documents needed during different phases of the trial. Enroll in this course today and learn about the ICH requirements to conduct a successful clinical trial.</p><a href=\"https://alison.com/resume/courses/5445\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5445\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"An Introduction to ICH and GCP","description":"This module introduces you to the International Council for Harmonization and its Efficacy Guideline E6, which is dedicated to Good Clinical Practice (GCP) principles. You will learn about ICH's mission, working groups, and principles for GCP. The module also explains requirements concerning the role of IRBs and IECs in clinical trials.","topics":["An Introduction to ICH and GCP - Learning Outcomes","Principals to ICH","Principles and Practices of ICH GCP","Role and Responsibilities of IRBs in Clinical Trials","An Introduction to ICH and GCP - Lesson Summary"]},{"name":"Module","details":"GCP Essentials for a Clinical Trial","description":"This module explains GCP requirements to conduct a clinical trial guaranteeing the safety of its human subjects. It teaches you about the roles of trial investigators and sponsors, taking consent from the trial's subjects, submitting safety reports, trial quality management and financing, ADR reporting, and Investigator's Brochure requirements.","topics":["GCP Essentials for a Clinical Trial - Learning Outcomes","Roles and Responsibilities of Trial Investigators","Quality Management of Clinical Trials","Trial Protocol Guidelines","Crucial Documents for a Clinical Trial","GCP Essentials for a Clinical Trial - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Good Clinical Practice - ICH Guidelines E6 R2 - Course Assessment"]}]}