{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2686","title":"Growing Organic Food Sustainably","totalEnrolled":"15,080","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about sustainable farming practices and organic gardening from this free online course.","description":"This free online course on organic food gardening demonstrates the steps and strategies of growing organic foods. You will learn about the various considerations you need to take into account when growing various types of organic vegetables. By the end of this free online course you will be able to understand the best seasons for planting certain crops and how to sow and grow them accordingly.","courseOutcomes":["Describe the process of preparing to...","Explain the process of successfully ...","Outline the steps to follow when gro...","Describe the process of carrying out...","Describe the process of preparing to grow carrots","Explain the process of successfully growing beetroot","Outline the steps to follow when growing chilli peppers","Describe the process of carrying out crop rotation","Outline various strategies for improving soil quality","Explain how to test your soil","Explain the process of making compost","Describe the process of making raised beds","Explain how to successfully sow various vegetable seeds","Describe the process of transplanting vegetable seed beds","Explain the concept of “hardening off”","Describe how to sow and grow lettuce, peas, garlic, early potatoes and tomatoes","Describe the process of preparing to...","Explain the process of successfully ...","Outline the steps to follow when gro...","Describe the process of carrying out...","Describe the process of preparing to grow carrots","Explain the process of successfully growing beetroot","Outline the steps to follow when growing chilli peppers","Describe the process of carrying out crop rotation","Outline various strategies for improving soil quality","Explain how to test your soil","Explain the process of making compost","Describe the process of making raised beds","Explain how to successfully sow various vegetable seeds","Describe the process of transplanting vegetable seed beds","Explain the concept of “hardening off”","Describe how to sow and grow lettuce, peas, garlic, early potatoes and tomatoes"],"courseDescription":"<p>This free online course on Sustainable Agriculture starts with an extensive module consisting of step by step demo videos on how to prepare and grow a variety of vegetables on your own. You will learn how to grow the following vegetables: Carrots, Beetroot, Chili Peppers, Swiss Chard, Perpetual Spinach, Artichokes, Broad beans, Cabbage and Celery, Garlic, Courgetti, Lettuce, Swede, Shallots, Kale, Runner beans, Potatoes, Onions, Leeks, Peas, Parsnip and Oca. You will also be learning how to maintain your vegetable growing area.</p><p>Furthermore, you will learn about soil care procedures through crop rotation as well as strategies of improving soil quality and fertility. You will get a detailed explanation on how you can make your own compost from locally available materials as well as some key tips and advice that you can apply when growing your own vegetables. Raised beds, their benefits, how to make them, and some tips on how to successfully sow vegetable seeds will all be covered in this free online course. Next, you will be learning about the process of transplanting seedlings. Finally, you will learn how to sow and grow five popular vegetables.</p><p>This online course introduces you to the skills, strategies and advice on farming methods to grow organic foods. Whether you want to grow your own vegetable garden or do it on behalf of someone else, this online course will be of great help. You will be able to avoid obvious mistakes and get it right the first time. By the end of this online course, you will be in a position to grow your favorite vegetables on your own. Start this interesting learning journey today.</p><a href=\"https://alison.com/resume/courses/2686\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2686\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Growing Vegetables","description":"This module consists of step by step demo videos on how to prepare and grow a variety of vegetables on your own. The videos cover demos for growing the following vegetables: Carrots, Beetroot, Chilli Peppers, Swiss Chard, Perpetual Spinach, Artichokes, Broad beans, Cabbage and Celery, Garlic, Courgette, Lettuce, Swede, Shallots, Kale, Runner beans, Potatoes, Onions, Leeks, Peas, Parsnip and Oca.","topics":["Growing Vegetables - Learning Outcomes","Growing Vegetables - Part 1","Growing Vegetables - Part 2","Growing Vegetables - Part 3","Growing Vegetables - Lesson Summary"]},{"name":"Module","details":"Maintaining your Vegetables","description":"In this module learn how to maintain your vegetable growing area. The module covers the following: Soil care through crop rotation, strategies of improving soil quality and fertility, how to test your soil, some information about vegetable families and a step by step process on how to make your own compost.","topics":["Maintaining your Vegetables - Learning Outcomes","Improve Your Soil","Vegetable Families","Maintaining your Vegetables - Lesson Summary"]},{"name":"Module","details":"Advice About Growing Vegetables","description":"This module discusses some key tips and advice that you can apply when growing your own vegetables. You will learn about raised beds, their benefits and how to make them. You will also learn about some tips on how to successfully sow vegetable seeds, You will learn about the process of transplanting seedlings. Finally you will learn about how to sow and grow five popular vegetables.","topics":["Advice About Growing Vegetables - Learning Outcomes","Raised Beds","Sowing Seeds","Five popular vegetables","Advice About Growing Vegetables - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Growing Organic Food Sustainably - Course Assessment"]}]}