{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4652","title":"Health and Safety - Electrical Safety in the Workplace","totalEnrolled":"1,328","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course discusses potential electrical hazards in the workplace and provides solutions to keep you safe.","description":"Electricity is one of the most serious dangers in the workplace. This course reveals how we expose workers continuously to possible electric shock and burns, explaining the potential hazards and introducing you to electrical safety. We outline the OSHA standards necessary to keep you safe from the dangers and help you develop an employee assistance program (EAP) that will assist you to practice controls and maintain high standards.","courseOutcomes":["Summarize the definition of electric...","Outline the standards for electrical...","Discuss the potential electrical haz...","Identify types of hazards, shocks, a...","Summarize the definition of electricity","Outline the standards for electrical use","Discuss the potential electrical hazards that could occur in the workplace","Identify types of hazards, shocks, arcs and blasts","Define the steps to protect you or employees from electrical hazards","Explain electrical safety measures","Identify OSHA requirements and regulations","Discuss what to do when working on or near live parts","Outline the ‘Hierarchy of Control’","Recall the process of forming a good EAP","Summarize the definition of electric...","Outline the standards for electrical...","Discuss the potential electrical haz...","Identify types of hazards, shocks, a...","Summarize the definition of electricity","Outline the standards for electrical use","Discuss the potential electrical hazards that could occur in the workplace","Identify types of hazards, shocks, arcs and blasts","Define the steps to protect you or employees from electrical hazards","Explain electrical safety measures","Identify OSHA requirements and regulations","Discuss what to do when working on or near live parts","Outline the ‘Hierarchy of Control’","Recall the process of forming a good EAP"],"courseDescription":"<p>Since Thales of Miletus, an ancient Greek, discovered static electricity, electricity has fascinated many inventors and paved the way for a host of innovations. However, many risks occur along with these great inventions due to the force electricity can deliver. We experience its possible harm in the form of an electric shock that can cause us pain, trauma or even death. This course delves into the electrical hazards found at work, and the safety measures needed to help reduce these dangers. We begin by looking at the fascinating history of electricity through the eras and how it opened people to a whole new world. Have you perhaps wondered why some materials are more efficient at conducting than others? This course will touch on this aspect before unravelling potential hazards associated with electricity use.&nbsp;</p><p>The course will go on to teach you the potential risks that electricity can cause in the workplace. Discover the conditions under which these dangers occur and learn the types of possible injuries that can arise when working with electricity. Then you will explore Occupational Health and Safety (OSHA) standards, training requirements and safe practices employers should observe. Whether you fall under OSHA or other government and/or locations, this course will give you a sound knowledge base to put these guidelines into practice. You will investigate the dangers, outline the conditions that are acceptable and understand how ground fault circuit interrupters (GFCI) can particularly make a difference.&nbsp;</p><p>The final section of this course will help you set up realistic controls and form action plans that comply with world government regulations and OSHA standards. The employee assistance program (EAP) will demonstrate how to control workplace behaviour, develop practical goals, investigate electrical hazards and finally which questions to consider to prepare you for any inspection. By the end of this course, you will feel confident about protecting your workplace environment from electrical hazards. This course will benefit employers and employees alike as it guides you through forming safe electrical practices at work.</p><a href=\"https://alison.com/resume/courses/4652\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4652\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Electrical Hazards and Safety in the Workplace","description":"This module discusses the history of electricity, what electricity is, and introduces electrical safety measures to secure safety in the working environment. You will study OSHA regulations before working through an action plan to make sure you reach their high standards.","topics":["Electrical Hazards and Safety in the Workplace - Learning Outcomes","An Introduction to Electricity","Electricity's Potential Hazards","Electrical Safety","OSHA Requirements","Employee Assistance Program (EAP)","Electrical Hazards and Safety in the Workplace - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Health and Safety - Electrical Safety in the Workplace: Course Assessment"]}]}