{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5298","title":"Health and Safety Well-being - Infectious Diseases","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online healthcare course covers the transmission of microorganisms, creating an IPCP and various HOC models.","description":"Throughout history, diseases have plagued the world, causing death and suffering. This course on infectious diseases covers a wide range of infectious microorganisms and how to control them. You will explore how these microorganisms are transmitted and what interventions you can take to prevent their transmission. In addition, you will learn the basics of an infection prevention and control program (IPCP) and safe work practices.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Conditions produced by organisms, such as bacteria, viruses, fungi, or parasites, are known as infectious diseases. Our bodies are home to a variety of organisms that, in most cases, are beneficial or even safe. But certain microbes have the potential to cause disease in specific situations. For example, some infectious diseases can spread from person to person, animals or insects to humans, by consuming tainted food and water or coming into contact with environmental organisms.&nbsp;</p><p>This course introduces you to pathogens, defines them and explains how they are transmitted. We then explore how an epidemic begins and spreads. Next, we discuss an infection prevention and control program (IPCP) and what is required to develop one. We guide you through the risk identification process and assessment, examples of which you can download from the resource section. Then, you will become familiar with the various hierarchy of controls (HOC) models created to tackle hazardous circumstances and risky work practices.</p><p>Finally, we study health protection procedures and safe work practices. We examine infectious diseases' impact on our health, delving into various pathogens in more detail by looking at their symptoms, their means of transmission and their prevention. This course has no registration or subscriptions fees and optional certification is available on completion.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}