{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4653","title":"Health and Safety - Personal Protective Equipment","totalEnrolled":"1,372","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the importance of PPE in the workplace, its correct use and the types available in this free online course.","description":"The safety of employees is of utmost importance and so personal protective equipment (PPE) is commonly used in the workplace to prevent serious health hazards and mitigate risks. This course delves deeply into the use of PPE and studies the various types used for the different dangers that may occur. Learn how to conduct a ‘hazard assessment’ correctly and understand the training required in PPE use and care in this health and safety course.","courseOutcomes":["Discuss the general personal protect...","Summarize the potential hazards foun...","Outline the proper use of PPE...","Explain the importance of being trai...","Discuss the general personal protective equipment (PPE) requirements and their role in the workplace","Summarize the potential hazards found at work","Outline the proper use of PPE","Explain the importance of being trained in PPE and who should do the training","Discuss the importance of demonstration when training in the use of PPE","List the most effective eye and face protection","Explain the criteria for protective eye and face devices to meet OSHA standards","Discuss the necessity for using personal protective equipment","Discuss respiratory hazards and control measures","Outline suitable respiratory protection program requirements and training","Define the selection guidelines for head, hand and foot protection","Recognize the care and use of electrical protective equipment","Recall how sound and noise is measured and suitable control and protection","Discuss the general personal protect...","Summarize the potential hazards foun...","Outline the proper use of PPE...","Explain the importance of being trai...","Discuss the general personal protective equipment (PPE) requirements and their role in the workplace","Summarize the potential hazards found at work","Outline the proper use of PPE","Explain the importance of being trained in PPE and who should do the training","Discuss the importance of demonstration when training in the use of PPE","List the most effective eye and face protection","Explain the criteria for protective eye and face devices to meet OSHA standards","Discuss the necessity for using personal protective equipment","Discuss respiratory hazards and control measures","Outline suitable respiratory protection program requirements and training","Define the selection guidelines for head, hand and foot protection","Recognize the care and use of electrical protective equipment","Recall how sound and noise is measured and suitable control and protection"],"courseDescription":"<p>Every business needs to develop a safe and healthy working environment. How do you protect the health and safety of your employees? This course provides the latest information on personal protective equipment (PPE), defines their categories and outlines the training requirements needed for any scenario. The first module explores the general use of PPE as a whole while the second module looks at the particular PPE used to protect each body part. Although every state or country will have its own regulations, the recommendations found in this course align with U.S. OSHA standards.</p><p>At first, you will explore the various designs of PPE and learn the importance of the ‘correct fit’ for each employee using them. We investigate the potential hazards found in the workplace and explain how to form an appropriate PPE hazard assessment. You will discover how to evaluate information to make an informed decision regarding suitable PPE and the level of protection an employee needs. You will go on to understand the required documentation, what hazards controls are and how you can apply them in your working environment. You will also become familiar with who needs training or retraining and the importance of practical evaluation.</p><p>The final module looks specifically at each type of PPE in more detail. You will examine eye and face protection, respiratory protection, heads, hands or feet protection, PPE for electrical safety and PPE needed to avoid hearing loss. You will gain further knowledge of the topics covered in the first module, pertaining more precisely to each type of PPE. Because dangers occur in every working environment, it is of utmost importance for supervisors and managers to be knowledgeable about PPE, manage programs and hazards assessments and to train and educate all personnel. This course is based on OSHA recommendations and is packed full of information for anyone who must understand the importance of hazard control. Enroll today and gain a deep understanding of PPE and its function in controlling dangers.</p><a href=\"https://alison.com/resume/courses/4653\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4653\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to PPE","description":"This module covers general Personal Protective Equipment (PPE). You will learn the requirements for employers to provide PPE to their workers and their proper use. Proper use of PPE is vital to avoid potential exposure. You will discover the potential hazards at work and why formal training and teaching is needed.","topics":["Introduction to PPE - Learning Outcomes","Requirements and Proper Use of PPE","Potential Hazards in the Workplace","Teaching and Training","Introduction to PPE - Lesson Summary"]},{"name":"Module","details":"Classifications of PPE","description":"This module discusses the various types of PPE available for each part of the body. We detail each PPE, from head and face protection, respiratory protection, hand and foot protection, electrical protection and finally, protection to prevent hearing loss. This will enable an employee to choose the correct PPE for each situation or job.","topics":["Classifications of PPE - Learning Outcomes","Eye and Face Protection","Respiratory Protection","PPE for the Head, Hands or Feet","Electrical Protective Equipment","Hearing Loss Protection","Health & Safety 104 - Personal Protective Equipment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Health and Safety - Personal Protective Equipment - Course Assessment"]}]}