{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5016","title":"Health and Safety Well-being - First Aid","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course provides essential first aid life-saving techniques for your colleagues and family.","description":"The importance of first aid at home or work cannot be overstated. In the event of an emergency, you would want to know how to handle it. This course delves into the techniques needed to handle emergencies. Employers must ensure that someone is professionally qualified to provide first aid should something go wrong. You will learn the basics of CPR, how to control bleeding, handling shock victims and what to do when someone burns themself.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Workplace first aid can mean the difference between life and death. This course explores the importance of first aid, different types of injuries and what to do in each case. It begins by outlining how to implement a first aid program at work and touches on the OSHA requirements. It discusses the goals of first aid and how to manage an incident. You will learn to conduct a primary survey using the acronym ‘DRAB’ (‘danger’, ‘response’, ‘airway’ and ‘breathing’) to help you evaluate what is needed and make clear decisions.</p><p>The following section examines what to do if someone is unconscious. Cardiopulmonary resuscitation (CPR) might be necessary if they are not breathing. Learn the goal of CPR, how to perform it and the steps needed for prompt action using the 'chain of survival' action strategy. We will then investigate the variety of wounds that could occur and how to handle different stages of bleeding and shock.&nbsp;</p><p>The final section discusses burns and how they are classified. You will learn to evaluate the burn’s size and what to do or avoid if a colleague is burnt. Although this course does not replace a certified practical course, it will give you the essential tools and techniques to handle any circumstance at work, while travelling or at home. So don't delay: you could make a difference in someone's life today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}