{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4783","title":"Health and Safety Hazards - Hazard Identification","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores hazard identification and analysis, crucial for the welfare of employees at work.","description":"Hazard identification is a process used to evaluate a situation or object that could cause damage or harm in the workplace. This course delves into each aspect of hazard identification. It includes an example of a 'job hazard assessment' (JHA) form, the employer's obligation and how to conduct a risk assessment. We explore preventative measures by examining the workplace to see how each component affects the overall working environment.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The hazard identification and control program aims to keep employees secure by making the workplace and its operations safe. Identifying hazards is a continuous process designed to evaluate situations or items that have the potential to cause harm or damage. This course introduces you to the basic concepts of a job hazard analysis before diving more deeply into preventative measures and procedures. You will discover how important it is to involve your staff in helping you identify behaviors and hazards that could endanger them or the environment in which they work.</p><p>An employer must ensure that employees' work and environment are free of known dangers. You will study various scenarios, which will give you a better understanding of possible implications that could occur. Next, we demonstrate a risk assessment where you look at probability, severity and exposure to decide on the level of risk. You will research the hazard categories and the five different types of exposure using the acronym ‘MEEPS’ (materials, equipment, environment, people and systems). Once you have identified the workplace hazards, you will learn to control them using various approaches.</p><p>The final section of the course goes more in depth into each area. It investigates different types of analyses, such as job hazard analysis, change analysis, process hazard analysis and phase hazard analysis. You will become an authority on the 'Hierarchy of Controls,' a hazard control strategy. Once you have applied various techniques and established solutions, you will know how to perform critical actions that produce successful recommendations. This course is ideal for enabling you to understand workplace hazards and how they can be eliminated or reduced. If you own your own company, are a supervisor or are in safety or management, this course is ideal. It includes tips on writing recommendations to make your working environment safe.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}