{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4724","title":"Health and Safety Hazards - Hazard Communication","totalEnrolled":"1,060","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains the importance of hazard communication when using chemicals in the workplace.","description":"Understanding and knowledge of hazard communication are paramount to ensuring the safe use of harmful chemicals. This course delves into hazard communication and explains how to communicate workplace hazards and the standards that must be met and maintained to ensure consistency under OSHA’s ‘Hazard Communication Standard’ and the United Nations’ ‘Globally Harmonised Systems’. These standards assure effective handling and use of chemicals.","courseOutcomes":["Outline an effective hazard communic...","Summarize the advantages of aligning...","Explain the importance of an employe...","Summarize chemical health hazards th...","Outline an effective hazard communication programme","Summarize the advantages of aligning OSHA and GHS","Explain the importance of an employee's right to be informed","Summarize chemical health hazards that could occur if standards aren’t met","Recall the importance of labelling containers correctly","Identify the warning words, statements and pictograms used to label containers correctly","Describe the importance of using safety data sheets (SDS)","Discuss who is required to have safety data sheets","Outline what is needed on a safety data sheet","Paraphrase the steps the importer must comply with","Discuss employer responsibility in hazard communication","Indicate the training requirements needed in hazard communication","Outline an effective hazard communic...","Summarize the advantages of aligning...","Explain the importance of an employe...","Summarize chemical health hazards th...","Outline an effective hazard communication programme","Summarize the advantages of aligning OSHA and GHS","Explain the importance of an employee's right to be informed","Summarize chemical health hazards that could occur if standards aren’t met","Recall the importance of labelling containers correctly","Identify the warning words, statements and pictograms used to label containers correctly","Describe the importance of using safety data sheets (SDS)","Discuss who is required to have safety data sheets","Outline what is needed on a safety data sheet","Paraphrase the steps the importer must comply with","Discuss employer responsibility in hazard communication","Indicate the training requirements needed in hazard communication"],"courseDescription":"<p>Hazard communication is a set of procedures that employers must implement to protect employees from injury and illness associated with using chemicals. To ensure chemical safety in the workplace, employers must meet these standards. These processes will confirm that the employee knows about the risks involved with the chemicals they employ at work. The Occupational Health and Safety Act (OSHA) and the Globally Harmonised System of Classification and Labelling of Chemicals (GHS) provide global standards to help employees meet these requirements. This course provides all the necessary information and examples to make your workplace safe and your employees aware of dangers.</p><p>The first section looks in depth at how you can establish hazard communication and the information required. You will look at the advantage of using the Hazard Communication Standard (HCS) to create a consistent, logical system for identifying chemicals and presenting hazard information on labels and safety data sheets (SDS) correctly. You will explore the possible health consequences that can arise should the standards not be met. We demonstrate how to label containers effectively for primary, secondary, stationary and portable systems. You will investigate the SDS in detail so that all SDS are uniform with supporting information under the required sixteen headings.</p><p>The final section of the course looks in more detail at the importance of training employees. Employers must convey the chemical information when employees are first allocated a task or before any new assignment. Awareness and training are crucial and this course is jam-packed with all you require to guarantee your workplace follows all the guidelines and standards necessary to protect your employees. Become an expert in hazard communication and be the go-to person your employer or employees can rely on to make sure they are protected.</p><a href=\"https://alison.com/resume/courses/4724\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4724\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Hazard Communication","description":"This module discusses the hazard communication at work and the chemical information needed to ensure employees are safe and understand the risks involved when using chemicals at work.","topics":["Introduction to Hazard Communication - Learning Outcomes","Establishing Hazard Communication","Labeling Containers Effectively","Safety Data Sheets","Employee Training","Introduction to Hazard Communication - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Health and Safety Hazards: Hazard Communication - Course Assessment"]}]}