{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4651","title":"Health and Safety - Fire Safety Training and Planning","totalEnrolled":"6,085","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches basic fire prevention measures and evacuation procedures in the event of a fire.","description":"The best way to avoid fires is to prevent them in the first place. This brief course provides the essential components to help you preempt fires in the work environment and take action in case a fire does occur. You will explore all the possible causes of fire and the measures required to mitigate them. Despite all these precautions, there are times when fires will occur. Be prepared for this kind of emergency by taking this course.","courseOutcomes":["Explain possible causes of fire...","Outline preventative measures to sto...","Summarize serious life safety hazard...","Discuss the importance of approved s...","Explain possible causes of fire","Outline preventative measures to stop a fire from occurring","Summarize serious life safety hazards","Discuss the importance of approved storage areas","Indicate various fire protection systems and their locations","Describe the importance of a sound emergency evacuation plan","Identify where you should locate an evacuation plan","Recall the steps to take in the event of an emergency procedure","Recognize how to aid individuals who require assistance","Explain possible causes of fire...","Outline preventative measures to sto...","Summarize serious life safety hazard...","Discuss the importance of approved s...","Explain possible causes of fire","Outline preventative measures to stop a fire from occurring","Summarize serious life safety hazards","Discuss the importance of approved storage areas","Indicate various fire protection systems and their locations","Describe the importance of a sound emergency evacuation plan","Identify where you should locate an evacuation plan","Recall the steps to take in the event of an emergency procedure","Recognize how to aid individuals who require assistance"],"courseDescription":"<p>Fire safety and training are essential for any company or business. Fire safety programmes need to be developed and regulated under the auspices of each authority's health and safety standards. This course intends to help you establish and maintain a safe working environment. It will guide you through preventative measures to minimise the causes of fires and teach you correct evacuation procedures if one occurs.&nbsp;</p><p>We believe that knowledge and education is crucial to save lives and prevent property damage. This training course begins by explaining the components of a fire and the possible causes. Then you will investigate how to prevent fires before learning how to reduce them, inspect potential problems and report them as soon as they occur. This leads to the necessity of a fire prevention plan (FPP), which provides information and guidelines to all employees or trainees to control fires or eliminate their cause in the first place.</p><p>The second section of the course will teach you emergency evacuation and procedures. You will become familiar with portable and stationary equipment and learn how to plan ahead if a fire breaks out. Understand that at least two evacuation routes are required in an evacuation plan and know that you should display these emergency routes in a visible location. Individuals requiring assistance must particularly be prepared and know their routes. The course will take you step by step through emergency procedures and train you in simple fire safety techniques. Although this material is a health and safety guide, individuals should refer to specific requirements and practices based on their industry and location. So enrol today and be a step ahead of your colleagues in understanding fire safety and the role that evacuation procedures can play in keeping everyone safe.</p><a href=\"https://alison.com/resume/courses/4651\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4651\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fire Prevention","description":"Fire losses are costly. This module teaches you the leading causes of fire in the workplace and suggests tips on preventing or controlling them once they have started.","topics":["Fire Prevention - Learning Outcomes","An Introduction to Fire Safety and Prevention","Fire Preventative Measures","Fire Protection Systems","Fire Prevention - Lesson Summary"]},{"name":"Module","details":"Emergency Evacuation","description":"This module discusses emergency equipment and its location. In addition, you will learn about the step-by-step procedure for planning an evacuation, exit routes, and protocols.","topics":["Emergency Evacuation - Learning Outcomes","Planning and Emergency Equipment","Evacuation Plan","Emergency Procedures","Emergency Evacuation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Health and Safety - Fire Safety Training and Planning: Course Assessment"]}]}