{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4551","title":"Health and Safety - Introduction to EAP and FPP","totalEnrolled":"1,163","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will prepare you for any unexpected emergency at work, including fire prevention and protection.","description":"Emergencies at work occur more frequently than you think. This course equips you to develop a detailed emergency action plan (EAP) and a comprehensive fire prevention plan (FPP) to ensure employees feel safe and secure in their working environment. This course, designed around the US Occupational Safety and Health Administration (OSHA) standards, will help you train workers to prevent disaster or limit damage caused by one.","courseOutcomes":["Outline an emergency action plan (EA...","Create an EAP...","Include evacuation procedures in a d...","Recognize the purpose of having a FP...","Outline an emergency action plan (EAP) requirements","Create an EAP","Include evacuation procedures in a document","Recognize the purpose of having a FPP in place","Recall who is responsible for each area in an FPP","Discuss the best practices employees should take to limit the risk of fire in the work environment","List the main hazards that lead to fires in the workplace","Select the key components of a sound fire-extinguishing system","Evaluate the FPP training requirements","Identify the various fire extinguishers and the class of fire they each extinguish","Indicate how to activate a fire extinguisher","Outline an emergency action plan (EA...","Create an EAP...","Include evacuation procedures in a d...","Recognize the purpose of having a FP...","Outline an emergency action plan (EAP) requirements","Create an EAP","Include evacuation procedures in a document","Recognize the purpose of having a FPP in place","Recall who is responsible for each area in an FPP","Discuss the best practices employees should take to limit the risk of fire in the work environment","List the main hazards that lead to fires in the workplace","Select the key components of a sound fire-extinguishing system","Evaluate the FPP training requirements","Identify the various fire extinguishers and the class of fire they each extinguish","Indicate how to activate a fire extinguisher"],"courseDescription":"<p>The importance of health and safety in the workplace cannot be stressed enough. This course will prepare your workers in the likely event of an emergency or fire. The Occupational Safety and Health Administration (OSHA) of the United States lists several requirements necessary to include in your plan. This course takes an in-depth look at some of these conditions. Whether you are an employer or an employee, this course teaches how to deal with emergencies, which could save your life and those of others.</p><p>Have you ever thought about how to escape from a building if a disaster occurred? An emergency action plan (EAP) helps you evacuate your building quickly and efficiently if an emergency strikes. It is a written document with key details, reporting requirements and typical procedures to undertake in the event of a crisis. The importance of knowing who is in charge, who makes decisions to evacuate, and the requirements for those staying behind are crucial. Accounting for everyone after evacuation is also essential. Ensuring the right person coordinates all the emergency services will make for an effective evacuation, keeping the loss of life and property to a minimum.</p><p>This course then explains fires and how to deal with them. Fires are classified according to the fuel that ignites them. This information is necessary when fighting a blaze as identifying which fire extinguisher to use for each class is imperative to prevent flames from getting out of control. You will be taught how to use an extinguisher and which one is appropriate for each type of blaze. The course’s final section deals with fires that can materialize and quickly get out of control. A fire prevention plan (FPP) helps limit this damage. We will discuss the five best practices of a FPP and give examples of possible hazards and materials that have the potential to ignite. Know your extinguishers, how to use one, and discover how to train yourself and your staff to be competent in an emergency. This material is a health and safety guide, but individuals should refer to specific requirements and practices based on their industry and location. This course has a wealth of information ready at your fingertips that could save a life.</p><a href=\"https://alison.com/resume/courses/4551\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4551\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Emergency Action Plans (EAP)","description":"This module introduces you to the emergency action plan (EAP), the elements to include in an EAP and the theories on exit routes and contingency processes. In addition, you will understand how to identify critical areas to coordinate and account for all employees, and organise search and rescue services.","topics":["Emergency Action Plans (EAP) - Learning Outcomes","EAP Requirements","Reporting and Evacuation Procedures","Assembling Areas and Employee Count","Emergency Action Plans (EAP) - Lesson Summary"]},{"name":"Module","details":"Fire Prevention and Protection Plan (FPP)","description":"This module will teach you to identify fires, classify them, and use a fire extinguisher to smother a fire according to its fuels. Learn the essential responsibilities for managers and supervisors to know how to execute a quality FPP and the value of training employees in their role.","topics":["Fire Prevention and Protection Plan (FPP) - Learning Outcomes","Fire Classification","FPP and Training Requirements","FPP - Written Components & Best Practices","Fire Prevention and Protection Plan (FPP) - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Health and Safety - Introduction to EAP and FPP - Course Assessment"]}]}