{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1713","title":"Health and Fitness - Running Tips, Swimming and Strength Training","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how performing running, swimming and strength training greatly improves health and fitness levels.","description":"This free online health and fitness course will teach you how running, swimming and strength training exercises will greatly improve your physical fitness. Problems with sedentary lifestlyes and increasing obesity levels are of major concern to many people. The course shows you how to perform a range of exercises, and provides a range of workout routines for you to practice. Start this free online course today and start improving your health.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, you will learn how performing running, swimming and strength training will improve physical fitness. You will study different running workouts designed to maximize aerobic potential and develop endurance. You will learn how appropriate track and terrain training increases performance, and how sprint and hill running improves distance, time and maximum speed. The course informs you about choosing and using appropriate running gear, and you will learn about different running surfaces and about the importance of running form or gait.</p><p>Swimming is excellent exercise for overall fitness, aerobic endurance, power, strength and flexibility. You will compare the benefits of open-water versus pool swimming and learn why wet suits, fins and other swimming gear is worn. There are a range of interval workouts presented, with details on work-rest ratios, pace, distance and repetition, for aerobic and anaerobic training sessions.</p><p>The course then introduces you to the principles of muscle strength and endurance training, through the use of weight equipment. Optimal physical fitness requires muscles of the upper and lower body to be developed in a balanced way. The course informs you how to perform strength training exercises that develop full body muscular balance. You will examine warm-up and cool-down exercises and how to avoid common injuries, and you will learn about the importance of diet, nutrition and hydration before and after exercise. Start this course today and gain the knowledge and skills to greatly improve your physical fitness and well-being.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}