{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1868","title":"HERO Training Course for Housing and Mental Health Projects","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about Housing Quality Indicators for community housing and mental health projects with this free online course.","description":"This free online HERO course teaches you about the HERO Housing and Mental Health Project training course, and about the 10 Housing Quality Indicators that have been identified for each of the targets of the HERO project. Mental illness affects around 27% (83 million) of Europeans annually. With this course, you will learn that community-based services show significantly better outcomes on adherence to treatment, clinical symptoms, and more.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online HERO training course has been developed to support learning and training of the local community activists involved in housing and mental health projects. The course has been designed to facilitate the learning, understanding, and developing of skills regarding the topics covered. Therefore, the structure of this training material allows its use both by single individuals, but also by facilitators and groups to develop workshops or sessions regarding the topics with different kind of targets.<br>This training course is divided into four modules, one for each of the target of the HERO project. The first module is dedicated to Users and their Families, followed by a module for Mental Health Professionals, one for Other Organisations, and finally Citizens. <br>Each module provides insights on the 10 Housing Quality Indicators that have been identified from Focus Groups and review of international literature during the first phases of the project. <br>For each module you will find a theoretical description of the topic with definitions, challenges regarding the topic and insights to face them and benefits regarding the topic followed by a more practical session including Self-Learning exercises aiming to actively process the previous theoretical description. In addition, the HERO Training Curriculum is available in the Course Resources section. All the modules and units are included as well as examples of good practices and group activities. We recommend that you download and read this documentation as part of completing this course. So, why wait? Start learning today and by the end of the week you will have gained skills and knowledge, which could help you and your community!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}