{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3932","title":"Higher Chakras with Lisa Grail","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to manage your chakras to improve your physical, emotional and mental well-being.","description":"Chakras refer to the energy centres in your body. Your chakras need to stay open or balanced to avoid physical, emotional, and spiritual health issues. This free online course will teach you about higher chakras that run along your spine. You will study the role they play in the flow of energy in your body. You’ll also learn special techniques to keep them open to promote physical, mental, and emotional well-being. Sign up today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Everyone has a measure of energy or chakra centred around the body, and each person's chakra is unique and different. That is why people can sometimes give off a 'good' or 'bad' vibe. In this free online course, you will understand how these energy centres work and how to harness their power to maintain physical, mental and emotional well-being. You will learn some powerful techniques to open and balance your chakras to regain vitality, health, and happiness in your life. Uncover characteristics of chakra and the possible causes for energy blocks. Find out what happens to your physical, emotional, mental, and spiritual health when your chakras are balanced or imbalanced. Gain a good understanding of the third eye and differentiate your physical sight from your spiritual one.</p><p>Next, learn how to create a sacred space for meditation to help you feel more connected to what is meaningful to you. Consider the best kriya to raise your vibrations, change your reality for the better, and strengthen your aura. You will also learn how to awaken green energy to attract prosperity and abundance in your life. Find out how to align your desires with your capabilities to realize your dreams and learn some physical postures and meditation practices to release stored tensions. You will learn to chant mantras to establish an energetic connection between your physical body and higher consciousness. Familiarize yourself with the meaning of various mantras used in Kundalini yoga.</p><p>Everything is energy, and energy is always moving. You can shift and move into your most natural, balanced energetic flow so that your chakras will allow you to specifically target points in your body with positive energy and recharge your body, mind, and soul. Clear and healthy functioning chakras certainly propel you into the life you deserve to live. Keeping your chakras in harmony is the key to overall physical and spiritual happiness. If you want to feel better, increase your vitality, have a better sex life, and create abundance, start actively working with your chakras. This exciting free online course will teach you excellent techniques to revive your chakras and find balance within your body and mind. You have the power to improve your well-being, so start learning today!&nbsp;</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}