{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1368","title":"HIV/AIDS - Awareness & Prevention","totalEnrolled":"34,781","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the common misconceptions about HIV and AIDS that will raise awareness and prevention of these diseases.","description":"This free online HIV/AIDS course teaches focuses on awareness and prevention of the disease. This global health issue continues to affect millions of people. With this course, you will get a comprehensive understanding of the impact of HIV/AIDs on both individuals and communities around the world. You will also look into the common misconceptions surrounding this disease and examine its spread, including its death toll on a global scale.","courseOutcomes":["Discuss the spread of HIV and AIDS...","Explain ways to spread awareness, pr...","...","...","Discuss the spread of HIV and AIDS","Explain ways to spread awareness, prevention and control of AIDS","Discuss the spread of HIV and AIDS...","Explain ways to spread awareness, pr...","...","...","Discuss the spread of HIV and AIDS","Explain ways to spread awareness, prevention and control of AIDS"],"courseDescription":"<p>The spread of AIDS and HIV is both a threat and a challenge to development programs in developing countries. This is why improvements in child healthcare have made a big turnaround in recent years. This course will discuss HIV and AIDS including the spread of AIDS and the deaths it has caused in different countries. You will learn how Thailand made a move to make their people aware of the disease with the Thailand’s AIDS Education program as well as their Prevention and Care Project.<br><br>You will then look at the common misconceptions and false understandings about HIV and AIDS and learn the truth behind those misconceptions. The course will cover basic information about HIV/AIDS, from having an HIV test to living with HIV or AIDS which will be a great help in its awareness and prevention. By learning how to protect yourself from the disease, HIV/AIDS can stop being a threat to the community.<br><br>HIV (human immunodeficiency viruses) and AIDS (acquired immune deficiency syndrome) are potentially life-threatening infections and illnesses that can take over your body once your immune system has been severely damaged by the said diseases. The best way to help prevent spread of HIV and AIDS is education, and by informing people about the risks and how to protect themselves from it. This course teaches safe health practices, AIDS awareness, prevention, and control. Have a look at the course today, and learn something truly essential.</p><a href=\"https://alison.com/resume/courses/1368\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1368\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to HIV and AIDS","description":"This module discusses HIV and AIDS. You will learn about the spread of AIDS and the deaths it has cased in different countries. You will learn about Thailand’s AIDS Education program and their Prevention and Care Project to help stop the spread of AIDS in that country. You will learn about common misconceptions and false understandings about HIV and AIDS and the truth behind those misconceptions.","topics":["HIV/AIDS - Awareness & Prevention - Learning Outcomes","HIV and AIDS - Part 1","HIV and AIDS - Part 2","HIV/AIDS - Awareness & Prevention - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["HIV/AIDS - Awareness & Prevention Assessment"]}]}