{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1387","title":"Hospitality Management - Health and Safety in Food Service","totalEnrolled":"18,598","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain an in-depth understanding of the health and safety aspect of food service with this hospitality management course.","description":"This free online course in Hospitality Management will introduce you to basic health and safety practices encountered in food services, and teach you about the functions and operations of the food and beverage department in any hospitality industry. You will also learn about food service principles throughout the hospitality industry, as well as other food service essential considerations such as restaurant layout and interior design.","courseOutcomes":["Define the features of a well-planne...","Define personal hygiene...","Explain health management and health...","Explain the five steps to food safet...","Define the features of a well-planned kitchen","Define personal hygiene","Explain health management and health conditions","Explain the five steps to food safety","Describe what is meant by food contamination","Explain proper food handling priorities","Describe the food preparation procedures","List the six basic hygiene practices for food handlers","Describe food disposal practices","List the different types of restaurant workforce injuries and accidents","Explain the main firefighting principles","Define the basic tasks involved in first aid","Define the features of a well-planne...","Define personal hygiene...","Explain health management and health...","Explain the five steps to food safet...","Define the features of a well-planned kitchen","Define personal hygiene","Explain health management and health conditions","Explain the five steps to food safety","Describe what is meant by food contamination","Explain proper food handling priorities","Describe the food preparation procedures","List the six basic hygiene practices for food handlers","Describe food disposal practices","List the different types of restaurant workforce injuries and accidents","Explain the main firefighting principles","Define the basic tasks involved in first aid"],"courseDescription":"<p>This course will first introduce you to the features of a well planned kitchen. You will look into the important factors of kitchen design including the kitchen layout. You will study personal hygiene and health management as well as learn about the different types of kitchen equipment. The course will discuss food safety, the observance of good hygiene codes and habits in relation to the food handling process, and the two basic types of food-borne illnesses.<br><br>You will then look into the common accidents in food service such as cuts, burns, and lacerations. The course will discuss fire safety, firefighting facilities, and equipment as well as teach you that fire extinguishers must only be used on the types of fire they are designed for. The course will also discuss first aid and teach you the two basic steps in restaurant first aid, which are CPR and the Heimlich maneuver.<br><br>The hospitality industry provides food, drink and, accommodation to people who are away from home. It is crucial that the needs of these people are met with kindness and goodwill. This course will teach you the best health and safety practices that will ensure a comfortable and satisfying stay at your hotel or for your restaurant guests. You can then rest assured that your customers will return and even help promote your business by word of mouth. That's really useful knowledge, and you can start learning it today, for free!</p><a href=\"https://alison.com/resume/courses/1387\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1387\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Kitchen Design and Layout","description":"This module teaches you the features of a well planned kitchen. You will learn about the different types of kitchen equipment and how to manage personal hygiene in the kitchen.","topics":["Kitchen Design and Layout - Learning Outcomes","Kitchen Layout for Food and Beverage Services","Personal Hygiene","Kitchen Design and Layout - Lesson Summary"]},{"name":"Module","details":"Safe Food Handling in Food Service Operations","description":"In this module, the main focus is on the observance of good hygiene codes and habits in relation to the food handling process, from initial food purchasing and storage through the preparation and cooking procedures to food service and finally disposal.","topics":["Safe Food Handling in Food Service Operations - Learning Outcomes","Food Safety","Food Handling Process","Safe Food Handling in Food Service Operations - Lesson Summary"]},{"name":"Module","details":"Preventing and Treating Accidents in Food Service Operations","description":"This module covers the main types of accidents in the food service sector, and the procedures and precautions that can be undertaken to minimize the effects. Fire safety and basic first aid procedures are also covered.","topics":["Preventing and Treating Accidents in Food Service Operations - Learning Outcomes","Food Service Accidents","Fire Safety and First Aid","Preventing and Treating Accidents in Food Service Operations - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 4: Hospitality Management - Health and Safety in Food Service Assessment"]}]}