{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4507","title":"How to Use Garden Herbs","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop a beautiful herb garden and learn the diverse applications of herb plants in this free online course.","description":"Are you looking to design an aesthetically pleasing herb garden in your own home? Do you want to add herbs to your diet? This course will help you grow your very own herb garden and covers their many applications. Humans have used herbs since ancient times as agents for cooking and healing or as fragrances and gifts. So don't waste any more time. Begin this gardening course today and build the perfect herb garden for your home.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you a gardening hobbyist looking to establish a herb garden in your own home? Have you decided to experiment with the numerous health benefits of herbs? Humans have used herbs in multiple forms for various purposes for millenia. Herbs have diverse applications, whether as remedies for illnesses or ingredients in recipes. This gardening course teaches you how to use herbs to make gifts and scented products. We also explain how to employ them for culinary or cosmetic purposes or as simple home remedies. We kick off with the basics of building a herb garden. We go through the essential herb garden checklist to ensure that you create your herb garden correctly. We discuss the effects of seasons on herbs and identify which season is best for herb cultivation. We advise you on how to ensure that the garden remains pesticide-free. Fretting over the style of your herb garden? Don’t worry. Whether it’s a formal look or an informal one, we explore both types of designs and supply tips and tricks to make sure your garden is aesthetically pleasing to anyone who looks at it.</p><p>Tired of spending excessive amounts of cash on traditional allopathic medication without any improvement in health? This course guides you in understanding the wondrous healing abilities of herbs. Discover how herbs can treat numerous ailments. Herbal medicine has been a field on its own since humans discovered its healing capabilities. With fewer serious side effects and lower costs, herbs have evolved into one of the leading forms of medication in the world of medicine today. We demonstrate how to prepare at-home remedies for numerous ailments such as cough, nausea, skin conditions, digestion problems and stress-related issues. Looking for ideas to beautify the home without a massive dent in the pocket? Are you tired of using the same cosmetic products at the grocery store without any results? We investigate the solutions to these and other issues. For example, we analyze herbal cosmetics that can be highly beneficial for the hair, skin and overall body and explain how to use herbs to adorn your own living space. Use them as fragrances, potpourris and even as great gift ideas.</p><p>If you want to start a healthy diet regimen and are confused about beginning, this course gives you simple, healthy and delicious ways to incorporate herbs into any diet and make it scrumptious. The health benefits of herbs are well known. We analyze how to store herbs at the correct temperatures and identify the conditions for maximum dietary benefit. We outline the key ingredients and describe their respective benefits for the mind and body. We discuss the various methods to propagate and cultivate culinary herbs as you work through the course. The benefits of herbs are now well documented across the world and they have become practical remedies for numerous ailments. With so many day-to-day uses and benefits, it is important to incorporate herbs properly in our daily lives for maximum benefit. So enrol for this gardening course now, develop your very own herb garden and reap the fantastic benefits as soon as you can!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}