{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1858","title":"Human Nutrition - Introduction to Macronutrients","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the importance and function of macronutrients for nourishment with this introduction to macronutrients course.","description":"This free online Human Nutrition course will give you an Introduction to Macronutrients. Our bodies require us to consume macronutrients on a daily basis to maintain important bodily functions such as growth and energy production. With this course, you will take an in-depth look at the three key energy-yielding macronutrients - carbohydrates, proteins, and lipids - and gain a solid understanding of their role in the maintenance of good health.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course will first discuss carbohydrates, the different chemical formulas associated with them, and how they are produced in plants. You will study the two types of simple carbohydrates, the three types of monosaccharides, and the three commonly occurring disaccharides. You will learn the three types of sugar in alcohol and their major advantages. The course will also cover alternative sweeteners as well as the two groups of complex carbohydrates.<br><br>You will then look into proteins and learn about the different types of amino acids and their structures. You will study the process of protein synthesis and learn about levels of protein structure and various protein functions. The course will also discuss the two types of proteins. Next, you will learn about lipids and the different fatty acids. You will be introduced to the naming systems for fatty acids as well as their food sources. The course will also cover essential fatty acids and eicosanoids.<br><br>The study of human nutrition is incredibly important as it helps us learn the essential nutrients in food that are necessary to support human life and health. Poor nutrition is a chronic problem all over the world which can be solved with a proper understanding of nutrition and dietary practices. This Human Nutrition - Introduction to Macronutrients online course will make it a little bit easier for you to achieve this goal.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}