{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1859","title":"Human Nutrition - Introduction to Micronutrients","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the role and functions of vitamin C, vitamin E, and selenium with this free online micronutrients course.","description":"This free online Human Nutrition course will give you an introduction to micronutrients. Vitamin C, vitamin E, and selenium are micronutrients and antioxidants that help prevent and delay various types of cell damage. Foods containing these biochemicals are beneficial for our health. With this course, you will learn about their absorption, metabolism, and excretion as well as the effects of their deficiency and toxicity on human health.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first discuss vitamins and minerals. You will learn about fat-soluble, water-soluble vitamins, and the different categories of minerals. You will also learn about the two schools of thought on how to cover vitamins and minerals in nutrition classes. Next, you will learn about antioxidant minerals and vitamins. You will look into free radicals, reactive oxygen species (ROS), and oxidative stress. You will study the components of antioxidant enzymes and the antioxidant network. You will also learn how too much intake of antioxidants can cause harm.<br><br>You will then look into the different forms of vitamin E, vitamin C, and selenium. You will study their absorption, metabolism, and excretion in the human body. The course will cover their food sources, the diseases resulting from deficiency, and their toxicity. You will also learn about enzymatic functions of vitamin C as well as look into Linus Pauling's work relating to vitamin C. Finally, you will learn about the dietary reference intake decisions and international units.<br><br>Micronutrients are substances required in trace amounts and are one of the major groups of nutrients your body need. They include vitamins which are necessary for energy production, immune function, and blood clotting as well as minerals that play an important role in growth, bone health, and fluid balance. This Human Nutrition - Introduction to Micronutrients course will help you gain an in-depth understanding of their function and role in human health. Check out the course today, and gain some new knowledge in just a few short hours.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}