{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5109","title":"Hydrogen Sulfide Awareness","totalEnrolled":"4,789","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to work safely in environments that are rich in hydrogen sulfide in this free online H2S awareness course.","description":"This health and safety course promotes hydrogen sulfide (H2S) awareness and covers the basic precautions required to work safely in H2S-rich environments. We explain the hazardous properties of H2S and its exposure limits, health effects, detection methods, control measures, suitable personal protective equipment and emergency response measures. This course provides practical chemical advice to reduce risk and keep you safe from this toxic gas.","courseOutcomes":["Describe H2S and explain how it is f...","Identify H2S hazards and where they ...","Highlight the exposure routes and ph...","Outline the risk factors of H2S expo...","Describe H2S and explain how it is formed","Identify H2S hazards and where they can occur in a workplace","Highlight the exposure routes and physiological effects of exposure to H2S","Outline the risk factors of H2S exposure","State the workplace exposure limits for short- and long-term exposure to H2S","Explain the recommended control measures to avoid H2S exposure","Discuss the types and use of H2S detection equipment","List the calibration types used to verify the accuracy of H2S detectors","Identify the types and use of respiratory protective equipment required to prevent H2S exposure","Summarize the basic first aid steps to take in H2S emergencies","Describe H2S and explain how it is f...","Identify H2S hazards and where they ...","Highlight the exposure routes and ph...","Outline the risk factors of H2S expo...","Describe H2S and explain how it is formed","Identify H2S hazards and where they can occur in a workplace","Highlight the exposure routes and physiological effects of exposure to H2S","Outline the risk factors of H2S exposure","State the workplace exposure limits for short- and long-term exposure to H2S","Explain the recommended control measures to avoid H2S exposure","Discuss the types and use of H2S detection equipment","List the calibration types used to verify the accuracy of H2S detectors","Identify the types and use of respiratory protective equipment required to prevent H2S exposure","Summarize the basic first aid steps to take in H2S emergencies"],"courseDescription":"<p>This health and safety course lays out the various safety hazards of hydrogen sulfide (H2S) gas and explains how to control them to work safely. You will learn different names of H2S, its hazardous properties and its most likely locations. We identify the routes the gas takes and outline the risk factors of different exposure limits established by various international organizations.</p><p>The course explains the different control measures that can be implemented to control H2S exposure and goes over the detection and measurement methods that help you to identify the respiratory protective equipment recommended for various H2S environments. Lastly, we lay out the steps to take during H2S emergencies and outline first aid procedures used to save victims of the gas.</p><p>This chemistry course suits anyone working in industries that encounter H2S, including the petroleum, construction, mineral mining, pulp and paper, metal processing and sewerage treatment fields. It also benefits anyone responsible for managing risk in such environments, particularly those overseeing employee health and safety training. Sign up to protect yourself and your colleagues from one of the most poisonous gases in the world.</p><a href=\"https://alison.com/resume/courses/5109\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5109\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"H2S Hazards and Controls","description":"This module will introduce you to hydrogen sulfide gas, its hazardous properties, and possible locations where it can be found. You will also understand the exposure limits, control measures to avoid exposure, detection methods, and personal protective equipment. In addition, you will learn the steps to take in hydrogen sulfide emergencies.","topics":["H2S Hazards and Controls - Learning Outcomes","Hydrogen Sulfide (H2S) Introduction","Physiological Effects of H2S Exposure","Hydrogen Sulfide Exposure Limits","Control of Hydrogen Sulfide Exposure","Hydrogen Sulfide Detection Equipment","Respiratory Protective Equipment","H2S Emergency Response Guidelines","H2S Hazards and Controls - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Hydrogen Sulfide Awareness - Course Assessment"]}]}