{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4910","title":"Identifying Child Abuse and Neglect","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain insights into identifying and preventing child abuse and neglect with this free online childcare course.","description":"International studies reveal that nearly three out of four children aged 2-4 regularly suffer from child abuse and neglect. However, this is preventable if you learn to recognise the signs and symptoms of child abuse and neglect, helping curb the adverse effects of this on the child and avert further damage. This course will equip you with relevant knowledge on identifying and reporting child abuse and negligence cases.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will help you to gain a comprehensive understanding of child abuse and neglect. We will explore the first step in helping an abused or neglected child and different types of abuse. Possessing this knowledge will help you to quickly identify the kind of abuse and neglect the victim is undergoing to report such cases adequately. Next, you will learn to recognise the signs from the child, parents or guardian.</p><p>Did you know that chronic child neglect, which is less visible and often less sensational, is more pervasive and difficult to resolve? Find out about chronic neglect, how to work with families undergoing it, including critical factors of successful casework practices, examples of what agencies are doing and ways agencies can consolidate child welfare approaches to chronic neglect with prevention and early intervention efforts. We will debate the impact of physical, psychological, behavioural and societal consequences. In actuality, however, separating the types of effects is impossible. Physical consequences, such as harm to a child’s developing brain, can have psychological inferences such as cognitive delays or emotional difficulties. We will research the long-term consequences of child abuse and neglect.</p><p>Next, we will outline programs and strategies that are proving advantageous in reducing the possibility of child maltreatment. In addition, we will briefly identify critical issues facing child abuse and neglect prevention programs as they seek to broaden their reach and impacts. By completing this course, you will learn what child abuse looks like in real life and what caseworkers do to protect children by helping families develop healthier habits and behaviours. This course is ideal for everyone, especially professionals working in social services. So go ahead and enrol in this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}