{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4483","title":"Introduction to ADHD Awareness","totalEnrolled":"3,752","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores attention deficit hyperactivity disorder and its treatment with therapy and medication.","description":"Attention Deficit Hyperactivity Disorder (ADHD) is a neurobehavioral disorder that has become widely recognised. This course clarifies ADHD and discusses all the components and benefits of understanding this condition. We provide information to assist you in diagnosing the disorder and exploring its various treatments. We explain what the key terms of ADHD are. We answer practical questions relating to the diagnosis of this condition.","courseOutcomes":["Analyse the family picture of ADHD...","Categorise the diagnosis of ADHD and...","Define the picture of ADHD and how i...","Describe moving into adolescence wit...","Analyse the family picture of ADHD","Categorise the diagnosis of ADHD and its first treatments","Define the picture of ADHD and how it affects the child","Describe moving into adolescence with ADHD","Evaluate the treatment with the holistic approach","Explain patterns of behaviour for parents to be aware of","Identify how parents can cope with a child that has ADHD","Indicate everyday issues to be overcome by everybody involved","Analyse the family picture of ADHD...","Categorise the diagnosis of ADHD and...","Define the picture of ADHD and how i...","Describe moving into adolescence wit...","Analyse the family picture of ADHD","Categorise the diagnosis of ADHD and its first treatments","Define the picture of ADHD and how it affects the child","Describe moving into adolescence with ADHD","Evaluate the treatment with the holistic approach","Explain patterns of behaviour for parents to be aware of","Identify how parents can cope with a child that has ADHD","Indicate everyday issues to be overcome by everybody involved"],"courseDescription":"<p>This course on ADHD provides accurate knowledge and awareness of this mental health disorder and demonstrates the working principles of understanding this condition. We describe and clarify the characteristics and functions of this condition's diagnosis and guide you through specific information about treatment affecting you personally. We provide the answers to questions relating to the key symptoms of the disorder, provide a parent’s guide and outline the initial signs to look for when contemplating if your child has ADHD or not. We discuss creating a plan before teaching you to assess the various ways of dealing with ADHD and knowing the differences.</p><p>Following this, we will prepare you to learn all about ADHD, allowing you to deal with the problems if it affects a family member or a work colleague. You will understand the effectiveness of cognitive behavioural therapy (CBT) for ADHD. Next, you will research how treatment works and examine the available distinct varieties of therapy. What behaviours emerge with this condition? What tools help you deal with ADHD? This course will clarify these questions before explaining how to live with ADHD successfully. Finally, you will discover the problems of a later or adult diagnosis and the related symptoms like impulsivity.&nbsp;</p><p>This course will equip you with the skills you need to understand ADHD and help you become aware of all the terminology and understanding you need from scratch. It provides precise and detailed techniques you can apply in your working field. This induction in ADHD awareness course is ideal for those with a family member or people who want to understand this disorder better. Register for this training course and become familiar with ADHD and the importance of awareness.</p><a href=\"https://alison.com/resume/courses/4483\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4483\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to ADHD","description":"This module will help you discuss the introduction to ADHD. We will review the symptoms of the condition. Also, this module will consider the first diagnosis and treatments from the condition. We will help you answer questions like: How can a kid be diagnosed with the condition? What are the Key terms of ADHD?","topics":["Introduction to ADHD - Learning Outcomes","Introduction to ADHD","The Family Picture of ADHD","The Diagnosis of ADHD and First Treatments","The Picture of ADHD and How it Affects the Child","Moving into Adolescence with ADHD","Moving into Adulthood with ADHD","Recognised Approaches to ADHD","Introduction to ADHD - Lesson Summary"]},{"name":"Module","details":"Treatment with the Holistic Approach","description":"This module will help you discuss the treatment with a holistic approach. We will review the patterns of behavior. Also, this module will consider the parent's guide to deal with the condition. We will help you answer questions like: What issues exist with an adult that suffers from this condition? What future can you expect?","topics":["Treatment with the Holistic Approach - Learning Outcomes","Treatment with the Holistic Approach","Patterns of Behaviour for Parents to be Aware Of","How Parents Can Cope with a Child That Has ADHD","Everyday Issues to Be Overcome By Everybody Involved","The Future for an Individual with ADHD","Common Misconceptions Regarding ADHD","Success Stories","Key Points to Consider Regarding ADHD","Treatment with the Holistic Approach - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Induction to ADHD Awareness - Course assessment"]}]}