{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5513","title":"Intermittent Fasting Diet","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online diet and nutrition course explains how intermittent fasting can help you gain muscle or lose weight.","description":"‘Intermittent fasting’ is a dietary practice in which people restrict their meal consumption to specific times of the day. This health and fitness course delves into the concepts behind intermittent fasting and examines common diet myths. We explain how intermittent fasting affects the process of building muscle or losing weight. Sign up to learn how to successfully follow this diet to eat healthily while you look and feel your best.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The eating pattern known as ‘intermittent fasting’ requires individuals to restrict the amount of food they consume to particular times of the day. We begin this health and fitness course by exploring the benefits of intermittent fasting. We then dispel some common myths about this approach to diet and identify who can benefit from it. We assist you in determining nutrition priorities when constructing a diet that helps you to successfully build muscle and lose fat using the intermittent fasting model. This course answers questions like ‘is breakfast the most important meal of the day?’ and ‘how can intermittent fasting benefit your health?’.</p><p>The course explains how to create, use and stay on an intermittent fasting diet that benefits you. We establish the importance of including macronutrients in your diet. We discuss concepts that help you to build a balanced diet using healthy protein, carbohydrates and fats. The course provides useful techniques you can use to successfully build muscle. We answer questions like ‘how important are pre-workout meals to building muscle?’ and ‘what are the best supplements to use in an intermittent fasting diet?’.</p><p>This course explores the health benefits of using an intermittent fasting diet to lose weight or build muscle. You can confidently use these concepts and techniques to assist other people. We explain how to bring your knowledge together to design a diet. We trace each stage of the process for both losing fat and building muscle. This course helps people understand the basics of an intermittent fasting diet and explains how it can benefit them. By drawing on the science of nutrition, this health and fitness course explains how to build muscles or lose weight using the intermittent fasting diet technique.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}