{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4299","title":"Introduction to Cerebral Palsy","totalEnrolled":"2,123","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the causes, symptoms, diagnosis and treatment of cerebral palsy in this free online course.","description":"This free online course will provide an in-depth understanding of cerebral palsy. You will understand the causes of this condition as well as the factors that contribute to it. We will examine the various types of cerebral palsy, treatment approaches and the formulation and implementation of a care plan for patients with cerebral palsy. You will thoroughly understand the medical condition and how you can treat it.","courseOutcomes":["List the symptoms of cerebral palsy...","Outline the various prenatal and per...","Explain some conditions that accompa...","Distinguish the different types of c...","List the symptoms of cerebral palsy","Outline the various prenatal and perinatal reasons for cerebral palsy","Explain some conditions that accompany motor disorders in a cerebral palsy patient","Distinguish the different types of cerebral palsy","Discuss the characteristics of postural tone in cerebral palsy","Summarise the important components of a care plan for patients","Discuss the role of the child, family and therapist in treatment","Differentiate between a child with and without cerebral palsy","List the symptoms of cerebral palsy...","Outline the various prenatal and per...","Explain some conditions that accompa...","Distinguish the different types of c...","List the symptoms of cerebral palsy","Outline the various prenatal and perinatal reasons for cerebral palsy","Explain some conditions that accompany motor disorders in a cerebral palsy patient","Distinguish the different types of cerebral palsy","Discuss the characteristics of postural tone in cerebral palsy","Summarise the important components of a care plan for patients","Discuss the role of the child, family and therapist in treatment","Differentiate between a child with and without cerebral palsy"],"courseDescription":"<p>Cerebral palsy is a broad term for a collection of chronic movement or posture disorders. The term ‘cerebral’ refers to the brain or is related to the brain, whereas ‘palsy’ refers to a physical ailment, such as muscle control. Cerebral palsy is often associated with conditions such as epilepsy, perception disturbance, vision disturbance and other symptoms. This course will give you a thorough understanding of cerebral palsy. You will be able to identify its causes and the factors contributing to it. We investigate the various types of cerebral palsy, treatment approaches and the development and implementation of a care plan. To begin, we will define it as a medical condition and outline important terms, exploring the condition’s five major types based on the number of affected limbs.</p><p>Several risk factors are associated with children with cerebral palsy, which can impact them during their prenatal and postnatal life stages. We will research the epidemiology of cerebral palsy, where we discuss the symptoms, causes, risk factors and the proper way to diagnose it. We will demonstrate various methods for diagnosing it in a child during the prenatal and perinatal stages and the signs and symptoms to watch for months after childbirth. Following the diagnosis, we will describe developing a care plan. A care plan outlines what an individual in need of social and health care can expect to receive to help them regain their independence or, at the very least, begin their recovery.&nbsp;</p><p>There are several treatment principles for a cerebral palsy patient. There is no standard way to treat all patients because each individual requires a different level of care and treatment. Occupational and physical therapy are essential components of a treatment plan. You will learn how these therapies differ and how they can effectively contribute to the treatment and care of such patients. After that, you will compare the lives and behaviours of a child with and without cerebral palsy. Finally, we will outline the role of the child, the family and the therapist in treatment. This course will equip you with detailed information and a complete understanding of the underlying concepts related to cerebral palsy. This course is for you if you are a professional or someone seeking to serve in the medical industry. Take advantage of this opportunity and enrol right away!</p><a href=\"https://alison.com/resume/courses/4299\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4299\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cerebral Palsy","description":"This module will give you an overview of cerebral palsy. You will learn about the causes and symptoms of cerebral palsy, as well as how to diagnose it. The various treatment and care planning principles for patients with cerebral palsy will also be explained.","topics":["Cerebral Palsy - Learning Outcomes","Introduction","Childcare, Planning and Treatment","Cerebral Palsy - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Cerebral Palsy - Course Assessment"]}]}