{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2189","title":"Introduction to Psychology of Everyday Life","totalEnrolled":"7,598","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the relationship between psychology and psychiatry, and the normal-abnormal dilemma from this free course.","description":"This free online course, Introduction to Psychology of Everyday Life will guide you through the issues of categorizing various human behaviors in today's society. Learn about the relationship between psychology and psychiatry, and the dilemma of differentiating expected and abnormal human behavior. Start this course today and improve your knowledge of human behavior.","courseOutcomes":["Identify the divisions of psychology...","Discuss the relationship between cli...","Recognize the various ways people di...","Summarize the constructive and destr...","Identify the divisions of psychology","Discuss the relationship between clinical psychology and psychiatry","Recognize the various ways people display aggression in everyday situations","Summarize the constructive and destructive arguments of aggression","Explain the various forms of conditioning","Discuss the diagnostic categories of behavior in psychiatry","Recognize the different types of depression in human behavior","Discuss the impact of religious practices and teachings on behavior","Discuss the relationship between psychology and pathology","Identify the divisions of psychology...","Discuss the relationship between cli...","Recognize the various ways people di...","Summarize the constructive and destr...","Identify the divisions of psychology","Discuss the relationship between clinical psychology and psychiatry","Recognize the various ways people display aggression in everyday situations","Summarize the constructive and destructive arguments of aggression","Explain the various forms of conditioning","Discuss the diagnostic categories of behavior in psychiatry","Recognize the different types of depression in human behavior","Discuss the impact of religious practices and teachings on behavior","Discuss the relationship between psychology and pathology"],"courseDescription":"<p>Introduction to Psychology of Everyday Life is a free online course that will enable you to gain insight into the world of psychology and the web of issues faced in modern society. This course will guide you through the dilemmas in the world of psychology and other related fields. You will begin the course with a discussion on psychology, the relationship between psychology and psychiatry.</p><p>Next, you will study various forms of aggression in human behavior, arguments for aggressive behaviors, and various forms of behavioral conditioning. Then, the course will help you identify the various types of depression prevalent in society, the impact of religious practices on human behavior, and the relationship between psychology and pathology. Finally, you will examine the normal-abnormal dilemma in classifying behavior from various perspectives.&nbsp;</p><p>This free online course will help you explore the science of human behavior and the relationships between psychology and other fields. This course will be of special interest to students, care providers, parents, teachers, and health professionals concerned with understanding the mental processes of individuals. Sign up for this course today and improve your knowledge of psychology and psychiatry.</p><a href=\"https://alison.com/resume/courses/2189\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2189\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Psychology and Day-to-Day Behavior","description":"Analyze the relationship between psychology and psychiatry from this module. You will also study the divisions of psychology, arguments on aggressive behavior, forms of conditioning, and behavioral reinforcements.","topics":["Psychology and Day-to-Day Behavior - Learning Outcomes","Understanding Psychology","Psychology and Psychiatry","Understanding Day-to-Day Behavior","Understanding Day-to-Day Behavior II","Psychology and Day-to-Day Behavior - Lesson Summary"]},{"name":"Module","details":"Normal-Abnormal Dilemma","description":"Study the different forms of human behavior in the dilemma of determining normal behavior and abnormal behavior from this module. You will study the dimensions of determining normalcy, diagnostic categories, religious impacts, and morality.","topics":["Normal-Abnormal Dilemma - Learning Outcomes","Introduction to Normal-Abnormal Dilemma","Determinants of Normal-Abnormal Behavior","Perspectives on Normal-Abnormal Dilemma","Deviations in Normal-Abnormal Dilemma","Normal-Abnormal Dilemma - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Psychology of Everyday Life - Course Assessment"]}]}