{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5058","title":"Introduction to Paramedicine Studies","totalEnrolled":"5,053","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course examines the relevant skills required to provide emergency patient care as a paramedic.","description":"Paramedicine deals with emergency medical care given to injured or ill people, typically in a setting outside a hospital. The paramedic must possess the tools and skills necessary for rapid response. This free course will teach you the essentials of emergency medical services (EMS). Explore the human anatomy, methods used to conduct an initial assessment and the procedures for administering emergency medicine and infection control. Enrol today!","courseOutcomes":["Define ‘paramedicine’...","List the roles of the different emer...","Summarise the various systems of the...","Outline the initial assessment metho...","Define ‘paramedicine’","List the roles of the different emergency medical service providers","Summarise the various systems of the human body and their functions","Outline the initial assessment methods used to monitor vital signs in a patient","Match common injuries with their correct treatment","Recognise the symptoms of a heart attack","List the symptoms of a diabetic emergency","Discuss infection control","Explain how ambulance types of equipment are maintained","Define ‘paramedicine’...","List the roles of the different emer...","Summarise the various systems of the...","Outline the initial assessment metho...","Define ‘paramedicine’","List the roles of the different emergency medical service providers","Summarise the various systems of the human body and their functions","Outline the initial assessment methods used to monitor vital signs in a patient","Match common injuries with their correct treatment","Recognise the symptoms of a heart attack","List the symptoms of a diabetic emergency","Discuss infection control","Explain how ambulance types of equipment are maintained"],"courseDescription":"<p>When critical emergencies occur, the first interventions that patients receive usually determine if they survive or not. This is why the job of first responders, such as paramedics, is crucial. Are you interested in saving lives and providing emergency healthcare? This course, published by John’s Academy, will teach you the basics of paramedicine. In addition, you will learn about emergency medical services (EMS) and the roles of different EMS providers.&nbsp;&nbsp;</p><p>We begin by discussing the basics of human anatomy, acquainting you with various systems of the human body. You will discover initial assessment methods and common injuries that a paramedic needs to know. Next, we explore other medical emergencies and infections to help you become comfortable dealing with critical situations. You will learn about paediatric first aid and examine ambulance maintenance. We will also review general first aid administration, where you will explore CPR and other basic procedures.</p><p>Lastly, you will discover how the body transports and balances fluids and electrolytes and why this is crucial in administering first aid. Finally, we will provide an overview of the legal issues surrounding the medical environment that first responders must consider. All paramedics must complete a comprehensive accredited paramedic education programme. This foundation course will give you a good starting point to help you on your way. Enrol today!</p><a href=\"https://alison.com/resume/courses/5058\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5058\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Paramedicine Workshop","description":"This module will explore Emergency Medical Services (EMS) and the roles of EMS providers. We will discuss the human anatomy and how to monitor vital signs. You will learn about common Injuries, medical emergencies, and infection control. Also, we will delve into pediatric first aid, and ambulance maintenance and examine fluid balance in the body.","topics":["Learning Outcomes - Paramedicine Workshop","Introduction to Paramedicine","Medical Emergencies","Basic First Aid","Lesson Summary - Paramedicine Workshop"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment - Introduction to Paramedicine Studies"]}]}