{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5390","title":"Introduction to Health and Safety in Caregiving","totalEnrolled":"3,963","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains how care workers can manage risk and comply with the UK’s health and safety policies.","description":"Caregivers and their patients may face occupational risks that include psychosocial, ergonomic, chemical and biological hazards. This health and safety course outlines the responsibilities of employers and employees in workplaces like care homes and explains how to identify, manage and control risks. We also discuss the UK’s legal approach to first aid, fire safety and stress management. Sign up to train as a professional caregiver.","courseOutcomes":["Identify the occupational health and...","Outline the benefits of risk and str...","Discuss fire safety management and d...","Explain the safety aspects of moving...","Identify the occupational health and safety responsibilities of care professionals","Outline the benefits of risk and stress management in terms of health and safety policies","Discuss fire safety management and describe the UK’s fire safety regulations","Explain the safety aspects of moving and handling equipment in health and social care settings","Identify the purpose of LOLER awareness training in health and safety management","Discuss RIDDOR regulations concerning reportable injury and first aid administration in the UK","Identify the occupational health and...","Outline the benefits of risk and str...","Discuss fire safety management and d...","Explain the safety aspects of moving...","Identify the occupational health and safety responsibilities of care professionals","Outline the benefits of risk and stress management in terms of health and safety policies","Discuss fire safety management and describe the UK’s fire safety regulations","Explain the safety aspects of moving and handling equipment in health and social care settings","Identify the purpose of LOLER awareness training in health and safety management","Discuss RIDDOR regulations concerning reportable injury and first aid administration in the UK"],"courseDescription":"<p>Caregivers must assume responsibility for their own safety and that of colleagues and those in their care. Caregivers and health and social care professionals must follow the guidelines contained in UK policies that aim to prevent accidents, illness, injuries and harm to anyone providing or receiving care. Carers require specialist training before they attempt certain workplace activities. This caregiving course provides an introduction to the training required by health and safety professionals.</p><p>We begin with an exploration of the UK’s health and safety legislation, policies and prescribed procedures. We highlight the responsibilities of employers and carers in terms of health and safety. We then explain how to reduce the risk of accidents and illnesses by performing risk assessments for job hazards in order to deal with them. The course lays out the levels of first aid training, the elements of risk assessment and the role of stress management in caregiving environments, which could also include the home.</p><p>The course then goes through the guidelines for fire safety enforcement. We examine other hazards and delve into stress management. We identify work-related stress triggers and highlight the signs of stress. Our last sections review the UK's legislation pertaining to ‘moving and handling’ risks in health and social care settings. We establish the significance of the ‘Lifting Operations and Lifting Equipment Regulations’ (LOLER) and ‘Reporting of Injuries, Diseases and Dangerous Occurrence Regulations’ (RIDDOR) for health and safety management in the workplace. This caregiving training course provides the skills you need to manage and control risks effectively and.comply with the UK’s statutory laws and legal norms governing occupational health and safety.</p><a href=\"https://alison.com/resume/courses/5390\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5390\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Health and Safety","description":"This module will examine health and safety policies in the UK. We will highlight the three recognised levels of first aid training and the five elements of risk assessment. Learn to deal with the risks of hazardous substances and emergency fires. We will also consider fire safety laws and regulations relevant to moving and handling risk in the UK.","topics":["Fundamentals of Health and Safety - Learning Outcomes","Health and Safety, Risk Management, and Stress Management","Legislation Regarding Fire Safety","Moving and Handling, LOLER and RIDDOR","Fundamentals of Health and Safety - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Health and Safety in Caregiving - Course Assessment"]}]}