{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4648","title":"Beginner Physiology and Pain Management","totalEnrolled":"871","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the various types of pain, their mechanism and how to manage them in this free online course.","description":"Everyone experiences some form of pain now and again. Pain, like a sharp stab or dull ache, can cause a great deal of discomfort to the body. However, these sensations are essential because they signify something is wrong. Have you ever wondered what causes particular forms of pain? How can the body be assessed when you are in pain? What is the best way to manage pain? We'll show you the causes of several types of pain and how to handle them.","courseOutcomes":["State the definition of ‘pain’ provi...","Recall the history of pain...","Discuss the mechanism of pain and th...","Explain the theories of pain and the...","State the definition of ‘pain’ provided by the International Association for the Study of Pain","Recall the history of pain","Discuss the mechanism of pain and the myths about pain","Explain the theories of pain and the factors that open or close the ‘gates of pain’","Describe the types of pain and their causes","Summarise the biopsychosocial model of health and illness proposed by George Engel","Classify back and neck pain with their treatment method","Outline the classifications of headaches and their characteristics","Analyse how to refer cases to specialists","State the definition of ‘pain’ provi...","Recall the history of pain...","Discuss the mechanism of pain and th...","Explain the theories of pain and the...","State the definition of ‘pain’ provided by the International Association for the Study of Pain","Recall the history of pain","Discuss the mechanism of pain and the myths about pain","Explain the theories of pain and the factors that open or close the ‘gates of pain’","Describe the types of pain and their causes","Summarise the biopsychosocial model of health and illness proposed by George Engel","Classify back and neck pain with their treatment method","Outline the classifications of headaches and their characteristics","Analyse how to refer cases to specialists"],"courseDescription":"<p>It is safe to assume that you may have experienced or felt a pain that is either mild or unbearable at some point in your life and it wasn't a pleasant experience. What exactly is pain? Why do we feel pain and how can it be treated or avoided? Pain is an unpleasant and discomforting feeling that serves as a warning mechanism that protects the body from harmful environments. It also serves as a signal when something goes wrong with the body and action is needed to eliminate the problem. We will introduce you to pain and how you can manage it. We will start by exploring the mechanism of pain, its myths and its history. Discover the appropriate testing method for pain, treatment and evaluation. We will teach you how to formulate a treatment plan for pain and when to refer pain cases to a pain specialist.</p><p>Pain perception was not well understood before now. However, this prompted several pieces of research leading to the development of pain theories. We will analyse the theories researchers developed to understand its mechanism and how it is perceived. You will then discover the factors that open or close the gates to pain, influencing how you can experience it. Pain can range from mild to unbearable and it is sometimes hard to pinpoint from where it stems. In some cases, it is defined by the cause. We discuss the types of pain, their symptoms and their reasons. Understand the difference between acute and chronic pain, explore the psychological aspect of pain, how acute pain progresses to chronic pain and how pain is assessed and measured.</p><p>Neck and back pain, which often occurs due to poor posture, are two of the most common pain experienced by many people. Investigate the mechanism of neck and back pain, their classifications, causes, evaluation and treatment. Headaches are a well-known type of pain. We will examine the types and categories of headaches, including ‘migraines with aura’ and ‘migraines without aura’ and how to diagnose headaches. This course will also show you the clinical features of neuropathic pain, the prevalence of neuropathic pain and neuropathic pain management. Finally, we'll teach you how to refer pain cases to specialists and the pharmacological and non-pharmacological measures of neuropathic pain treatment. You don't need any prior knowledge to take this course. It is designed for everyone. Are you experiencing pain and having trouble managing and treating it? Enrol and start this course today.</p><a href=\"https://alison.com/resume/courses/4648\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4648\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pain Management","description":"In this course, you will be introduced to the definition and mechanism of pain. You will learn about pain theories, types of pain, how to assess and measure pain and the principles of back and neck pain. We will show you classifications of headaches and the measures of managing neuropathic pain.","topics":["Pain Management - Learning Outcomes","Pain and Pain Theories","Types of Pain and Acute Pain","Head, Back and Neck Pain","Pain Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Physiology and Pain Management - Course Assessment"]}]}