{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2077","title":"Introduction to the Role of Nutrition in Human Health","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the key relationships between food, nutrition, and human health in this free online human nutrition course.","description":"The free online human nutrition course will introduce you to the relationship between food, nutrition and health, and how the body digests, absorbs and utilizes nutrients. Start the course and learn about the classes of nutrients and their various food sources, the energy requirements in the body, and the causes, symptoms and dietary requirements for some diseases that affect the body.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course, you will learn about the relationship between food, and nutrition and the key role they play in maintaining human health. The course also covers how nutrients are utilized in the body, and the recommended dietary allowances.</p><p>The course begins by reviewing the various classes of nutrients, such as the classification and importance of carbohydrates in the diet, as well as the types of dietary fiber. Next, the course teaches you about the essential amino acids, and the types and health significance of protein. You'll also learn about factors influencing energy needs, the roles of macronutrients, units of energy and components of energy requirements. Also covered are the basal metabolic rate (BMR), energy balance, and benefits and dietary sources of vitamins.</p><p>Finally, you will learn about the functions of major minerals as well as trace minerals in the body. This course will be of great interest to learners who want to understand the importance of food in maintaining health. Knowing the classes of nutrients your body needs and their food sources will help you learn to take care of your health. Start this course today and learn about the key relationships between food, nutrition, and human health.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}