{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4529","title":"Introduction to Ballroom Dancing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basic techniques of elegant ballroom dances such as the waltz and cha-cha in this free online course.","description":"Ballroom dancing requires a touch of artistry, compatibility, confidence, patience and creativity. This course will teach you, in baby steps, the basic dance variations that you need to know to begin ballroom dancing. It allows you to learn the dance moves and have fun that improves physical and mental health. So it doesn't matter if you have never danced a ballroom dance before, put on your dancing shoes and let's get started!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Ballroom dancing offers a variety of benefits to your health and wellness. The advantages range from keeping fit to social interaction and improved mental states. Acquiring the skills for ballroom dances is rudimentary and easy. The course will first introduce you to one of the most elegant ballroom dances: the waltz. From the gentlemen's and the ladies' roles, you will learn the basic steps of the waltz, such as the box step. The box step involves using your feet to form invisible boxes beneath your feet. This exciting course will help you discover how to do the waltz count so you gracefully glide across the floor with rhythm and poise. Then we proceed to teach you the trick of the ‘underarm turn’. Learn to lead and when to give your partner the signal to do a turn. We explore the meaning of the ‘hesitation step’ and explain how to incorporate it into the waltz.</p><p>The cha-cha is next and is a lively and fun dance. The cha-cha was adapted from the mambo, which was of Cuban origin and prevalent in the 1950s. Explore the fundamentals and techniques of the cha-cha. The instructors will teach you the step-by-step process of dancing the cha-cha so that you can perform it with confidence and freedom. You will learn how to do the underarm turn, crossover or ‘New Yorker’. Once you have mastered these, you will become familiar with the basic steps of salsa, ‘salsa on1’ and ‘salsa on2’, salsa ‘cross leads’ step and the basics of the swing dance. We will present you with tips and techniques for combining the different steps so your movements are smooth and lithe.</p><p>We have designed this course for dancers at all levels but mainly for beginners. If you are a beginner, then the course is perfect for you. You will learn all the principles and strategies for mastering the dances. It is also suitable for intermediate dancers who desire to learn new ways to practise and develop their ballroom dancing skills. We have loaded this course with tips that will help you accelerate your potential and advance as a ballroom dancer. Enrol today to start this fascinating journey.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}