{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5244","title":"Introduction to Care Planning Policy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online healthcare course explains how care plans protect the wellbeing and dignity of vulnerable patients.","description":"Effective medical care requires a deep understanding of health concepts, care mapping and teamwork even among health professionals. A properly planned care policy ensures better patient care. This course unveils strategies for drawing up and implementing care plans in the UK. We also discuss specific ways that care plans safeguard the health of children and young people in the care plan. Sign up to learn how care planning improves patient care.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Everyone wants to live a healthy life. This often requires access to instant medical intervention so individuals and groups must make concrete plans to achieve their health goals. This course introduces you to the care planning process using a learner-centred approach. We study care plan policies based on government guidelines and models of social care delivery in the UK. We highlight the roles of the multidisciplinary team drawing up and implementing care plans and establish the importance of the 'concept care map'.</p><p>The course then highlights the best approaches to effective care plan implementation. Learn how to evaluate a care plan considering parameters like self-management, team management and more. We discuss ways to maintain, retain and dispose of medical records. In addition, we review the UK's care planning policy and the role of the World Health Organization (WHO) in health and social planning in Europe.</p><p>We emphasise why you must safeguard children and young people by keeping them away from crime, antisocial behaviour and educational failure. The course examines various forms of child abuse and neglect and explains how to identify victims and seek help for them. Lastly, we examine government policies for safeguarding vulnerable children. Enrol in this course today to learn the details of care planning policies and enhance your ability to provide effective patient care.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}