{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1426","title":"Introduction to Occupational Hygiene","totalEnrolled":"3,461","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Improve your understanding of occupational hygiene and its impact on health in the workplace with this free course.","description":"This course in occupational hygiene will teach you how to assess health risks in the workplace and help an organization maintain high levels of health and safety. This specialist course covers topics such as toxicology, bodily systems (musculoskeletal, nervous and endocrine etc) as well as the importance of Material Safety Data Sheets (MSDS). Enrol and complete today to fine-tune your knowledge of OHS.","courseOutcomes":["Explain the importance of occupation...","Define how the skin plays an importa...","Describe different skin disorders...","Identify the functions of the muscul...","Explain the importance of occupational hygiene","Define how the skin plays an important role in protecting our bodies","Describe different skin disorders","Identify the functions of the musculoskeletal system","Explain the functions of the nervous system","Describe what the endocrine system does","Explain the role of other parts of the body","Describe the three main routes of entry of toxins into the body","Explain the role of metabolism","Identify examples of hazardous substances","Distinguish between a hazard and a risk","Explain the process of assessing health risks","Explain the importance of occupation...","Define how the skin plays an importa...","Describe different skin disorders...","Identify the functions of the muscul...","Explain the importance of occupational hygiene","Define how the skin plays an important role in protecting our bodies","Describe different skin disorders","Identify the functions of the musculoskeletal system","Explain the functions of the nervous system","Describe what the endocrine system does","Explain the role of other parts of the body","Describe the three main routes of entry of toxins into the body","Explain the role of metabolism","Identify examples of hazardous substances","Distinguish between a hazard and a risk","Explain the process of assessing health risks"],"courseDescription":"<p>This course will first introduce you to occupational hygiene and why it is important to recognize health hazards in the workplace. You will learn the history of occupational hygiene and how different parts of the body can be damaged due to inadequate occupational hygiene. Study contact dermatitis as well as the musculoskeletal, nervous, endocrine, gastrointestinal and circulatory systems. The material also discusses the major functions of the respiratory system as well as of the liver, kidney, and eyes.</p><p>You will then look into toxicology and the three main entry routes where toxins enter the body. Then move onto hazardous substances and how to assess health risks in the workplace. You will learn that much of the work involved in assessing workplace hazards can be carried out by accessing Materials Safety Data Sheets (MSDS), which is a standard way of communicating toxicology and other relevant information about dangerous substances. See why all assessments of risks to health should be reviewed at least every two years.</p><p>The role of occupational hygienists is very important in an organization. They ensure that workplace or occupational health and safety (OHS) is maintained by identifying, evaluating and controlling the exposure of the workers to chemical, physical, ergonomic and biological hazards. This introductory online course is designed to help you enhance your role as an occupational hygienist. So, enrol in the course today, and improve your professional skills in just a few short hours.</p><a href=\"https://alison.com/resume/courses/1426\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1426\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Human Physiology and Industrial Diseases","description":"In this module you will learn about occupational hygiene and why it is important to recognise health hazards in the work place. You will learn the history of occupational hygiene and how different parts of the body are at risk of developing health risks due to inadequate occupational hygiene.","topics":["Human Physiology and Industrial Diseases - Learning Outcomes","Introduction to Occupational Hygiene","The Human Body – Part I","The Human Body - Part II","Human Physiology and Industrial Diseases - Lesson Summary"]},{"name":"Module","details":"Introduction to Toxicology","description":"In this module you will learn about toxicology and the three main entry routes that allow toxins to enter the body. You will learn about examples of hazardous substances and how to assess health risks in a workplace.","topics":["Toxicology and Health Risks - Learning Outcomes","Fundamentals of Toxicology","Hazardous Substances/Processes","Assessment of Health Risks","Toxicology and Health Risks - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Occupational Hygiene - Course Assessment"]}]}