{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4553","title":"Introduction to Food and Nutrition","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore the essentials of proper nutrition to maintain good health, longevity and wellness in this free online course.","description":"Food and nutrition are crucial for good health and longevity. This course will teach you all about nutrients and their functions in the human body. Discover how to correctly compute macronutrients to reach your daily recommended values and understand food sources of nutrients that treat or prevent diseases. Assess various diets and research all the possibilities to equip you to make the best decisions for your health transformation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free nutrition course is a much-needed resource for health professionals and consumers looking to learn the fundamentals of nutrition in the face of confusing public data. It uses scientific evidence and facts to present you with the clear, unvarnished truth. Amer Taha, a medical health professional with years of expertise, explains what ‘nutrition’ is and what it is not. By shifting our mindsets to see food as medicine, we can start a self-care journey, thereby preventing illness rather than curing it. We begin with the basics: studying nutrients and how they function in the body. We also discuss mental wellbeing, nutrient absorption and the different parts of the body.</p><p>The first module explains macronutrients, which are carbohydrates, fats and proteins. Then you learn about micronutrients, namely vitamins and minerals. Discover the importance of macronutrients and their deficiencies to calculate the individual’s daily energy needs, thereby ensuring adequate caloric intake. We will study vitamins and discuss their crucial functions in the body before moving on to minerals, which are chemical substances used by the body to perform critical roles that include blood formation, muscle contraction and much more. In the second module, we will delve into diets and diseases. Weight loss and health are the two primary reasons people consider diets. We will examine famous diets such as ‘Atkins’, ‘raw food’, ‘ketogenic’ and ‘paleo’ by discussing their pros and cons and potential nutrient deficiencies to rate them for health and weight loss.</p><p>Different diseases have various symptoms and root causes. We explore these and consider the additional nutrients needed to help the body recover when diseased. Learn how to read labels that carry nutritional facts on processed or packaged foods to understand their nutrients, serving sizes and daily dietary values. The U.S. Food and Drug Administration requires that these are listed so consumers are fully aware of what they are ingesting. Armed with the knowledge of proper nutrition, professionals and individuals can make prudent choices for health and longevity. Sign up for this free online course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}