{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4487","title":"Introduction to Neurology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the principles of Neurology and explore the human nervous system and its disorders in this free online course.","description":"Neurology, a medical specialty, deals with disorders of the nervous system, which serves as the body's command centre. To keep the body system in order, we need to pay particular attention to the warning signs. What are the warning signs of neurological disorders? We'll explain the concepts of the nervous system and its functions. Discover the symptoms of neurological disorders and learn how to screen and assess them.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you ever had a migraine or been anxious for no reason? What about having a simple headache? These could be symptoms of neurological disorders that respond to internal or external stimuli. The body's neural systems manage the responses to these stimuli, but they also do a lot more. In this course, we will show you the organisation of the neural system in the brain and spinal cord and provide the foundation for understanding the complicated pathophysiology of the nervous system. Neurology is the branch of medicine that studies nerves and the treatment of disorders of the nervous system. With an ageing population, neurological diseases represent an increasing economic burden to society and cause much suffering to patients, caregivers and loved ones. We will provide you with a thorough understanding of various neurological conditions, allowing you to recognise the signs and symptoms of different neurological deficits in both adults and children.</p><p>The peripheral nervous system (PNS) coordinates activity and responses by transferring signals from one part of the body to another, in conjunction with the central nervous system (CNS). You will gain insight into the anatomy of the central and peripheral nervous system and the overall organisation of sensory and motor systems in the brain and spinal cord. We help you grasp the fundamentals of seizures and epilepsy, inherited and acquired neuromuscular diseases, central nervous system infections, tumours, migraines and other neurological diseases. We use our vision to see myriad elements of the world distant from our bodies, as do other primates with forward-facing eyes. Explore the human visual systems and the different visual disorders caused by various neurological and other conditions. We investigate the symptoms of these conditions before exploring the auditory system and types of disorders associated with hearing impairment.</p><p>Finally, we outline the common signs and symptoms related to a single or multiple nerve structure dysfunction in any neurological condition and explain how to recognise these problems in both the young and the old. Research the neurological screening methods and diagnostics that are applied in day-to-day clinical practice. Are you interested in pursuing a career in Neurology? This course will provide an excellent foundation for students pursuing Bachelors of Medicine, physiotherapy or nursing and can also benefit medical professionals who feel the need to brush up on the fundamentals. It also suits those who have a particular interest in understanding the complexities of the brain. There are no prerequisites to take the course and all you need is a passion for learning. So why wait? Take this course and start comprehending the complexities of the human nervous system.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}