{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4900","title":"Introduction to Mediterranean and Okinawa Diets","totalEnrolled":"712","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore diets that foster longevity and good health while lowering the risk of disease in this free online course.","description":"The Okinawa and Mediterranean diets have consistently ranked at the top of the list of healthy eating plans. Do you want to know the basis for their effectiveness? This course investigates the health benefits of the Mediterranean diet, its foods, nutritional value and how to plan and prepare them at home. You'll learn about the Okinawan diet, its history and how it may help you live longer, prevent disease and control your weight.","courseOutcomes":["Define the ‘Mediterranean diet’...","Recall the health benefits of the Me...","List different foods in the Mediterr...","Evaluate the importance of meal plan...","Define the ‘Mediterranean diet’","Recall the health benefits of the Mediterranean diet","List different foods in the Mediterranean diet","Evaluate the importance of meal planning and eating habits","Describe the nutritional value of the Mediterranean diet","Explain the role of a Mediterranean diet in weight loss","Discuss the history and scientific background of the Okinawa diet","Recognise various foods in the Okinawa diet","Identify the health benefits of the Okinawa diet","Define the ‘Mediterranean diet’...","Recall the health benefits of the Me...","List different foods in the Mediterr...","Evaluate the importance of meal plan...","Define the ‘Mediterranean diet’","Recall the health benefits of the Mediterranean diet","List different foods in the Mediterranean diet","Evaluate the importance of meal planning and eating habits","Describe the nutritional value of the Mediterranean diet","Explain the role of a Mediterranean diet in weight loss","Discuss the history and scientific background of the Okinawa diet","Recognise various foods in the Okinawa diet","Identify the health benefits of the Okinawa diet"],"courseDescription":"<p>The Mediterranean diet is a modern set of guidelines inspired by the traditional dietary patterns of Southern Italy and parts of Greece. This course will introduce you to the Mediterranean diet, its food list, classifications and how it differs from other diets. The Mediterranean diet is all about making healthy choices from a wide variety of delicious foods. Explore ways to make suitable food options and prepare healthy meals for you and your family. Meal planning provides a road map of what to eat for a specified time frame. It helps eliminate wastage of food and saves you more money. You'll study how to plan your meals for your chosen duration and balance the calories and nutrients in your diet. Research the impact of nutrition on the quality of your health and lifestyle. Next, you will learn about various attributes of the Mediterranean diet and their role in losing weight or eliminating the possibility of putting on weight.</p><p>The Okinawan culture is fascinating because they have long life expectancies and low disability rates. Explore the concept of the Okinawa diet, its unique properties and health benefits for the body and mind. The geographical location of Okinawa and the people's cultural heritage had an impact on the evolution of the Okinawan diet. You'll study its history, timeline and scientific background responsible for longer life expectancy. You'll discover the potential health benefits, including its role in weight control, diabetes prevention and treatment of numerous diseases.</p><p>We designed this course for people who want to maintain healthful lifestyles by following wholesome food practices and making adjustments in their daily lives. This course is also valuable for people working in the food and nutrition industry who want to improve their knowledge of healthy foods and lifestyles. This course provides a complete, easy-to-follow guideline for adopting a healthy eating and living culture. The food items recommended are easily and readily available that you can purchase on a low budget. The abundance of fast food and other unhealthy diets makes an average person considerably more vulnerable to diseases and nutrition deficiencies. Following the Mediterranean and Okinawan diet practices can prevent many non-communicable diseases such as diabetes, coronary illnesses and many cancers. Join this course now and learn to eat cleanly and stay healthy.</p><a href=\"https://alison.com/resume/courses/4900\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4900\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Mediterranean and Okinawa Diets","description":"This module will introduce you to the Mediterranean diet and lifestyle for a healthy body and mind. You will learn about the benefits of the Mediterranean diet for maintaining health and preventing diseases. Learners will be shown the culture of the Okinawan diet and its role in increasing life expectancy, staying healthy and other health benefits.","topics":["Mediterranean and Okinawa Diets - Learning Outcomes","Introduction to Mediterranean Foods","Consuming a Mediterranean Diet","Okinawa Diet","Mediterranean and Okinawa Diets - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Mediterranean and Okinawa Diets - Course assessment"]}]}