{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4935","title":"Introduction to Public Health","totalEnrolled":"6,479","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches how public health measures can prevent diseases, prolong life and improve its quality.","description":"This course will explore the history, functions and science of public health. First, we will examine the role of government in public health, including its significant branches such as population and informatics. Next, we will discuss the meaningful epidemiologic functions, the measurement of disease incidence and the study of disease outbreaks. In addition, we will learn about public health ethics and human rights.","courseOutcomes":["Discuss how public health interventi...","Summarise how we can gain insight in...","Describe why we must have a clear un...","Explain how public health controls i...","Discuss how public health interventions can help us implement effective policies and healthy lifestyles","Summarise how we can gain insight into public health goals","Describe why we must have a clear understanding of epidemiology and its benefits","Explain how public health controls infectious diseases and protects the general population","Discuss the public health implications and epidemic patterns","Outline the process of infant and maternal mortality prevention including the concept of infant mortality rates","Explain what the public health needs assessment and national public health policy are","Summarise the various environmental issues that can affect human health and wellbeing","Discuss the ethics in epidemiology and vaccination and the role of government in promoting ethics in public health","Discuss how public health interventi...","Summarise how we can gain insight in...","Describe why we must have a clear un...","Explain how public health controls i...","Discuss how public health interventions can help us implement effective policies and healthy lifestyles","Summarise how we can gain insight into public health goals","Describe why we must have a clear understanding of epidemiology and its benefits","Explain how public health controls infectious diseases and protects the general population","Discuss the public health implications and epidemic patterns","Outline the process of infant and maternal mortality prevention including the concept of infant mortality rates","Explain what the public health needs assessment and national public health policy are","Summarise the various environmental issues that can affect human health and wellbeing","Discuss the ethics in epidemiology and vaccination and the role of government in promoting ethics in public health"],"courseDescription":"<p>In this course, ‘Introduction to Public Health’, we will learn the basic concept of public health and its related areas. Then, we will discuss how public health interventions can help us implement effective strategies and healthy lifestyles for society, organisations and individuals. Do you want to know how public health principles relate to key areas such as population and informatics? First, we will discuss all of this in detail. Next, we will explore why we need to understand epidemiology and its benefits clearly. In addition, we will analyse the concept of public health and preventive medicine.</p><p>This course will illustrate how public health controls infectious diseases and protects the public. You will learn to measure the incidence of disease, how to investigate an outbreak and the extent of infection. We will examine the area of public health that deals with health issues that affect women, children and families. Wondering what the public health needs assessment and national public health policy are? We will learn the implications of these policies for practice and the national public health service framework and partnership. In addition, we will look at various environmental issues that can affect people's health and wellbeing. We will research communicable disease control and public health measures. We will explore topics such as chemical waste, air pollution, climate change and lack of access to health care. We will investigate how an epidemic disease occurs.&nbsp;</p><p>The course will then describe the science of global warming and the UK’s National Green Energy Plan. Want to know about the role of public health ethics and the relationship between human rights and public health? We will look at the ethics of vaccination and epidemiology. We will also scrutinise the role of government in promoting public health ethics. This course is ideal for anyone who wants to learn the basics of public health and its functions. So why wait? Start learning today.</p><a href=\"https://alison.com/resume/courses/4935\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4935\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Public Health","description":"In this module, we will learn about public health interventions that can help us implement effective strategies and healthy lifestyles for society, organizations, and individuals. Next, we will look at the principles of public health and its major branches such as population and informatics. We will also learn about epidemiology and its benefits.","topics":["Fundamentals of Public Health - Learning Outcomes","Introduction to Public Health","Principles of Public Health","Understanding Epidemiology","Disease Control","Understanding Measures of Disease Frequency","Maternity and Childbirth","Health System and Policy","Environment and Public Health","Public Health and Ethics","Fundamentals of Public Health - Learning Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}