{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5210","title":"Introduction to Art Therapy","totalEnrolled":"5,501","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the benefits of art therapy and how to use it to improve patients’ mental health in this free online course.","description":"Art therapy is a type of psychotherapy that uses art as a form of communication between the therapist and the patient to treat a wide range of mental health conditions. In this psychotherapy course, we explore the concepts and practices of art therapy to help you engage in therapeutic art activities with your clients. We provide the skills you need to confidently work with clients of all artistic abilities in a variety of settings.","courseOutcomes":["Identify the key types of art therap...","State the principles of art therapy...","Discuss the main approaches to art t...","Recognise various types of creative ...","Identify the key types of art therapy and explain how to apply them","State the principles of art therapy","Discuss the main approaches to art therapy","Recognise various types of creative therapy","Define the concept of ‘mindfulness’ as a mechanism in the treatment of psychological conditions","Summarise various art therapy techniques and their applications","Explain how art therapy is beneficial to children, adults and families as a whole","Identify the specific type of therapy that is most appropriate for clients based on their psychological state","Identify the key types of art therap...","State the principles of art therapy...","Discuss the main approaches to art t...","Recognise various types of creative ...","Identify the key types of art therapy and explain how to apply them","State the principles of art therapy","Discuss the main approaches to art therapy","Recognise various types of creative therapy","Define the concept of ‘mindfulness’ as a mechanism in the treatment of psychological conditions","Summarise various art therapy techniques and their applications","Explain how art therapy is beneficial to children, adults and families as a whole","Identify the specific type of therapy that is most appropriate for clients based on their psychological state"],"courseDescription":"<p>Art therapy is a type of psychotherapy that uses art as a way to help people express themselves. It can be used to help people deal with stress, anxiety and mental health issues. This course introduces you to art therapy and its concepts and explains how to work with clients who have physical and mental impairments. We explore the history and principles of art therapy and highlight some of the key figures in its evolution. We then study the key types of art therapy, including individual and group therapy, and show you how to effectively incorporate it into your professional psychotherapy practice. This course also suits anyone who simply wants to broaden their horizons and investigate the value of art therapy in their lives.</p><p>Creativity is a powerful tool that can be used to help improve mental health and wellbeing and art therapy offers one way to tap into your creative side. We discuss creative therapy and its uses and lay out some of the different types of innovative treatments. We define ‘mindful creativity’ and emphasise the importance of mindfulness and mindfulness practices like meditation. The course goes over art therapy techniques that you could use with clients, the necessary materials and their goals. We focus on the use of drawing and demonstrate how art therapy can be employed as a kind of treatment for kids who have physical and mental impairments.</p><p>The course explains how to use art therapy to treat families and guides you through some of the most common mental illnesses you're likely to encounter as an art therapist. We provide some useful recording techniques you can use with your clients and cover the basics of supervision and its boundaries and therapeutic limitations. This course is designed for anyone interested in learning about the growing field of art therapy and how to work with clients who have physical and mental impairments. Whether you are a professional psychotherapist looking to improve your ability to help your clients or are simply interested in learning how creativity can improve mental health, this course is for you.</p><a href=\"https://alison.com/resume/courses/5210\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5210\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Creative Art Therapy","description":"This module introduces the concept of art therapy and discusses some of the important figures in the development of art therapy. You’ll be introduced to the key types of art therapy, including individual and group therapy. You’ll learn about art therapy techniques and their applications.","topics":["Creative Art Therapy - Learning Outcomes","Concepts of Art Therapy","Art Therapy Techniques","Beneficiaries of Art Therapy","Creative Art Therapy - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Introduction to Art Therapy"]}]}