{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4572","title":"Beginner Urology","totalEnrolled":"738","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain insights into the anatomy of the genitourinary tract, its disorders and treatment in this free online course.","description":"Urology enables us to understand the genitourinary tract's functionality, anatomy and importance to keep and maintain good urological health conditions. With that in mind, we will explore the common urological problems that can lead to poor urological health conditions and explain how they can be treated. We will show you the anatomy of the genitourinary tract, common diseases associated with it and available treatments.","courseOutcomes":["Define the term ‘urology’...","Identify the anatomical parts of the...","Recall the definition of ‘anatomy’...","Recognise the characteristics of uri...","Define the term ‘urology’","Identify the anatomical parts of the human body that make up the genitourinary tract","Recall the definition of ‘anatomy’","Recognise the characteristics of urinary organs in the body such as the adrenal gland and kidney as well as their functions.","State some of the genitourinary tract disorders and the physical examinations used in the diagnoses of the disorders","Examine the types of urinary tract infection and the treatment remedies","Analyse the sexual disorders that exist in both male and female","Define the term ‘urology’...","Identify the anatomical parts of the...","Recall the definition of ‘anatomy’...","Recognise the characteristics of uri...","Define the term ‘urology’","Identify the anatomical parts of the human body that make up the genitourinary tract","Recall the definition of ‘anatomy’","Recognise the characteristics of urinary organs in the body such as the adrenal gland and kidney as well as their functions.","State some of the genitourinary tract disorders and the physical examinations used in the diagnoses of the disorders","Examine the types of urinary tract infection and the treatment remedies","Analyse the sexual disorders that exist in both male and female"],"courseDescription":"<p>The human body has a way of eliminating potentially harmful liquid waste. This waste forms urine in the bladder and we remove it from the body via the urinary tract. Organs such as the kidney, the bladder, ureters and urethra make up the urinary tract system of the body. Urology is concerned with the diseases associated with the male and female urinary tract and the male reproductive organ. Have you ever wondered how your body lets you know when to urinate? Understanding how the urinary tract system works is vital to living a healthy life. We will explore the concept of urology, the body parts that make up the genitourinary tract and the concepts of reproduction. In addition, we research the anatomy of the organs that make up the genitourinary tract and how they function to eliminate urine from the body.</p><p>The anatomy of an infant differs from that of an adult structurally in many ways. We will examine the anatomical difference of the urogenital structure in humans from the foetal stage to adulthood. When a human is conceived, the baby receives two chromosomes from both parents. The genetic code of the chromosome from the baby's father determines whether it is male or female. We will show you the determining factor located in the chromosome of the father of a baby that decides the biological sex of the baby. We then examine the urinary system's organs, how it differs in males and females and their unique role in ensuring liquid waste leaves the body. Any problem with one of these parts becomes a cause for concern. Discover the variety of issues that can affect the urinary tract system, the symptoms of genitourinary tract disorders and how to examine the urinary tract system.&nbsp;</p><p>At times, the usual physical examination method becomes challenging and fails to provide answers to possible problems in the urinary tract. Thus we use alternative laboratory procedures such as macroscopic and microscopic techniques. We will examine the processes of performing these alternative methods and the necessary equipment. Study urinary tract imaging, ultrasonography and radiology. These are required to diagnose symptoms of disorders such as difficulty in initiating urine, urinary retention, haematuria and more. Lastly, this course covers sexual dysfunction in males and females, including its cause, treatment and solutions. Health problems in the urinary tract can happen to anyone. We designed this course for anyone who wants to know how the genitourinary tract works, its diseases and its treatment. No prior knowledge is required so register for this anatomy course today.</p><a href=\"https://alison.com/resume/courses/4572\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4572\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Concept of Urology","description":"In this module, you’ll be introduced to the concept of urology and the human body parts that make up the genitourinary tract. You will be taught the anatomy of the genitourinary tract and how it functions in the body. Upon that, you will learn about urological disorders, urinary tract infections, diagnosis, sexual disorders and treatment.","topics":["The Concept of Urology - Learning Outcomes","Urology and Anatomy","Examination of the Genitourinary Tract","Sexual Dysfunction and Treatment","The Concept of Urology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Urology - Course Assessment"]}]}