{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4962","title":"Introduction to Pharmacology","totalEnrolled":"6,058","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an understanding of the fundamental principles of pharmacology with this free online course on Alison.com.","description":"re you looking to develop a career in the field of pharmacology? Are you passionate about reducing harmful environmental chemicals that can cause serious health problems? This course delves into pharmacology and the issues surrounding drug development. Whether it's the creation and marketing of drugs to specific drugs related to various body parts, this course will teach you all the terminology and information you need to work in this field.","courseOutcomes":["Explain the fundamental principles o...","Examine the fundamental procedures a...","Analyse the properties and aspects o...","Describe the different types of card...","Explain the fundamental principles of pharmacology along with its major sub-disciplines","Examine the fundamental procedures and protocols involved in the development of drugs","Analyse the properties and aspects of the central nervous system that are required to study neuropharmacology","Describe the different types of cardiovascular disorders and their aetiology","Identify the functions and properties of the hormones secreted by the endocrine system","Discuss the pharmacology related to cancer and the principles of chemotherapy","Examine the different chemical substances that contaminate the environment and are responsible for health issues","Explain the fundamental principles o...","Examine the fundamental procedures a...","Analyse the properties and aspects o...","Describe the different types of card...","Explain the fundamental principles of pharmacology along with its major sub-disciplines","Examine the fundamental procedures and protocols involved in the development of drugs","Analyse the properties and aspects of the central nervous system that are required to study neuropharmacology","Describe the different types of cardiovascular disorders and their aetiology","Identify the functions and properties of the hormones secreted by the endocrine system","Discuss the pharmacology related to cancer and the principles of chemotherapy","Examine the different chemical substances that contaminate the environment and are responsible for health issues"],"courseDescription":"<p>Are you interested in developing a career in pharmacology? Or do you want to start a business venture in the drug manufacturing industry? This course is tailor-made for your needs. We go through the fundamental concepts related to pharmacology. Then we will identify the various sub-disciplines of the field. Finally, we will explore the issues pertaining to drug discovery, development and marketing.</p><p>Have you ever wondered how they create drugs for different vital organs and functions of the body? We will analyse the different issues faced by the body's cardiovascular, endocrine and central nervous systems. We investigate the essential drugs manufactured by studying various symptoms of these systems. Cancer is a huge conundrum in the world of medicine today. We will examine the treatment of cancer cells through drugs and chemotherapy.</p><p>The final sections will study the immune system and inflammation as it is fascinating how the human body fights infections and bacteria through its immune system. Harmful chemical agents in the environment and the food or water that we consume can be a source of tremendous health problems. Toxicology deals with how we can tackle this issue. The safe use and application of drugs, which is of utmost importance, will be studied in depth. So enrol now.</p><a href=\"https://alison.com/resume/courses/4962\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4962\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Principles of Pharmacology","description":"This module introduces the learner to the fundamental principles of pharmacology and its field of application. The learner will be examining the procedures and protocols of drug development. The role of pharmacology in treating disorders of various body parts shall be discussed. Analysis of toxic chemicals in the environment shall also be provided.","topics":["Principles of Pharmacology - Learning Outcomes","Fundamental Principles of Pharmacology","Drug Development and Regulation","Neuropharmacology","Cardiovascular Pharmacology","Endocrine Pharmacology","Chemotherapy","Inflammation and Immune Pharmacology","Environmental Toxicology","Principles of Pharmacology - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Pharmacology - Course assessment"]}]}