{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3214","title":"Introduction to Emergency Operations and Safety at Sea","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free marine safety course explains emergency operations and various manoeuvring methods in different conditions.","description":"This course introduces you to emergency operations, safety actions and procedures to take in case of an emergency at sea. You will learn about the anchoring process, different search patterns, using tugs, as well as emergency steering. Study the process of rescuing a person overboard, how to locate the casualty and the recommended methods to apply in such a case and possibly save a life.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>There are different manoeuvring methods you can use when there is an emergency at sea. This course teaches you the appropriate strategies and search patterns to apply during a crisis. We explain the theory behind the safe operation of vessels in different weather conditions. You will develop your skills to understand the key principles and practices necessary in emergency cases. This course comprises two modules alongside various topics broken down with accompanying illustrations to give you a comprehensive understanding of the anchoring manoeuvres in different conditions such as calm, deep or windy or a current with the wind abeam. We teach you about the recommended cable lengths needed for anchoring and its dependence on the nature of the sea bed and the strength of the wind and current.</p><p>This course then explains the IAMSAR Manual, which provides guidelines for common aviation and maritime approaches to organise and provide search and rescue (SAR). You will learn about fulfilling obligations accepted under the International Conventions. Learn how to search a large area when survivor location is uncertain and the search patterns recommended by the manual. We introduce you to berthing and unberthing manoeuvres under different conditions. We also discuss berthing with the help of different numbers of tugs and how you can approach them.</p><p>Furthermore, this course explores several recommended man-overboard manoeuvres. We describe when to use the most appropriate one in the prevailing circumstances, and outline the immediate and delayed actions recommended for a person missing in varied occurrences. This course explains emergency steering as a system used during the failure of the primary steering system. We clarify the emergency steering operation and the periodic checks required. You will also learn about auxiliary steering procedures, their arrangements, emergency operations and regulations, drills and testing carried out at sea. We illustrate the effects of the pivot point and transverse propeller thrust and function necessary for vessel handling. This free online course will be of great interest to anyone interested in understanding how to carry out emergency operations and safety at sea.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}