{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5119","title":"Introduction to Medical Terminology","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of medical terminology to speak medical vernacular fluently with this free online healthcare course.","description":"Medicine has a very distinct and highly specialised language. This course helps you to develop a working medical vocabulary. We introduce you to basic medical terminology used to describe the human body, its various organ systems, diseases, disorders and associated treatment procedures. We explore the suffixes, prefixes and word roots most commonly encountered in medicine. By the end of this course, you will speak like a doctor.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Understanding the verbal or written clinical terms and abbreviations commonly used for healthcare communication can be challenging but understanding the basic word structure and definitions of some common word elements makes the meaning of thousands of medical terms clear. ‘Medical terminology’ is the vocabulary used by those who work in the medical field. They use distinct terms to describe the human body, how it works, its disorders and the procedures and treatments used to treat it. Any prospective medical student needs to know the common terminologies used by medical professionals so this course develops your medical fluency and teaches you a language that lets you communicate with doctors, nurses and patients.</p><p>We first introduce you to the terms associated with the anatomy, physiology and pathology of the human body and its different parts, using pictures to help you understand and memorise them. You will then learn about the equipment used in a hospital. Medical terminologies consist of ‘stem’ words, prefixes, suffixes, acronyms and abbreviations. We lay out the most common suffixes and prefixes used in medical terminology and explain how to use them to ‘decode’ medical words. We then explore the terms associated with systems of the body such as its central nervous, musculoskeletal and respiratory systems. We also provide terminologies associated with laboratory tests, procedures, therapeutics and more.</p><p>This course is ideal for those who want to work in the health and science fields and need to communicate with physicians, nurses, lab technicians and other medical professionals, including support staff like receptionists, medical clerks or patient-care coordinators. On a personal level, understanding medical terminology can explain your own or your loved one's health and facilitates better communication with your doctors and nurses. This course contains illustrated presentations, images and diagrams to help you understand its content. There are no prerequisites for taking the course and our list of acronyms and abbreviations helps you to build a foundation in understanding medical terminology.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}