{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4355","title":"Introduction to Environmental Health","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains how the environment is constantly suffering and how we can protect and preserve it.","description":"Are you aware that some human activities can potentially harm the environment globally? By taking this course, you will learn how people have become the cause and can be the cure for environmental degradation. You'll learn about environmental pollution and the different reasons behind it. You will see the industry-level damage the environment endures and how environmental health is the answer to individual health.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The need to protect and preserve the environment is increasing exponentially. A safe and healthier environment is paramount for human health and psychological wellbeing. Due to human activities such as the combustion of fossil fuel, cutting down of forests and more, significant negative environmental changes have led to climatic change. In this course, you will understand the relationship between human health and the environment and how the environment affects human health and wellbeing. We will show you the benefits of ‘living green’ and how to limit actions, tendencies and substances that can compromise the environment that causes human diseases. Explore the green products you can produce to help curb air, soil, water and other pollutants. Discover the various conditions that multiple types of pollution can cause.</p><p>Are you among those that have used the terms 'waste' and 'pollution' interchangeably? Understand the concept of pollution and waste and the difference between them. Waste disposal has severe environmental implications and can cause serious problems. Understanding the industry-level damage the environment endures because of waste can help solve waste issues. We will show you those that are harmful to human health and those that are not, as well as the types and classifications of waste. This course will also apprise you of the categories, sources and examples of pollutants that contribute to the natural world becoming toxic to human health.</p><p>Air pollution is caused by a chemical, physical or biological agent that alters the natural characteristics of the atmosphere to the detriment of human health. Household combustion devices and vehicles usually cause air pollutants. These contaminants change the climate, weather and temperature. We will examine the effect of a warm environment on human health and well-being and the concept of zoonotic disease. In the final section, you'll learn how waste can be treated, recycled and minimised. In addition, we research the solutions to air pollution and the treatment of water for reuse. We have designed this course for public health professionals and enthusiasts interested in protecting the environment and living green. Do you care about the preservation of natural resources to enhance human-nature coexistence? Enrol now and start this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}