{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4790","title":"Introduction to Diet, Nutrition and Hydration","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about nutrition principles, healthy dieting and the significance of keeping hydrated in this free online course.","description":"We do not always find the six vital nutrients required for optimal health in our diet. So how do we ensure the body gets all the nutrients it needs? Learn about the nutritional values of different foods, types of nutrients and the dietary requirements for children and adults. Explore common eating disorders, food-related diseases, the role of nutrition in combating and managing conditions and the impact of malnutrition on the body.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Foods contain different substances, called ‘nutrients’, necessary for the health and growth of the body. We will introduce you to the factors that influence our food choices, the composition of diets and the broad application of nutritional studies. Our bodies need both macro and micronutrients to remain healthy. We will help you understand these components and their respective role in maintaining a healthy and energetic body. Not everyone requires identical amounts, however, and a well-balanced diet provides you with the nutrients your body needs. How can we ensure that we eat a well-balanced diet? We will demonstrate the diverse requirements of expectant mothers, children, teenagers, adults and the elderly. Study how the traditional diet evolved into being relatively balanced despite a lack of knowledge.</p><p>Eating disorders adversely affect your body and may lead to physical or mental illnesses and diseases. Explore types of eating disorders, the reasons behind developing them and how you can prevent and cure them. Upon that, you will learn about the diseases of various organs, including the gastrointestinal tract and liver and study the role of nutrition in treating or managing them. The ideal body weight depends upon a person’s height and the risk of developing health-related issues increases when you become either over or underweight. Investigate the factors behind weight gain and loss, ways to manage body weight and lifestyle choices that can aid in maintaining wellness. Tissues and internal organs require fluid to perform physiological functions, such as retaining internal temperature, excreting waste products from the body and providing lubrication to joints. Investigate the significance of staying hydrated, the daily water requirement and the consequences of dehydration for your body.&nbsp;</p><p>We designed this course for people who want to maintain good health by making the right nutritional and lifestyle choices. However, it is also helpful for anyone in this industry wanting to improve their knowledge in the field. You don’t need to have any prior learning. We break down different principles and practices of a healthy diet and food choices into separate sections to make it easy for you to grasp. With the growing awareness of health and fitness, the nutrition industry has grown into a multibillion-dollar market with excellent career prospects for people worldwide. Join today and maintain a sound body, prevent food-related illnesses or make a career in the nutrition industry and learn for free!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}