{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4726","title":"Introduction to Cooking and Gastronomy","totalEnrolled":"3,751","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will introduce you to the concept of gastronomy and the scientific basis of good food.","description":"Food is a human necessity, a source of energy and great pleasure and is of prime importance in many celebrations and occasions. Gastronomy is all about food. In this course, we will introduce you to the scientific principles underpinning the methodology of preservation and processing of food. We'll teach you different meat and culinary fish techniques, food hazards prevention tips and COVID -19 protocols to observe if you manage a food business.","courseOutcomes":["Define ‘gastronomy’ and its differen...","Explain gastronomic concepts like st...","State the necessity for thermal proc...","Outline the different methods of pre...","Define ‘gastronomy’ and its different types","Explain gastronomic concepts like structure and appeal, a meal experience, satisfaction or dissatisfaction and more","State the necessity for thermal processing of food and the different methods employed for the same","Outline the different methods of preservation and processing of meat and fish","Distinguish between the different culinary techniques used in meat and fish preparations","List the different types of food hazards and their prevention","Recognise the difference between food allergy and food intolerance","Summarise the COVID -19 prevention guidelines for reopening food businesses","Define ‘gastronomy’ and its differen...","Explain gastronomic concepts like st...","State the necessity for thermal proc...","Outline the different methods of pre...","Define ‘gastronomy’ and its different types","Explain gastronomic concepts like structure and appeal, a meal experience, satisfaction or dissatisfaction and more","State the necessity for thermal processing of food and the different methods employed for the same","Outline the different methods of preservation and processing of meat and fish","Distinguish between the different culinary techniques used in meat and fish preparations","List the different types of food hazards and their prevention","Recognise the difference between food allergy and food intolerance","Summarise the COVID -19 prevention guidelines for reopening food businesses"],"courseDescription":"<p>The word 'gastronomy' is derived from the Greek word 'gastro’, meaning ‘stomach’ and 'nomos’, meaning ‘laws’ or ‘knowledge’. Gastronomy is thus defined as 'the art or science of good eating’. It involves not only the ritual of food consumption but understanding and appreciating the many avenues of food production and cooking. It includes discovering, tasting, experiencing, researching and remembering all the aspects that make food worth eating. Gastronomy is also about knowing and understanding what you eat. This course will introduce gastronomic concepts and their applications in food preparations, culinary arts and food enjoyment. Post-COVID, there has been a change in our food habits as concern for health and hygiene grows. Gain insight into the adaptations and precautions the food industry should take to prevent the spread of the coronavirus.</p><p>Almost all food is processed in some form before it is consumed. We will show you the different methods employed by the food industry in the thermal processing of food and explain the underlying science. We will walk through the concepts of blanching, pasteurisation and sterilisation of food and the technical processing of canned food. Animal protein from meat and fish forms an essential part of our diet. Explore the different preservation techniques and how to process raw meat from beef, poultry or fish. We will also teach you how to cook them to be appealing, tasty and healthy and will help you avoid food hazards. Research the different types of food hazards caused by physical or chemical contaminants and allergens and how to prevent them. Understand how to effectively respond to consumer interest in health, wellness and nutritious foods and develop your culinary creativity.</p><p>Gastronomy is a booming career choice as there is a growing demand for processed but healthy foods and ready-to-eat meals. One of the main advantages of studying gastronomy is that you can always increase your knowledge about different cultures, recipes and new ways of cooking. It encourages people to eat healthily while bringing different cultures together. With a basic understanding of gastronomy, you can identify food allergens that may affect some diners and ensure that all of your meals are free of pollutants and infections. This course is not only for aspiring students but for anyone wanting to know what they are eating. Also, to be a true gastronome, you don't have to work in the food industry. Simply knowing and enjoying food and appreciating cuisine will also help build up your skills as a connoisseur. So take this course and start learning from the best!</p><a href=\"https://alison.com/resume/courses/4726\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4726\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Basics of Gastronomy","description":"Gastronomy is the art or science of good food and good beverage enjoyed in good company. In this module, we will introduce you to gastronomic concepts and teach you the healthy ways of preserving, processing and cooking meat and fish. You will learn how to prevent food hazards and follow the COVID-19 precautions in the food business.","topics":["Basics of Gastronomy - Learning Outcomes","Introduction to Gastronomy","Preservation and Processing of Meat and Fish","Culinary Techniques of Meat and Fish Preparation","Food Hazards and COVID-19 Guidelines","Basics of Gastronomy - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Cooking and Gastronomy - Course Assessment"]}]}