{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5257","title":"Introduction to Diabetes Awareness","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the root causes of various types of diabetes and explains how to prevent and treat them.","description":"Are you concerned about diabetes? If so, this diabetes awareness course answers all the questions you might have. We discuss the root causes of diabetes, its various types and several methods for managing the disorder. We show you how to determine the body's tolerable sugar levels and explain how a healthy diet can help you manage or prevent diabetes. Sign up to learn how to protect yourself and your loved ones from this common lifestyle disease.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>About one in ten people in the U.S. live with diabetes, many of whom do not even know they have it. In this free online diabetes awareness course, we explain how diabetes affects the health of the human body. We discuss various risk factors and explain how changes to lifestyle habits can help manage the disease before examining the role of clinical diabetes treatments. The course begins with the scientific definition of ‘diabetes’. We then trace the health effects of diabetes, including its psychological impact on mental health.</p><p>Women and men experience the symptoms of diabetes differently. We compare the disease’s effect on each sex and contrast the methods used to manage and treat it. Adopting healthy dietary and daily habits can prevent lifestyle diseases like diabetes. We demonstrate that even small lifestyle changes, like regular exercise and healthy eating, can play a key role in preventing diabetes. The course also delves into the social care cost of treating diabetes in the United Kingdom.</p><p>Diabetes is divided into two categories: type 1 and type 2. We go over the signs and symptoms of each and show you how to identify their risk factors. The timely treatment of any disease is critical and should be prioritised so we provide the various treatments used to stay ahead of this disease. Finally, the course discusses some rare and genetic types of diabetes, including gestational diabetes, hypoglycaemia and Wolfram syndrome. This course is designed to help healthcare professionals manage and treat diabetes but also suits anyone who wants to keep themselves and their loved ones safe. Sign up to learn what simple lifestyle changes can prevent diabetes from affecting your life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}