{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2948","title":"Introduction to Tissue Engineering","totalEnrolled":"944","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"How do complex tissue engineering and other medical techniques allow for optimal drug delivery?","description":"This free introductory biochemistry course covers the fundamentals of tissue engineering and regeneration. You will study the modifications and design of tissue components as well as whole tissue repair, as well as the important features of biofilm and bacteria, and the intricacies of the polymeric growth factor.","courseOutcomes":["Discuss tissue engineering and whole...","Identify implant-associated infectio...","Define foreign body response (FBR)...","Compare natural and synthetic hydrog...","Discuss tissue engineering and whole tissue replacement","Identify implant-associated infections and their treatments","Define foreign body response (FBR)","Compare natural and synthetic hydrogels","Explain drug delivery in tissue engineering","Describe osteoporosis and its treatments","Discuss tissue engineering and whole...","Identify implant-associated infectio...","Define foreign body response (FBR)...","Compare natural and synthetic hydrog...","Discuss tissue engineering and whole tissue replacement","Identify implant-associated infections and their treatments","Define foreign body response (FBR)","Compare natural and synthetic hydrogels","Explain drug delivery in tissue engineering","Describe osteoporosis and its treatments"],"courseDescription":"<p>‘An Introduction to Tissue Engineering’ teaches you the foundations of basic tissue-engineering concepts such as whole tissue replacement and the intricate methods used to do so, such as transplants and 3D printing techniques. You will learn about the regeneration of tissue and the techniques used for this, such as scaffolding, and then will look at foreign body response (FBR).</p><p>Next, you will study osteoporosis, the difficulties this disease can cause and the modifications done to implants to still allow bone attachment. You will find out how drug delivery is incorporated into tissue engineering and how to compute the polymeric growth factor. Compare natural and synthetic hydrogels and discover the processes each need for manufacture, as well as their unique uses.</p><p>Finally, you will learn about implant-associated infections as well as treatments and the difficulties biofilm and bacteria can cause. This course is exciting for those who are interested in the biological or chemical fields of study and would like to increase their knowledge of how tissue engineering techniques allow for optimal drug delivery.</p><a href=\"https://alison.com/resume/courses/2948\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2948\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Tissue Engineering","description":"In this module, Tissue Engineering, you will be introduced to tissue engineering and whole tissue replacement. You will learn the Polymeric Growth Factor and Polymeric Systems as well as Regeneration and Foreign Body Response to Implants and the features of Implant Infections.","topics":["Tissue Engineering- Learning Outcomes","Introduction to Tissue Engineering","Foreign Body Response","Surface Modifications","Polymeric Growth Factor","Polymeric System","Implant-Associated Infections","Bio-Film and Bacteria","Tissue Engineering- Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Final Course Assessment"]}]}