{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3659","title":"Law of Attraction and Self Hypnosis: How to Manifest Your Dream Life","totalEnrolled":"4,405","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the law of attraction and self-hypnosis to effortlessly transform your life with this free online course.","description":"The law of attraction is based on the belief that positive or negative thoughts bring positive or negative experiences into a person's life. This free online course will introduce the principles of the law of attraction. You will also learn self-hypnosis to reprogram your subconscious mind. This course is suitable for anyone who wants to modify their lives and become a better version of themselves. Enrol today and begin your transformation.","courseOutcomes":["Explain how the law of attraction wo...","Describe how to love yourself as you...","Outline the three steps to creating ...","State why feeling good is so importa...","Explain how the law of attraction works","Describe how to love yourself as you are","Outline the three steps to creating your reality","State why feeling good is so important","Discuss how to create your personal power affirmation","Summarize the science of neuroplasticity","Outline the four brainwave patterns","Explain how the law of attraction wo...","Describe how to love yourself as you...","Outline the three steps to creating ...","State why feeling good is so importa...","Explain how the law of attraction works","Describe how to love yourself as you are","Outline the three steps to creating your reality","State why feeling good is so important","Discuss how to create your personal power affirmation","Summarize the science of neuroplasticity","Outline the four brainwave patterns"],"courseDescription":"<p>The law of attraction is based on the belief that thoughts are a form of energy and positive energy attracts success in all areas of life, such as health, finances, and relationships. This free online course will introduce you to the law of attraction. You will gain a deeper understanding of how the law of attraction works in your life. This will enable you to live the life you choose with more financial freedom, better relationships, and vibrant health. Learn and practice several powerful and practical tools that will enable you to create all that you dream and desire when applied correctly. You will study a step-by-step process to show you the tools and techniques to get the law of attraction to work for you rather than against you decisively. Familiarize yourself with self-hypnosis to reprogram your subconscious mind with the latest neuroscience principles and create your unique empowering affirmation. Discover the hidden thought patterns missing from your subconscious mind. Use one of the most straightforward tools for relaxation and meditation to unwind and release any tension you may have in your body or mind.</p><p>Discover several powerful processes and tools to access your subconscious mind and change its limited programming. Find out how the law of attraction works with your thoughts and feelings to create your reality and how connecting with the subconscious mind is so valuable for changing your limiting thoughts and beliefs. You will learn a powerful self-hypnosis technique called the Yoga Nidra, enabling you to connect with your subconscious mind. How to create a master list of all your big dreams, desires, and power affirmation will also be discussed. Have you ever used affirmations and still did not get the desired results? This process of self-hypnosis and affirmation will help you solve that problem. Learn how changing your limiting beliefs exercise will help you transform any limiting beliefs you may have. Learn how to replace them with positive empowering beliefs. Uncover how our thoughts and beliefs affect our health and well-being through the science of neuroplasticity and find out some tips to help you feel good. Study some brainwave patterns such as beta and alpha and learn why we form most of our subconscious mind patterns and beliefs in our early years.</p><p>This is a practical course with all the tools you need to succeed with the law of attraction. Have you wondered why you work so hard to make your life work, but you can't make that breakthrough? This course also covers how to eliminate your toxic beliefs so that you can live the life of your dreams. Most popular books or programs on self-improvement only touch the surface of your challenges, not the subconscious toxic beliefs. You will get clear simple to follow steps to manifest more money, vibrant health, and loving relationships in your life. This course is suitable for anybody who would like to replace negative thinking and beliefs with positive empowering thoughts and ideas. No prior knowledge or experience is necessary, but it requires you to have an open mind and enthusiasm to learn. You will also need to be willing to complete practical exercises and have a genuine desire to change your life. Enrol today and begin your transformation.</p><a href=\"https://alison.com/resume/courses/3659\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3659\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Law of Attraction: How to Feel Good","description":"In this module, you will gain a deeper understanding of how the Law of Attraction works and discover one of the simplest tools for relaxation and meditation. Learn how to attract great people into your life, the right and fulfilling relationships for you.","topics":["The Law of Attraction: How to Feel Good - Learning Outcomes","Simple Breathing Meditation","Feeling Good About Yourself","Love Yourself as You Are","Three Steps to Creating Your Reality","Ways of Changing Your Conditions","The Law of Attraction and Quantum Physics","The Law of Attraction: How to Feel Good - Lesson Summary"]},{"name":"Module","details":"The Deep Mind System: Theory and Practical","description":"In this module, you will learn and practice the deep mind system self-hypnosis to relax, reduce stress or implant your positive affirmation and imagery into the subconscious mind. Listen to the recording several times and practice on your own using the materials supplied in the resources section to help you remember the steps.","topics":["The Deep Mind System: Theory and Practical - Learning Outcomes","The Deep Mind System: Theory and Practical","Brainwave Patterns","Beliefs in the Subconscious Mind","Neuroplasticity","How to Use the Deep Mind System","Guided Self Hypnosis: The Deep Mind System","How to Use the Ataxis Exercise","The Deep Mind System: Theory and Practical - Lesson Summary"]},{"name":"Module","details":"Manifest Your Desires and the Empowerment Exercise","description":"In this module, you will learn principles you can utilize throughout your life to help you manifest the things you desire and change your negative beliefs to positive empowering beliefs. Learn how to create your Personal Power Affirmation.","topics":["Manifest Your Desires and the Empowerment Exercise - Learning Outcomes","Manifest Your Desires Exercise","The Empowerment Exercise","Manifest Your Desires and the Empowerment Exercise - Lesson Summary"]},{"name":"Module","details":"Creating Your Personal Power Affirmation","description":"In this module, you will learn how to create your unique list of positive statements that you will use together with self-hypnosis to place it deeply in your subconscious mind and begin to attract all your dreams and desires.","topics":["Creating Your Personal Power Affirmation - Learning Outcomes","Creating Your Personal Power Affirmation","Personal Power Affirmation","Creating Your Personal Power Affirmation - Lesson Summary"]},{"name":"Module","details":"Changing Your Limiting Beliefs Exercise","description":"In this module, you will be guided through a powerful meditation utilizing your self-hypnosis technique and a deepening technique that will enable you to have a deeper and stronger connection with your subconscious mind.","topics":["Changing Your Limiting Beliefs Exercise - Learning Outcomes","Momentum: Why We Keep Repeating Patterns of Thoughts or Beliefs","Learn to Use Only Inspired Action","Changing Your Limiting Beliefs","How to Change Your Limiting Beliefs","Guided Self Hypnosis: Changing Your Limiting Beliefs","Changing Your Limiting Beliefs Exercise - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Law of Attraction and Self Hypnosis: How to Manifest Your Dream Life - Course Assessment"]}]}