{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3711","title":"Learn How to Use The 911, 999 & 112 Emergency Services Correctly","totalEnrolled":"2,070","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you how to get the response you need when making an emergency call.","description":"This course outlines how to effectively communicate with 911, 112 and 999 emergency call operators. We'll explain how to get the much-needed assistance you or somebody else may need. The ability to contact and effectively communicate with the emergency services often means the difference between life and death. It is unlikely that you will be required to make these calls too often in your lifetime, but it’s essential to know what to do and say.","courseOutcomes":["Describe an emergency...","Describe reasons why people call the...","Classify when you should NOT call 91...","Discuss how you can prepare yourself...","Describe an emergency","Describe reasons why people call the emergency service","Classify when you should NOT call 911, 112, or 999","Discuss how you can prepare yourself, your home, and your family to make a call to the emergency services","Explain the different elements involved when making an emergency call","Explain how to set up your smartphone to deal with emergencies","Explain how using VOIP to contact the emergency services can cause problems","Explain how people use texting to engage with emergency services","Identify how to set up your car to call the emergency services automatically","Describe how the communication of emergency services with the public has been affected by the use of social media","Describe the benefits of third-party smartphone apps for particular emergencies","List the five steps involved in making a 911, 112, or 999 call","Describe an emergency...","Describe reasons why people call the...","Classify when you should NOT call 91...","Discuss how you can prepare yourself...","Describe an emergency","Describe reasons why people call the emergency service","Classify when you should NOT call 911, 112, or 999","Discuss how you can prepare yourself, your home, and your family to make a call to the emergency services","Explain the different elements involved when making an emergency call","Explain how to set up your smartphone to deal with emergencies","Explain how using VOIP to contact the emergency services can cause problems","Explain how people use texting to engage with emergency services","Identify how to set up your car to call the emergency services automatically","Describe how the communication of emergency services with the public has been affected by the use of social media","Describe the benefits of third-party smartphone apps for particular emergencies","List the five steps involved in making a 911, 112, or 999 call"],"courseDescription":"<p>We don’t want to tempt fate, but there might be a time where a crisis strikes and you need to call the emergency services like the fire brigade, police, or paramedics. Seeking urgent help can be a scary experience, and people are often daunted by the prospect of who to call when an emergency strikes. However, it is vital to contact the emergency services as soon as possible when faced with a life-threatening incident because time is unlikely to be on your side.</p><p>In case of an emergency - like a car accident, burglary, shooting, or heart attack - you are probably familiar with one of the first steps to carry out. You know you will need to dial an emergency number such as 911, 112, 999, or any other country-specific number. However, what you may not know is that people often make mistakes at this first step. Throughout this course, you will learn that there is a right and wrong way of making an emergency call. Knowing what to do and what to say is essential to get the response you need during an emergency.</p><p>By learning the correct steps in making an emergency call, you can improve the efficacy and speed of the dispatch time. This will result in emergency responders arriving more quickly at the scene of the incident. It is straightforward to take the correct precautions before calling, ultimately making the process run smoothly for you and the emergency call operator. So why wait? Be as prepared as you can and enrol for this free online course today.</p><a href=\"https://alison.com/resume/courses/3711\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3711\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"How to Call the Global 911, 999 &112 Emergency Services","description":"During this stage, I will help you understand what types of situations require an immediate response from the emergency services. In this module, you will learn about emergencies, understand the variety of emergencies you may encounter, and the range of available emergency services. In this module, we cover four key stages of an emergency call, namely, introduction, when to call and not to call the emergency services, preparing for an emergency call, and how to make an emergency call.","topics":["How to Call the Global 911, 999 &112 Emergency Services - Learning Outcomes","Introduction to Emergencies","When to Call and Not to Call the Emergency Services","Preparing for an Emergency Call","How to Make an Emergency Call","How to Call the Global 911, 999 &112 Emergency Services - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Learn How to Use the 911, 999 &112 Emergency Services Correctly - Course Assessment"]}]}