{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5475","title":"Lose Weight by Managing Proteins, Carbs & Fats","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to lose weight with the effective and healthy diet options provided in this free online nutrition course.","description":"People battling with obesity find it challenging to choose a diet option that provides them with the required nutrition and helps them control their weight. Nutritionists and dieticians help them to face this challenge by drawing up sensible diet plans. This health and fitness course establishes the benefits of learning about various healthy foods and delves into the science of weight-loss to help you or your clients manage weight effectively.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Obesity is becoming a global challenge. Every year, hundreds of thousands of people are diagnosed with obesity and are urged to adopt a strict diet and weight management plan. However, such patients and those treating them usually find it challenging to find and stick to healthier diet options. This eventually affects motivation and patients stop managing their diet and health and continue with their previous unhealthy lifestyles.</p><p>To counter this problem, Element Recipe has designed this course to benefit people with obesity and their nutritionists, physicians and dieticians. This course is part of our ‘Weight Loss’ series and it presents various foods containing the three macronutrients essential for the human body. These macronutrients are protein, carbohydrates and fats. The whole course revolves around these nutrients, the foods in which they are found and various recipes in which they are found.</p><p>We discuss foods with higher protein content and food items that contain healthy carbs and fatty foods. The course also describes the ‘starvation mode’, its connection with obesity and the categories into which bodies break up their calories. We then provide essential tips to help you avoid any unnecessary reduction in body metabolism. So whether you are trying to lose weight yourself or work as a dietician, nutritionist or even personal trainer, this course is meant for you. Sign up to explore the science of food to learn how to lose and manage weight with a healthy diet.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}