{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2687","title":"Managing Safety and Health in Schools","totalEnrolled":"13,506","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about effective health and safety management in schools and workplaces with this free online training course.","description":"This free online course on Managing Health and Safety in Schools will teach you about the health and safety regulations that are found in schools and workplaces around the world. In a school or workplace, safety is everyone's responsibility. This online safety training course will familiarize you with health and safety regulations, recommendations, and emergency preparedness measures.","courseOutcomes":["Identify the requirements of Health ...","Identify roles, duties, and responsi...","Describe a safety statement...","State the main features of a safety ...","Identify the requirements of Health and Safety legislation","Identify roles, duties, and responsibilities for safety in schools and workplaces","Describe a safety statement","State the main features of a safety statement","Define a hazard","Identify hazard types","Define risk and risk assessment","Describe risk measurement","Define risk control measures","Explain the safe system of work","Identify key control measures","List key elements of emergency planning","Complete an accident report","Outline the role of a safety committee","List the main entitlements of a safety representative","Describe reporting and investigating procedures","Identify the requirements of Health ...","Identify roles, duties, and responsi...","Describe a safety statement...","State the main features of a safety ...","Identify the requirements of Health and Safety legislation","Identify roles, duties, and responsibilities for safety in schools and workplaces","Describe a safety statement","State the main features of a safety statement","Define a hazard","Identify hazard types","Define risk and risk assessment","Describe risk measurement","Define risk control measures","Explain the safe system of work","Identify key control measures","List key elements of emergency planning","Complete an accident report","Outline the role of a safety committee","List the main entitlements of a safety representative","Describe reporting and investigating procedures"],"courseDescription":"<p>This free online training course begins by introducing you to safety and health legislation as well as general duties and responsibilities around safety and health management in schools and workplaces. Health and safety are relevant to all school principals or employers and any new members of staff. You will also learn about the safety statement which is very important in safeguarding the health and safety of those at work.</p><p>Furthermore, you will then delve into the different types of hazards which include biological, chemical, ergonomic, physical, psychological, and safety. Learning how to identify hazards at your workplace can help you control or eliminate them thus preventing accidents, injuries, and property damage. With this course, you will also learn how to measure and assess risk, plan for emergencies, and report an accident. You will also be introduced to the role of the safety committee.</p><p>This Health and Safety training online course will help you become a better member of the management committee by teaching you essential health and safety protocols applicable in the workplace or school. Upon the completion of this online course, you will learn how to identify risks and hazards in schools and workplaces as well as how to correctly create an accident report, and handle an emergency or accident. Enroll in this online course today and improve your knowledge and skills on the best practices of health and safety in schools and workplaces.</p><a href=\"https://alison.com/resume/courses/2687\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2687\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Legislation and General Duties for Safety Management","description":"In this module: Legislation and General Duties for Safety Management, you will learn about the main legal requirements for a school or workplace to create a safe and healthy place to work. You will also learn about the different roles and responsibilities in safety management, as well as the process of preparing a safety statement.","topics":["Legislation and General Duties for Safety Management - Learning Outcomes","Legislation and Responsibilities in Safety Management","Safety Statement","Legislation and General Duties for Safety Management - Lesson Summary"]},{"name":"Module","details":"Risk Assessment","description":"In this Module: Risk Assessment, you will learn about hazards and risks. You also learn how to prepare controls to eliminate or reduce the likelihood of accidents and ill-health occurring, thereby allowing staff and students to work safely.","topics":["Risk Assessment - Learning Outcomes","Risk Assessment","Control Measures","Risk Assessment - Lesson Summary"]},{"name":"Module","details":"Emergency Planning, Accident Reporting, and Safety Management Systems","description":"In this Module: Emergency Planning, Accident Reporting, and Safety Management Systems, you will learn about planning for emergency situations, and how to respond to and report work-related accidents. You will also discover the composition and roles and obligations of a safety committee.","topics":["Emergency Planning and Safety Management Systems - Learning Outcomes","Emergency Planning and Accident Reporting","Health and Safety Management System","Emergency Planning, Accident Reporting, and Safety Management Systems - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Managing Safety and Health in Schools - Course assessment"]}]}