{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2695","title":"Managing Health and Safety in Healthcare","totalEnrolled":"24,747","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the management of safety and health in healthcare with this free online course.","description":"This free online course, Managing Health and Safety in Healthcare, will teach you about safety management practices, providing an introduction to managing occupational safety and health in a way that is suitable for all healthcare settings. This free online course will teach you about the safety statement, safe systems of work, safety consultation, biological, physical and chemical hazard types and general principles of prevention.","courseOutcomes":["Explain how to manage occupational h...","Explain the safe system of work...","Identify the components and describe...","Recognise accidents and incidents in...","Explain how to manage occupational health and safety in a healthcare environment","Explain the safe system of work","Identify the components and describe the function of a safety statement","Recognise accidents and incidents in healthcare","Outline the steps in an accident investigation","Identify the main requirements of the Safety, Health and Welfare Act","List the four categories of hazards in healthcare settings","Describe the risk assessment process","Apply the General Principles of Prevention in your workplace","Outline the four biological agent risk groups","Describe the measures used to safeguard healthcare employees from the harmful effects of hazardous biological or chemical agents","Explain how to manage occupational h...","Explain the safe system of work...","Identify the components and describe...","Recognise accidents and incidents in...","Explain how to manage occupational health and safety in a healthcare environment","Explain the safe system of work","Identify the components and describe the function of a safety statement","Recognise accidents and incidents in healthcare","Outline the steps in an accident investigation","Identify the main requirements of the Safety, Health and Welfare Act","List the four categories of hazards in healthcare settings","Describe the risk assessment process","Apply the General Principles of Prevention in your workplace","Outline the four biological agent risk groups","Describe the measures used to safeguard healthcare employees from the harmful effects of hazardous biological or chemical agents"],"courseDescription":"<p>This free online course begins by providing you with an overview on safety and health as it pertains to healthcare. First, you will learn about the Safety Statement which is a legal requirement for all employers, then you will be learning how safety and health within a healthcare environment are managed and learn that it is based on the principle that safety can be managed because most accidents and ill-health are foreseeable and can usually be prevented.</p><p>Furthermore, you will learn about the laws governing the elements of the safety and health management with specific application to healthcare. Next, the course covers healthcare hazards in biological, physical and chemical forms, and how to assess the risks posed by these hazards. This online course will also teach you the procedures for controlling risks and how to deploy the General Principles of Prevention in curtailing risks effectively.</p><p>Upon the completion of this online course, you will be able to identify the components and describe the function of a safety statement, recognize the importance of safety consultation in the healthcare environments, learn the laws guiding health and safety management in health care spaces, outline the procedure for assessing and controlling risks, as well as contextualize general preventive principles to specific risks posed by different hazard forms. Sign up for this free online course today and learn how to effectively manage occupational health and safety in a healthcare environment.</p><a href=\"https://alison.com/resume/courses/2695\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/2695\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Managing Health and Safety in Healthcare","description":"In this module: Managing Health and Safety in Healthcare, learners will be introduced to the general concept of health and safety management. you will learn about the laws guiding the elements of occupational health and safety management. You will also learn about the different hazard types and how to implement preventive principles for the different risks they pose.","topics":["Managing Health and Safety in Healthcare - Learning Outcomes","General Health and Safety Management in Healthcare","Legislation","Physical Hazards","Biological Hazard","Chemical Hazard","Managing Health and Safety in Healthcare - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Managing Health and Safety in Healthcare - Course assessment"]}]}