{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5269","title":"Management and Administration of Medicines","totalEnrolled":"1,699","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover effective strategies to help you manage and administer various types of medicines in this free online course.","description":"Misadministration of medicines is a major concern for the world's healthcare systems. Recent research and case studies conducted at the University of Manchester estimate that 237 million medication errors occur each year, with avoidable medication errors killing over 1,700 people. This course sheds light on effective medicine prescription, management and optimization as well as how to manage common health problems.","courseOutcomes":["List the various types of medicine m...","State the implications of poor medic...","Discuss the need for controlled drug...","Distinguish between the various drug...","List the various types of medicine management","State the implications of poor medicine management","Discuss the need for controlled drug prescription","Distinguish between the various drug administration methods","Identify various medications for the treatment of common health problems","List the symptoms that palliative care addresses","Summarize safety precautions for patients with eczema","Explain the principles of medicine optimization","Recall the roles and responsibilities of healthcare practitioners","List the various types of medicine m...","State the implications of poor medic...","Discuss the need for controlled drug...","Distinguish between the various drug...","List the various types of medicine management","State the implications of poor medicine management","Discuss the need for controlled drug prescription","Distinguish between the various drug administration methods","Identify various medications for the treatment of common health problems","List the symptoms that palliative care addresses","Summarize safety precautions for patients with eczema","Explain the principles of medicine optimization","Recall the roles and responsibilities of healthcare practitioners"],"courseDescription":"<p>Medication is an essential component of the healthcare system. Good medication prescription and optimization practices can help prevent patient deaths caused by medication errors. This course examines the principles of medication management and good medication prescription in relation to the standard of practice achievable in the UK. It introduces you to the fundamentals of medication management and clinical pharmacokinetics. You will learn about the various drug administration routes, adverse drug reactions, and the importance and consequences of poor medication management.</p><p>The first step in the medication process is drug prescription, which starts a chain reaction. We will teach you the fundamentals of good prescription, as well as how to take a medication history and write a drug prescription. Learn about the pharmacological management of common problems such as diarrhea, constipation, and diabetes. Learn about the principles of palliative care and medicine optimization, as well as the roles of healthcare practitioners in medication management in residential aged-care facilities.</p><p>Alternative medicines are non-prescription drugs that are widely available and used in local communities. This course explains commonly recognized alternative medicines as well as measures to ensure user safety and welfare. Furthermore, you will learn the significance of medication review and storage, as well as the legislation involved in medication optimization. This course is for everyone, whether you are an aspiring or practicing healthcare practitioner, caregiver or if you simply want to learn about medication management.</p><a href=\"https://alison.com/resume/courses/5269\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5269\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Medicines and Pharmacological Management","description":"In this module, you will learn the importance of medication management, and the principles of good medication prescription, you will also learn how to manage common sicknesses.","topics":["Medicines and Pharmacological Management - Learning Outcomes","Introduction to Medicine Management","Effective Medication Prescription","Pharmacological Management of Common Problems","Medicines and Pharmacological Management - Lesson Summary"]},{"name":"Module","details":"Commonly Used Medicines and Optimization","description":"In this module, you will be introduced to the principles of palliative care, and the principles of medicine optimization, you will learn the roles and responsibilities of healthcare practitioners and the legislations involved in drug management.","topics":["Commonly Used Medicines and Optimization - Learning Outcomes","Palliative Care and Commonly Used Medicines","Principles of Medicine Optimization","Medication, Law and Legislation","Commonly Used Medicines and Optimization - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Management and Administration of Medicines - Course Assessment"]}]}