{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5152","title":"Management and Treatment of Dual Diagnosis","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore effective treatment and management strategies for dual diagnosis in this free online psychology course.","description":"Research suggests that roughly half the people with a mental disorder also have a substance use disorder at some point in their lives, a condition known as ‘dual diagnosis’ that was first identified in the 1980s. This is a major concern for the healthcare industry and the demand for capable practitioners trained to address it has increased. This psychology course provides the best treatment and management practices to overcome dual diagnosis.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Dual diagnosis was first identified in the 1980s in patients suffering severe mental illness and substance addiction at the same time. This combination remains a major concern for the healthcare industry and requires an integrated assessment and treatment approach in both mental health and substance misuse to overcome. This course covers treatments and management strategies for dual diagnosis. We begin with an overview of dual diagnosis and an explanation of how the brain works as we trace the connection between anxiety disorders and substance abuse.</p><p>In order to provide effective dual diagnosis treatment, the two disorders must be integrated rather than treated separately. Such an approach to treatment combines psychotherapy, pharmacotherapy, detoxification, medication and group therapy. We explain the basics of contingency management treatment and outline various care models designed to ensure effective care management across drug misuse treatment services.</p><p>The course lays out the policies governing dual diagnosis and identifies the penalties for drug misuse under various laws. We provide effective risk assessment and management techniques and our practical tips can help you deal with various issues you encounter in practice. Finally, we walk you through the stages of dual diagnosis treatment. We examine the medications and other types of treatment provided by substance abuse services. This psychology course is ideal for anyone interested in a career in mental health or counselling as we trace the links between substance abuse and mental disorders and explain how to treat both.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}