{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5486","title":"Master Psychoanalytical Theory Of Personality by Sigmund Freud","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how Sigmund Freud’s psychoanalytic Theory of Personality explains our minds in this free online psychology course.","description":"Are you looking to understand the inner workings of the human mind? You’re not the first and this psychology course examines the work of one of the world’s most famous thinkers: Sigmund Freud’s. We explore Freud’s psychoanalytical theory of personality to provide a deeper understanding of the factors that shape our personalities. Sign up to uncover the underlying patterns in human behaviour and the hidden impulses that drive our psychologies.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Sigmund Freud's psychoanalytic theory of personality is one of history’s most influential psychological theories. It provides a window into the inner workings of the human mind and the different levels of consciousness. This psychology course provides an in-depth understanding of the psychoanalytical theories of the Austrian neurologist and founder of psychoanalysis. We explore the foundational concepts of psychoanalytic theory and define important terms like ‘id’, ‘ego’ and ‘superego’. We also demonstrate the techniques used by Freud to develop his theories.</p><p>This course lays out the various components of psychoanalytic theory, including the unconscious, repressed memory, defence mechanisms and dream analysis. We also explain how such psychoanalytical theory relates to clinical practice and investigates its practical applications. We examine the different types of psychotherapies used in psychoanalytic practice, such as free association, dream interpretation and the use of transference.&nbsp;</p><p>This course offers you a comprehensive understanding of the psychoanalytic theory of personality and its applications. If you are interested in what drives human thought and behaviour, this psychology course delves into the work of one of the world’s most influential thinkers to help you understand Freudian theory and how to apply it practically.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}