{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2085","title":"Meal Planning, Sanitation and Therapeutic Nutrition","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about meal planning, food hygiene and dietary requirements for some diseases in this clinical nutrition course.","description":"This free online clinical nutrition course will introduce you to therapeutic nutrition and its principles and practices. Start the course today and learn more about food sanitation and hygiene, the dietary requirements for some diseases, and also how nutrition helps with stress, burns and surgery. You will also learn about water purification, nutritional disorders, balanced diet and food groups, and meal planning in a healthcare setting.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online course you will learn about planning meals, food hygiene and various dietary requirements for some diseases. The course explains why water is an essential nutrient and effects of daily water losses is explained. Next, the course introduces the concept of balanced diet and food groups. Effective meal planning, and aspects that affect food selection will also be covered in the course.</p><p>You will learn about food sanitation and hygiene, the purification and filtration of water, the therapeutic adaptation of a normal diet as well as some modifications of a normal diet. This course will also teach you about the principles of a therapeutic diet. The dietary requirements needed to treat diseases affecting the intestines, liver, gall bladder, and treating diarrhoea will be covered.</p><p>Finally, you will learn about dietary requirements for treating diseases that affect the heart and the kidney, as well as the dietary requirements for treating cancer, and various types of burns will be covered. The course also covers key aspects of food sanitation and hygiene. Start the course today and learn about nutritional disorders, balanced diet and food groups, and meal planning in a healthcare setting.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}