{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1381","title":"Mental Health Studies - Suicide, Violent Behavior and Substance Abuse","totalEnrolled":"144,297","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn why mental well-being is so important and learn to identify mental health problems so you can help reduce the stigma of mental illness today.","description":"This free online mental health studies course covers the important topics of suicide, violent behaviour and substance abuse. With self-harm and debilitating mental health problems increasing globally, mental health has become an increasingly important concern of healthcare systems around the world. This course will guide you through some truly important knowledge that can help alleviate actions and habits that might be endangering one's health.","courseOutcomes":["Identify the signs and types of suic...","Cite conditions that are likely to c...","Identify the most common precipitati...","Identify the methods used to manage ...","Identify the signs and types of suicide behaviors","Cite conditions that are likely to cause of suicide","Identify the most common precipitating factors in violent behavior","Identify the methods used to manage the violent patient who is unarmed or armed","Describe the factors impacting the effect of the particular substance on the individual","Identify the long and short-term effects of substance abuse","Identify the signs/symptoms and treatment for overdose and withdrawal of alcohol, opioids and barbiturates","Identify behavior changes resulting from substance abuse","Describe body mechanism adjustments and tolerance levels to substances","Identify the signs and types of suic...","Cite conditions that are likely to c...","Identify the most common precipitati...","Identify the methods used to manage ...","Identify the signs and types of suicide behaviors","Cite conditions that are likely to cause of suicide","Identify the most common precipitating factors in violent behavior","Identify the methods used to manage the violent patient who is unarmed or armed","Describe the factors impacting the effect of the particular substance on the individual","Identify the long and short-term effects of substance abuse","Identify the signs/symptoms and treatment for overdose and withdrawal of alcohol, opioids and barbiturates","Identify behavior changes resulting from substance abuse","Describe body mechanism adjustments and tolerance levels to substances"],"courseDescription":"Mental health care and wellbeing are becoming increasingly important aspects of health provision in health systems around the world. The course begins by introducing you to areas of mental health where the activities, actions or habits of people endanger their health and welfare. The course introduces the learner to suicide, conditions that are likely to be a cause of suicide, and preventative treatment measures. Next, the course teaches how to manage violent patients and outlines the complex area of substance abuse. The course describes the long and short-term effects of substance abuse, and identifies the signs, symptoms and treatment for overdose and withdrawal of alcohol, opioids and barbiturates.This mental health studies course will be of great interest to healthcare professionals or those interested in the field of mental health, counselling, psychotherapy, therapeutics and other related areas of healthcare. <a href=\"https://alison.com/resume/courses/1381\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1381\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Mental Health Studies - Understanding Suicide","description":"In this module, you will gain an indepth insight into the different types of suicide. You will learn about the signs to look out for and the conditions that are likely to cause suicide. This module will teach you about myths and facts that surround suicide and inform you on the methods to manage a potential suicide victim.","topics":["Mental Health Studies: Understanding Suicide - Learning Outcomes","Suicide and Types of Suicide Behavior","Myths and Facts about Suicide","Immediate Danger Signs of Suicide Intent","Mental Health Studies: Understanding Suicide - Lesson Summary"]},{"name":"Module","details":"Mental Health Studies - Violent and Hostile Behavior","description":"This module will teach you about the most common factors in violent behavior. You will learn about the methods that are used to manage a violent patient who is unarmed and also the methods to use if a violent patient is armed.","topics":["Mental Health Studies: Violent and Hostile Behavior - Learning Outcomes","Management of Violent or Hostile Behavior","Management of Violent or Armed Behavior","Mental Health Studies: Violent and Hostile Behavior - Lesson Summary"]},{"name":"Module","details":"Mental Health Studies - Substance Abuse","description":"In this module, you will gain an insight into the various types of substance abuse. You will learn how to identify symptoms for different substance abuse and how to treat a substance abuser. You will also learn about tolerance levels for each individual and how the list of substances commonly inhaled changes constantly.","topics":["Mental Health Studies: Substance Abuse - Learning Outcomes","Introduction to Substance Abuse","Barbiturates and Sedatives as Central Nervous System Depressants","Opioids (Narcotics) Use","Central Nervous System Stimulants","Central Nervous System Stimulants: LSD and Inhalants","Alcohol as a Central Nervous System Depressant","Mental Health Studies: Substance Abuse - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 4: Mental Health Studies - Suicide, Violent Behavior and Substance Abuse Assessment"]}]}