{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1380","title":"Mental Health Studies - Understanding Behaviour, Burnout and Depression","totalEnrolled":"60,527","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to reduce the stigma of mental illness by getting an in-depth understanding of mental health disorders.","description":"This free online Mental Health Studies course from Alison clearly discusses behaviour, burnout, and depression, allowing you to recognize them. A lot of people experience trauma in their lives, and while some can cope with negative situations, others may not manage so well. With this free course, you will become much more ready to help people deal with the effects of serious mental health problems.","courseOutcomes":["Define normal behaviour...","Identify the characteristics of norm...","Describe the range of neurotic and p...","Identify therapeutic and drug interv...","Define normal behaviour","Identify the characteristics of normal behaviour and defence mechanisms","Describe the range of neurotic and psychotic behavioural tendencies","Identify therapeutic and drug interventions to treat abnormal behaviours","Discuss the causes, signs and symptoms of burnout","Identify types and classification of depression","State the causes, signs and symptoms of depression","Define normal behaviour...","Identify the characteristics of norm...","Describe the range of neurotic and p...","Identify therapeutic and drug interv...","Define normal behaviour","Identify the characteristics of normal behaviour and defence mechanisms","Describe the range of neurotic and psychotic behavioural tendencies","Identify therapeutic and drug interventions to treat abnormal behaviours","Discuss the causes, signs and symptoms of burnout","Identify types and classification of depression","State the causes, signs and symptoms of depression"],"courseDescription":"<p>This course will first look into behaviour and cultural differences as well as how society defines behavioural norms. You will study the defence mechanisms used by people in everyday interactions and learn how rationalization can reduce stress. The course will discuss the different types of personality disorders such as schizoid personality, explosive personality, and obsessive-compulsive personality to name a few. You will also look into psychotherapy as a therapeutic intervention for these personality disorders.<br><br>You will then study the two major types of depression and look into the symptoms of severe depression. The course will discuss the signs to look out for as well as how to manage the disorder. Next, you will cover the topic of burnout and study its signs and symptoms. You will learn the causes of burnout and the techniques for its prevention. Finally, you will study the types of medications for the treatment of depression.<br><br>The modern world has created many challenges that adversely impact our health and wellness in our daily personal and professional lives. As a result, personality disorder, phobia, and neurotic behaviour sometimes get the better of some people. These disorders can be alleviated, with the right knowledge. So, learn more about mental health by taking this course, and help yourself or a loved one enjoy more balanced mental well-being.</p><a href=\"https://alison.com/resume/courses/1380\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1380\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Mental Health Studies - Behavior","description":"This module will teach you about how society can define behavioral norms. You will learn about behavior and cultural differences as well as defense mechanisms used in everyday interactions. You will learn how rationalization can reduce stress and gian indepth knowledge about schizophrenia.","topics":["Mental Health Studies: Behavior - Learning Outcomes","Introduction","Behavior","Human Behavior Defense Mechanisms","Neurotic and Psychotic Behavior","Schizophrenia","Personality Disorders","Therapeutic Intervention","Mental Health Studies: Behavior - Lesson Summary"]},{"name":"Module","details":"Mental Health Studies - Burnout and Depression","description":"This module will teach you about the two major types of depression. You willl learn the symptoms of severe depression and the signs to look out for. You will also gain insight into managing depression. This module will also inform you on what causes burnout and will teach you the techniques to prevent burnout.","topics":["Mental Health Studies: Burnout and Depression - Learning Outcomes","Causes of Burnout","Signs and Symptoms of Burnout","Depression","Mental Health Studies: Burnout and Depression - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 3: Mental Health Studies - Behaviour, Burnout and Depression Assessment"]}]}