{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4768","title":"Monkeypox - What You Need to Know","totalEnrolled":"2,386","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how the mpox virus has spread and what you can do to avoid catching it in this free online course.","description":"What is mpox and how does it spread? Find the answers and learn how to protect yourself and others in this practical course. Monkeypox may be less deadly than its cousin smallpox and less contagious than coronavirus, but its widespread emergence beyond Africa's borders in 2022 has been declared a public health emergency of international concern (PHEIC) by the World Health Organization. We will update the data here as information emerges.","courseOutcomes":["List the parts of the world where mp...","State what a zoonotic disease is...","Recall some of the mammals associate...","Discuss the connection between the e...","List the parts of the world where mpox is endemic","State what a zoonotic disease is","Recall some of the mammals associated with mpox virus infection","Discuss the connection between the end of smallpox vaccination and the spread of mpox","Recall how many strains or 'clades' of mpox there are","Describe how the 2003 outbreak of mpox in the USA was caused","Outline the typical incubation period of mpox","List the common symptoms of mpox before the rash appears","Summarise the stages of the rash","Discuss the case fatality ratio of mpox","Describe some of the ways in which mpox can spread","Explain how the current outbreak has come to be associated with sexual intercourse, despite mpox not being considered a sexually transmitted disease","Identify what sort of vaccine is being ordered for mpox patients and their close contacts","Outline the steps that should be taken to minimise the spread of infection","List the parts of the world where mp...","State what a zoonotic disease is...","Recall some of the mammals associate...","Discuss the connection between the e...","List the parts of the world where mpox is endemic","State what a zoonotic disease is","Recall some of the mammals associated with mpox virus infection","Discuss the connection between the end of smallpox vaccination and the spread of mpox","Recall how many strains or 'clades' of mpox there are","Describe how the 2003 outbreak of mpox in the USA was caused","Outline the typical incubation period of mpox","List the common symptoms of mpox before the rash appears","Summarise the stages of the rash","Discuss the case fatality ratio of mpox","Describe some of the ways in which mpox can spread","Explain how the current outbreak has come to be associated with sexual intercourse, despite mpox not being considered a sexually transmitted disease","Identify what sort of vaccine is being ordered for mpox patients and their close contacts","Outline the steps that should be taken to minimise the spread of infection"],"courseDescription":"<p>Our free mpox course is packed with factually correct, reliable information on the latest virus to make news headlines. The virus, formerly called monkeypox, is endemic to parts of Africa; however, in May 2022, cases began to appear in different parts of Europe, the USA, Canada and beyond that were not connected to travel from African hotspots. While it is not as contagious as coronavirus and not as deadly as its predecessor smallpox, mpox is still of concern. Patients are advised to isolate themselves for 21 days to avoid spreading the infection further - and in some countries, that applies to close contacts too. In this course, you will learn the background of the spread of mpox in humans, its connection to the eradication of smallpox globally and the accompanying cessation of vaccination programmes.</p><p>The course explores the development of the mpox outbreak in 2022 and the international response as medical researchers race to find answers to exactly how and why it has spread to other countries. You will learn the mpox symptoms and the typical incubation period before they appear. There usually are two phases in mpox cases: an initial period when the patient feels unwell and then the appearance of the distinctive rash a few days later. Discover how to avoid contracting the virus and what you should do if you catch it. While there is no specific treatment yet, most cases are mild and the illness runs its course naturally. However, mpox can cause difficulties, particularly for children and those with suppressed immune systems, so everyone has a role to play in preventing the further spread of infection.&nbsp;</p><p>The earliest cases of the 2022 outbreak of mpox may have occurred in homosexual and bisexual men but experts believe that it is not a sexually transmitted disease and that patients have contracted it through close contact. Nevertheless, like any virus, mpox can affect anyone, so why not make sure you know exactly what you could be dealing with. Being informed is the best defence against any infectious disease. Our free course will be regularly updated with the latest advice and information so you can enrol, safe in the knowledge that you are being kept thoroughly up to date.</p><a href=\"https://alison.com/resume/courses/4768\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4768\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Monkeypox - Background, Symptoms and Advice","description":"Few people outside of Africa had heard of monkeypox in April 2022, however, by May it had become a household word. In this module you will learn how monkeypox is spread and its most common symptoms including how the distinctive rash evolves. You will also discover how to protect yourself and others from the virus.","topics":["Learning Outcomes | Monkeypox - Background, Symptoms and Advice","Monkeypox - Background and Symptoms","Monkeypox - Transmission and Treatment","Monkeypox - Developments and International Response","Monkeypox - Advice for the Public","Lesson Summary | Monkeypox - Background, Symptoms and Advice"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment | Monkeypox - What You Need to Know"]}]}