{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5464","title":"Muscle Building Without A Gym","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how a bodyweight workout plan can help you build muscle at home in this free online health and fitness course.","description":"Muscle growth is caused by exercise and hormones like testosterone, growth hormone, amino acids and other nutrients. This health and fitness course delves into the science behind building muscle and improving fitness. We examine common myths surrounding muscle building and formulas like the fat-loss formula. Sign up to learn how to successfully follow a bodyweight workout programme and stay motivated as you reach your fitness objectives.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Several variables influence muscle formation, including hormones such as testosterone and growth hormone as well as the availability of amino acids and other nutrients. We begin this health and fitness course by exploring the science behind muscle. We then dispel some myths about muscle building and discuss what to expect as a beginner. We help you to identify the most important fat-loss and muscle-building formulas. We explain how to build muscle successfully and discuss what you should consider when trying to lose fat.</p><p>The course explains how to draw up, implement and stick to a bodyweight workout programme. We lay out the exercises that will help you build muscles, including compound exercises. We discuss activities that will help you build muscle in your legs, back, chest, arms and other desired body parts. The course provides useful techniques you can use to maintain your discipline and motivation as you successfully reach your fitness goals. We help you answer questions like ‘can you build muscle and lose fat at the same time?’ and ‘what environment can help me to build muscle and lose fat?’.</p><p>This course explores the science of muscle building to provide the skills you need to follow a bodyweight workout programme successfully. You can confidently use these concepts and techniques to assist both yourself and other people as a personal trainer. We explain how to stay motivated after starting your fitness journey. We trace each stage of the process for both losing fat and building muscle. This course helps people understand the basics of muscle building and explains how to create a workout plan using bodyweight exercises. Working out should not require expensive equipment or a gym membership so sign up for this health and fitness course to learn how to build muscles at home.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}