{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5234","title":"Noise and Hearing Protection Training","totalEnrolled":"311","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to protect people’s hearing from the effects of loud noise in this free online health and safety course.","description":"According to the Center for Disease Control and Prevention, 22 million U.S. workers are exposed to dangerous noise at work each year. This health and safety course describes the types of noise we experience and the risk of noise exposure. We explain how to control noise and choose suitable hearing protection before going over the UK’s noise control legislation. Sign up to protect yourself and your colleagues from ear damage caused by noise.","courseOutcomes":["Identify different types of noise...","Explain how to conduct a noise risk ...","Describe various ways to control noi...","Identify the health effects of susta...","Identify different types of noise","Explain how to conduct a noise risk assessment","Describe various ways to control noise at the workplace","Identify the health effects of sustained loud noise","Compare safe and unsafe noise levels","Explain the different noise control laws of the United Kingdom","Discuss the techniques used to conserve hearing","Identify different types of noise...","Explain how to conduct a noise risk ...","Describe various ways to control noi...","Identify the health effects of susta...","Identify different types of noise","Explain how to conduct a noise risk assessment","Describe various ways to control noise at the workplace","Identify the health effects of sustained loud noise","Compare safe and unsafe noise levels","Explain the different noise control laws of the United Kingdom","Discuss the techniques used to conserve hearing"],"courseDescription":"<p>Exposure to loud noise for long periods of time causes permanent hearing loss. This health and safety course explains how to control workplace noise and prevent hearing loss. We identify the sources of noise and discuss how to implement the ‘hierarchy of noise control’, from elimination and substitution to engineering control and implementing administrative measures. We show you how noise can severely affect people’s health and wellbeing.</p><p>The course lays out the factors affecting noise risk and symptoms of hearing loss. We identify acceptable noise levels and the most common causes of hearing loss in adults. We explain the concept of ‘safe hearing’ and which sound levels or decibels (dB) require hearing protection and how long you can listen to various decibels. We then assess the effectiveness of hearing protectors and delve into the UK legislation designed to eliminate noise risk and protect employees in the workplace.</p><p>Finally, we lay out the roles of your organisation’s health and safety executive and demonstrate how to set up an action plan for mitigating noise hazards. We discuss various hearing conservation programmes and the use of personal audiometric records. This comprehensive training course provides in-demand skills to help you further your career and improve your professional skills. This course suits managers responsible for the health and safety of their colleagues or anyone concerned about their noisy work environment. Sign up to learn how to protect your hearing.</p><a href=\"https://alison.com/resume/courses/5234\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5234\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Noise and Hearing Protection","description":"In this module, you will learn the various types of noise we experience in our environment and how to conduct noise risk assessments. We will cover the ways of controlling noise in the workplace and the health effects of loud noise. Discover the safe noise level, noise control legislation and technique for hearing conservation.","topics":["Noise and Hearing Protection - Learning Outcomes","Basics of Noise and Hearing Protection","Effects of Loud Noise and Safe Hearing","Legislation and Hearing Conservation","Noise and Hearing Protection - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Noise and Hearing Protection Training - Course Assessment"]}]}