{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5005","title":"Nuclear Warfare 103 - Fallout","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about nuclear fallout and how to deal with it in this free online course and its complementary guidebook.","description":"In this survival course, you will explore radioactive fallout and the likely effects of a nuclear incident. You will also examine situations where nuclear disasters have occurred and look at the impact on the local populations and their environments. This practical course will help you become familiar with common terms and includes the seminal handbook by US scientist Cresson Kearny, ‘Nuclear War Survival Skills’, as a free download.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will provide answers to the questions many of us don't want to ask. The prospect of nuclear warfare is too terrifying to contemplate - which is why such weapons are considered a deterrent. However, as you will know if you have completed our other nuclear survival courses, there are good reasons to become informed ahead of a future attack. First of all, you will realise that nuclear warfare may have little to no effect on your family. Secondly, even if your region was targeted, you have an excellent chance of survival if you are not within a mile or so of ground zero and thirdly, it is much easier to avoid being contaminated by fallout if you know how to deal with it. Educating yourself on what to do in the event of an attack means you will be less frightened, have a better grasp of the actual threats and know how to keep your family safe.</p><p>In this course, we take a deep dive into fallout: what it is, how it is created and what to do if you are threatened by it. We include practical steps for taking care of yourself, other people and pets in the event of an emergency so you can be confident that you would know what to do. You may have heard terms like 'nuclear winter' and feared that an atomic weapon would be cataclysmic. We will explore the science of fallout and the effects of different types of radioactivity to give you a better understanding of what you could be dealing with. While exposure to radioactive substances is linked to certain types of cancer, you will find that the dosage and length of time the exposure lasts are significant factors. Next, the course examines historic incidents at Chornobyl/Chernobyl in Ukraine, Fukushima in Japan and Sellafield in the UK, where there were serious leaks of radioactive material into the environment. Finally, we will look at how different countries have dealt with instances where people have suffered ill effects from contaminated radioactive substances and the compensation schemes that have been put in place.</p><p>This course aims to give the learner a fuller understanding of nuclear fallout and the main steps you can take to stay safe. You will become familiar with the terms that would be widely used should a nuclear attack take place and understand what they mean. You will also comprehend the different factors that would dictate whether you need to shelter and for how long. Having a grasp of terms like 'rads', 'sieverts' and 'isotopes' will make it much easier for you to follow what is happening in the event of a war. We have also included a pdf of the ultimate survivors' handbook, ‘Nuclear Warfare Survival Skills’’ by Cresson Kearny, which you can download in the ‘Resources’ section of the course. The course draws on several reliable sources to boost your confidence in your ability to manage such a crisis. As Kearny himself said: \"Surely in future years, nuclear survival know-how will become an increasingly important part of every prudent person's education.\" Why not enrol and begin your journey to learning today?</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}