{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1367","title":"Nursing Studies - The Physical Examination","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about patient care and the procedures and techniques used in modern nursing with this free nursing course.","description":"This free online Nursing Studies course will teach you how to carry out the most important functions and roles of a modern nurse. You will be shown how the nursing professional can best support both the patient and the physician during physical examinations and measurements of patient vital signs, and you will also gain an overview of the main duties of modern nurses. This will help you to boost your existing nursing skills in no time at all.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free nursing course begins by giving an overview of a systematic approach to conducting an effective physical examination. You will first learn the function of the physical examination, the role of the nurse during the examination, and the positioning of the patient. Next, you will study throat cultures and the main types of specimen collection, including the principles, procedures, supplies, and equipment used. You will then learn how testing determines the health condition of vital internal organs and body components.<br><br>Next, you will cover the topic of cardiovascular, respiratory, gastrointestinal, and genitourinary systems as well as the musculoskeletal and integumentary system. You will learn how to measure a patient's vital signs, temperature, pulse, and respiration rate. You will also learn how to effectively interview your patient to gather subjective and objective medical data. Finally, you will study blood pressure and its physiological impact, and you will learn how to identify anatomical sites where blood pressure may be taken.<br><br>This free nursing course will be of great interest to all healthcare professionals who would like to learn more about advanced practices in nursing, and will enable them to refresh their understanding of the procedures in the physical examination, specimen collection, and measurement of patient vital signs. It will also be valuable to learners who are interested in starting a career in nursing. Check out the course today, and get on your way to a fulfilling nursing career.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}