{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1360","title":"Nursing Studies - Health and Safety, Movement and Exercise","totalEnrolled":"12,790","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about patient care and the procedures and techniques used in modern nursing with this free online nursing course.","description":"This free online Nursing Studies - Health and Safety, Movement and Exercise course teaches the principles of good body mechanics required to care for immobile patients, as well as what to consider when helping patients perform physical tasks. Caring for immobile patients requires both knowledge and patience, with this clear and simple course on body positions, back alignment, and muscle use, assisting your patients will become much easier.","courseOutcomes":["Define and identify principles of go...","Name the eight general consideration...","Describe the basic principles for po...","Describe techniques for maintaining ...","Define and identify principles of good body mechanics","Name the eight general considerations for performing physical tasks","Describe the basic principles for positioning and turning patients","Describe techniques for maintaining the proper body alignment of a patient","Describe the different ways of positioning a patient","Identify the actions which should be taken if a patient begins to fall","Identify the effects of immobility on the body","Define the nine types of body movement","Identify guidelines for range-of-motion exercises","Define and identify principles of go...","Name the eight general consideration...","Describe the basic principles for po...","Describe techniques for maintaining ...","Define and identify principles of good body mechanics","Name the eight general considerations for performing physical tasks","Describe the basic principles for positioning and turning patients","Describe techniques for maintaining the proper body alignment of a patient","Describe the different ways of positioning a patient","Identify the actions which should be taken if a patient begins to fall","Identify the effects of immobility on the body","Define the nine types of body movement","Identify guidelines for range-of-motion exercises"],"courseDescription":"<p>This course will first introduce you to health and safety standards for healthcare professionals. You will study body mechanics so you can utilise the correct muscles to complete a task safely and efficiently. You will also learn about the most common injuries sustained by nurses as well as the importance of changing the patient's position. This course will then look into the general principles that apply when turning the adult patient. It will also discuss the common positions and techniques used when helping a patient to walk.<br><br>You will then study the active and passive ranges of motion in exercise. You will learn that a joint that has not been moved sufficiently can begin to stiffen within 24 hours and will eventually become inflexible, which is why a nurse has to perform Range of Motion (ROM) exercises on each joint in as full a range as possible without causing pain. You will also look into isometric exercises and the different types of body movements.<br><br>Learning the principles of good body mechanics and the different techniques for positioning patients will ensure that both the nurse and patient are kept safe from accidents. This course will give you an in-depth understanding of these movements and even teach you what to do if a patient begins to fall. So if you are looking into a career as a nurse practitioner or just want to refresh your knowledge on the proper body movements and exercises, take this course and help bring your patients back to their feet.</p><a href=\"https://alison.com/resume/courses/1360\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1360\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Health and Safety for Healthcare Professionals","description":"This module looks at health and safety standards for healthcare professionals.","topics":["Health and Safety for Healthcare Professionals - Learning Outcomes","Body Mechanics","Prevention of Pathogen Transmission","Health and Safety for Healthcare Professionals - Lesson Summary"]},{"name":"Module","details":"Positioning and Ambulating the Adult Patient","description":"This module discusses the positioning and ambulating of adult patients.","topics":["Positioning and Ambulating the Adult Patient - Learning Outcomes","Positioning the Adult Patient","Common Positions used when Ambulating a Patient","Techniques and Actions when Ambulating an Adult Patient","Positioning and Ambulating the Adult Patient - Lesson Summary"]},{"name":"Module","details":"Active and Passive Ranges of Motion in Exercise","description":"This module lays out the active and passive ranges of motion in exercise.","topics":["Active and Passive Ranges of Motion in Exercise - Learning Outcomes","The Effects of Immobility","Exercise for the Immobile Patient","Active and Passive Ranges of Motion in Exercise - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 4: Nursing Studies - Health and Safety, Movement and Exercise Assessment"]}]}