{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1569","title":"Nursing Studies - Clinical Skills: The Digestive System","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to properly care for patients with gastrointestinal illnesses, with this free online nursing course.","description":"This free online Nursing Studies course teaches you about the digestive system. You will learn the skills needed to provide effective care to patients who are experiencing gastrointestinal difficulties, as well as about how the digestive system ingests, breaks up and carries food. The material covers the insertion of feeding tubes, physical examinations and common diseases such as diabetes, cirrhosis, gastroenteritis and peritonitis.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>There are six essential nutrients required to maintain life and health: carbohydrates, proteins, fats, minerals, vitamins and water. This course will first discuss these nutrients including the three major groups of carbohydrates. You will then study the function and division of the stomach and the time frame involved in the digestive process. You will also look into the physical examination of the abdomen involving visual inspection, auscultation (listening to the body’s internal sounds) and palpation.</p><p>A gastrostomy is a surgical opening into the stomach, made through an incision in the left upper abdomen. This course will discuss the 16 steps involved in administering a gastrostomy tube (G-tube) for feeding. You will learn that caring for patients with cirrhosis requires careful assessment and monitoring of their nutritional status. You will then study diabetes and learn the seven steps in administering insulin. This course will also discuss the symptoms of hyperglycemia and ketoacidosis.</p><p>By the end of this course you will have a much stronger understanding of the digestive system and highly important types of gastrointestinal disorders such as gastritis, gastroenteritis, peritonitis, ulcers, and intestinal obstructions. You will have also learned how to identify the symptoms for each disorder and treat them effectively. This is powerful knowledge that can really make a difference in your patients' lives. So, check out the course today and enhance your nursing or caregiving skills in just a few short hours.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}