{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5251","title":"Nursing Care for Patients With Learning Disabilities","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online medical course teaches you the foundational values, roles and models of learning disability nursing.","description":"Are you interested in developing the fundamental skills necessary to support the mental well-being of children, young people, and adults with learning disabilities as you work towards a fulfilling career as a learning disability nurse? By enrolling in this free course, you will become familiar with different nursing models and psychological methods to help care for people with various learning needs and look after their mental health.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course illustrates the different roles of learning disability nurses. It starts by defining learning disabilities and mental health as two distinct fields and then discusses the mental health needs of people with learning disabilities. Then, study learning disability nursing in general, including its history, development and social policy changes that have impacted the role of learning disability nursing. We also explain therapeutic nursing, and developing partnership, intimacy and reciprocity in the nurse-patient relationship.</p><p>The next section explains various psychosocial approaches that can help people with learning disabilities and mental illness. You will study the fundamentals and application of cognitive behavioural therapy (CBT), anger management, behaviour therapy, systematic desensitisation, relaxation training, modelling, social skills training and counselling. Following that, you look at the psychodynamic approaches that focus on psychoanalysis. Next, we highlight psychodynamic therapy, the therapist-client relationship and non-specific therapy factors. The knowledge and practical skills nurses need when working with people with learning disabilities across their lifespans is discussed.</p><p>You will also comprehend the role of learning disability nurses in helping people with learning disabilities plan for good health and well-being. In addition, you discover the pertinent issues associated with planning and delivering care for people with intellectual disabilities who have mental health problems. We will also explain different nursing models and behavioural interventions. The final section discusses the future of learning disability nursing within the ever-changing health and social care context. So, sign up for this free course to discover the nursing care process for dually diagnosed people. Optional certification available.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}