{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1359","title":"Nursing Studies - Patient Care and Hygiene","totalEnrolled":"73,865","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about important procedures and techniques used in patient care and modern nursing with this free online course.","description":"This free online Nursing Studies course from Alison covers patient care and hygiene. A nursing team is responsible for protecting the patient from any additional injury or illness. With this course, you will learn proper techniques for completing these duties. You will also study advanced patient hygiene procedures and environmental health and safety awareness, as well as how to ensure patient safety and comfort in the care setting.","courseOutcomes":["Discuss guidelines/methods of bed-ma...","Identify guidelines for terminally c...","Discuss the rules for the use of dis...","Determine the purposes for giving a ...","Discuss guidelines/methods of bed-making","Identify guidelines for terminally cleaning the patient care unit","Discuss the rules for the use of disposable and non-disposable items","Determine the purposes for giving a patient a bath","Identify conditions which encourage the breakdown of skin","Identify interventions which can prevent skin breakdown","Identify patient needs and observations which should be made during bathing procedures","Describe the guidelines for shaving a male patient, and performing perineal care","Cite the hospital fire and electrical safety measures","Discuss guidelines/methods of bed-ma...","Identify guidelines for terminally c...","Discuss the rules for the use of dis...","Determine the purposes for giving a ...","Discuss guidelines/methods of bed-making","Identify guidelines for terminally cleaning the patient care unit","Discuss the rules for the use of disposable and non-disposable items","Determine the purposes for giving a patient a bath","Identify conditions which encourage the breakdown of skin","Identify interventions which can prevent skin breakdown","Identify patient needs and observations which should be made during bathing procedures","Describe the guidelines for shaving a male patient, and performing perineal care","Cite the hospital fire and electrical safety measures"],"courseDescription":"<p>This free online nursing course will first discuss the categories of basic human needs including physiological needs, safety, love and belonging, esteem, and self-actualization. This knowledge will help you understand your patients better. You will then study the equipment used for patient care as well as learn the guidelines for bed-making. You will be taught how to perform terminal cleaning of the patient care unit as well as learn the rules for the use of disposable and non-disposable items.<br><br>Next, you will learn the advanced principles of patient personal hygiene, including mouth and skin care. You will study the purpose of giving the patient a bath, how to avoid the breakdown of skin and the observations which should be made during bathing procedures. You will also study the guidelines for shaving a male patient and performing perineal care, as well as learn the importance of a back massage. Finally, you will take a look at hospital fire and electrical safety measures.<br><br>Caring for the general well-being of patients is a delicate but rewarding job. If you are interested in a career in nursing, this patient hygiene and care studies will be very valuable. It will also be of great interest to all healthcare professionals who would like to learn more about advanced nursing practices and procedures in adult patient care. So, take the course today and learn how you can give adult patients the extra care that they need.</p><a href=\"https://alison.com/resume/courses/1359\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1359\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Adult Patient Care","description":"This module will walk you through the care of adult patients.","topics":["Adult Patient Care - Learning Outcomes","Categories of Basic Human Needs","Equipment for Patient Care and Guidelines for Bed-Making","Adult Patient Care - Lesson Summary","Terminal Cleaning of the Patient Care Unit"]},{"name":"Module","details":"Advanced Principles of Patient Hygiene","description":"This module will discuss the advanced principles of patient care.","topics":["Advanced Principles of Patient Hygiene - Learning Outcomes","The Purposes of Giving the Patient a Bath","Mouth Care","The Benefits of a Back Massage","Personal Care for the Adult Patient","Advanced Principles of Patient Hygiene - Lesson Summary"]},{"name":"Module","details":"Environmental Health and Practical Nursing","description":"This module looks at the relationship between nursing practices and environmental health.","topics":["Environmental Health and Practical Nursing - Learning Outcomes","Environmental Health and Its Impact on the Practice Nurse","Safety Measures in the Patient Care Environment","Environmental Health and Practical Nursing - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Module 4: Nursing Studies - Patient Care and Hygiene Assessment"]}]}