{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4559","title":"Nursing Fundamentals of the Cardiovascular System","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the basics of the human heart to nurse patients suffering from cardiac illnesses with this free online course.","description":"Cardiac development produces rapid clinical changes, creating a need for nurses and healthcare providers to be educated on the most recent treatment and care expertise. The course 'Nursing Fundamentals of the Cardiovascular System' explores all you need to know about risk factors and preventative measures. It delves into cardiac issues, including heart failure, inflammations and valve abnormalities, to enrich your cardiology nursing skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Community-based nurses and other health care professionals increase physician care and are well known for their effectiveness in supporting cardiovascular health. Cardiovascular nurses have played a significant role in promoting cardiovascular health ever since the institution of coronary care units in the 1960s. Since then, cardiology nursing has progressed tremendously in tandem with technological advancements and breakthroughs in the control and diagnosis of heart disease. Heart disease is the leading cause of mortality globally; the future role of nurses is exciting but it requires education and experience to research high-quality coronary heart disease nursing care. Cardiac nurses play a vital role in preventing, detecting and providing therapy for heart conditions. Cardiology nursing services are required not only to care for patients but also to encourage healthy lifestyle choices.&nbsp;</p><p>The nurse practitioner position in the care of cardiovascular diseases (CVDs) is well established in the modern world as they engage with patients with chronic conditions in direct and indirect (nurse-led clinics) roles. Nurses can play a vital part in treating the risks of coronary artery disease in a low-resource context. As a medical professional, you need a deep understanding of cardiac anatomy and physiology to recognise the appropriate care for individuals with cardiac diseases. Likewise, you should acknowledge the limitations of those who suffer from heart diseases and correctly administer recommended drugs and therapies to individuals with heart problems safely and knowledgeably. This course strives to deliver an introductory experience of cardiovascular disorders. We begin with the biological structure of the electrical mechanism of the heart. Subsequently, review a comprehensive presentation of the available detection systems for acute coronary syndrome. Finally, interpret cardiac chest pain signals as the consequences of myocardial infarction.</p><p>By the end of the course, you will be able to improve your ability in influencing the health-related lifestyles and self-care habits of your cardiology patients. Define the origin, pathophysiology and symptoms of common cardiac illnesses, including hypertension and atherosclerosis. Complete your training by discussing the effects and nursing implications of widely administered drugs for patients with heart problems. Rhonda Lawes is a Certified Nurse Educator (CNE) and an Assistant Professor at the University of Oklahoma College of Nursing. She will be your tutor, breaking lessons into straightforward, easy-to-understand topics. Encouraging cardiovascular health among all individuals and emphasising prevention substantially reduces barriers to multidisciplinary collaboration and broad community participation. Get started with the course 'Nursing Fundamentals of the Cardiovascular System' and play an essential role in preventing heart disorders.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}