{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1458","title":"Nursing Studies - Role of Nurse in Surgical Care","totalEnrolled":"24,476","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain a better understanding of a nurse's role in the surgical care of patients, with this free online nursing course.","description":"In this free online nursing studies course, you will learn about the vital roles performed by the nurse during surgical care. Nursing staff provide essential support during all phases of the surgical cycle, which encompasses the peri-operative, pre-operative, intra-operative, and recovery room phases. The course will also teach you about some of the most essential surgical interventions that nurses are regularly involved in","courseOutcomes":["Cite facts related to the surgical e...","Identify the nursing implications re...","Examine doctor's orders for implemen...","Cite the nursing implications relate...","Cite facts related to the surgical experience","Identify the nursing implications related to preparing a patient for surgery","Examine doctor's orders for implementation of pre-operative care","Cite the nursing implications related to preparing a patient for surgery","Identify from descriptive statements, the key members of the surgical team","Identify three major classifications of anesthetic agents","Define what complications should be prevented in the recovery room","Identify the nursing implications related to the prevention of respiratory distress","Cite facts related to the surgical e...","Identify the nursing implications re...","Examine doctor's orders for implemen...","Cite the nursing implications relate...","Cite facts related to the surgical experience","Identify the nursing implications related to preparing a patient for surgery","Examine doctor's orders for implementation of pre-operative care","Cite the nursing implications related to preparing a patient for surgery","Identify from descriptive statements, the key members of the surgical team","Identify three major classifications of anesthetic agents","Define what complications should be prevented in the recovery room","Identify the nursing implications related to the prevention of respiratory distress"],"courseDescription":"<p>This free nursing course will first introduce you to peri- and pre-operative patient care. You will learn the impact that surgical intervention can have on a patient and how this can require both physical and psychosocial adaptation for the patient and their family. You will study the reasons for surgical interventions as well as look into the classifications and descriptors accompanying them. The course will also discuss the factors that may cause patients psychological stress.<br><br>The course will then discuss the role of the nurse during the intraoperative and recovery room phase of surgery. You will learn about the descriptors used to classify surgical procedures which include ablative, diagnostic, constructive, reconstructive, palliative, and transplant. The course will then discuss the surgical team which includes the surgeon, the anesthesiologist, the scrub nurse, and the circulating nurse as well as look into their key roles in the surgical process.<br><br>Surgery is an invasive procedure which can be very difficult for any patient. Regardless of the need for the surgery or the size of the surgery, any surgery that imposes physical and psychological stress is rarely considered \"minor\" by the patient. As a nurse, the ability to provide the right care for patients in this position is a powerful one. By taking this course, you will learn what you need to know to help patients going through this difficult experience. That is a truly meaningful skill.</p><a href=\"https://alison.com/resume/courses/1458\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1458\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Peri and Pre-Operative Patient Care","description":"In this module, you will be introduced to peri and pre-operative patient care, what peri-operative and pre-operativea patient care is all about, the facts related to the surgical experience, the impact of surgical intervention on the patient, and the various types and classification of surgery.","topics":["Peri-Operative Patient Care And The Surgical Experience","Pre-Operative Patient Care"]},{"name":"Module","details":"The Intra-Operative Phase","description":"In this module, you will be introduced to the Intraoperative phase, what the Intraoperative phase is, the surgical team, the classification of surgical procedures, and the reasons for surgical intervention.","topics":["The Intra-Operative Phase And Surgical Team","Major Classifications Of Anesthetic Agents"]},{"name":"Module","details":"The Recovery Room Phase","description":"In this module, you will be introduced to the recovery room phase, what the recovery room is, the nursing care goals of the recovery room, nursing implications related to the general care of a patient in the recovery room, and the accommodation of patients who have undergone major or minor surgery.","topics":["The Recovery Room","Respiratory Distress","Post-operative Patient Care According To Body Systems","General  Post-operative Implications"]},{"name":"Module","details":"Course assessment","description":"","topics":["Role of Nurse in Surgical Care - Assessment"]}]}