{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5520","title":"Occupational Therapy - Fundamentals of Rehabilitation Sciences","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to identify and treat some of the common conditions that require occupational therapy in this free online course.","description":"This short course describes some conditions of the upper and lower limbs of the human body that may require the services of an occupational therapist to treat. We explain how to easily identify such conditions and their causes. We also explore the role of occupational therapy in depression management. Sign up to learn how occupational therapy can be used to treat maladies of the body and mind and help patients achieve health and wellbeing.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Occupational therapy is a crucial component of medical and rehabilitation sciences and is particularly important for people born with congenital conditions and those suffering workplace injuries. This course provides the basic knowledge required to quickly identify these conditions. Although this course has been developed under the supervision of medical professionals, it is not an alternative to a hands-on approach to occupational therapy and its management. The course is instead designed to serve as a helpful tool that can help you solidify your understanding of the role of such therapy and identify conditions that require it.</p><p>This course consists of a single module made up of four topics. The first topic introduces you to occupational therapy and some of the essential skills the profession requires. The second and third topics are dedicated to various upper and lower limb injuries respectively. We present pictures of common conditions that can arise after injury to nerves found in a particular part of the human body. These lessons can help you to accurately diagnose these conditions and understand their causes.</p><p>Our last topic focuses on the role of occupational therapy in depression management. We lay out some common symptoms of depression and trace variations according to gender and age groups. We then provide depression management techniques that can be employed to manage those symptoms and their underlying conditions. This course uses vivid illustrations to help make our text clear and you can also find questions at the end of each topic to help reinforce your newfound knowledge. Occupational therapy plays an important role in restoring patients to physical and mental health so sign up to learn how to identify conditions that require this widely employed treatment method.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}