{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4508","title":"Oil and Gas Management - Health and Safety","totalEnrolled":"8,069","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to manage an oil and gas project while following health and safety guidelines in this free online course.","description":"Have you ever wondered how oil and gas projects are planned, managed and safely executed? This course divides the oil and gas projects into three stages, explaining their financial and technical requirements to protect the health and safety of workers and the environment. Explore how to plan, control and manage projects in the oil and gas industry as well as how to lead teams effectively by setting shared organisational goals.","courseOutcomes":["Describe the business and economics ...","List various characteristics of the ...","Explain how pipeline integrity manag...","Identify potential hazards in oil an...","Describe the business and economics of the petroleum industry","List various characteristics of the oil and gas projects","Explain how pipeline integrity management programme can prevent risks and ensure the safety of workers and the environment","Identify potential hazards in oil and gas projects","Indicate the role of shareholders and investors in the oil and gas sector","Recognise the importance of communication management at the workplace","Solve common workplace issues through communication, cooperation and coordination","Evaluate risks in oil and gas projects to devise suitable risk management techniques","Describe the business and economics ...","List various characteristics of the ...","Explain how pipeline integrity manag...","Identify potential hazards in oil an...","Describe the business and economics of the petroleum industry","List various characteristics of the oil and gas projects","Explain how pipeline integrity management programme can prevent risks and ensure the safety of workers and the environment","Identify potential hazards in oil and gas projects","Indicate the role of shareholders and investors in the oil and gas sector","Recognise the importance of communication management at the workplace","Solve common workplace issues through communication, cooperation and coordination","Evaluate risks in oil and gas projects to devise suitable risk management techniques"],"courseDescription":"<p>The oil and gas industry is a major contributor to the energy sector and is divided into three main operational sectors offering career opportunities at every stage. This course covers all major segments of the petroleum industry, its management and the range of career choices the industry offers. We determine the profitability of petroleum products by the correlation between supply and demand and government regulations. We outline the economics of the petroleum industry and the impact of some of the most common economic factors on the feasibility of petroleum projects. We define a ‘project’ as a ‘temporary endeavour undertaken to create a unique product, service or result’. Explore the role of stakeholders in oil and gas projects, project management and the characteristics of oil and gas projects. The pipeline industry adopts a ‘pipeline integrity management’ programme to prevent potential risks affecting workers and the environment. Discover the roles and responsibilities of permit holders in completing pipeline integrity management programmes that include hazard identification and risk management.&nbsp;</p><p>The principal aim of banks in making loans is to earn profits for their shareholders. Gain insight into the lenders' project risk analysis, the lending guidelines to follow before investing in a particular oil and gas project and the strategies for managing the sponsor's financial risk exposure. ‘Communication management’ refers to the functional interface between individuals and groups within the project environment. A successful manager spends a substantial amount of time on communication activities. We demonstrate how to implement communication management with a step-by-step approach and explain how it is directly related to the success of a project. This course will also shed light on common barriers to project communication and examines methods of conflict resolution through communication, cooperation and coordination. Within the oil and gas industry, there are inherent risks of accidents and injuries occurring at any stage of the process. Explore the application of a risk assessment to identify potential hazards and take necessary steps and precautions for the safety of workers and the environment.</p><p>We have designed this course for those who want to enter the oil and gas field and have a sound knowledge base or those who studied it and want to refresh their expertise. We cover the basic mode of operation of petroleum projects, from pre-operation to completing the project, covering all the financial, management and safety issues. We outline both the technical and non-technical aspects of an oil and gas project, including the importance of interpersonal skills at the workplace. We break down complex procedures into small steps to help you quickly understand and follow more easily. The oil and gas sector plays a key role in the world energy sector and is pivotal to industrial production. The petroleum industry offers a wide range of high-paying job opportunities to professionals with the proper knowledge and expertise. Become part of the petroleum sector and register today!</p><a href=\"https://alison.com/resume/courses/4508\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4508\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Oil and Gas Management","description":"This module will introduce you to oil and gas project management and economics. Learners will acquire knowledge of the pipeline integrity management program and the common risks management techniques in oil and gas projects. You will be taught the importance of effective communication at the workplace and techniques for conflict resolution.","topics":["Oil and Gas Management - Learning Outcomes","Introduction to Oil and Gas Management","Managing Pipeline and Risk Analysis","Communication Management and Safety","Oil and Gas Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Oil and Gas Management - Health and Safety - Course assessment"]}]}