{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5169","title":"Operating as a Mental Health Support Worker","totalEnrolled":"4,724","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to work in a support capacity in the treatment of people with mental health issues in this free online course.","description":"Maintaining mental health is crucial to people’s wellbeing and affects their ability to function socially, emotionally and psychologically. Professionals trained to provide mental health assistance to patients are required to handle mental health difficulties. This psychology course provides the training required to provide day-to-day care to patients and examines various mental diseases, their symptoms and available treatment options.","courseOutcomes":["Recognise the duties and responsibil...","Describe how to spot some of the ear...","Outline the role of a mental health ...","List the four major mental disorders...","Recognise the duties and responsibilities of mental health support worker","Describe how to spot some of the early signs of mental health problems","Outline the role of a mental health first aider","List the four major mental disorders that affect children and adolescents","Identify the causes and symptoms of stress and anxiety disorders","Explain schizophrenia disorder and list its types","Recognise different kinds of personality disorders and describe their causes, symptoms and treatments","Explain the use of psychiatric medication in the treatment of mental illness","State the aims of the UK’s Mental Health Act","Outline the composition of Community Mental Health Teams (CMHTs)","List the benefits of service user involvement in the creation of mental health policy","Recognise the duties and responsibil...","Describe how to spot some of the ear...","Outline the role of a mental health ...","List the four major mental disorders...","Recognise the duties and responsibilities of mental health support worker","Describe how to spot some of the early signs of mental health problems","Outline the role of a mental health first aider","List the four major mental disorders that affect children and adolescents","Identify the causes and symptoms of stress and anxiety disorders","Explain schizophrenia disorder and list its types","Recognise different kinds of personality disorders and describe their causes, symptoms and treatments","Explain the use of psychiatric medication in the treatment of mental illness","State the aims of the UK’s Mental Health Act","Outline the composition of Community Mental Health Teams (CMHTs)","List the benefits of service user involvement in the creation of mental health policy"],"courseDescription":"<p>Mental health support workers play an important function in the treatment of those suffering from mental health problems. This course outlines the role of mental health support workers and identifies the characteristics, credentials and skills that they require to excel. We then look at the roles of mental health first aiders and the legalities surrounding their work.</p><p>This course examines numerous mental health problems, including schizophrenia, personality disorders, eating and sleeping issues, stress and anxiety disorders and psychiatric issues affecting children and adolescents. Any intellectual, emotional or behavioural impairment that is considered ‘clinically substantial’ is a marker of a mental illness. Such markers are frequently associated with distress or functional limitations in important areas, representing a wide range of distinct mental illnesses.</p><p>We then show you how to identify the many medications used to treat psychiatric problems. What law governs the rights of patients suffering from mental health issues? Become familiar with mental health legislation, community mental health teams (CMHTs) and methods for dealing with those who are experiencing a mental health crisis. This course explains how to assist those who are struggling with mental health issues to regain their mental wellbeing. This course is suitable for social workers and anyone who intends to assist in the day-to-day care of patients in mental care facilities. It also suits anyone who wants to learn more about common mental health disorders and the measures used to treat them.</p><a href=\"https://alison.com/resume/courses/5169\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5169\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Mental Health and Personality Disorders","description":"In this module, you will learn the overview of mental health support workers. The module will also teach you about schizophrenia, personality disorders, mood disorders, eating and sleeping disorders, stress and anxiety disorders, and mental health first aid. It will also cover pediatric and adolescent psychiatric illnesses.","topics":["Mental Health and Personality Disorders - Learning Outcomes","Introduction to Mental Health","Stress and Personality Disorders","Mood, Eating and Sleeping Disorders","Mental Health and Personality Disorders - Lesson Summary"]},{"name":"Module","details":"Mental Health Treatment, Therapy and Legislation","description":"The topics covered in this module include self-harm and suicide, medication and therapy in the treatment of mental illness, social attitudes toward mental illness, mental health legislation and services, community mental health teams, mental health in the workplace, the involvement of the service user and approach to people in mental health crises.","topics":["Mental Health Treatment, Therapy and Legislation - Learning Outcomes","Treatment of Mental Illness","Mental Health Legislation and Services","Approaches to People in Mental Health Crisis","Mental Health Treatment, Therapy and Legislation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Operating as a Mental Health Support Worker - Course Assessment"]}]}