{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5049","title":"Oral Infections and Oral Mucosal Lesions","totalEnrolled":"1,464","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the prevention and treatment measures for oral infections and mucosal lesions.","description":"According to recent research, oral disease is estimated to affect over 3.5 billion people worldwide, with the majority of infections treatable in their early stages. However, poor oral hygiene and heredity increase the risk of this disease. This course focuses on situations where oral diseases can become lethal by teaching students about their symptoms and effective treatments to improve disease detection, prevention and management.","courseOutcomes":["Explain the causes of most oral infe...","Identify the parts of the mouth that...","Discuss the functions of antibodies ...","Recall the methods of treating odont...","Explain the causes of most oral infections","Identify the parts of the mouth that provide a physical barrier against infections","Discuss the functions of antibodies in the human body","Recall the methods of treating odontogenic infections","Distinguish between fungal and viral infections","State the key factors in the development of necrotizing ulcerative periodontitis","Identify the risk factors for oral mucosal lesions","List and explain the types of oral mucosal lesions","Distinguish between oral surface lesions and soft tissue enlargement","Discuss the properties of reactive soft tissue enlargement","Summarize the treatment procedures for oral lesions caused by heredity","Recall the treatment procedures for the most common salivary gland tumor","Explain procedures for the evaluation of patients for oral mucosal lesions","Explain the causes of most oral infe...","Identify the parts of the mouth that...","Discuss the functions of antibodies ...","Recall the methods of treating odont...","Explain the causes of most oral infections","Identify the parts of the mouth that provide a physical barrier against infections","Discuss the functions of antibodies in the human body","Recall the methods of treating odontogenic infections","Distinguish between fungal and viral infections","State the key factors in the development of necrotizing ulcerative periodontitis","Identify the risk factors for oral mucosal lesions","List and explain the types of oral mucosal lesions","Distinguish between oral surface lesions and soft tissue enlargement","Discuss the properties of reactive soft tissue enlargement","Summarize the treatment procedures for oral lesions caused by heredity","Recall the treatment procedures for the most common salivary gland tumor","Explain procedures for the evaluation of patients for oral mucosal lesions"],"courseDescription":"<p>According to the recent ‘global burden of disease’ (GBD) research, oral disease is becoming more and more prevalent. This course will teach you about the body's defenses, the various microbial species that live in the oral cavity and how they can become pathogenic. This self-paced course begins with an overview of oral infections, followed by information on host defense mechanisms, innate immune defenses, adaptive immune defenses and some microbiologic considerations.</p><p>Periodontal diseases and tooth decay are the most common causes of oral infections, to name a few. Diabetes, a weakened immune system, poor oral hygiene and genetic predisposition raise a person's risk of periodontal disease. We will teach you how to treat viral and oral fungal infections and investigate different antibiotic treatments. Finally, we will research oral mucosal lesions, different types of soft tissue enlargements of the oral mucosa and the distinction between surface lesions and soft tissue enlargement. Learn how to evaluate patients and educate them on preventing and managing oral mucosal lesions.</p><p>This course focuses on situations where oral infections can become life-threatening by instructing you about these diseases, their symptoms and available treatments to help them detect them earlier. In addition, this course helps oral health care providers understand the various types of oral infections and lesions, as well as how to evaluate patients and educate them on prevention and early detection. Take this course right now to improve your knowledge of oral hygiene.</p><a href=\"https://alison.com/resume/courses/5049\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5049\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Oral Infections","description":"In this module, you will be introduced to oral infections and types, you will learn how antibodies are created and the benefits of immunoglobins, learn the causes of infections in immunocompromised patients, the types of oral and viral infections, and antibiotic treatments.","topics":["Oral Infections - Learning Outcomes","Introduction to Oral Infections","Types of Infections","Antibiotic Treatment","Oral and Viral Infections","Oral Infections - Lesson Summary"]},{"name":"Module","details":"Oral Mucosal Lesions","description":"In this module, you will learn the types and risk factors of oral lesions and types of soft tissue enlargement of the oral mucosa, learn how to evaluate patients, and also the prevention and management of oral mucosa lesions.","topics":["Oral Mucosal Lesions - Learning Outcomes","Introduction to Oral Lesions","Prevention of Oral Mucosal Lesions","Evaluation for Oral Mucosal Lesions","Oral Mucosal Lesions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Oral Infections and Oral Mucosal Lesions - Course assessment"]}]}