{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5280","title":"Oxygen First Aid Training","totalEnrolled":"922","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you when and how to use emergency oxygen in any first-aid situation.","description":"Many first aid situations require the administration of oxygen to critically injured or ill persons and the use of oxygen requires knowledge and training. In this course, we'll teach you everything from recognising situations where emergency oxygen will be beneficial, to providing oxygen to breathing and non-breathing patients. You'll learn about different oxygen delivery systems, hazards associated with oxygen use and safe handling techniques.","courseOutcomes":["Identify deregulated lung functions ...","Define first aid and the aider’s rol...","Discuss how CPR is performed on peop...","State the protocol and the devices u...","Identify deregulated lung functions and the necessity of oxygen administration","Define first aid and the aider’s role in a medical emergency","Discuss how CPR is performed on people of different ages","State the protocol and the devices used to deliver oxygen to Covid-19 patients","Recognise the benefits of using oxygen in treating an injured diver","Describe different equipment and their parts used to provide emergency oxygen","Summarise the risks associated with oxygen delivery","Explain the operation procedure of CPR face mask and Bag-valve mask for emergency oxygen delivery","List the precaution and safety guidelines for handling, carrying or travelling with oxygen","Identify deregulated lung functions ...","Define first aid and the aider’s rol...","Discuss how CPR is performed on peop...","State the protocol and the devices u...","Identify deregulated lung functions and the necessity of oxygen administration","Define first aid and the aider’s role in a medical emergency","Discuss how CPR is performed on people of different ages","State the protocol and the devices used to deliver oxygen to Covid-19 patients","Recognise the benefits of using oxygen in treating an injured diver","Describe different equipment and their parts used to provide emergency oxygen","Summarise the risks associated with oxygen delivery","Explain the operation procedure of CPR face mask and Bag-valve mask for emergency oxygen delivery","List the precaution and safety guidelines for handling, carrying or travelling with oxygen"],"courseDescription":"<p>The cells and tissues in the body need a constant supply of oxygen to work properly. When a person isn't getting enough oxygen, organs of the body, especially the brain, heart and kidneys fail to function. Oxygen is an integral part of emergency treatment given to ill or injured patients and is considered a life-saving therapeutic agent. However, extreme care should be taken when administering oxygen to both conscious breathing or unconscious non-breathing casualties. Guidelines for oxygen administration states that oxygen should only be administered by staff who are trained and competent as oxygen overdose or saturation can be fatal. In this course, we will show you the importance of oxygen administration for a casualty and teach you the responsibilities of a first aider at the incident scene. You'll learn how and when to administer supplemental oxygen and how to perform cardiopulmonary resuscitation (CPR) appropriately.</p><p>As a first aider, we will first teach you the importance of assessing any emergency situation as well as ensuring that there are no risks to yourself or the casualty. You'll learn how to recognise and respond to emergency situations that require the application of oxygen or oxygen resuscitation and perform CPR on an injured individual. We'll show you the different parts of oxygen-delivery equipment, how to assemble them and maintain the flow rate and pressure in casualties of different ages. You'll study the safe application of emergency oxygen to individuals having hypoxia, cardiac arrest or diving accidents like near-drowning or lung overexpansion injuries. Upon that, you'll explore the protocols to follow when dealing with COVID–19 patients. Oxygen is a life-saving drug and like all drugs, it too can cause harmful effects on the body if not used properly. You will learn to recognise the symptoms of oxygen poisoning, denitrogenation and hypoxic drive and ways to prevent it.</p><p>Next, we will introduce you to the different masks used for administering emergency oxygen to breathing and non-breathing individuals and show you how to use a CPR face mask and a Bag-valve mask (BVM) and their benefits. Upon that, you will discover how to use and store oxygen cylinders safely and securely and the precaution to take when travelling with oxygen. This course is suitable anyone and qualified first aiders, first responders, dental care professionals, nurses and healthcare professionals. Oxygen administration is considered a necessary training for security teams and special forces and for those involved with climbing, navigation and diving activities. Taking this course will help you gain a vital skill needed within emergency services and health care professions or supplement your existing first aid training. Anybody who wishes to specialize in first aid provision using specialised equipment can take this course. There are no formal entry requirements. So why wait? Enrol today.</p><a href=\"https://alison.com/resume/courses/5280\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5280\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Uses of Emergency Oxygen in First Aid","description":"In life-threatening situations where the body's oxygen supply is depleted, oxygen administration is required to save lives. In this module, you will learn how and when to administer oxygen as well as how to perform CPR on adults, children and infants. We'll teach you the safety concerns with carrying, storing and administering emergency oxygen.","topics":["Uses of Emergency Oxygen in First Aid - Learning Outcomes","Administering Supplementary Oxygen","Procedure of Oxygen Administration","Safety Protocol","Uses of Emergency Oxygen in First Aid - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Oxygen First Aid Training - Course Assessment"]}]}