{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4771","title":"Paediatric First Aid","totalEnrolled":"5,620","courseIncludes":["4-5 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn the fundamental skills of paediatric first aid for children and infants.","description":"Paediatric first aid is essential knowledge for any parent or adult who works with children. This course teaches all you need to know, from the role of first responders to some of the standard equipment and techniques you will need as a first responder. Study the procedure for CPR in children and infants, treatments required for common injuries and the effects of acute illness and psychological first aid treatment for children.","courseOutcomes":["Explain what paediatric first aid is...","Outline the process of initial asses...","Describe the cardiopulmonary resusci...","Explain various illnesses, their tri...","Explain what paediatric first aid is and the role of first responders","Outline the process of initial assessment and the importance of prioritising treatment for infants and children","Describe the cardiopulmonary resuscitation ( CPR) process, CPR transfer and the AED in children and infants","Explain various illnesses, their triggers and how to administer first aid in these situations","Explain the effects of acute medical conditions, ranging from minor injuries to life-threatening emergencies","Discuss the potential risks and hazards that exist in different environments.","Summarise the limitations of first aiders' medical skills and the need to engage emergency services","Outline how to recognise and treat conditions caused by heat or cold","Explain what paediatric first aid is...","Outline the process of initial asses...","Describe the cardiopulmonary resusci...","Explain various illnesses, their tri...","Explain what paediatric first aid is and the role of first responders","Outline the process of initial assessment and the importance of prioritising treatment for infants and children","Describe the cardiopulmonary resuscitation ( CPR) process, CPR transfer and the AED in children and infants","Explain various illnesses, their triggers and how to administer first aid in these situations","Explain the effects of acute medical conditions, ranging from minor injuries to life-threatening emergencies","Discuss the potential risks and hazards that exist in different environments.","Summarise the limitations of first aiders' medical skills and the need to engage emergency services","Outline how to recognise and treat conditions caused by heat or cold"],"courseDescription":"<p>This course delves into the importance of paediatric first aid, what it is and the role of first aiders. It is essential to have a basic knowledge of paediatric first aid as a parent or child carer. Discover how to assess the casualty's condition before offering your services. Are you wondering how to make an initial assessment and have an overview of the situation as a first aider? This course explains all these details and discusses some of the crucial equipment and techniques you might need as a first aider.</p><p>Next, you will become familiar with the contents of a first aid kit and examine how to use the equipment properly. We will also go over the principles of bandaging and rolling bandages. Do you wonder how to perform cardiopulmonary resuscitation (CPR) on children and infants? This course will explain CPR and how to use an automated external defibrillator (AED) in detail. We will also discuss how to treat the most common injuries. Most first aiders are faced with the aftermath of accidents or collisions and we will examine how to handle these types of situations. Then we will discuss various illnesses, their triggers and how you can provide first aid in these situations. Explore the effects of acute conditions, ranging from minor injuries to life-threatening emergencies.&nbsp;</p><p>Children can easily be affected by the environment during moments when they are resting or exploring. This course explains how to handle these situations if an event occurs. We will also explain what ‘psychological first aid is’ and how to recognise the psychological issues a young person may face, including appropriate treatment procedures. We will then discuss the myths cited by some as treatment options for specific injuries and illnesses. Next, we will discuss the limitations of first aiders' medical skills and the need to use emergency medical services. This course is ideal for anyone with basic first aid who wants to improve further. So why wait? Start your learning journey today.</p><a href=\"https://alison.com/resume/courses/4771\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4771\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Paediatric First Aid","description":"This module covers the fundamentals of paediatric first aid and the role of the first aiders. Next, we learn how to assess the casualty's condition before administering first aid including some of the common equipment and techniques required by first aiders. We will also learn the procedure for CPR in children & infants, as well as the treatments.","topics":["Learning Outcomes - Fundamentals of Paediatric First Aid","Introduction to Paediatric First Aid","Assessment and Assistance","Equipment and Techniques","Loss of Responsiveness and CPR","Paediatric First Aid for Common Illnesses","Paediatric First Aid for Common Injuries and Incidents","Lesson Summary - Fundamentals of Paediatric First Aid"]},{"name":"Module","details":"First Aid for Injuries and Medical Conditions","description":"This module will explain the effects of acute medical conditions ranging from minor injuries to life-threatening emergencies. We will learn how to recognize and treat heat or cold-related illnesses. Then we will discuss what psychological first aid is and what myths are cited by some as treatment options.","topics":["Learning Outcomes - First Aid for Injuries and Medical Conditions","First Aid for Acute Medical Conditions","Environmental Injuries","Caring for Children","Psychological First Aid for Children","Things to Keep in Mind","Call for an Emergency","Lesson Summary - First Aid for Injuries and Medical Conditions"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}