{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/2970","title":"Pediatric Advanced Life Support (PALS)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Successfully complete this free online course on PALS and apply for certificate to become globally accredited.","description":"This free online pediatric advanced life support (PALS) course is of great help to anyone dealing with children and infants. This course gives you life-saving procedures and skills to employ when faced by emergency situations and trains you to identify respiratory distress symptoms in infants and administer intervention measures. Complete this course now and certify your knowledge to gain free international accreditation today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will begin by defining pediatric (or paediatric) advanced life support (PALS). You will learn about the series of protocols to guide responses to life-threatening clinical events. You will also learn about how to quickly and efficiently organize a resuscitation team to effectively participate in PALS. Learn about PALS basic life support (BLS) method used when there is limited access to advanced interventions such as medications and monitoring devices. Because respiratory distress in children and infants can occur unexpectedly, the knowledge of the steps and algorithms for BLS may mean the difference between life and death.</p><p>The course then explains more about resuscitation tools that are available as an essential component of PALS. You will learn about the two adjuncts broken down into two subcategories: medical devices and pharmacological tools. You will also learn about the symptoms to look for when checking for respiratory disorder and how to respond to them. Study the various types of shock, and how to recognise and respond to each. You will master post-resuscitation care and its role in optimizing ventilation and circulation, preserving organ and tissue function, and maintaining recommended blood glucose levels.</p><p>Finally, you will go through a series of demonstration videos, viewing a demonstration, and learning airway management and how to access an infant’s airway. You will also gain the skills to perform a one-person BLS and a two-person BLS. Studying the importance of airway management is a major component of pediatric advanced life support. Complete this course and purchase a certificate to gain access to free international accreditation. If you are a parent, carer, childminder, nursery teacher or an au pair, these skills will be invaluable to your peace of mind.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}