{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4422","title":"Pedicure Treatment and Nail Polish Application","totalEnrolled":"4,976","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master these highly sought-after pedicure and nail-polish treatment skills in this free online cosmetology course.","description":"Explore the ‘European pedicure’ methods and the means and skills required to provide high-quality professional services to your clients. This cosmetology course will introduce you to the tools of the trade and discuss important industry requirements for beauticians. Learn how to perform a proper pedicure treatment and expertly apply traditional and permanent nail polish, a high-demand skill in the beauty and makeup industry.","courseOutcomes":["State the function of each tool requ...","Recall the industry standards and re...","List the steps required to carry out...","Differentiate between traditional na...","State the function of each tool required for a complete pedicure treatment","Recall the industry standards and requirements for hygiene and health safety","List the steps required to carry out a full pedicure treatment","Differentiate between traditional nail polish and a gel nail polish","Describe the process for applying traditional nail polish","Discuss how to apply the gel nail polish","Explain the process of safely removing permanent nail polish","State the function of each tool requ...","Recall the industry standards and re...","List the steps required to carry out...","Differentiate between traditional na...","State the function of each tool required for a complete pedicure treatment","Recall the industry standards and requirements for hygiene and health safety","List the steps required to carry out a full pedicure treatment","Differentiate between traditional nail polish and a gel nail polish","Describe the process for applying traditional nail polish","Discuss how to apply the gel nail polish","Explain the process of safely removing permanent nail polish"],"courseDescription":"<p>Due to our daily activities, we often enclose our feet in tight shoes and cause damage, which we further compound by walking, which adds to the pressure. Pedicure treatments provide exceptional care to the feet and toenails by removing hardened dead skin and nail cuticles, trimming and giving form to the nails. Hydrating the skin and leaving the client relaxed, beautified and feeling special is key to their wellness. This course will teach you how to provide professional pedicure treatments to your clients.</p><p>We will explain all the tools you need to provide a good pedicure treatment. We discuss specific terms and definitions you should know as a beautician and outline industry-specific requirements for providing personal care, hygiene and health safety. It is advised, for example, that the beautician should wear protective disposable gloves while working on a client, disinfect or sterilize the tools appropriately before using them on each client and maintain a clean environment at all times. We demonstrate the detailed steps for performing the pedicure treatment, which begins with disinfecting the client's feet, removing dirt and calluses, performing a foot scrub and then massaging the feet for the client’s relaxation.</p><p>Further on, you will learn the application of traditional nail polish, which requires three types of nail polish applied in sequence: the base coat, the colour (to be applied twice) and the finishing coat. Finally, the course will introduce the 'permanent' or gel polish application. The gel polish is different from the traditional nail polish as it stays on the nails without cracking until it is time to remove it. It is a suitable choice for natural nails that tend to break easily. This nail polish looks natural, doesn't create the thick ‘fake nail’ effect and is simple to use. If you want to enter the beauty industry or are interested in improving and expanding your cosmetic skillset, this short course will get you started. Enrol today!</p><a href=\"https://alison.com/resume/courses/4422\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4422\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Pedicure Treatment Workshop","description":"This module includes topics that introduce the tools and techniques for providing pedicure treatments. It will discuss important hygiene and health safety protocols that should be followed when serving clients. You will learn the European pedicure methods, and how to expertly apply and remove nail polish.","topics":["Learning Outcomes - Pedicure Treatment Workshop","Pedicure Treatment","Nail Polish Aplication","Lesson Summary - Pedicure Treatment Workshop"]},{"name":"Module","details":"Course assessment","description":"","topics":["Pedicure Treatment and Nail Polish Application - Course Assessment"]}]}