{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3436","title":"Pharmacy Assistant","totalEnrolled":"28,472","courseIncludes":["5-6 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the strategies to give skilled and efficient pharmaceutical care with this free online pharmacy assistant course.","description":"Pharmacy assistants play a vital role in patients’ lives. No matter how efficient a doctor’s recommended treatment may be, it will not be useful if the medications are not given in the correct dosages with clear instructions and advice. In this course, you will learn the various benefits and responsibilities of this rewarding career choice. You will also discover how pharmacy initiatives continually help to improve communities around the world.","courseOutcomes":["List the roles and responsibilities ...","Explain the seven vital principles o...","Recognize the necessary skills neede...","Explain how to overcome communicatio...","List the roles and responsibilities of a pharmacist assistant","Explain the seven vital principles of the Code of Ethics","Recognize the necessary skills needed to be a pharmacy assistant","Explain how to overcome communication barriers","Outline the importance of developing self-awareness","Recall various dispensing methods","Indicate how to dispose of expired and outdated drugs","Solve and minimize dispensing errors","List the roles and responsibilities ...","Explain the seven vital principles o...","Recognize the necessary skills neede...","Explain how to overcome communicatio...","List the roles and responsibilities of a pharmacist assistant","Explain the seven vital principles of the Code of Ethics","Recognize the necessary skills needed to be a pharmacy assistant","Explain how to overcome communication barriers","Outline the importance of developing self-awareness","Recall various dispensing methods","Indicate how to dispose of expired and outdated drugs","Solve and minimize dispensing errors"],"courseDescription":"<p>During the day at work, you start to feel that something isn’t quite right. You feel a slight headache coming on as well as a somewhat sore throat. Before you go home, you decide to stop by your doctor’s office to get checked out and then on to your pharmacy to buy the prescribed medicine. This scenario is a common fixture of our busy lives. However, a key point to remember is that a treatment recommended by a doctor will not be effective if the medications are not given to the patient correctly, along with clear instructions and useful advice from the pharmacist. Pharmacy assistants (or pharmacy technicians) play an active role in the dispensing of drugs. In this course, you will learn how pharmacy initiatives contribute to improving healthcare in communities, and you will understand how to use pharmaceutical resources efficiently.</p><p>Working in the pharmacy field can be a challenging profession but it can also be a very rewarding career choice. Did you know that the roots of pharmacy or the treatment of disease can be traced back nearly 4 000 years? In this course, you begin by studying the brief history and importance of pharmacy throughout history, as well as its current impact today. Pharmaceutical care involves exercising extreme vigilance while dispensing any type of medication. This makes it vital for each team member to be well aware of specific medications, dosages, and allergies a patient might require or have. You will take a closer look at the different responsibilities these workers have that usually depend on their work area. This course will also teach you sets of rules, regulations and principles of code that must be followed as a pharmacy worker, which have been designed to help you to make the right decisions.</p><p>Perhaps the next most critical and important skill set required for a successful career in the pharmacy sector is communication. It is very important to develop valued and mutually respectful relations between a pharmacy assistant and a patient. You will take a deep dive into analysing positive and negative examples of typical conversations at the counter. Then you will consider desirable communication traits and a guide on how to give effective patient counselling. Finally, you will study a list of standard prescription abbreviations and proper dispensation practices. Understanding these details is fundamental to a patient’s health and failure to convey the correct instructions or dosage can result in severe negative results. Anyone with an interest in learning about becoming a pharmacy assistant will gain a lot from this course. Enrolling will help first-time assistants, pharmacy students and anyone thinking about entering the pharmaceutical field. It provides techniques and strategies behind developing effective communication skills, practising good dispensing practices and giving efficient patient counselling.</p><a href=\"https://alison.com/resume/courses/3436\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3436\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Pharmacy Assistant","description":"In this module, you are introduced to the role of a pharmacy assistant. We will begin by studying the responsibilities this crucial role has in the public health sector. Then we will look at some of the vital skills you need to learn to help you guide patients and clients on self-medication.","topics":["Introduction to Pharmacy Assistant - Learning Outcomes","Introduction to the Pharmacy Sector","Pharmacy Team and Practices Part One","Pharmacy Teams and Practices Part Two","Introduction to Pharmacy Assistant - Lesson Summary"]},{"name":"Module","details":"Communication Skills and Responsibilities","description":"This module will teach you essential skills to conduct excellent communication with health professionals and patients. In addition, you will learn how to overcome barriers when communicating with patients. We will also view other roles and responsibilities as a pharmacist assistant.","topics":["Communication Skills and Responsibilities - Learning Outcomes","Communication Skills","Overcoming Communication Challenges","Responsibilities and Patient Record Maintenance","Communication Skills and Responsibilities - Lesson Summary"]},{"name":"Module","details":"Essential Methods and Techniques","description":"In this module, you will learn the many common names of medications. This will minimise errors when handling drugs. Analyse how to efficiently order inventory within the shelves which provides a clean and efficient workplace. We will also study health and safety standards that are crucial for everyday practice.","topics":["Essential Methods and Techniques  - Learning Outcomes","Fundamentals of Prescription and Drug Dispensation","Dispensing Methods and Electronic Service","Stock Management in Pharmacies","Health and Safety Risks Assessment","Essential Methods and Techniques  - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment"]}]}