{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4735","title":"Pharmacy Assistant and Technician","totalEnrolled":"9,019","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you the fundamentals of becoming a pharmacy assistant or technician.","description":"This course will provide you with the necessary knowledge and training to work as a pharmacy assistant or technician. We'll teach you about the responsibilities of a pharmacy assistant, such as handling prescriptions, stock and inventory management and other pharmacy technician duties such as operating safe medications optimisation systems. Learn about pharmacy standard operating procedures and risk assessment methods.","courseOutcomes":["Discuss the roles of pharmacies in t...","State the duties and responsibilitie...","Explain the working principles of th...","Indicate the principles of the code ...","Discuss the roles of pharmacies in the health industry","State the duties and responsibilities of a pharmacy","Explain the working principles of the Accuracy-Checking Pharmacy Technician programme (ACPT)","Indicate the principles of the code of ethics","Identify various prescription abbreviations used in pharmacies","Distinguish between stock management and inventory management","Recognise the terminologies used in pharmacies","Outline the difference between stock management and inventory management","List the functions of an invoice","Discuss the roles of pharmacies in t...","State the duties and responsibilitie...","Explain the working principles of th...","Indicate the principles of the code ...","Discuss the roles of pharmacies in the health industry","State the duties and responsibilities of a pharmacy","Explain the working principles of the Accuracy-Checking Pharmacy Technician programme (ACPT)","Indicate the principles of the code of ethics","Identify various prescription abbreviations used in pharmacies","Distinguish between stock management and inventory management","Recognise the terminologies used in pharmacies","Outline the difference between stock management and inventory management","List the functions of an invoice"],"courseDescription":"<p>Pharmacy assistants are essential in aiding patients in getting the medicines they need while providing exceptional customer service to make the experience as pleasant as possible. Are you interested in working as a pharmacy assistant or technician? Look no further! This course will provide you with the required capacity and training to operate as a pharmacy technician or assistant. We begin with an overview of an assistant's duties before delving into a pharmacy technician's responsibilities, including using safe medicines optimisation processes to ensure the safe and logical administration of pharmaceuticals for therapy.</p><p>Learn important medical terms that help you identify symptoms and diagnose and treat patients. Next, you will learn how to improve pharmacy communications, self-care and self-medication. To promote patient welfare, we research prescription and dispensing ethics. Next, you will learn about stock management, which involves managing stock procurement to meet requirements and inventory management. Finally, you'll discover standard operating procedures that enable audits and aid in staff training and growth.</p><p>From prescribing and dispensing pharmaceuticals to maintaining stockpiles and identifying risks, pharmacy assistants and technicians are indispensable in the healthcare industry. We've included compelling pharmacological information to assist you in identifying pharmaceuticals that can be taken with other medication in the event of adverse effects or altered potency and doing effective health, safety and risk evaluation. Don't delay! Get started with this course right away!</p><a href=\"https://alison.com/resume/courses/4735\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4735\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Roles of Pharmacy Assistants and Technicians","description":"This module depicts the job roles of pharmacy assistant and technician. You will learn how to prescribe and minimise dispensing errors in pharmacies and the process of managing stock and inventory management. Also, get acquainted with the standard operating procedures (SOPs) and risk assessment methods.","topics":["Roles of Pharmacy Assistants and Technicians - Learning Outcomes","Introduction to Pharmacy Assistant","Prescription and Dispensing Methods","Standard Operating Procedures","Roles of Pharmacy Assistants and Technicians - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Pharmacy Assistant and Technician - Course assessment"]}]}