{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3295","title":"Phlebotomist Training Course","totalEnrolled":"57,901","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the procedures and skills required to specialize in phlebotomy with this free online diploma course.","description":"Phlebotomy is the surgical involvement of a needle taking or introducing fluid to a body be that blood or medicine. With this course, you will learn the responsibilities involved in being involved in such an important task. Equipment, safety measures and procedures are vital to know as well as what blood is made up of. Complications can arise in any role so we will prepare you with techniques to overcome these difficulties.","courseOutcomes":["Summarize the knowledge, skills and ...","Identify the primary job responsibil...","Recall medical terminology that invo...","Discuss infection control and the sa...","Summarize the knowledge, skills and guidelines needed to work as a healthcare technician specializing in phlebotomy","Identify the primary job responsibilities for a certified phlebotomist and gain a firm understanding of venipuncture techniques","Recall medical terminology that involves drawing blood and preparing it for lab testing","Discuss infection control and the safety standards of working as a phlebotomist and how to prevent hematomas and nerve damage","Recognize modern diagnostic methods and the latest lab technology","Describe precautions to take for patients with special needs and appropriate ways to communicate with patients","Summarize the knowledge, skills and ...","Identify the primary job responsibil...","Recall medical terminology that invo...","Discuss infection control and the sa...","Summarize the knowledge, skills and guidelines needed to work as a healthcare technician specializing in phlebotomy","Identify the primary job responsibilities for a certified phlebotomist and gain a firm understanding of venipuncture techniques","Recall medical terminology that involves drawing blood and preparing it for lab testing","Discuss infection control and the safety standards of working as a phlebotomist and how to prevent hematomas and nerve damage","Recognize modern diagnostic methods and the latest lab technology","Describe precautions to take for patients with special needs and appropriate ways to communicate with patients"],"courseDescription":"<p>This training course introduces you to the world of phlebotomy. A blood test can be one of the most useful tools for a doctor trying to pinpoint an illness and a phlebotomist is a doctor’s best friend in this way. You will familiarize yourself with the role of a phlebotomist, as well as the professional and personal traits a phlebotomist should hold. You will learn about maintaining high standards of practice by examining traditional duties you could find yourself taking on. The course discusses exactly what blood is and how it works. Do you know the components that make up the circulatory system? This course will teach you this and more including the main types of blood vessels, the main veins that are used to draw blood and the different blood types. Discover the different kinds of phlebotomy equipment and their different uses. You will also explore the variety of needles available to phlebotomists and how to select the correct needle for a patient.</p><p>Become proficient in the process of routine venipuncture, which includes each step of the process from applying a tourniquet to bandaging a patient's arm after completion. You will also learn about the potential complications that you may come across during venipuncture and pre-examination variables. Here you will study everything from patient complications and equipment assembly to how to examine venipuncture equipment. The needle will be focused on here, from the proper technique of inserting the needle to disposing of the needle safely. The main thing a phlebotomist should be aware of is how to draw blood correctly. This vital piece of information is covered within the course. The causes of contamination during collection and how to avoid them is also covered. You will be introduced to the procedure of dermal punctures and the many dermal puncture devices made for specific scenarios you may face.</p><p>The course also covers the fundamentals of what makes up a quality blood assessment and how to correctly document these assessments as a phlebotomist. You will also gain an understanding of the variables that are present before, during and after examination and about the quality management systems in place. The course will discuss newborn screening, blood cultures, glucose tolerance testing and bleeding time tests. You will also be introduced to phenylketonuria and the consequences of leaving this disorder untreated. You will end this course with a look at the importance of infection control, risk management and preparing patients for procedures.</p><a href=\"https://alison.com/resume/courses/3295\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3295\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Phlebotomist Training","description":"In this module, you will be introduced to phlebotomy. This includes the anatomy and physiology of the veins and the techniques required for safe and effective venipuncture for the process of blood sampling. You will develop all the necessary skills to perform venipuncture safely while minimising the risk of pre-analytical errors. You will also be introduced to the equipment used in venipuncture procedures, documentation that should be completed and special blood tests that you may encounter.","topics":["Phlebotomist Training - Learning Outcomes","Introduction to Phlebotomy","Venipuncture and Dermal Puncture","Special Blood and Infection Control","Phlebotomist Training Course - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}