{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5583","title":"Pilates Principles - The Fundamentals for Ultimate Full-Body Workout","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to do Pilates in this free online fitness course that provides the training required for a full-body workout.","description":"This Pilates class lays out the fundamentals of Pilates and covers various exercises, including push-ups, lower limb stretches, spinal twists, the ‘Jack Knife’, sidekicks and inner thigh lifts. We also explain how to use the correct breathing techniques while doing these exercises. This course suits anyone who wants to get into shape and improve their health. It also benefits those who intend to work as Pilates instructors or personal trainers.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Pilates was introduced by Joseph Pilates after World War One and remains one of the most famous and popular forms of exercise across the world. Its inventor considered exercises to be an integral part of one's health and fitness routines. After establishing his first studio, his ideas caught on as more people came to recognise the benefits of this revolutionary approach to exercise.</p><p>This Pilates class is offered by Element Recipe and explains how an effective exercise regimen can leave you looking and feeling great. We begin with muscle stretches for lower limbs and&nbsp; exercises designed to tone your core body muscles. We then explain how to do push-ups correctly before moving on to ‘Jack Knife’ exercises and spine twists. This Pilates training course also describes common mistakes you must avoid while performing these exercises.</p><p>We lay out the six Pilates principles that summarise this form of exercise, along with breathing techniques that complement Pilates. We show you how to use these concepts and techniques to improve your workout routine. This course suits anyone who wants to improve their health and fitness. It also helps you to establish yourself as a certified Pilates instructor or personal trainer who can help others exercise professionally. Sign up for this Pilates class to learn how this popular form of exercise can strengthen your core, reduce stress and leave you looking and feeling your best.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}