{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3445","title":"Pivot & Thrive: How to get Through the Rest of the Covid-19 Pandemic","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to cope and prosper with the coronavirus pandemic at home and in the workplace in this free online course.","description":"The Covid-19 pandemic seriously disrupts our lives at home or in the workplace and this free online course provides tools to help you manage and overcome the crisis. We offer a new perspective on how to manage your professional and personal life during these difficult times. While much of the world stands still, life goes on and this course can help you find your feet and face tomorrow with more confidence.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The worldwide Covid-19 pandemic has affected every person on the planet and this course raises many questions regarding how we look at the pandemic and its impact. Can another pandemic like this happen again? How does it affect major life decisions that I need to take? What is ‘pivoting’ and how can it help me to navigate the current global crisis? This course lets you interrogate your own ways of thinking and invites you to consider different perspectives. Major life decisions must still be made and we need to anticipate our own needs and those of the people around us as we decide whom to include in the decision-making process. By assessing our professional and personal lives, we can determine whether we need to conduct a ‘pivot’ and choose what type we should employ.</p><p>This course offers a fresh perspective on the Covid-19 pandemic and provides the tools to perform your own personal and business ‘pivot path assessment’ exercise. The aim of this exercise is to make clear previously murky areas of your professional life as it examines your work offering, cost structure, delivery method and customers to help you to figure out your sustainable competitive advantage and consider new cost and delivery methods. The assessment exercise may ultimately lead you to make changes and this course can help you and your business to thrive during and after the coronavirus pandemic.</p><p>The course also helps prepare for future challenges. We examine technologies and approaches being used today to combat the negative effects of the pandemic and consider how to adapt them to future upheavals. Are you ready to thrive before the Covid-19 pandemic ends? Let’s reassess what you do and adapt it to the unique challenges posed by the coronavirus pandemic. Sign up for this free online course to gain valuable new skills and fresh perspectives that can help you navigate the greatest crisis of the new century.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}