{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5435","title":"Pregnancy Care: From Conception to Delivery","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you about pregnancy care from conception to delivery, including postpartum care.","description":"Are you expecting a baby or planning to start a family? In this course, you will learn about the different stages of pregnancy, as well as the physical impact of pregnancy on women. You'll study the process of childbirth and the medical care required by the mother and child before and after delivery. We'll discuss the importance of breastfeeding newborns, mothers' emotional well-being, and common pregnancy complications.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>During pregnancy, a woman's body undergoes many changes to support the growth and development of the foetus. To ensure the health and well-being of both mother and baby, the mother must receive proper care and follow all necessary guidelines throughout the pregnancy. In this course, you will learn about the anatomy of the female reproductive system, the common physical changes during pregnancy, foetal development, and ways to check foetal well-being. Nutrition during pregnancy is crucial as it plays a vital role in the growth and development of the foetus and the mother's health. We'll show you the importance of nutrition during pregnancy and the factors that affect the nutritional intake of expectant mothers. Explore the factors that risk pregnant women's health, such as work, substance abuse, and social environments.</p><p>Regular, rhythmic, and powerful uterine contractions that begin gradually and you cannot stop are considered 'true' labour. You'll study different stages of labour and the necessities and procedures of childbirth. We'll teach you how to provide postnatal care, care to a woman and her baby after birth, to the mother and how to recognise and address any warning signs such as infections and bleeding. You'll study the nutritional properties of human milk, the proper way to breastfeed and common breastfeeding difficulties. Mental health issues during and after pregnancy can include depression, anxiety, and post-traumatic stress disorder (PTSD). You'll explore the changing feelings and emotions during pregnancy and ways to improve the psychological health of a mother. In addition, we'll examine various complications that can occur during pregnancy and how to recognise and manage them.</p><p>We designed this course for women who need to care for themselves during pregnancy or those who plan to have a baby. It is also helpful for midwives and other healthcare professionals specialising in caring for mothers and babies during pregnancy. Gain valuable knowledge and insights into this complicated topic of pregnancy and childbirth. While pregnancy care is primarily the responsibility of healthcare professionals, all individuals need a basic understanding, as it affects individuals and families personally. The course content is written in plain and straightforward language, making it uncomplicated for anyone to understand and apply the information provided. Join now to learn more about pregnancy care!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}