{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5405","title":"Principles of Healthcare Delivery","totalEnrolled":"404","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to respect the dignity and legal rights of patients to provide optimal healthcare in this free online course.","description":"Healthcare professionals must abide by certain legal principles governing patient care and their relationships with the public. Doctors require more than a firm grasp on medicine and this course discusses concepts like equality, diversity and inclusion (DEI). We examine the UK legislation designed to protect the rights and wellbeing of patients. We also go through the Caldicott principles governing privacy and risk management in care facilities.","courseOutcomes":["Define the terms ‘equality’, ‘divers...","Differentiate between prejudice and ...","State the four ethical principles th...","List the nine ‘Protected Characteris...","Define the terms ‘equality’, ‘diversity’ and ‘discrimination’","Differentiate between prejudice and stereotyping","State the four ethical principles that ensure anti-discriminatory practices","List the nine ‘Protected Characteristics’ applied in the UK's Equality acts","Outline the Caldicott principles that protect patients' privacy","Explain the person-centred approach to planning user care services","Describe the activities that demonstrate support for service users' wellbeing and individuality","Explain how to carry out a risk assessment in a care facility","Define the terms ‘equality’, ‘divers...","Differentiate between prejudice and ...","State the four ethical principles th...","List the nine ‘Protected Characteris...","Define the terms ‘equality’, ‘diversity’ and ‘discrimination’","Differentiate between prejudice and stereotyping","State the four ethical principles that ensure anti-discriminatory practices","List the nine ‘Protected Characteristics’ applied in the UK's Equality acts","Outline the Caldicott principles that protect patients' privacy","Explain the person-centred approach to planning user care services","Describe the activities that demonstrate support for service users' wellbeing and individuality","Explain how to carry out a risk assessment in a care facility"],"courseDescription":"<p>Providing excellent healthcare requires medical skills that include a proper understanding of equality, diversity and inclusion. This course is designed by Alpha Academy to help medical personnel and caregivers of any skill level. All care workers must be able to identify incidents involving discrimination and promote the principles of equality and diversity as they perform their roles. We will examine the UK’s legislation and policies established to support these principles and ensure the dignity of those in your care.</p><p>The course then explores the person-centred approach applied to planning for individual and social care settings. It is typically an effective way to place the service user at the centre of care planning stages and empower them to significantly influence the care and support they receive. We explain how to support the lifestyle of care receivers and review the different activities that promote their wellbeing.</p><p>We then show you how to preserve the mental health and self-esteem of clients, which is an essential element of a caregiver’s role. Finally, our last lesson explains how to deal with complex and sensitive situations and manage risk. This social work and healthcare course helps you to develop empathy, sensitivity and a good sense of fairness in your dealings with clients and patients. Sign up to learn how to respect DEI values and protect the dignity and wellbeing of those in your care.</p><a href=\"https://alison.com/resume/courses/5405\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5405\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Healthcare Delivery","description":"This module will explore the concepts of equality, diversity, and anti-discriminatory practices. You will learn about legislation and policies instituted to prevent the unfair treatment of service users as well as to ensure carers provide full support for their well-being and individualism. We will then discuss risk management in care facilities.","topics":["Learning Outcomes - Healthcare Delivery","Healthcare Legislation","Person-Centered Healthcare","Healthcare Risk Assessment","Lesson Summary - Healthcare Delivery"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment - Principles of Healthcare Delivery"]}]}