{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5453","title":"Workplace Health and Risk Assessment","totalEnrolled":"1,507","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Preserve health and safety in the workplace with this free online course that explains how to conduct a risk assessment.","description":"This occupational health and safety course explains how to reduce danger in the workplace. We establish the importance of workplace health and safety measures and describe the legal responsibilities of employers and employees. We then explain how to set up a risk assessment team to identify and prevent hazards. We also explore the UK laws regulating first aid and PPE at work and examine some control measures used to improve infection control.","courseOutcomes":["Explain the importance of workplace ...","Identify the legal responsibilities ...","Evaluate the risks and role of hazar...","Discuss common diseases of the respi...","Explain the importance of workplace health and safety for moral, legal and financial reasons","Identify the legal responsibilities of employers in maintaining health and safety at work","Evaluate the risks and role of hazard controls at work","Discuss common diseases of the respiratory system","List the various UK laws and regulations regarding health and safety rules for employees","Recall the control measures used to control infection in the workplace","Explain the importance of workplace ...","Identify the legal responsibilities ...","Evaluate the risks and role of hazar...","Discuss common diseases of the respi...","Explain the importance of workplace health and safety for moral, legal and financial reasons","Identify the legal responsibilities of employers in maintaining health and safety at work","Evaluate the risks and role of hazard controls at work","Discuss common diseases of the respiratory system","List the various UK laws and regulations regarding health and safety rules for employees","Recall the control measures used to control infection in the workplace"],"courseDescription":"<p>Workers' safety and welfare are a top priority for any thriving company. Preventing stress and injuries by keeping the workplace safe is essential to keeping employees healthy, happy and productive. This Alpha Academy's health and risk assessment course provides you with the knowledge and skills required to reduce medical risks for everyone with whom you work.&nbsp;</p><p>The course begins by establishing the importance of workplace health and safety for moral, legal and financial reasons. We lay out the yearly percentages of work-related cases of ill-health reported in the UK. We then explore the legal responsibilities of employers, employees and self-employed people in maintaining health and safety at work. The course also identifies the objectives of risk assessment, engineering and administrative controls.</p><p>We lay out the categories and consequences of work-related accidents and illness. The course then explains the UK's laws pertaining to first aid and focuses on the principles and regulations of the Personal Protective Equipment at Work Regulation 1992 (amended 2002 and 2013). We cover other legislation and regulations regarding employee health and safety rules. This course suits anyone who is interested in the health and safety of their colleagues and employees and adds a valuable element to your CV. Sign up to learn how to conduct risk assessments and maintain health and safety in the workplace while meeting your legal responsibilities.</p><a href=\"https://alison.com/resume/courses/5453\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5453\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Health and Risk Assessment","description":"In this module, you will learn about the importance of workplace health and safety. You will also study the legal responsibilities of employers, employees and the self-employed in the UK. Then, we will examine the compositions of a risks assessment team, work-related accidents, ill health and some control measures for minimizing infections.","topics":["Health and Risk Assessment - Learning Outcomes","Risk Assessment and Responsibilities","Work-Related Accidents and Prevention","Health and Safety Information and Measures","Healthcare and Risk Assessment - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Workplace Health and Risk Assessment - Course Assessment"]}]}