{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5065","title":"Procedures for Cerebrospinal Fluid (CSF)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores all aspects of cerebrospinal fluid and its collection, storage and testing techniques.","description":"Cerebrospinal fluid (CSF) is an incredible substance that plays an extraordinary role in the protection and functioning of the brain. Its analysis helps us to diagnose diseases and conditions that affect the brain and spinal cord. This free online course guides laboratory technicians, health professionals and paramedics in CSF’s proper collection, handling and testing procedures. Enroll now and gain insight into the chemistry and function of CSF.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Cerebrospinal fluid (CSF) is a colorless fluid that surrounds our brain and the spinal cord. It has three primary functions in the body: supplying nutrients to the brain, acting as a cushion to protect the brain from shocks or injury and removing metabolic waste. Examination of the CSF reveals many diseases and is a regular part of medical diagnosis and examinations. The correct procedures to collect, store and test cerebrospinal fluid are thus central to a precise diagnosis and require an expert hand in any paramedic, nurse or laboratory professional. This course fills that gap and exposes the best practices used to perform CSF procedures to raise your skills and equip you with the knowledge required.</p><p>This course is designed with very well-organized topics that take you through all the medical procedures and scientific approaches to collecting, storing and testing cerebrospinal fluid in an informative manner. Step by step, from history to composition and importance, we introduce all aspects of this miracle fluid in the human body. We follow each topic with an assessment that tests your learning and takes the guesswork out of the study.</p><p>This introductory course primarily suits the needs of medical and supporting medical workers like lab technicians, certified nurses, medical technicians, therapists and other support staff working in the medical diagnosis and treatment fields. Those typically interested in the medical field will also find it fascinating. It is informative and raises your skill level. Enroll today and learn some valuable health skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}