{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4243","title":"Professional Anxiety Coach","totalEnrolled":"5,971","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become a professional anxiety coach by learning how to treat signs of mental distress with this free online course.","description":"Many individuals experience fear, worry and anxiety in some form, often ruining their daily lives. Anxiety is a natural and human response to danger that can keep us safe, but sometimes people require professional help to manage their overwhelming distress. This free online course provides guidelines and toolkits for dealing with uncontrollable emotions, which establishes a good foundation for a career in professional anxiety counselling.","courseOutcomes":["Describe anxiety signs and symptoms ...","Classify types of anxiety and their ...","Outline a variety of self-directed t...","Explain how to overcome resistance t...","Describe anxiety signs and symptoms from a mental standpoint","Classify types of anxiety and their effect on daily life","Outline a variety of self-directed treatments for anxiety disorders","Explain how to overcome resistance to change by resetting your mindset","Describe the methods to work against self-imposed barriers that cause anxiety","Recognise the anti-anxiety formulas for a happy life","Outline the strategies for stress management through activity management","Recognise the importance of quality sleep and how to make lifestyle changes to achieve it","Explain how to use mindfulness and breathing techniques to deal with stress","Discuss triggers, vulnerability and natural ways to cope with panic attacks","Describe the coaching strategies and steps to assist people with anxiety","Outline how to get started in the coaching business","Describe anxiety signs and symptoms ...","Classify types of anxiety and their ...","Outline a variety of self-directed t...","Explain how to overcome resistance t...","Describe anxiety signs and symptoms from a mental standpoint","Classify types of anxiety and their effect on daily life","Outline a variety of self-directed treatments for anxiety disorders","Explain how to overcome resistance to change by resetting your mindset","Describe the methods to work against self-imposed barriers that cause anxiety","Recognise the anti-anxiety formulas for a happy life","Outline the strategies for stress management through activity management","Recognise the importance of quality sleep and how to make lifestyle changes to achieve it","Explain how to use mindfulness and breathing techniques to deal with stress","Discuss triggers, vulnerability and natural ways to cope with panic attacks","Describe the coaching strategies and steps to assist people with anxiety","Outline how to get started in the coaching business"],"courseDescription":"<p>The natural way the human body reacts to stressful situations or threats is known as ‘anxiety’, a feeling of fear or apprehension characterized by physical symptoms. For example, people might experience distress before a job interview, while giving a speech or even on the first day of school or a new job. When this becomes a mental illness, anxiety can create problems in many areas of social and public life as stress and tension emerge from many places. If the psychological condition is not handled either by self-tools or a therapist, it can develop into a more complex mental disease that features panic attacks. In severe cases, anxiety can mature into uncontrolled fears like phobias. Unfortunately, the source of fear is not always as easy to overcome as many people may think and some people need professional guidance and support to manage their distress.</p><p>Stress can affect people’s lives, causing short-term physical effects like breathing difficulties, dizziness, trembling and exhaustion. Other mental complications include depression, insomnia and social isolation that can progress to social anxiety. Anxiety can thus develop into an endless struggle against fear that can create self-imposed obstacles that stop you from living a healthy life. If you often feel anxious and worried about the tiniest details, it might be time to understand what is going on before it spirals out of control. You might know someone who is going through a difficult period and would like to have the information required to assist them. The course guides you through an analysis of anxiety in four different modules and helps you understand anxiety from a psychological standpoint. We discuss panic attacks, phobias and various anxiety disorders, including obsessive-compulsive disorder, post-traumatic stress, separation anxiety and social anxiety. We examine the psychological bases of various types and sources of anxiety before showing you how to make self-assessments to identify and classify forms of distress while developing strategic plans to overcome them. We break down the best ways to conquer your sticking points to help you battle your inner self to overcome your own resistance to change. We supply various exercises that can help you locate and confront the sources of your anxiety with the tools you need to transform your lifestyle and enjoy a panic-free life.</p><p>This free online course lays out new methodologies and psychological techniques to keep anxiety under control by practising mindfulness and employing breathing tactics. We explain how to control your reaction and behaviour in stressful circumstances. If you are looking forward to helping others as a professional coach, we offer a large-scale set of options, exercises and worksheets for you to use to encourage your clients through self-care. Coaches strive to develop a deeper personal relationship with their clients to assist them in working through their current challenges. Such a setting allows them to collaborate with their clients as a team rather than as part of a ‘doctor-patient’ relationship. This course enriches your professional knowledge about managing panic attacks and dealing with social anxiety to make you helpful to others in critical situations. We also explain how to support those who suffer from pandemic isolation and trauma borne of wars, toxic relationships, youthful maltreatment, sexual abuse or any other situation that may cause them to lose control of their life. This course covers the psychological fundamentals that enable you to combat anxiety by providing theory, examples, methodologies, exercises and professional suggestions to make you a successful and compassionate coach.</p><a href=\"https://alison.com/resume/courses/4243\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4243\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction and Signs of Anxiety","description":"This module acquaints the foundations of anxiety from a psychological standpoint, defining anxiety disorder, panic attack, and phobias. You will know about their relationship and the emotional repercussions involved. Furthermore, you will gain practical tips on crisis management to help you cope with your anxiety problems.","topics":["Introduction and Signs of Anxiety - Learning Outcomes","Introduction","What is Anxiety?","Types of Anxiety","Treatment of Anxiety Disorders","10 Telltale Signs of Anxiety","Introduction and Signs of Anxiety - Lesson Summary"]},{"name":"Module","details":"Cognitive and Emotional Anxiety Control","description":"This module will provide you with the knowledge to determine your anxiety type. You will learn prioritization methods and insights to harvest the power of your mind by identifying the triggers. In addition, you will study the process of determining the obstacles to confront resistance to change through the path of acceptance.","topics":["Cognitive and Emotional Anxiety Control - Learning Outcomes","Understanding Anxiety and your Type of Anxiety","How to Stop Struggling and Start Living","Believe You Can Overcome Your Anxiety","Overcome Your Stuck Points and Face Your Inner Demons","Overcome Resistance to Change and Arrive at Acceptance","How to Act on Your Fears and Navigate Self-Imposed Obstacles","Overcome Anxiety and Live Panic-free Life","Cognitive and Emotional Anxiety Control - Lesson Summary"]},{"name":"Module","details":"Behavioral Management of Anxiety","description":"This module outlines several strategic approaches to overcome stressful circumstances. Alternatively, you will learn about the benefits of quality sleeping to improve your behaviour by regaining control. You will study mindfulness meditation methodologies and breathing techniques to help you handle anxiety.","topics":["Behavioural Management of Anxiety  - Learning Outcomes","Learn New Ways and Manage your Activities to Control Anxiety","The Importance of Sleep and Lifestyle Changes","Practice Mindfulness and Breathing Techniques","Behavioral Management of Anxiety  - Lesson Summary"]},{"name":"Module","details":"Coaching Tips for Anxiety Conditions","description":"This module explains the psychological foundations to identify the best approach for handling yourself through a mental illness such as a panic attack or social anxiety disorder. Also, you will gain protocols to help you plan a session for a client with anxiety difficulties. Furthermore, you will acquire suggestions to initiate a coaching business.","topics":["Coaching Tips for Anxiety Conditions - Learning Outcomes","Managing Anxiety/Panic Attacks","Dealing with Social Anxiety","1 Session with Anxiety Client: What Anxiety is Doing to You","Special Chapter: Start a Coaching Business","Coaching Tips for Anxiety Conditions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Professional Anxiety Coach - Course Assessment"]}]}