{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1371","title":"Psychology - Biology and Behaviour","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the relationship between stress and diseases with this free course on biology and human behavior psychology.","description":"This free online course in psychology will introduce you to the biology and behaviour aspects of the basic principles of psychology. You will first learn about famous psychologists such as Ivan Pavlov and B. F. Skinner, and their theories on classical conditioning psychology and operant conditioning psychology. In a simple manner, the course will then guide you through the importance these theories have for a psychologist's career.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This psychology course being by covering the classical conditioning theory, also known as the respondent or Pavlovian conditioning theory. You will learn about the ethical issues in conditioning human behaviour, along with the key terms and the main elements in this principle. The course will then cover the operant conditioning theory, which overviews the practice of learning and punishment. Through these lessons, you will become familiar with the essential topics of learning theory, learning by insight, and learning set.<br><br>Next, you will study topics related to the states of consciousness. These will include waking consciousness and its characteristics, controlled and automatic processes, and the patterns of the four stages of sleep including their characteristics, dream types, and the effects of sleep deprivation. You will also learn about daydreaming, pain, and the purpose of sleep. Bringing this all together, you will then learn about the biological basis for behaviour, stress, and the relationship between stress and diseases.<br><br>This free online psychology course is designed to make it much easier for you to grasp the fundamentals of psychology. The lessons in this course will be an excellent complement to face-to-face classes, and will help you to discuss the biological basis of behaviour, the most important types of stress, and the relationship between stress and diseases with your peers. So, check out the course and start bringing your psychology knowledge to the next level.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}