{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1370","title":"Psychology - Memory and Cognition","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn more about the key concepts of memory and cognition with this free online psychology course from Alison.","description":"This free online Psychology course focuses on memory and cognition. It concentrates on the visual side of psychology which is the scientific study of the human mind and its functions. You will learn about the characteristics of the visual sensory system. You will also examine the Gestalt principles of figure-ground, closure, similarity, and proximity, factors which influence depth perception, and the conditions which may affect sight in old age.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The Psychology - Memory and Cognition course begins by reviewing the processes of visual perception which involve the selection, organisation and interpretation of information. You will then learn about reception, which is the essential process of receiving electromagnetic energy from the environment at the site of the visual receptor cells called rods and cones. You will also study the Gestalt psychology and principles, binocular cues including convergence, and examples of illusions including the Muller-Lyer illusion, Ames-room, Ponzo illusion, and the Moon illusion.<br><br>Next, you will learn about memory and memory strategies such as a mnemonic device, narrative chaining, acrostics, and acronyms. You will learn that long-term memory is organised into declarative, procedural, semantic, and episodic as well as learn how information goes through encoding, storage, and retrieval stages. You will study the different types of memory loss such as organic amnesia, anterograde amnesia, retrograde amnesia, and Alzheimer's disease (which is the most common cause of dementia).<br><br>This online psychology course will be of great interest to learners who are interested in a career in psychology and would like to learn more about the psychological aspects of memory and cognition. It will also be valuable to teachers, tutors, and school counselors who want to help their students perform better in class. How the brain makes a memory is an amazing process so check out the course and learn more about memory and cognition now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}