{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3898","title":"PTSD: Dealing with Shock and Trauma","totalEnrolled":"6,911","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn practical exercises for overcoming trauma and shock using the TAT Pose in this free online course.","description":"This short course is practical for anyone who has suffered trauma or shock or offers support and counsel on people's journey to healing. We will start by defining what healing is and setting the goal of attaining inner peace. You will learn the exercises that are used for specifically 'cleaning and clearing' shock and trauma. If you are interested in dealing with trauma, then this free course is for you. Enrol today!","courseOutcomes":["Define healing as it pertains to som...","Differentiate between shock and trau...","Explain the difference between survi...","Outline the steps necessary to prepa...","Define healing as it pertains to someone suffering from trauma or shock","Differentiate between shock and trauma","Explain the difference between surviving and thriving","Outline the steps necessary to prepare for 'clearing and cleaning' exercises","Define 'Template Memories'","List the steps in the inner child and adult self-reclamation exercise","State the importance of choosing a good attitude for attaining and maintaining healing","Define healing as it pertains to som...","Differentiate between shock and trau...","Explain the difference between survi...","Outline the steps necessary to prepa...","Define healing as it pertains to someone suffering from trauma or shock","Differentiate between shock and trauma","Explain the difference between surviving and thriving","Outline the steps necessary to prepare for 'clearing and cleaning' exercises","Define 'Template Memories'","List the steps in the inner child and adult self-reclamation exercise","State the importance of choosing a good attitude for attaining and maintaining healing"],"courseDescription":"<p>The world we live in today has become increasingly violent and has created many sufferers of trauma and shock. Technology such as television and the internet also increased the number of people indirectly witnessing traumatic events, so they too may be affected to some degree. Childhood abuse, tragic loss, and a host of other human issues contribute to Post Traumatic Stress Disorder (PTSD). This term describes the condition victims of trauma or shock are in before any form of treatment. This course will take you through the practical steps of dealing with PTSD through 'cleaning and clearing energy packets' in the system.</p><p>We will start by defining and describing healing and inner peace as what sufferers seek to attain. We will then explain how the impact of an event or series of events causes dysfunction in the body through frozen images known as Template Memories. Dispelling these images is the goal of the exercises proposed in the course - specifically, the TAT Pose and Three-Spot Tapping Points. Before the exercises, you will learn how water impacts one's physiology and the importance of hydration in the treatment. You will also learn about Neurological Disorganization and its correction. Carrying out inner dialogue to affirm and provide some grounding before 'treatment' is a pertinent prerequisite that we will also focus on.</p><p>Finally, you will learn the importance of choosing a positive attitude. When you are equipped with an awareness of your attitude, it can lead to success in 'overcoming' trauma and shock. It should be encouraging to anyone interested to know that the exercises introduced in this course have proven effective and provided lasting healing to those who have tried them. Professionals working with sufferers of PTSD, victims, their friends and family, or anyone interested will find the tools provided in this course valuable and practical. Sign up today!</p><a href=\"https://alison.com/resume/courses/3898\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3898\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Cleaning and Clearing Shock and Trauma","description":"This module will demonstrate action steps for ‘healing’ trauma and shock. You will learn the importance of hydration and inner dialogue as preparatory steps required for the TAT pose and Three-Spot Tapping Points. You will also learn how trauma or shock creates ‘Energy Packets’ and therefore the need for ‘cleaning and clearing.’","topics":["Cleaning and Clearing Shock and Trauma - Learning Outcomes","Introduction and Safety","The Cost of Surviving Versus Thriving","Preparing for the Process of Change","The Action Steps","Cleaning and Clearing Shock and Trauma - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["PTSD: Dealing with Shock and Trauma - Course assessment"]}]}