{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5042","title":"PUWER and RIDDOR Training","totalEnrolled":"393","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an understanding of the laws relevant to workplace health and safety with this free online course on Alison.com.","description":"Are you trying to understand workplace regulations that deal with injuries? Or are you an employer and want to ensure workplace safety for your employees? Then we have the perfect course for you if you have answered ‘yes’ to these questions. This course on PUWER and RIDDOR training will provide you with accurate knowledge that can help you, both as an employer and as an employee, to know your jurisdictions. So do not waste time and enrol now!","courseOutcomes":["Define the term ‘PUWER’ along with a...","Identify the key regulations that fo...","Examine the process and legal requir...","Outline the guidelines that are requ...","Define the term ‘PUWER’ along with a history of its evolution up until its current state","Identify the key regulations that form a part of the PUWER legal framework and to whom they apply","Examine the process and legal requirements necessary to ensure that various types of work equipment remain safe","Outline the guidelines that are required to provide the functional safety of work equipment while operating","Explain the process of identifying and mitigating risk under the PUWER framework","Define the term ‘RIDDOR’ and other various terms that fall under the regulations","Identify the person responsible for reporting any workplace injury or incident under RIDDOR","Examine the costs and benefits of providing a good health and safety environment at the workplace","Explain the laws and legislations that can be applied to workplace safety requirements","Identify the core elements that are part of health and safety management","Describe the steps that are part of the risk assessment process at the workplace and who should carry out those steps","Define the term ‘PUWER’ along with a...","Identify the key regulations that fo...","Examine the process and legal requir...","Outline the guidelines that are requ...","Define the term ‘PUWER’ along with a history of its evolution up until its current state","Identify the key regulations that form a part of the PUWER legal framework and to whom they apply","Examine the process and legal requirements necessary to ensure that various types of work equipment remain safe","Outline the guidelines that are required to provide the functional safety of work equipment while operating","Explain the process of identifying and mitigating risk under the PUWER framework","Define the term ‘RIDDOR’ and other various terms that fall under the regulations","Identify the person responsible for reporting any workplace injury or incident under RIDDOR","Examine the costs and benefits of providing a good health and safety environment at the workplace","Explain the laws and legislations that can be applied to workplace safety requirements","Identify the core elements that are part of health and safety management","Describe the steps that are part of the risk assessment process at the workplace and who should carry out those steps"],"courseDescription":"<p>Do you want to understand employer responsibilities while purchasing new workplace equipment? This course will guide you on the United Kingdom’s ‘Provision and Use of Work Equipment’ (PUWER) and ‘Reporting of Injuries, Diseases and Dangerous Occurrences Regulations’ (RIDDOR ) legislation as an employer and employee in dealing with workplace equipment and injuries. With the possibility of criminal and civil liabilities in the court of law, understanding these laws is better for workplace culture and avoiding serious consequences of hazards and injuries. The course begins with a discussion of PUWER and the various regulations it encapsulates. Then we will examine the selection of equipment and risk assessment procedures.</p><p>Want to understand the maintenance requirements under PUWER? Maintaining workplace equipment and safety records is essential under the legislation provided by PUWER. We will also examine critical regulations and accountability requirements under PUWER. Workplace injuries and hazards are prevalent. The course's RIDDOR portion will define key terms and provide crucial information on liabilities and responsibilities at the workplace.</p><p>Are you wondering how to carry out a risk assessment exercise to mitigate the chance of workplace injury? The course will follow a step-by-step process on performing a risk assessment exercise and the necessary measures to ensure that employees work in a suitable environment. Workplace safety and the use of proper equipment are vital when it comes to workplace culture. Not only does it improve relationships between employers and employees, but it can also significantly reduce litigation costs down the road. So enrol in this course on PUWER and RIDDOR today to take your personal or professional journey further.</p><a href=\"https://alison.com/resume/courses/5042\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5042\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Provision and Use of Work Equipment Regulations","description":"This module will be dissecting the regulations that were created in order to deal with the risks associated with the use of the equipment in the workplace. Key legal requirements and risk assessments before buying equipment shall be discussed. Inspection and maintenance requirements will also be examined in order to ensure workplace safety.","topics":["PUWER - Learning Outcomes","PUWER and It's Importance","Selection and Conformity of Work Equipment","Safe Functionality of Work Equipment","Inspection and Risk Assessment","Maintenance and Training of Work Equipment","PUWER - Lesson Summary"]},{"name":"Module","details":"Reporting of Injuries, Diseases and Dangerous Occurrences Regulations","description":"This module will be dissecting the reporting of injuries, diseases, and dangerous occurrences regulations. A cost/benefit analysis of good health and safety practices shall be carried out. The key principles of assessing the risks and managing health and safety in the workplace shall be discussed with the learner.","topics":["RIDDOR Training - Learning Outcomes","RIDDOR Regulations","Health and Safety at Work and the Laws","Managing for Health and Safety","Risk Assessment and Common Risks","Reporting of Injuries, Diseases and Dangerous Occurrences Regulations"]},{"name":"Module","details":"Course assessment","description":"","topics":["PUWER and RIDDOR Training - Course assessment"]}]}