{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3441","title":"Reiki: Third Degree","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the energy-healing abilities of Reiki using the third degree with this free online course.","description":"In this interesting course, you will learn about the techniques and methods used to help yourself and others in the third degree of Reiki. Study traditional and non-traditional master symbols and the various methods of attunement using techniques from all three degrees of Reiki. Other healing disciplines and how to combine them with Reiki will also be covered.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Your journey with Reiki will have begun with the first and second degrees. Welcome to the third degree and the advanced opportunities this course will offer you using this ancient form of holistic healing. You will be introduced to advanced Reiki techniques that can be used in a variety of different ceremonies. As you progress, you will familiarize yourself with the third degree of Usui Reiki, including identifying the three groups of symbolism. What are the prerequisites to becoming a teacher of Reiki? Throughout your learning, you will understand how to become a Reiki master and what characteristics you should possess. This course will also teach you about the most powerful master symbol in all of Reiki, as well as other non-traditional master symbols that you can use. You will learn the meaning behind these and how to draw each one.</p><p>As you progress through the third degree, you will be introduced to the Reiki attunement ceremony. This begins with the hui yin and violet breath before discussing the steps involved in preparing yourself and your student for the ceremonies. Throughout the material, you will learn about ceremonies based on techniques from all three degrees individually, as well as a ceremony based on a combination of the degrees. This includes visuals of the teacher and student for every position (including where to stand and in what position your hands should be placed), detailed descriptions of what should be said, and the symbols that should be intoned as the ceremony progresses. You will also learn about alternative methods for each degree and the combination ceremony. Once again, detailed instructions for these methods, such as the surrogate method and distant attunement, will be covered.</p><p>The course finishes with more advanced Reiki techniques. You will see how to heal using psychic surgery, as the course walks you through the steps involved. You will then be introduced to reiju self-empowerment and giving reiju to others. Through step-by-step instructions, you will understand what should be done to each chakra in order to give reiju. Wrapping up, you will be introduced to distant reiju. Throughout this introduction to the third degree of Reiki, you will form a solid understanding of master Reiki techniques, specifically the attunement ceremony and how to properly conduct one, from the symbols involved to the alternative methods that could be used. Enrol in this course to continue your healing journey with Reiki by learning how to stimulate your natural healing abilities.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}