{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4770","title":"Risk Assessment & Control - Health & Safety","totalEnrolled":"4,847","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to conduct a risk assessment and hazard identification for your organization in this free online course.","description":"This short course is designed to teach its enrollees the importance of conducting a risk assessment as part of organizational health and safety management. It discusses various aspects of risk assessment, such as its essential steps, the reasons for conducting a risk assessment and the goals. The course also contains sufficient learning material on hazard identification and the method of ranking these risks.","courseOutcomes":["Define ‘risk assessment’...","Explain the reasons for performing a...","Outline the steps of performing a ri...","Recognize the three most important p...","Define ‘risk assessment’","Explain the reasons for performing a risk assessment","Outline the steps of performing a risk assessment","Recognize the three most important processes of performing risk assessment","Evaluate the five essential terms related to risk assessment","Discuss the important measures for performing hazard identification","Paraphrase the risk ranking process","Define ‘risk assessment’...","Explain the reasons for performing a...","Outline the steps of performing a ri...","Recognize the three most important p...","Define ‘risk assessment’","Explain the reasons for performing a risk assessment","Outline the steps of performing a risk assessment","Recognize the three most important processes of performing risk assessment","Evaluate the five essential terms related to risk assessment","Discuss the important measures for performing hazard identification","Paraphrase the risk ranking process"],"courseDescription":"<p>The practices involving organizational health and safety have evolved in recent years. Both employees and their employers are now taking greater measures to ensure the safety of their workplace. However, considerable training and evaluation still need to be undertaken. This comprehensive course has been developed by Exoexcellence Consultants to cover one of the most critical aspects of organisational health and safety: risk assessment.</p><p>The course comprises a single module made up of three base topics. The first will introduce you to the process of risk assessment and the reason why organizations should conduct it. You will also encounter the five essential steps of this process, which we will discuss in depth. The second topic provides a more detailed insight into the risk assessment process. It mentions the important terms related to the process, its goals and the purpose of conducting the risk assessment.</p><p>In the last topic, you will study how you can identify the hazards in the workplace and their severity. You will also learn to rank the risks and the factors on which risk assessment documentation depends. The last topic also contains a risk assessment template that you can use to conduct a risk assessment for your organization. This course also includes a summary at the end so that you can reinforce all the critical knowledge gained throughout. Lastly, on the successful completion of an assessment, you will be able to acquire an Alison certificate.</p><a href=\"https://alison.com/resume/courses/4770\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4770\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Organizational Risk Assessment & Control","description":"This module presents discussions on important aspects of organizational risk assessment and control in the workplace. Through this module, you will be able to define risk assessment and its importance. Moreover, you will also learn about the reasons for conducting this assessment along with its goals. Lastly, hazard identification is also given.","topics":["Organizational Risk Assessment & Control - Learning Outcomes","Introduction to Risk Assessment","The Three Processes of Risk Assessment","Identifying the Organizational Hazards","Organizational Risk Assessment and Control - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Risk Assessment & Control - Health & Safety - Course assessment"]}]}