{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4357","title":"RSBA1 - Food Safety and Hygiene","totalEnrolled":"17,413","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn food safety and hygiene practices that will improve your food handling knowledge with this free online course.","description":"This course covers the importance of food safety practices, including food hygiene, handling and temperature control. You'll learn how to identify critical control points and implement them into your daily activities from home to the working environment. In addition, this course will cover cross-contamination, waste bin management, pest prevention and personal hygiene. Help to do your part in the community and register today.","courseOutcomes":["Discuss the importance of food safet...","Distinguish between bacterial and ch...","Describe the role of HACCP in the pr...","Recognise how to observe hygiene in ...","Discuss the importance of food safety and hygiene","Distinguish between bacterial and chemical cross-contamination","Describe the role of HACCP in the prevention of food contamination","Recognise how to observe hygiene in the food preparation environment","Recall how to preserve food by controlling its temperature","Identify how to avoid food cross-contamination","Summarise the importance of pest control","Discuss the importance of food safet...","Distinguish between bacterial and ch...","Describe the role of HACCP in the pr...","Recognise how to observe hygiene in ...","Discuss the importance of food safety and hygiene","Distinguish between bacterial and chemical cross-contamination","Describe the role of HACCP in the prevention of food contamination","Recognise how to observe hygiene in the food preparation environment","Recall how to preserve food by controlling its temperature","Identify how to avoid food cross-contamination","Summarise the importance of pest control"],"courseDescription":"<p>Food safety and hygiene are the fundamental foundations for proper food handling. It is a good practice involving preparing, handling and storing foodstuffs so that they are free from contamination, protect consumers' health and ensure that the food we eat is satisfactory. This course covers the importance of food safety practices, including food hygiene, handling and temperature control. You will learn about the 'use by' and 'best by' labels that appear on food items, indicating when you should consume that food item. We explore personal hygiene, safety practices and hygiene in a food preparation environment. Understand the various temperature ranges in which bacteria can thrive in food and how to prevent the spread of bacteria by preserving and storing food in the best conditions.</p><p>We live in a time when personal hygiene and understanding the consequences of transferring and cross-contaminating are more vital than ever. This course provides a detailed breakdown and usage of sanitisers, disinfectants and detergents. A person will benefit by extending this knowledge to family, friends and the broader community. Taking the necessary precautions will mean prevention. Isn't it good to know that learning an everyday life skill can impact many other people along the way? From ensuring hair is kept away from the face to being aware of any jewellery or accessories that could potentially obstruct food handling. How about making sure you wear appropriate footwear? Did you know that slips, trips and falls are caused by unsuitable footwear, wet surfaces, worn carpets or loose cables and wires? As you can see, this course goes beyond the standards of food safety and hygiene, giving you a variety of precautions to consider.&nbsp;</p><p>We will delve deeper into good food safety practices and examine the importance of Hazard Analysis Critical Control Points (HACCP). Learning the importance of identifying any HACCP will help you develop a food safety management system that contains all policies and procedures for maintaining food safety. The golden rule is simple: keep out of danger by keeping food hot or cold. This course will break down what temperatures apply to this rule. We will show you appropriate waste bin management and even pest prevention. Learn and use the suggestions to keep pests at bay, from storing food securely in containers to conserving the environment. This course is for everyone, and there are no prerequisites. Do you know that cross-contamination can be bacterial, physical and chemical? Learn the difference and so much more by enrolling today and sharing the good news with others who can do the same. Why wait? Join today and spread the word.</p><a href=\"https://alison.com/resume/courses/4357\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4357\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Food Safety and Hygiene","description":"Improve your knowledge on food safety and hygiene guidelines in this module. The best practices of food preservation and hygiene using temperature control will be explored. Upon that, you'll understand the importance of handling food safely as well as how to prevent food contamination and pests.","topics":["Food Safety and Hygiene - Learning Outcomes","Safety Guidelines","Food Hygiene","Food Safety and Hygiene - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - RSBA1 - Food Safety and Hygiene"]}]}