{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3165","title":"Safeguarding Vulnerable Adults","totalEnrolled":"32,650","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online caregiving course helps you to protect vulnerable adults, at home or as part of your work.","description":"This free online caregiving course teaches you how to protect vulnerable people and raise concerns regarding their wellbeing. We explain 'Disclosure and Barring Service' checks that prevent harm befalling British children and certain adults. We also cover the different ways to share information with relevant bodies regarding abuse and neglect.","courseOutcomes":["Explain the basic principles of safe...","Discuss the different issues safegua...","Describe the Safeguarding Vulnerable...","Recall the purpose of The Care Act 2...","Explain the basic principles of safeguarding vulnerable adults","Discuss the different issues safeguarding cover","Describe the Safeguarding Vulnerable Groups Act 2006","Recall the purpose of The Care Act 2014","Identify the signs of abuse in older people","Analyze the different types and indicators of abuse and neglect","Recognize your personal responsibility to report safeguarding concerns","Outline the importance of communication in a care setting","Compare and contrast verbal, non-verbal and written communication","Summarize the correlation between consent and confidentiality","Explain the basic principles of safe...","Discuss the different issues safegua...","Describe the Safeguarding Vulnerable...","Recall the purpose of The Care Act 2...","Explain the basic principles of safeguarding vulnerable adults","Discuss the different issues safeguarding cover","Describe the Safeguarding Vulnerable Groups Act 2006","Recall the purpose of The Care Act 2014","Identify the signs of abuse in older people","Analyze the different types and indicators of abuse and neglect","Recognize your personal responsibility to report safeguarding concerns","Outline the importance of communication in a care setting","Compare and contrast verbal, non-verbal and written communication","Summarize the correlation between consent and confidentiality"],"courseDescription":"<p>This course introduces you to the basic principles of safeguarding vulnerable adults and protecting their health and wellbeing and explores them in detail. We also study issues like human trafficking, domestic violence and modern slavery while we explore relevant legislation. We closely examine Disclosure and Barring Service checks, which are designed to keep children and vulnerable adults from harm, and unpack the difference between ‘regulated’ and ‘controlled’ activity. Then comes analysis of the five key principles of the Mental Capacity Act in Britain.</p><p>Can you spot the signs of abuse? Not all abuse can be seen because not all mistreatment is physical and this course helps you understand when and how to make assumptions regarding abuse. We trace the roots of abuse and neglect, which can appear in many forms, and describe the types and possible indicators of various types of abuse: physical, emotional, sexual, domestic, discriminatory and financial. Older people suffering abuse can be afraid and embarrassed to talk about it so we show you how to spot signs of abuse in older people. We discuss the importance of communication in care settings in detail. Communication is defined by more than the words we use and we cover different channels, including verbal, non-verbal and written communication. The course also demonstrates how listening and paying attention plays an important role in handling complaints from either the client or their family.</p><p>Lastly, we show you how to respond to a disclosure of information. Confidentiality about vulnerable adults is important so we explain how to raise concerns about someone’s welfare while protecting their interests. We study the ‘seven golden rules’ of sharing such information in detail. This course is for anyone working in health care and social welfare organizations who wants to enhance their ability to safeguard vulnerable adults. It can also help you to care for loved ones by preserving their safety and dignity.</p><a href=\"https://alison.com/resume/courses/3165\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3165\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Beginners Guide to Safeguarding Vulnerable Adults","description":"In this module, you will learn about the basic principles of safeguarding vulnerable adults. We will discuss the different issues safeguarding covers such as human trafficking, domestic violence and abuse, modern slavery and dignity. In addition, you will also study the importance of communication in a care setting and how to raise safeguarding concerns about vulnerable adults with designated safeguarding officers and adult social care.","topics":["Learning Outcomes","An Introduction to Safeguarding of Vulnerable Adults","Reporting Your Concern","Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Final Assessment"]}]}