{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4947","title":"Safety for Lone Workers","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you the roles and responsibilities of lone workers in maintaining workplace safety.","description":"Many people's work requires that they work alone. Yet those who do so may be especially vulnerable if help is not readily available. This course examines the duties and responsibilities lone workers have to perform to ensure workplace safety. Study the safety legislation of lone workers, probable workplace threats, safety working procedures and measures to safeguard their physical and mental wellbeing. Sign up today and start learning.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Professionals who work alone or without close supervision have special requirements demanding different precautions to ensure their safety at work. This course aims to help lone workers and their employers learn more about their respective roles and responsibilities in maintaining a safe working environment. The course is brought to you by John Academy. They have helped students worldwide gain the relevant experience and skills they need to succeed in their chosen fields.</p><p>You will be introduced to lone working and discover the professions that involve working independently and how these situations differ from conventional workplaces. We will also enlighten you about the laws, regulations and policies concerning their safety. After teaching you about the possible risks of lone workers and their employers' role in assessing them, you will explore the buddy system and gain an idea about car safety, personal safety on foot and a manager's checklist.</p><p>Next, you will learn about conflicts, supervision and specialised lone worker devices. You will also discover the types of training and health and safety precautions you should give lone workers. You will examine ways to report incidents, raise membership awareness and encourage reporting. Lastly, we will review possible ways to ensure their physical and mental wellbeing, the application of first aid kits at isolated working sites and how to maintain safe working conditions. By the end of this course, you will have a complete understanding of the duties and obligations of lone workers regarding their safety. So start learning today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}