{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5171","title":"Safe Handling and Administration of Medication","totalEnrolled":"10,856","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how health and safety guidelines can ensure the safe use of medication in this free online healthcare course.","description":"Health professionals require training to safely handle and administer medications to protect the patients in their care from the dangers posed by mishandled medical drugs. This course explores the safety procedures used in medicine management to provide you with these important medical safety skills. We explain how to handle hazardous drugs and prevent prescription errors. We also describe how the Covid-19 pandemic affected the use of medicine.","courseOutcomes":["Explain the importance of medication...","Distinguish between policies and pro...","State the standard operating procedu...","Discuss the importance of personal p...","Explain the importance of medication safety","Distinguish between policies and protocols in medicine administration","State the standard operating procedures (SOP) for the safe and secure handling of medicine","Discuss the importance of personal protective equipment when handling hazardous drugs","Describe the legal and practical documentation required for keeping track of medication","Explain how Covid-19 affects guidelines for safe medication administration","Explain the importance of medication...","Distinguish between policies and pro...","State the standard operating procedu...","Discuss the importance of personal p...","Explain the importance of medication safety","Distinguish between policies and protocols in medicine administration","State the standard operating procedures (SOP) for the safe and secure handling of medicine","Discuss the importance of personal protective equipment when handling hazardous drugs","Describe the legal and practical documentation required for keeping track of medication","Explain how Covid-19 affects guidelines for safe medication administration"],"courseDescription":"<p>Allopathic (or ‘mainstream’) medicine treats diseases with drugs that could be potentially harmful or ineffective if not properly administered. It is essential that the health industry standardises the safe handling and administration of medication. This free medical health and safety course provides the knowledge required to safely administer drugs. We discuss the role of the government in establishing and maintaining the laws and policies that ensure that effective medicines are administered properly.</p><p>The course then traces the link between medical management and professional communication, which is essential to ensure that all healthcare professionals caring for a patient share the same information and that any potential problems associated with their care are resolved. Encouraging patients to take an active role in maintaining medication safety is one approach used to reduce incidents of medication error. Patient involvement can improve the health and quality of life of those in your care and lowers the risk of unintended harm.</p><p>We discuss the details of prescription medicine and examine the safe handling of hazardous drugs (HDs). We examine the record-keeping and audit processes, which are important in ensuring that procedures, care plans and medication management principles operate in accordance with policy. Finally, we investigate the impact of the Covid-19 pandemic on the safe use of medication. This course provides you with technical skills that are critical for patients' safety. Sign up for this patient safety course to learn how to safely prescribe and administer medical drugs without risking the health and wellbeing of those in your care.</p><a href=\"https://alison.com/resume/courses/5171\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5171\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Safe Medicine Administration","description":"This module will examine safety in handling medications, and the role of government in providing relevant policies. We will explore medication errors, hazardous drugs, and the patient's involvement in safety. You will learn about record-keeping, audit processes, and then finally, the safe use of medication during the COVID-19 Pandemic.","topics":["Learning Outcomes - Safe Medicine Administration","Introduction to Medicine Administration","Safe Administration of Medicines","Safe Handling of Hazardous Drugs","Lesson Summary - Safe Medicine Administration"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment - Safe Handling and Administration of Medication"]}]}