{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3287","title":"Shipboard Safety: Training, Drills, and Hazardous Materials","totalEnrolled":"946","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Minimize onboard risk with safety drills and the proper care of hazardous materials with this free online course.","description":"This free online course demonstrates the value of regular training and frequent drills to ensure the proper handling of dangerous situations and materials on ships. We examine a range of shipboard hazards and provide methods to reduce the risks they pose. These safety measures involve relevant stakeholders including crew members and their managers and we explain how everyone can contribute to keeping ships safe.","courseOutcomes":["Explain the reasons to conduct emerg...","Describe the function of the safety ...","Discuss the importance of onboard cr...","List the essential steps of ‘Abandon...","Explain the reasons to conduct emergency drills and safety drills","Describe the function of the safety management system","Discuss the importance of onboard crew training according to the STCW 78/95 convention","List the essential steps of ‘Abandon Ship’ drills","Recall the different requirements for towing oil or hazardous material in bulk on ships","Analyze the components of the International Maritime Dangerous Goods Code (IMDG)","Explain the applications of different U.S. maritime regulations to ship transport","List hazardous materials that are usually carried on tugboats","Evaluate and common safeguards used in handling packaged petroleum and other flammable liquids","Explain the reasons to conduct emerg...","Describe the function of the safety ...","Discuss the importance of onboard cr...","List the essential steps of ‘Abandon...","Explain the reasons to conduct emergency drills and safety drills","Describe the function of the safety management system","Discuss the importance of onboard crew training according to the STCW 78/95 convention","List the essential steps of ‘Abandon Ship’ drills","Recall the different requirements for towing oil or hazardous material in bulk on ships","Analyze the components of the International Maritime Dangerous Goods Code (IMDG)","Explain the applications of different U.S. maritime regulations to ship transport","List hazardous materials that are usually carried on tugboats","Evaluate and common safeguards used in handling packaged petroleum and other flammable liquids"],"courseDescription":"<p>Most heavy equipment and machinery can sometimes be unsafe for various reasons that also apply to vessels that transport goods at sea. Ships are particularly vulnerable to human error, design defects, weather conditions and other problems that cause accidents. Shipboard safety thus seeks to prevent accidents related to heavy equipment, machinery and the vessels themselves. Other onboard dangers include fire, poisoning and rodent infestation. This course provides the relevant training and drills that help reduce the risk of accidents before, during and after voyages. We also describe materials that constitute hazardous cargo and stowage.</p><p>This free online course establishes the value of regular training and ongoing drills for dangerous situations on board ships. These measures involve all relevant stakeholders, including crew members and their landbound managers, and can handle complex emergencies. We explain the reasoning behind the practices employed when stowing and transporting hazardous materials across the sea.&nbsp;</p><p>Ship safety practices have evolved to reduce risks on offshore oil rigs, tugboats, cruise vessels, cargo ships, cranes, shipyards and ship docks. These machines and vessels are known for their operational complexity that traditionally demands caution from their staff. This course covers the conventions, laws, regulations and standards that guide and protect sailors and suits maritime shippers, logistic entrepreneurs, marine operations managers, ship crew and marine engineers. If you already work on a ship or its port, this course can keep you safe and help you move upwards.</p><a href=\"https://alison.com/resume/courses/3287\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3287\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Value of Training and Drills","description":"In this module, you will learn about the value of safety drills as part of emergency preparations including appropriate ways of organizing such safety drills for best results. You will also learn about SCRBs, EPIRB, and SART in different situations.","topics":["Value of Training and Drills - Learning Outcomes","Introduction to Value of Training and Drills","Examining Value of Training and Drills","Abandon Ship Drills","Value of Training and Drills - Lesson Summary"]},{"name":"Module","details":"Hazardous Materials","description":"In this module, you will learn about the IMDG code used in transporting hazardous materials at sea together with the implementation of US laws for the transportation of such materials. You will also learn about the requirements for towing hazardous cargoes on tugs and barges.","topics":["Hazardous Materials - Learning Outcomes","Introduction to Hazardous Materials","Labelling","Hazardous Materials Carried on Tugboats","Hazardous Materials - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Training, Drills, and Hazardous Materials - Course Assessment"]}]}