{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3700","title":"Special Needs School Shadow Support","totalEnrolled":"7,702","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to manage children with Autism and other developmental disorders in a school setting in this free online course.","description":"This free online course teaches how to manage kids with Autism and similar developmental disorders in school settings. Shadow Support involves one-on-one support for children with developmental disorders to help them develop social, behavioural and academic skills. In this course, you will learn the necessary tools and techniques needed to provide shadow support and help you understand the need for inclusive education systems.","courseOutcomes":["Explain the need for inclusive educa...","Discuss the relevance of shadow supp...","Outline the peculiar features of aut...","List the common challenges associate...","Explain the need for inclusive education systems","Discuss the relevance of shadow support","Outline the peculiar features of autistic children","List the common challenges associated with autism","Discuss the educational implications of developmental disorders","Explain the triad of impairment","Outline the types of visual supports","Describe the components of functional assessment","Outline the steps for managing a meltdown situation","Identify tools commonly used to influence behaviour in shadow support","Explain the role of autistic child peers in helping them adjust to the school environment","Describe how a bullying situation is best handled","Explain the need for inclusive educa...","Discuss the relevance of shadow supp...","Outline the peculiar features of aut...","List the common challenges associate...","Explain the need for inclusive education systems","Discuss the relevance of shadow support","Outline the peculiar features of autistic children","List the common challenges associated with autism","Discuss the educational implications of developmental disorders","Explain the triad of impairment","Outline the types of visual supports","Describe the components of functional assessment","Outline the steps for managing a meltdown situation","Identify tools commonly used to influence behaviour in shadow support","Explain the role of autistic child peers in helping them adjust to the school environment","Describe how a bullying situation is best handled"],"courseDescription":"<p>In this free online course, you will gain the needed knowledge and learn the skills and techniques necessary for providing shadow support to children with Autism Spectrum Disorder, Attention Deficit and Hyperactivity Disorder, and anxiety disorders. It begins by explaining inclusive education systems and establishing the need for such</p><p>systems. It then covers the characteristics of Autistic children that differentiate them from their neurotypical counterparts and explains the educational implications of having developmental disorders.</p><p>The second half of the course covers techniques and best practices for shadow support interventions. It explains visual supports in detail and demonstrates their use in organizing a child’s activities and promoting good behaviour. It goes further to introduce techniques for employing reward systems and properly assessing a child’s behaviour for understanding and influencing it in the future. The course introduces methods for managing meltdowns, facilitating social interaction, and using a child’s peers to provide support.</p><p>Shadow support is instrumental in improving social, academic and behavioural skills in children with Autism Spectrum Disorder (ASD) or similar development disorders, making it easier for them to navigate everyday life. Suppose you are a parent of an autistic child, a teacher tasked with caring for such children, or an individual interested or involved in early-child education. In this case, you will find the information contained in this course particularly useful. Start now and gain the needed knowledge to provide shadow support for Autistic children in under 3 hours.</p><a href=\"https://alison.com/resume/courses/3700\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3700\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Inclusive Education Systems and Behavioural Implications","description":"In this module, you will see an example of an inclusive education system, and understand the need for such a system. You will also learn about the characteristics of children with developmental disorders and the common challenges they face, particularly in academic environments.","topics":["Inclusive Education and Behavioural Implications - Learning Outcomes","Course Overview and Inclusive Education Systems","Education and Behavioural Implications","Inclusive Education and Behavioural Implications - Lesson Summary"]},{"name":"Module","details":"Intervention Strategies. Best Practices and Independence","description":"In this module, you will learn about visual supports like visual schedules and organisational prompts, and how they are used to improve educational, social, and behavioural skills in children with Autism and similar developmental disorders. You will also learn about involving a child's peers in the support system.","topics":["Intervention Strategies. Practices & Independence - Learning Outcomes","Intervention Strategies","Promoting Independence","Interventions & Independence - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Special Needs School Shadow Support - Course assessment"]}]}