{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3100","title":"Structure of Proteins","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course in organic chemistry and biology explains the structure and functions of proteins.","description":"This free online biological chemistry course introduces you to the structure and functions of proteins. We take you through the hierarchical structure of proteins, the techniques used to determine their three-dimensional structure, their purification and the processes used for enzymes. This course offers entry into the fields of chemistry and biology and suits anyone interested in learning how the body fuels itself.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course breaks down the structural and functional aspects of proteins. The first half of the course describes their hierarchical structure and explains the secondary and tertiary structure of peptides and proteins. The amino-acid sequence characterizes the primary structure of proteins. The secondary structure is the initial folding of the sequence into alpha helices, beta sheets and beta turns. The tertiary structure is a more complex folding of the protein and the quaternary structure is the combination of two or more of the same protein. We offer insight into techniques like X-ray crystallography, nuclear magnetic resonance (NMR) and electron microscopy used to determine the three-dimensional structure of proteins. We then demonstrate the use of Ramachandran plot to analyze the structure of proteins and illustrate the need for rotation around bonds in order to clarify different geometries in protein structure. The course explains how to determine which bonds in the polypeptides are free to rotate and describes the ‘steric effect’ and various protein purification techniques such as ion exchange chromatography, sodium dodecyl sulphate–polyacrylamide gel electrophoresis (SDS PAGE) and isoelectric focusing.&nbsp;</p><p>The protein-purification process is based on the main parameters of molecular weight, charge, solubility and affinity. This course covers the purification of proteins by proteomics and gel filtration. ‘Proteomics’ means the study of all the proteins found in any structure. We also examine protein-purification using ion exchange chromatography and two-dimensional gel electrophoresis. The course then explores the different functions of proteins, starting with their role in catalyzing various reactions in our bodies. Such proteins are called ‘enzymes’. We provide a detailed explanation of enzyme-catalyzed reactions, types and classes of enzymes and their cofactors. There are six classes of enzymes that are always written in a specific sequence as per the requirements of the relevant nomenclature system. We address the Michaelis-Menten constant and maximum value of rate in the context of enzyme-catalyzed reactions and the factors that affect them. We conclude with an explanation of the catalytic activity of serine and other types of proteases.&nbsp;</p><p>Proteins are associated with living organisms but this biological chemistry course investigates the chemical structure of proteins and opens new windows in the quest for further research and advanced learning. Chemists need to know the basics of biology to understand the nature and type of chemistry that goes on in biological systems and biologists must analyze the precise microscopic details of any process of synthesis or decomposition. This course is thus useful in a contemporary scientific environment and offers scope for advancement not only in the areas of academics or research and development but in pharmaceutical sales and manufacturing or even scientific regulation. Sign up to gain insight into the hidden building blocks of life.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}