{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5023","title":"Suicide Prevention - Diagnosis and Treatment","totalEnrolled":"1,931","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you suicide prevention, risk assessment, diagnosis and treatment techniques.","description":"The World Health Organization estimates that over 700,000 people commit suicide each year. People attempt suicide for various complex reasons, making it challenging for others to comprehend why someone might want to do it. However complicated an issue suicide is, it can be avoided. Knowing the suicide risk factors is the first step toward prevention. This course examines suicide diagnosis, treatments and preventive measures.","courseOutcomes":["Discuss the general epidemiology of ...","List common intrinsic characteristic...","Identify key risk factors and precip...","Describe which populations are at th...","Discuss the general epidemiology of the incidence and prevalence of suicide","List common intrinsic characteristics of patients most likely to exhibit suicidality","Identify key risk factors and precipitating events that typically impact individual patients, such as comorbidity and situational factors","Describe which populations are at the highest risk for suicidal behavior","Recognize gender differences in suicidality","Distinguish between the risk factors for youth and the elderly","Evaluate the intergenerational and family history of suicide","Explain the clinician’s role in making a preliminary and ongoing assessment of a patient’s status in terms of suicide potentiality","Discuss the theories concerning the underlying psychodynamics of suicidality","Discuss the general epidemiology of ...","List common intrinsic characteristic...","Identify key risk factors and precip...","Describe which populations are at th...","Discuss the general epidemiology of the incidence and prevalence of suicide","List common intrinsic characteristics of patients most likely to exhibit suicidality","Identify key risk factors and precipitating events that typically impact individual patients, such as comorbidity and situational factors","Describe which populations are at the highest risk for suicidal behavior","Recognize gender differences in suicidality","Distinguish between the risk factors for youth and the elderly","Evaluate the intergenerational and family history of suicide","Explain the clinician’s role in making a preliminary and ongoing assessment of a patient’s status in terms of suicide potentiality","Discuss the theories concerning the underlying psychodynamics of suicidality"],"courseDescription":"<p>The World Health Organization (WHO) and national health organizations worldwide are concerned about the rising suicide rate. Over the past 50 years, suicide rates have climbed globally by 60%. It comes at a high economic and personal cost. Suicide is expensive in terms of both its financial impact and the emotional toll it takes. In this course, you can learn about the specific measures to combat the threat of suicide.</p><p>We have divided this course into modules and topics. The first module will teach you about the broad epidemiology of suicide, risk factors and protective factors. Then you will discover suicidality risk groups. You will compare the gender disparities in suicidality and the risk factors for young people and the elderly. Additionally, the course will allow you to investigate comorbid behavioral health conditions linked to increased risk, for example personality and bipolar disorders. Finally, you will explore occupations with high suicidality rates and situational triggers associated with suicidality.</p><p>The second module will cover an overview of theories relating to the underlying psychodynamics of suicidality, developing and putting protective protocols into practice, enlisting the help of family and close friends, group interventions, support groups, treatment modalities, proactive preventative measures and suicide hotlines. This course would benefit social workers, marital and family therapists and mental health therapists. After completing this course, you will have the necessary knowledge to effectively stop patients with suicidal thoughts from acting on them. Enroll today and start learning.</p><a href=\"https://alison.com/resume/courses/5023\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5023\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The General Epidemiology of Suicide","description":"In this module, you will learn about epidemiology, risk factors, and protective factors of suicidality. Then, you'll discover suicidality risk factors for adolescents and the elderly, groups at risk, gender disparities in suicidality, family history of suicide, jobs with high rates of suicide, and environmental triggers linked to suicidality.","topics":["The General Epidemiology of Suicide - Learning Outcomes","The General Epidemiology of Suicide","Populations with Elevated Risk Factors - Part 1","Populations with Elevated Risk Factors - Part 2","The General Epidemiology of Suicide - Lesson Summary"]},{"name":"Module","details":"Overview of Theories of Psychodynamics of Suicidality","description":"The overview of theories relating to the underlying psychodynamics of suicidality, efficient suicidality screening, diagnosis, and assessment, development and application of protective protocols, proactive preventative measures, documentation, Baker Acting, and creation of a supportive environment are among the topics covered in this module.","topics":["Theories of the Psychodynamics of Suicidality - Learning Outcomes","Overview of Suicidality Theories","Theories Concerning Suicidality","Prevention and Special Considerations","Theories of the Psychodynamics of Suicidality - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Suicide Prevention - Diagnosis and Treatment - Course Assessment"]}]}