{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5469","title":"Supervision Skills for Adult Care","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to manage staff in adult care settings in this free online course that provides modern supervision strategies.","description":"Your team needs supervision to provide high-quality care and assistance that produces favourable results for both the worker and clients. This management course provides the skills you need to support your staff, build better work relationships and perform supervision sessions. We cover the principles, purpose and scope of leadership and examine its models and processes. We explain how power imbalances and personal wellbeing affects performance.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Supervision involves a supervisor meeting regularly and interacting with staff to review their work performance and help them do good work. This ‘Supervision Skills in Adult Care’ training course begins by defining concepts and diving into models of supervision such as cognitive behavioural supervision, integrated development models and the system approach. We explore the different forms of supervision and the frequency of conducting them. We then examine supervision contracts with internal and external factors that influence operations and delve into the power imbalance between supervisor and supervisee.</p><p>We discuss the factors of power imbalances and how to address them in the workplace, including how they can cause conflict. We then explain your role as a manager in defusing such conflict. We lay out the elements that make up the wellbeing of employees and identify signs of stress and anxiety encountered outside the workplace. The course shows you how to spot signs of life events and stress triggers that may affect employees’ wellbeing and thus their workplace performance. We also discuss the effects of stress and anxiety and explain how to address them as a supervisor. The course demonstrates how to establish supervision agreements with supervisees to freely discuss sensitive issues.</p><p>Finally, we look at the sources of evidence and material to support discussion during supervision before exploring the importance of staff wellbeing. This course provides a clear understanding of the supervisor's responsibility and strategies for supporting employees. Uncover tips for managers when handling an employee with a care obligation to reduce stress and turnover. The course is suitable for anyone working in the adult social care and health sector charged with supervising staff and improving performance. These management principles and leadership principles are applicable in many industries but we tailor our training to cover adult care. Sign up to start developing your leadership skills.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}