{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1972","title":"Supporting Individuals with Intellectual Disabilities and Mental Illness","totalEnrolled":"44,064","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about supporting people with intellectual disabilities and mental illness with this free online course.","description":"This free online intellectual disability and mental healthcare course will teach you about how quality care services depend on understanding clients. You will study the four guiding principles of support work and how the strengths and resources of clients and their communities are involved in the care process. You will also look into the historical use of names and labels for people with disabilities, and more.","courseOutcomes":["Explain why quality care services de...","List the four guiding principles of ...","Describe how support workers use the...","Describe the negative use of names a...","Explain why quality care services depends on understanding clients","List the four guiding principles of support work","Describe how support workers use the strengths and resources of clients and their communities","Describe the negative use of names and their impact on people with disabilities","Trace the historical use of labels for people with disabilities","Identify classification categories that differentiate levels of intellectual disability","Explain why quality care services de...","List the four guiding principles of ...","Describe how support workers use the...","Describe the negative use of names a...","Explain why quality care services depends on understanding clients","List the four guiding principles of support work","Describe how support workers use the strengths and resources of clients and their communities","Describe the negative use of names and their impact on people with disabilities","Trace the historical use of labels for people with disabilities","Identify classification categories that differentiate levels of intellectual disability"],"courseDescription":"<p>In this free online course supporting individuals with Intellectual Disabilities and Mental Illness, you will learn that one in four adults experience some form of mental retardation or health problems during their lifetime, and mental illness not only affects the individuals concerned but also their families and friends.</p><p>This intellectual and developmental disabilities course begins by showing you why quality care services depend on understanding clients. You will also learn about the four guiding principles of support work and how the strengths and resources of clients and their communities are involved. Finally, the course will help you learn about the historical use of names and labels for people with intellectual disabilities, as well as their impact, causes of intellectual disability and the identification of classification categories that differentiate levels of intellectual functioning and intensities of supports.</p><p>This course is not just for mental health experts and other social and health industry professionals but will be of great interest to anyone who has experienced mental health issues personally and those with a general interest in this health area. Start this course today and learn problem-solving skills for supporting individuals with intellectual disabilities and mental illness.</p><a href=\"https://alison.com/resume/courses/1972\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1972\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Support Work: The Fundamentals","description":"In this module you will learn why quality care services depends on understanding clients; the four guiding principles of support work and how the strengths and resources of clients and their communities are involved.","topics":["Support Work: The Fundamentals - Learning Outcomes","Course Introduction","Guiding Principles and History","Individuals and Communities","Support Work: The Fundamentals - Lesson Summary"]},{"name":"Module","details":"What's in a Name?","description":"In this module, you will trace the historical use of names and labels for people with disabilities, as well as their impact and you will identify classification categories that differentiate levels of intellectual disability and intensities of supports.","topics":["What's in a Name? - Learning Outcomes","Significance of Names","Use of Names","Intellectual Disability","What's in a Name? - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Supporting Individuals with Intellectual Disabilities and Mental Illness - Assessment"]}]}