{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1441","title":"Swine Flu - Causes, Effects and Treatment","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the Swine Flu virus, and its transmission, symptoms and prevention with this free online influenza course.","description":"This free online Swine Flu course will teach you about the causes, effects, and treatments available for Swine Flu. When new strains of influenza break out, humans don't have any natural immunity to them. Therefore, when a new virus develops there's a risk that that virus can become a pandemic if the virus continues to pass from person to person. In this course, you will about how Swine Flu is transmitted, and how it is prevented, and treated.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online Swine Flu course will be of great interest to all learners who would like to learn more about the influenza (flu) virus, its transmission and prevention, as well as the \"variants\" responsible for swine flu. An influenza pandemic is defined as a new or novel influenza virus that spreads easily between humans. When new influenza viruses are introduced into the environment, humans don’t have any natural immunity to protect against them. Therefore, there is a risk that new influenza viruses could develop into a pandemic if the virus passes easily from person to person.</p><p><br>The course begins by describing how pigs are susceptible to multiple viruses (avian, human and swine) and how this combination can result in an 'antigenic shift'. If a new virus type causes illness in people and is transmitted easily from person-to-person, an influenza pandemic can occur, such as the influenza A H1N1 pandemic in 2009, which effected 74 countries. You will learn about the symptoms of swine flu, how to test for it, its diagnosis, comparison with the common cold, and travel and safety tips. Similar to seasonal flu, some people are at high risk of developing serious illness from variant flu virus infections. In severe cases, pneumonia may develop and death may occur. Most reported variant flu virus infections in people have occurred following exposure to infected pigs or their virus contaminated environments, particularly in association with large agricultural fairs.</p><p>&nbsp;</p><p><br>The course describes the risk factors that can lead to exposure to viruses, as well as precautions that can be taken to prevent the spread of flu between pigs and people. You will also learn about the importance of reporting and monitoring variant influenza, as well as the use of vaccines and anti-viral medicines. So, why wait? Start learning how to protect you and your loved ones from influenza today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}