{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4873","title":"The Psychology of Unconscious Bias","totalEnrolled":"1,250","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an understanding of the psychology of unconscious bias with this free online course on Alison.com.","description":"Are you a psychology student looking to gain a deeper understanding of unconscious bias and its effects? Or are you an employee looking to overcome the prevalence of unconscious bias at your workplace? This course contains all the correct information and tools to help you. We will equip you with the proper knowledge to help you understand the unconscious biases around us. So enrol now and understand this consequential topic!","courseOutcomes":["Define the terms ‘bias’ and ‘heurist...","Describe the two systems of thinking...","Identify the main reasons why people...","Examine some of the commonly found b...","Define the terms ‘bias’ and ‘heuristics’ along with their role in shaping the perspective towards others","Describe the two systems of thinking among individuals known as ‘system 1’ and ‘system 2’ thinking","Identify the main reasons why people are biased toward certain groups or individuals","Examine some of the commonly found biases at the workplace and how they affect performance","Explain how the commonly found biases at the workplace can be overcome or ‘de-biased’","Identify the role of perception, association and beliefs in creating some of the most commonly found biases","Discuss the solutions and tools available to individuals and groups in order to overcome the issue of unconscious bias","Define the terms ‘bias’ and ‘heurist...","Describe the two systems of thinking...","Identify the main reasons why people...","Examine some of the commonly found b...","Define the terms ‘bias’ and ‘heuristics’ along with their role in shaping the perspective towards others","Describe the two systems of thinking among individuals known as ‘system 1’ and ‘system 2’ thinking","Identify the main reasons why people are biased toward certain groups or individuals","Examine some of the commonly found biases at the workplace and how they affect performance","Explain how the commonly found biases at the workplace can be overcome or ‘de-biased’","Identify the role of perception, association and beliefs in creating some of the most commonly found biases","Discuss the solutions and tools available to individuals and groups in order to overcome the issue of unconscious bias"],"courseDescription":"<p>Have you ever encountered a situation where you felt judged because of specific preconceived ideas or stereotypes held by those around you? Or are you working in an organisation where certain existing biases hinder your growth? This course will address these answers and many more aspects related to this subject in the psychology of unconscious biases. We will begin your journey by discussing the definition and origins of the term ‘bias’. Closely connected to biases is the use of ‘heuristics’. We shall examine these terms and their prevalence and evolution in detail.</p><p>Ever felt that someone within your organisation is getting extra preferential treatment? Biases within the workplace are widespread and often go unnoticed or unreported. Moreover, workplace biases can sometimes be extremely difficult to identify, whether it's a judgement based on looks, age or any other aspect. Discover several workplace biases and the fundamental tools necessary to overcome these issues at work.</p><p>Are you curious about the impact of culture on certain types of biases towards a particular group of individuals? We will examine the role of perception, beliefs and cultural norms in creating unconscious biases. Next, we will analyse the various studies and experiments carried out by cognitive theorists to understand the biased mind. Finally, we will research the crucial role that leadership and team building play in overcoming biases. Information on unconscious bias can be beneficial in tackling it successfully so don't waste any more time. Register today and become informed!</p><a href=\"https://alison.com/resume/courses/4873\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4873\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Psychological Aspects of Unconscious Bias","description":"This module introduces the learner to the concepts of biases, heuristics, and their role in our daily lives. The formation of biases in a human's life along with types of unconscious biases shall be examined. Different types of biases in the workplace and how they can be avoided shall be discussed. Perceptions and de-biasing tools shall be analyzed","topics":["The Psychology of Unconscious Bias - Learning Outcomes","Introduction to Unconscious Bias","Origins of Bias","Unconscious Bias at the Workplace","Avoiding Unconscious Biases at Work","Biases and Perception","Individual and Structural Intervention","The Psychology of Unconscious Bias - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Psychology of Unconscious Bias - Course assessment"]}]}