{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4752","title":"The Anatomy of the Head and Face","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an insight into the anatomy of the head and the facial muscles with this free online course on Alison.com.","description":"The anatomy of the head and face are complex. Humans have well-developed facial muscles that allow for various facial emotions. So if you ever wonder how different facial muscles work or are fascinated with the scalp, this online course will provide you with all the information to satisfy your learning interest. We explore the most intricate details of facial and head muscles and the different types of injuries or infections that are possible.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you looking to understand the inner mechanisms that make up our scalp or the face? Or are you inquisitive about how various injuries and infections affect this particular segment of our body? This comprehensive course on the anatomy of the head and face by anatomist Dr Saqib Mansoor will help you gain valuable knowledge. It covers all aspects of the head, from a detailed analysis of the muscles to a discussion on wounds and infections. It kicks off by explaining the various layers of the scalp and the different types of tissue that composes the head. Adequate blood supply to the scalp is crucial for its proper function. We will examine the complex network of nerves, veins and arteries. Have you ever wondered what causes the colour of our eyes or surrounding changes due to injury? We will outline the cause of 'black eyes' and various other infections and wounds that affect the human scalp.</p><p>Muscles work in tandem to create simple facial expressions such as smiling. Investigate the different types of muscles that make up the human face. We have divided these into different segments relating to the mouth, lips, ears and nose. Each muscle category is relevant to displaying a wide range of human emotions, such as happiness or sadness, which we shall identify. We will analyse these connections and their function and how they connect to a different set of nerves to coordinate with the brain. For example, you will discover how skin irritations and infections could occur when using a tissue or handkerchief.</p><p>We will then demonstrate the parotid gland's composition, function and nerves and how it works to produce constant saliva. Learn about common infections, such as 'mumps’, and what causes them. The human body is a complex mechanism involving coordination between muscles, nerves and a blood flow network. The evolution of anatomy throughout history has made it possible for everyone to observe this mechanism and enhance their understanding of the human body. If you are one of the many individuals who want to understand this fascinating subject, join this online course with Dr Saqib Mansoor today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}