{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4730","title":"The Anatomy of the Knee Joint","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Develop an understanding of the anatomy and various functions of the knee joint in this free online course.","description":"Are you an athlete trying to understand the anatomy of the knee joint? Or do you have to prepare for an anatomy presentation at school? This online course on knee joint anatomy contains detailed information to help you understand every aspect of this vital joint we use daily. In addition, this course explores the different knee movements and the blood supply to the knee joint. So don't waste any more time and enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you a teacher looking to prepare a lecture on knee joint anatomy for the upcoming class? Or are you curious how this fascinating joint performs such crucial everyday tasks within the human body? This online course is a wealth of knowledge regarding the intriguing features and functions of the knee. Dr Saqib Mansoor, your lecturer, takes you through a detailed analysis of the knee joint and its inner workings so that concepts regarding this body part become crystal clear. The course kicks off with some basic information regarding the knee joint. Then we shall discuss some essential facts regarding it and the main factors that play a role in its stability.</p><p>The following section explores the different areas and functions of the joint capsule in depth. You will discover the connections to and from the joint capsule and the medial and lateral alar folds that are an important part of the joint. This information will be shared theoretically and in diagrams and videos to make each aspect completely clear. Next, Dr Mansoor guides you through the various ligaments found within the knee structure. He defines and explains the Q-angle, which is responsible for the displacement of the patella. He will examine external and intra-articular ligaments in detail.</p><p>Next, the course addresses the different types of knee movement in detail. The extension and flexion of the knee are vital movements as the leg bends or straightens. These locking and unlocking actions are essential as they can also result in the most number of injuries. Through diagrams, we demonstrate how the blood vessels supply blood to the knee joint. Then we discuss the innervation of the knee joint via the application of Hilton’s law before finally looking at the bursae around the knee joint, which helps reduce friction. The knee joint is an integral part of the proper functioning of the leg. Knee injuries are a significant part of the total injuries that athletes suffer. Understanding this body part and its associated injuries can ensure its rehabilitation in the case of an injury and its proper functioning. So do not waste any more time. Join this online course on Alison.com to take your learning journey further.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}