{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3813","title":"The Basics of Food Safety and Hygiene","totalEnrolled":"10,472","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, learn about food safety protocols and what is required by law to prevent food-borne illness.","description":"Food safety is a set of practices and procedures required by law to prepare, handle, and store food and prevent food-borne illness and injury. This food safety certificate includes essential details for anyone who works in the food industry and is designed to help you understand food safety procedures, identify potential hazards, and become familiar with what the law requires from you as a business owner or employee to prevent harm to consumers.","courseOutcomes":["Summarize a food handler’s responsib...","Identify unhygienic habits...","Discuss food safety training...","List the six stages of cleaning...","Summarize a food handler’s responsibilities","Identify unhygienic habits","Discuss food safety training","List the six stages of cleaning","Recall pest control practices","Define ‘Organoleptic Checks’","Describe food preservation methods","Identify sources of bacterial contamination","Explain how to prevent cross-contamination","Recognize physical, allergenic, and chemical hazards to food safety","Describe food poisoning symptoms","Outline control measures to prevent food-borne disease","Summarize a food handler’s responsib...","Identify unhygienic habits...","Discuss food safety training...","List the six stages of cleaning...","Summarize a food handler’s responsibilities","Identify unhygienic habits","Discuss food safety training","List the six stages of cleaning","Recall pest control practices","Define ‘Organoleptic Checks’","Describe food preservation methods","Identify sources of bacterial contamination","Explain how to prevent cross-contamination","Recognize physical, allergenic, and chemical hazards to food safety","Describe food poisoning symptoms","Outline control measures to prevent food-borne disease"],"courseDescription":"<p>The food industry is one of the world’s biggest businesses. As the world’s population continues to increase, so will the food industry’s size and complexity. Therefore, making sure that the food we all consume is safe to eat must be a top priority for anyone who works in the food industry. It is estimated that in the United States alone, about 48 million people get sick from a food-borne illness every year. Around the world, almost half a million people die due to consuming contaminated food. This food safety course is designed to help you understand the importance of food safety. This scientific discipline governs the preparation, handling and storage of food to prevent food-borne illness and injury. The rules and regulations presented in this course are based on Hazard Analysis Critical Control Points (HACCP) concepts, an internationally recognized management method designed to manage and acknowledge food safety risks and other related hazards. It is also important to understand that each country might have its own laws governing food safety, and it is your responsibility to consult your local regulatory agencies.</p><p>This food handling course starts by discussing the importance of personal hygiene. Food handlers are considered the most severe hazard in the food industry due to the high likelihood of contaminating food through poor personal hygiene. Learn the responsibilities required by law for food handlers, identify unhygienic habits, proper handwashing procedure, the proper use of protective clothing and gloves, and the required procedure to follow when an employee becomes ill. The next section studies why cleanliness in any food-oriented business is essential to promote food safety, increase customer confidence, and maintain a good reputation after which you will learn the practicalities of the six stages of cleaning and how to create regular and well-structured cleaning schedules. One of the most considerable financial losses that food-oriented businesses suffer comes from throwing away spoiled food and this challenge is addressed by teaching you how to spot and prevent food spoilage by investigating the main methods of preserving food, understanding your obligations when freezing, defrosting, storing food, and seeing the relevance of ‘sell by’ and ‘use by’ dates on packages.</p><p>The biggest battle fought by anyone who handles food is against bacteria, viruses, and mould. You will explore the various classifications and types of bacteria, how to prevent bacteria from spreading, how viruses can affect certain types of food, and spot spoilage from mould and yeast. Besides these microbiological hazards, your learning also includes how to identify and prevent physical, chemical, and allergenic hazards. Some other practical things you will learn includes how to diagnose symptoms of food allergies and know how to react if you witness someone going into anaphylactic shock. As a business owner in the restaurant industry, it is inevitable that at some point, a customer will complain that they have contracted food poisoning from your business and having a rigorous, well-documented HACCP system in place can protect you and your customers - all of this and more is covered in-depth in this food safety training. The content of this food safety and hygiene course is critical and necessary if you work in any food-related business such as restaurants, food preparation, -manufacturing, -processing, and -distribution.</p><a href=\"https://alison.com/resume/courses/3813\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3813\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"An Introduction to Food Safety","description":"This module will discuss the best practices to avoid food contamination due to poor hygienic practices. It will explain the importance of personal hygiene, proper cleaning and disinfecting procedures, and detecting and preventing food from spoiling.","topics":["An Introduction to Food Safety-Learning Outcomes","Personal Hygiene","Cleaning and Disinfecting","Food Spoilage and Food Storage","An Introduction to Food Safety - Lesson Summary"]},{"name":"Module","details":"Food Safety Knowledge","description":"This module will discuss what causes food-borne illnesses, how to identify contamination hazards that can cause food poisoning, how to take preventative measures to avoid the spread of bacteria in food and the legal guidelines and regulations set in place for food handling businesses.","topics":["Food Safety Knowledge - Learning Outcomes","Bacterial and Microbiological Hazards","Physical, Chemical, and Allergenic Hazards","Food Poisoning and Control Measures","Food Safety Knowledge - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["The Basics of Food Safety and Hygiene - Course Assessment"]}]}