{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5398","title":"Training on Infection Prevention and Control Principles","totalEnrolled":"5,267","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online epidemiology course explains how infection control and prevention curb the spread of disease.","description":"This epidemiology course explores the management and prevention of infections. We explain how to direct the implementation of infection prevention and control measures and develop policies that protect public safety. We also emphasise the value of risk assessment and provide risk assessment methods that can be used during emergencies. Sign up to learn about the medical and legal aspects of combating infection in this public health course.","courseOutcomes":["Establish the importance of infectio...","Recognise the stages of the spread o...","Identify the different means of tran...","Define the concept of ‘decontaminati...","Establish the importance of infection control and prevention","Recognise the stages of the spread of infection","Identify the different means of transmission","Define the concept of ‘decontamination’","Outline the laws and regulations related to infection prevention","Explain how to perform risk assessments","Indicate the types of personal protective equipment (PPE)","Discuss the person-to-person spread of infection","Establish the importance of infectio...","Recognise the stages of the spread o...","Identify the different means of tran...","Define the concept of ‘decontaminati...","Establish the importance of infection control and prevention","Recognise the stages of the spread of infection","Identify the different means of transmission","Define the concept of ‘decontamination’","Outline the laws and regulations related to infection prevention","Explain how to perform risk assessments","Indicate the types of personal protective equipment (PPE)","Discuss the person-to-person spread of infection"],"courseDescription":"<p>This course explores modern infection prevention and control methods. It starts with an introduction to infection and infection control and lays out the different stages of infection spreading, often called the ‘chain of infection’. The prevention and control of infection in the workplace involves everyone. We describe the specific roles and responsibilities of the health department, employers and employees concerning the spread of disease.</p><p>We then discuss the microbiology involved in the cycle of infection and the different means of transmission. We study decontamination methods and standards used to classify products according to the level of danger associated with their use. The course then examines the relevant regulations, infection control policies and prescribed procedures and their implementation according to published guidelines. We also establish the necessity of infection risk assessment and management.</p><p>The next section emphasises the importance of personal protective equipment (PPE). We explain the impact of hazard assessments and discuss PPE legislation, the duties of employees regarding PPE and the requirement for PPE. We also describe the different types of such equipment and their practical uses in detail. The course’s final section focuses on person-to-person spread of infection. Sign up for this epidemiology course to learn about the external and internal variables that drive infection control practice, the chain of transmission and techniques to prevent and control infection.</p><a href=\"https://alison.com/resume/courses/5398\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5398\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Infection Prevention and Control","description":"This module will define infection control and go over what it entails, why it is essential, and how it spreads. You will learn about risk management and risk and hazard assessment. Also, you will discover the different types of personal protective equipment (PPE) and their practical uses.","topics":["Infection Prevention and Control - Learning Outcomes","Introduction to Infection and Infection Control","Hazard and Risk Assessment","Personal Protective Equipment (PPE)","Infection Prevention and Control - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Training on Infection Prevention and Control Principles - Course Assessment"]}]}