{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1397","title":"Treatment and Movement of a Patient in Physical Therapy","totalEnrolled":"11,128","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to provide pain relief, improve strength, increase range of motion and perform types of physical therapy.","description":"This free online physical therapy treatments course will teach you the safest and most effective ways of moving and transferring a patient who requires therapy. A physical aide has a very important role to play in caring for a patient, this physical therapy treatments course includes the specialist knowledge and training required to work as a physical therapy aide, and gives you a strong understanding of essential therapeutic exercise techniques.","courseOutcomes":["Discuss therapeutic exercises for lo...","Identify neurological illnesses that...","List the names of different bones in...","Identify the correct body mechanics ...","Discuss therapeutic exercises for lower back pain","Identify neurological illnesses that physical therapy can help alleviate","List the names of different bones in the human body","Identify the correct body mechanics for lifting activities","Explain the process of getting a patient from a sitting position to a standing position","Discuss different methods for transferring a patient to and from chairs, beds, wheelchairs, etc","Discuss what is involved in the different modalities for physical therapy treatments","Identify equipment for assisting with gait training","Discuss therapeutic exercises for lo...","Identify neurological illnesses that...","List the names of different bones in...","Identify the correct body mechanics ...","Discuss therapeutic exercises for lower back pain","Identify neurological illnesses that physical therapy can help alleviate","List the names of different bones in the human body","Identify the correct body mechanics for lifting activities","Explain the process of getting a patient from a sitting position to a standing position","Discuss different methods for transferring a patient to and from chairs, beds, wheelchairs, etc","Discuss what is involved in the different modalities for physical therapy treatments","Identify equipment for assisting with gait training"],"courseDescription":"<p>These different types of physical therapist courses will introduce you to the basic structure and function of the human body. You will study the musculoskeletal system, the cardiopulmonary system, the neurological system, the skeletal system, and the muscular system. You will learn about the different types of physical therapy, muscle tissue, common cardiopulmonary pathologies, and the difference between the axial skeleton and the appendicular skeleton. You will also look into different types of physical therapy and range of motion exercises as well as the most common nervous system disorders.</p><p>You will then study body mechanics and learn the proper turning and positioning of the patient. The physical therapy treatments course will discuss tips for lifting and methods for transferring. You will also learn what types of patients are at risk for decubitus ulcers which will help you spot problems faster. You will then look into the most commonly used modalities in physical therapy, which includes temperature and sound. You will also learn the benefits of therapeutic exercises.</p><p>Lower back pain is one of the most common ailments in patients who seek physical therapy treatments. This course will give you an in-depth understanding of the therapeutic exercises used to treat lower back pain. You will also learn how to apply correct body mechanics to ensure your safety as well as your patient's. So why wait? Take this course today and learn how to start helping patients improve their mobility with physical therapy movement, manage pain and chronic illness, or recover from injury.</p><a href=\"https://alison.com/resume/courses/1397\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1397\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Module 1 Basic Structure and Function of the Human Body","description":"This module teaches you about the basic structure and function of the human body including different types of muscle tissue, common cardiopulmonary pathologies, and the difference between the axial skeleton and the appendicular skeleton.","topics":["Basic Structure and Function of the Human Body: Learning Outcomes","Musculoskeletal System","Cardiopulmonary System","Neurological System & Neurological Illnesses","Skeletal & Muscle System","Basic Structure and Function of the Human Body: Lesson Summary"]},{"name":"Module","details":"Module 2 Turning and Positioning the Patient","description":"In this module, you will learn about Turning and Positioning the Patient including tips for lifting and methods for scooting transfers. You will also learn about pressure ulcers and bed mobility.","topics":["Turning and Positioning the Patient: Learning Outcomes","Introduction to Turning and Positioning the Patient","Body Mechanics: Lifting","Turning and Positioning the Patient: Lesson Summary","Transfers: Safely Moving Patients"]},{"name":"Module","details":"Module 3 Therapeutic Exercises, Agents and Modalities","description":"In this module, you will learn about therapeutic exercises, agents and modalities ranging from the use of crutches to hydrotherapy.","topics":["Therapeutic Exercises, Agents and Modalities: Learning Outcomes","Physical Therapy Agents and Modalities","Assisting with Gait Training","Therapeutic Exercises","Therapeutic Exercises, Agents and Modalities: Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course Assessment: Treatment and Movement of a Patient"]}]}