{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4266","title":"Treating Trauma using DBT","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online psychology course trains you to manage cognitive disorders using dialectical behavioural therapy.","description":"This free online course arms you with the knowledge required to manage and treat trauma and cognitive disorders. We explore the causes of cognitive disorders and how to manage them. We explain how to treat trauma using dialectical behavioural therapy techniques that draw on and enhance mindfulness, distress tolerance, emotion regulation and interpersonal effectiveness. Sign up to learn how to help people reconnect with their peers and themselves.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online course teaches you how to effectively manage and treat trauma like post-traumatic stress syndrome (PTSD) using dialectical behavioural therapy (DBT). We begin with a brief history of DBT and establish its value before demonstrating how it works. We draw a distinction between cognitive behavioural therapy (CBT) and DBT, despite their similarities. The course then examines psychotherapy and shows you how DBT aims to heal and treat trauma by teaching patients these four skills: mindfulness, distress tolerance, emotional regulation and interpersonal effectiveness.</p><p>We begin with mindfulness: the process of focusing attention on the present moment and situation. We explain how mindfulness can be harnessed to cope with negative situations and feelings and lay out three states of mind: ‘wise’, ‘reasonable’ and ‘emotional’. The course then moves on to distress tolerance and its role in treating trauma. We break down the idea of ‘radical acceptance’, which encourages people to accept things as they are and let go of feelings that cannot be reversed or are out of their control. We teach you how to employ the ‘IMPROVE’ skill to boost distress tolerance and remind patients of their own strength. The course lays out how to treat trauma using emotional regulation, which separates ‘primary’ and ‘secondary’ feelings. We explore interpersonal effectiveness to help people improve their social interactions as a sense of community can aid the management of trauma.</p><p>Trauma represents an emotional response to awful events that are hard to simply move past, like car accidents, natural disasters or violent crime. Initial reactions to trauma may include confusion, sadness, anxiety, numbness, dissociation, rage and confusion. Trauma can also harm mental health and this course trains you to treat PTSD using the new and exciting methods of DBT. Sign up to learn how to help people heal mental scars and escape the prisons built by fear and grief in their minds.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}