{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1781","title":"Ultimate Fitness System 3 - Gentle Stretching","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Discover how to transform your body and improve your stretching and flexibility with this free online course.","description":"The free online Ultimate Fitness System 3 - Gentle Stretching course is a video training course that makes stretching fun. It is for people at the beginner to intermediate levels. Start the course today and let fitness expert Emma K. show you the fun and painless way to get in the best shape of your life through gentle stretching techniques and exercises that are amazingly powerful and work fast.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Stop struggling! Stretching and exercise doesn't have to be hard. Fitness expert Emma K. will show you the fun and painless way to get in the best shape of your life through gentle stretching techniques and exercises that are amazingly powerful and work fast. This course is intended or people at the beginner to intermediate levels, although advanced students may find they can learn a few new moves too.</p><p>In this free online course you will learn what works and what doesn't work for exercise and stretching and why. The course shows you a fast, simple and easy approach to exercise and stretching that anybody can do. You'll learn how to perform gentle stretches, perfect for those who are not flexible at all, and how to gently breakthrough and develop a great stretch. The course teaches you a new way of thinking about and performing exercises and stretches.</p><p>Discover how to get into amazing shape with no strain. This system is great for all ages and ability levels. Everybody can do it. So start the course today and gain more flexibility than you ever thought possible, and have fun doing it.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}