{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1772","title":"Ultimate Fitness System 2 - Fitness, Endurance & Stretching","totalEnrolled":"7,987","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn a fun and painless way to get in the best shape of your life using gentle exercises in this free online course.","description":"This free online course Ultimate Fitness System 2 - Fitness, Endurance & Stretching is a video-based training course intended for people at beginner to intermediate levels. Fitness expert Emma K. makes it fun and painless to get in the best shape of your life through gentle exercises that are amazingly powerful and work fast. Once you have used the Ultimate Fitness System 2 your life will be transformed.","courseOutcomes":["Describe what works and what doesn't...","Explain a new way of thinking about ...","Describe a fast, simple and easy app...","Describe how to gently develop a gre...","Describe what works and what doesn't work for exercise and why","Explain a new way of thinking about and performing exercises","Describe a fast, simple and easy approach to exercise and stretching","Describe how to gently develop a great stretch","Describe what works and what doesn't...","Explain a new way of thinking about ...","Describe a fast, simple and easy app...","Describe how to gently develop a gre...","Describe what works and what doesn't work for exercise and why","Explain a new way of thinking about and performing exercises","Describe a fast, simple and easy approach to exercise and stretching","Describe how to gently develop a great stretch"],"courseDescription":"<p>Flextrim makes fitness fun! This free online course Ultimate Fitness System 2 - Fitness, Endurance &amp; Stretching is a video-based training course intended for people at beginner to intermediate levels, although advanced students may find they can learn a few new moves too!</p><p>Stop Struggling - Fitness and stretching doesn’t have to be hard. Fitness expert Emma K. makes it fun and painless to get in the best shape of your life through gentle exercises that are amazingly powerful and work fast. If you are just starting to exercise or you are looking for a truly unique way to get fit you have come to the right place. Once you have used the Ultimate Fitness System 2 your life will be transformed, so why wait? Start the course today!</p><a href=\"https://alison.com/resume/courses/1772\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1772\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Ultimate Fitness System 2","description":"This Section will Introduce you to the Instructors (Prof. Paul & Emma K.) and Teach You The Basic Principles Behind the Flextrim System of Exercise and Stretching.","topics":["Welcome To The Ultimate Fitness System 2"]},{"name":"Module","details":"Ultimate Fitness System 2 Workouts 1 - 3","description":"Ultimate Fitness System 2 – Fitness, Endurance & Stretching: This Video Is Intended For People At The Beginner To Intermediate Levels (Although Advanced Students May Find They Can Learn A Few New Moves Too!) Stop Struggling! Fitness & Stretching Doesn’t Have To Be Hard! Fitness Expert Emma K. Makes It Fun & Painless To Get In The Best Shape Of Your Life Through Gentle Exercises That Are Amazingly Powerful And Work Fast!","topics":["Ultimate Fitness System 2 Workouts 1 - 3"]},{"name":"Module","details":"Course assessment","description":"","topics":["Ultimate Fitness System 2 - Fitness, Endurance & Stretching - Course Assessment"]}]}