{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4837","title":"Understanding Social Care","totalEnrolled":"5,032","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the essentials of providing support for the vulnerable within your society in this free online course.","description":"‘Social care’ refers to a wide range of activities from child protection to end-of-life care for adults. At its core, social care involves providing care and support for the most vulnerable members of society such as the aged, children, the disabled or the mentally challenged. By taking this course, you will gain a rich understanding of the nature of social care work, including the duties, conduct and legal requirements of a care worker.","courseOutcomes":["Outline the legal requirements for s...","Distinguish between supervision and ...","Explain the ‘duty of care’ concept...","Classify difficult scenarios that co...","Outline the legal requirements for social care work","Distinguish between supervision and appraisal","Explain the ‘duty of care’ concept","Classify difficult scenarios that could be encountered by a care worker","Explain the role of effective communication in social care work","Identify different forms of communication used in social care","Outline the steps for conducting risk assessments for service users","Recall categories of potential food hazards","Summarise the possible effects of child abuse","Identify the elements of basic life support","Discuss techniques for dealing with stress","Describe the process for administering cardiopulmonary resuscitation (CPR)","Outline the legal requirements for s...","Distinguish between supervision and ...","Explain the ‘duty of care’ concept...","Classify difficult scenarios that co...","Outline the legal requirements for social care work","Distinguish between supervision and appraisal","Explain the ‘duty of care’ concept","Classify difficult scenarios that could be encountered by a care worker","Explain the role of effective communication in social care work","Identify different forms of communication used in social care","Outline the steps for conducting risk assessments for service users","Recall categories of potential food hazards","Summarise the possible effects of child abuse","Identify the elements of basic life support","Discuss techniques for dealing with stress","Describe the process for administering cardiopulmonary resuscitation (CPR)"],"courseDescription":"<p>Efforts by governments to cater to the support needs of the most vulnerable – such as the terminally ill, aged, mentally challenged and endangered children – make up social care. Social care personnel are responsible for providing the day-to-day care requirements of individuals who fall into this vulnerable category. To succeed as a care worker, you must understand elements of social care like the role and desired conduct of care workers, legal requirements for providing care and techniques for effective communication with service users. This course will provide you with all that.</p><p>We will begin by covering the duty of a care worker in detail. Here you will learn about the legal, health and safety and data protection requirements of care workers. You will also gain an understanding of the importance of people-centred conduct as well as diversity and equality in social care. Next, you will discover techniques for communicating with service users. You will master various types of communication, like speech, body language and so on, and learn to effectively communicate with those in your care.</p><p>You will be introduced to the various mental health conditions that you might encounter as a care worker, as well as techniques for catering to the nutritional requirements of service users. We will cover techniques for the full range of care from the basics of child protection to basic life support for the elderly. By the end of this course, you would have gained an in-depth understanding of the nature of social care as well as the duty and requirements of those tasked with providing it.</p><a href=\"https://alison.com/resume/courses/4837\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4837\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Understanding your Role and Duty","description":"In this module, we will go over the nature of a social care role. You will learn the responsibilities and duties of a social worker, as well as the legal requirements of the role. You will also be introduced to the concept of duty of care, and the importance of diversity and equality in social care work.","topics":["Understanding your Role & Duty – Learning Outcomes","Understand Your Role","Duty of Care","Diversity, Equality and Personal Development","Person-centred Conduct","Understanding your Role & Duty – Lesson Summary"]},{"name":"Module","details":"Communication, Nutrition and Mental Health","description":"In this module, we will go over communication, nutrition, and mental health within social care. You will learn different forms of communication, rules for handling food and fluids, and common mental health conditions you might experience in the course of social care work. You will also learn to carry out risk assessments for service users.","topics":["Communication, Nutrition and Mental Health – Learning Outcomes","Communication","Privacy and Dignity","Food Handling & Nutritional Needs","Mental Health, Dementia and Learning Disabilities","Communication, Nutrition and Mental Health – Lesson Summary"]},{"name":"Module","details":"Safety, Basic Life Support and Child Protection","description":"As a worker in social care, you might be faced with emergency situations, and it is important to know how to deal with such. In this topic, you will learn to perform procedures like first aid and CPR that could be critical to the survival of a care user. You will also learn about child abuse, and protecting children from abusive situations.","topics":["Safety, Basic Life Support and Child Protection – Learning Outcomes","Child Protection","Basic Life Support","Health and Safety","Handling Information","Safety, Basic Life Support and Child Protection – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Social Care – Course assessment"]}]}