{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3850","title":"Understanding Bipolar Disorder","totalEnrolled":"4,859","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to live with Bipolar Disorder and other mental challenges, and manage stigmatisation in this free online course.","description":"Whether you have mental health challenges of your own or know someone with a mental illness, it can be challenging to face. This free online course will equip you to better understand conditions like bipolar- and anxiety disorder. We'll explain its different phases and how it manifests itself. You'll learn how mental illnesses work and what you can do to remove the stigmas attached. Start this course today to make a positive difference.","courseOutcomes":["Recall the types of drugs used to tr...","Outline the different strategies use...","State the different levels of change...","Outline some practical and social is...","Recall the types of drugs used to treat Bipolar Disorder","Outline the different strategies used to recover from Bipolar Disorder","State the different levels of change required for social inclusion to take place","Outline some practical and social issues faced by individuals with bipolar experiences","Indicate some common myths about mental illness","Recognise the factors that cause school-related stress and how to reduce their effects","Explain what Bipolar disorder is","List the different types of anxiety disorders","Recall the types of drugs used to tr...","Outline the different strategies use...","State the different levels of change...","Outline some practical and social is...","Recall the types of drugs used to treat Bipolar Disorder","Outline the different strategies used to recover from Bipolar Disorder","State the different levels of change required for social inclusion to take place","Outline some practical and social issues faced by individuals with bipolar experiences","Indicate some common myths about mental illness","Recognise the factors that cause school-related stress and how to reduce their effects","Explain what Bipolar disorder is","List the different types of anxiety disorders"],"courseDescription":"<p>This course on understanding Bipolar Disorder is an introductory course that aims to highlight how mental illnesses work and what we can do to end the stigma surrounding mental illness in society. We also look into the different types of anxiety disorders. While mental illness is relatively common, most individuals will hide their status out of fear and possible rejection. But contrary to popular belief, someone who has a mental illness can function just like anyone else. Naturally, there will be days when their performance at work or in their daily lives might not be up to scratch. But the person in question might just need a break – just like anyone else. No one chooses to have a mental illness. That said, societal norms are not helpful to those who have a mental illness.</p><p>This course will explain how mental disorders work. You will gain a greater insight into the different types of bipolar and anxiety disorders and how episodes can be reduced or managed. We will also provide guidelines to support mentally ill patients with their treatment and recovery. For example, healthcare professionals recommend steps patients can take to aid in their recovery, like keeping track of their symptoms and avoiding alcoholic beverages. We'll also study how we can treat mental illness with therapy, medication or a combination of both. Many drugs are available to treat patients. However, therapists may prescribe medication depending on a patient's symptoms.&nbsp;</p><p>Anyone can become mentally ill, and it does not target any one group in particular. A person can look extremely happy on the outside but might be hurting on the inside as there rarely are any physical signs of mental illnesses. By being open about your status, you might be able to help to lessen the stigmatisation. Character flaws do not cause mental disorders. Mental illness has nothing to do with being inactive or inadequate. It is sensible to understand an individual's specific condition to know how to support them. Your mental health forms the basis of your emotions, reasoning, communication, learning, and self-esteem. Maintaining your mental health also is essential for personal and emotional relationships, which helps to contribute positively to society. Enrol for this course today and gain more insight into what causes mental disorders. It will also equip you to reduce the stigma surrounding mental illness.</p><a href=\"https://alison.com/resume/courses/3850\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3850\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Bipolar Disorder- Mental Illness, Risk and Treatment","description":"In this module, we will discuss the stigma and discrimination associated with Bipolar disorder. The different treatments available and the various medications that doctors may prescribe to aid a patient with Bipolar disorder.","topics":["Bipolar Disorder- Mental Illness, Risk & Treatment - Learning Outcomes","Bipolar Disorder","Mental Illness","Risk and Bipolar Experience","Treatment and Medication for Bipolar Disorder","Bipolar Disorder- Mental Illness, Risk and Treatment Lesson Summary"]},{"name":"Module","details":"Social Inclusion, Psychotherapy and Awareness","description":"In this module, we will discuss how to raise awareness about Bipolar disorder, define what Psychotherapy is, the different treatments available, and recognize the factors that cause school-related stress to reduce it.","topics":["Social Inclusion, Psychotherapy and Awareness - Learning Outcomes","Social Inclusion","Associated Problems That Frequently Co-occur with Bipolar Disorder","Strategies for Managing Symptoms of Bipolar","Psychotherapy for Bipolar Disorder","Raising Awareness About Bipolar Disorder","Social Inclusion, Psychotherapy and Awareness - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Bipolar Disorder - Course Assessment"]}]}