{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1853","title":"Understanding Mesothelioma: Causes, Symptoms, Diagnosis and Treatment","totalEnrolled":"2,575","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about Mesothelioma including its causes, symptoms and treatment options with this free online course.","description":"This free online Mesothelioma course will teach you about the causes, diagnosis, symptoms, and treatment of the Mesothelioma disease. This course aims to familiarise learners with the effects of Mesothelioma and the various environmental factors that influence the development of the disease. The course includes a test which will help you to cement your understanding of the disease, its development, and its treatment options.","courseOutcomes":["Define the four main types of mesoth...","Identify the primary causes and risk...","Recognize common symptoms for each t...","Outline how different mesothelioma c...","Define the four main types of mesothelioma","Identify the primary causes and risk factors mesothelioma","Recognize common symptoms for each type of mesothelioma","Outline how different mesothelioma cell types can impact diagnosis, prognosis and treatment options","List different techniques and testing procedures can be used to make a diagnosis of mesothelioma","Identify the main treatment options for mesothelioma","Define the four main types of mesoth...","Identify the primary causes and risk...","Recognize common symptoms for each t...","Outline how different mesothelioma c...","Define the four main types of mesothelioma","Identify the primary causes and risk factors mesothelioma","Recognize common symptoms for each type of mesothelioma","Outline how different mesothelioma cell types can impact diagnosis, prognosis and treatment options","List different techniques and testing procedures can be used to make a diagnosis of mesothelioma","Identify the main treatment options for mesothelioma"],"courseDescription":"<p>This free online course will help you to gain an in-depth insight and knowlegde of the disease Mesothelioma. This course will explain the causes and environmental factors that can increase the risk of developing Mesothelioma. The course will also identify the different types of Mesothelioma, such as Pleural, Peritoneal, Pericardial or Testicular Mesothelioma and their respective symptoms.</p><p>Lastly, the course will also explain how Mesothelioma can be diagnosed using different procedures and dicusses the most common treatment options that are currently available depending on the staging of the disease. This course will be of interest to anyone who wants to learn more about how Mesothelioma may be prevented, diagnosed and treated. So, why wait? Start learning more about Mesothelioma today!</p><a href=\"https://alison.com/resume/courses/1853\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1853\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Overview of Mesothelioma","description":"This module explains the different types of Mesothelioma and the symptoms related to each type. This module also explains the key causes and risk factors of Mesothelioma, as well as how to prevent exposure to asbestos. This module also explains how Mesothelioma can be diagnosed and its different stages. Lastly, this module also explains the various curative and palliative treatment options for Mesothelioma.","topics":["Overview of Mesothelioma - Learning Outcomes","Types of Mesothelioma and Symptoms","Causes, Risk Factors and Prevention","Diagnosis and Stages of Mesothelioma","Treatment Options","Overview of Mesothelioma - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Mesothelioma - Course Assessment"]}]}