{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1424","title":"Understanding the Ebola Virus: History, Treatment and Prevention","totalEnrolled":"5,154","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn vital information about the severe and often fatal hemorrhagic fever brought about by the Ebola virus.","description":"This free online course on understanding the Ebola virus focuses on the history, treatment and prevention of the illness. The virus is contracted from wild animals and spreads through transmission in humans. Serious outbreaks of the Ebola virus have occurred in West African countries, and infected individuals have also died in Spain and America. This course will guide you through clear, simple, and vital information about the Ebola virus.","courseOutcomes":["Outline the causes, effects and trea...","List signs and symptoms of the disea...","Summarize protocols for containing a...","Summarize protocols for treating the...","Outline the causes, effects and treatments of the disease","List signs and symptoms of the disease","Summarize protocols for containing and limiting transmission of the Ebola virus","Summarize protocols for treating the Ebola disease","Discuss World Health Organisation recommended precautions, designed to halt or slow down the Ebola disease","Summarize the use of 'ring vaccination', as part of a wider treatment strategy","Outline the causes, effects and trea...","List signs and symptoms of the disea...","Summarize protocols for containing a...","Summarize protocols for treating the...","Outline the causes, effects and treatments of the disease","List signs and symptoms of the disease","Summarize protocols for containing and limiting transmission of the Ebola virus","Summarize protocols for treating the Ebola disease","Discuss World Health Organisation recommended precautions, designed to halt or slow down the Ebola disease","Summarize the use of 'ring vaccination', as part of a wider treatment strategy"],"courseDescription":"<p>Formerly known as Ebola hemorrhagic fever, the first EVD outbreaks occurred in remote villages in Central Africa, near tropical rainforests. The 2014–2016 outbreak in West Africa involved major urban areas as well as rural ones. This course will first discuss where specifically the outbreak has occurred, what the signs and symptoms of infection are, how an infection can be treated, and how to avoid becoming infected. You will learn how community engagement can be the key to successfully controlling future outbreaks.<br><br>You will then learn about the mortality rate from the Ebola virus, which is extremely high. The course will discuss how an outbreak of the virus can result in serious consequences for the health of individuals who are infected by it, and consequences for the health resources of communities and countries where the outbreak occurs. You will also learn that good outbreak control relies on professional case management, reliable infection prevention and control practices, surveillance and contact tracing, good laboratory services, safe and dignified burials, and social mobilisation.<br><br>The Ebola virus causes an acute and serious illness which is often fatal if left untreated. With early supportive care with rehydration and proper treatment, the chances of a victim's survival can be greatly improved. This course will give you a better understanding of the disease as well as explain some common misunderstandings about the virus. By taking this course, you can keep yourself updated on how an outbreak can be prevented, controlled, and treated.</p><a href=\"https://alison.com/resume/courses/1424\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1424\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Recent Developments","description":"Two interactive presentations covering the following topics: WHO Emergency Committee; Ebola vaccine.","topics":["Recent Developments - Learning Outcomes","WHO Emergency Committee","Ebola Vaccine","Recent Developments - Lesson Summary"]},{"name":"Module","details":"Ebola History, Treatment & Prevention","description":"Two interactive presentations covering the following topics: Introduction and History; Transmission and Treatment.","topics":["Ebola History, Treatment & Prevention - Learning Outcomes","Introduction and History","Transmission and Treatment","Ebola History, Treatment & Prevention - Lesson Summary"]},{"name":"Module","details":"Protocols and Community Participation","description":"Two interactive presentations covering the following topics: Ebola Precautions; Engagement and Participation.","topics":["Protocols and Community Participation - Learning Outcomes","Ebola Precautions","Engagement and Participation","Protocols and Community Participation - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding the Ebola Virus - End of Course Assessment"]}]}