{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3397","title":"Understanding Epilepsy","totalEnrolled":"3,110","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course takes you through the symptoms, classifications, diagnosis and treatment of epilepsy.","description":"Most of the world’s roughly 50 million epileptics do not have access to treatment, medical attention or even information about their neurological disorder. This free online course identifies who is most susceptible to epilepsy and explains its causes and symptoms. We then examine the available tools for diagnosis and treatment and demonstrate the use of the electroencephalogram (EEG) to detect this long-misunderstood condition.","courseOutcomes":["Define ‘epilepsy’...","Classify epileptic seizures...","Discuss the symptoms and causes of e...","Explain how to diagnose epilepsy wit...","Define ‘epilepsy’","Classify epileptic seizures","Discuss the symptoms and causes of epilepsy","Explain how to diagnose epilepsy with an EEG","Utilize the international EEG electrode placement method","Tell ‘normal’ EEG readings apart from their epileptic counterparts","Define ‘epilepsy’...","Classify epileptic seizures...","Discuss the symptoms and causes of e...","Explain how to diagnose epilepsy wit...","Define ‘epilepsy’","Classify epileptic seizures","Discuss the symptoms and causes of epilepsy","Explain how to diagnose epilepsy with an EEG","Utilize the international EEG electrode placement method","Tell ‘normal’ EEG readings apart from their epileptic counterparts"],"courseDescription":"<p>For millennia, people have suffered through untreated neurological disorders like schizophrenia and epilepsy as the lack of medical information led their peers to believe that they were possessed by demons or evil spirits. Sadly, those suffering from such conditions were often shunned and mistreated and this continues in many communities today. Of the roughly 50 million people who suffer from epilepsy worldwide, more than 75% do not receive any treatment for their seizures, even in developed countries like the United States. This free online course takes you through the early warning signs of epilepsy and explains its symptoms, causes, diagnosis and treatment.</p><p>We begin with a brief history of epilepsy and the last century’s efforts to understand it. We go through the discovery of anti-epileptic drugs and the development of the electroencephalogram (EEG), a test that measures the brain’s electrical activity utilizing electrodes attached to the scalp. The course then defines ‘epilepsy’ and examines its symptoms before moving on to its classification. The International League against Epilepsy divides the disorder into three broad categories: focal, generalized and ‘unknown’ (when there is insufficient data for a solid diagnosis). We track their causes and differences to establish why such categorization is important. We then investigate how an epileptic seizure occurs in the brain and track the electrical signals caused by the seizure as they travel through the brain’s cortical circuits.</p><p>Understanding the behaviour of the abnormal synaptic activity that occurs in the brain before, during and after a seizure is important to illustrate how an EEG is used to diagnose and classify epileptic seizures. This course demonstrates EEG experimentation, including practical details like electrode placement and testing protocols. We show you how to compare EEG readings to distinguish between the brainwaves of a ‘normal’ brain and those created by its epileptic counterpart. We unpack medical terms like ‘epileptogenesis’, ‘epileptic aura’ and the ‘Jacksonian March’. The course then delves into contemporary efforts to widen access to epileptic diagnostic tools to those who need it most and explores current medical research attempting to discover new antiepileptic drugs. This course suits medical students or anyone who has a loved one who suffers from epilepsy. Sign up to take part in the worldwide effort to spread awareness of this treatable neurological disorder.</p><a href=\"https://alison.com/resume/courses/3397\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/3397\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Using EEG Data to Classify Epilepsy","description":"This module will demonstrate how to run simulations of six neurophysiological phenomena using simulation software known as MetaNeruon. It will also discuss the neurological conditions underlying epilepsy and how to use an EEG to diagnose this mental disorder.","topics":["Using EEG Data to Classify Epilepsy - Learning Outcomes","Introduction to Epilepsy","Diagnosing and Classifying Epilepsy with EEG","Using EEG Data to Classify Epilepsy - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Epilepsy - Course Assessment"]}]}