{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4669","title":"Understanding Obsessive-Compulsive Disorder (OCD)","totalEnrolled":"952","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to easily detect the symptoms of obsessive-compulsive disorder in this free online course.","description":"There is a thin line between normal anxiety levels and obsessive-compulsive disorder (OCD). Therefore, there is a chance of misdiagnosis of OCD. This course offers a detailed exploration of the symptoms and causes of OCD. Understanding the indicators and origin will ascertain if you or anyone you know exhibits these symptoms. Treatment and support help you, a friend or a family member cope with suffering from this mental illness.","courseOutcomes":["Describe obsessive-compulsive disord...","Recognise the impact of OCD on an in...","Describe obsessive-compulsive disord...","Define ‘cognitive behavioural therap...","Describe obsessive-compulsive disorder and all its subtypes","Recognise the impact of OCD on an individual’s quality of life","Describe obsessive-compulsive disorder in children","Define ‘cognitive behavioural therapy’ CBT and explain developmental issues in CBT","List the benefits of using CBT with kids and youths","Explain psychological methods for overcoming OCD","List the common types of OCD distortions","Discuss living with OCD and how to cope with a family member with OCD","Establish the importance of maintaining health and safety in the workplace","Describe obsessive-compulsive disord...","Recognise the impact of OCD on an in...","Describe obsessive-compulsive disord...","Define ‘cognitive behavioural therap...","Describe obsessive-compulsive disorder and all its subtypes","Recognise the impact of OCD on an individual’s quality of life","Describe obsessive-compulsive disorder in children","Define ‘cognitive behavioural therapy’ CBT and explain developmental issues in CBT","List the benefits of using CBT with kids and youths","Explain psychological methods for overcoming OCD","List the common types of OCD distortions","Discuss living with OCD and how to cope with a family member with OCD","Establish the importance of maintaining health and safety in the workplace"],"courseDescription":"<p>Obsessive-compulsive disorder (OCD) has a significant impact on a person's quality of life. The severity ranges from moderate to extreme and can wax or wane over time. People often worry about something or someone; however, recurring and intruding worries or anxieties over something particular is where the problem lies. At what point can stress be regarded as abnormal or excessive? How do I know if I or someone I know exhibits symptoms of OCD? We will investigate the psychological and biological factorial causes of OCD and its symptoms. This mental illness can affect men, women and even children. We will discuss popular treatment, principles, cognitive-behavioural therapy strategies and the benefits of using cognitive behavioural therapy (CBT) with children and youths. This course will also look at treating a child showing signs of this illness.</p><p>Living with OCD can be difficult and usually impacts the family in different ways. It can disrupt daily family life to a significant extent if left untreated. We will explore the ways a family can cope with a member diagnosed with OCD. We will explore different methods of treatment, effective relapse prevention and how to overcome OCD. Given that we spend so much time at work, it's hardly surprising that our mental and physical health can suffer. You will learn different ways of preventing your psychological and physical health from suffering from illness by enrolling in the health programs of your organisations.</p><p>Living with OCD can be difficult, demanding and exhausting because it can take up many hours of a person's day and may severely affect other aspects of daily life. This course is designed to enlighten you that OCD is a recognised and treatable mental health condition. Fully understanding what it is all about is the first step toward recovery. The insights provided in this course will help anyone living with an OCD patient by teaching you how to cope and aid them in getting treatment. Enrol in this course today and be a step ahead in all matters OCD.</p><a href=\"https://alison.com/resume/courses/4669\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4669\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Treatment of Obsessive-Compulsive Disorder","description":"In this module, you will be introduced to obsessive-compulsive disorders (OCD), you will gain an in-depth insight into the signs, symptoms, and causes of obsessive-compulsive disorders, and how to identify and treat specific OCD symptoms. This module will also teach you many methods of treatment for OCD and treating children with OCD.","topics":["Treatment of Obsessive-Compulsive Disorder - Learning Outcomes","Treatment of Obsessive-Compulsive Disorder","Identifying and Treating OCD","Treating Children with OCD","Treatment of Obsessive-Compulsive Disorder - Lesson Summary"]},{"name":"Module","details":"Overcoming and Living with OCD","description":"This module will teach you how to overcome OCD, effective relapse prevention, and recovery. You will learn about living with OCD, the impact of OCD in the family, how to cope with a family member suffering from OCD, insights on how to help a friend or family member conquer OCD as well as health, safety, and wellness in the workplace.","topics":["Overcoming and Living with OCD - Learning Outcomes","Overcoming OCD and Relapse Prevention","Living with OCD","Workplace Health and Safety","Overcoming and Living with OCD - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Obsessive-Compulsive Disorder (OCD) - Course Assessment"]}]}