{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4913","title":"Understanding Methamphetamine Addiction Disorder","totalEnrolled":"3,484","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches about Methamphetamine Addiction Disorder, its effects and available treatments.","description":"Nicknamed ‘crystal’, ‘zoom’, ‘crank’, ‘tweak’, ‘ice’ or simply ‘poor man's cocaine’, methamphetamine is a synthetic drug that affects the central nervous system. The abuse of this drug today is a widespread menace around the globe and a challenge to health and social workers. This course describes the current epidemic of methamphetamine abuse and helps you become familiar with the available psychosocial and pharmacological treatments.","courseOutcomes":["Explain methamphetamine addiction...","Describe the current epidemic of met...","Identify the cluster of biopsychosoc...","Indicate various psychosocial and ph...","Explain methamphetamine addiction","Describe the current epidemic of methamphetamine abuse and its multi-layered impact","Identify the cluster of biopsychosocial symptoms associated with acute and chronic meth use","Indicate various psychosocial and pharmacological treatments targeting methamphetamine addiction","Outline the clinical considerations for optimizing treatment among the four special subpopulations","Recognize various symptoms and patterns related to meth abuse","Discuss the impact of meth abuse on society, health, children, family and the economy","Explain methamphetamine addiction...","Describe the current epidemic of met...","Identify the cluster of biopsychosoc...","Indicate various psychosocial and ph...","Explain methamphetamine addiction","Describe the current epidemic of methamphetamine abuse and its multi-layered impact","Identify the cluster of biopsychosocial symptoms associated with acute and chronic meth use","Indicate various psychosocial and pharmacological treatments targeting methamphetamine addiction","Outline the clinical considerations for optimizing treatment among the four special subpopulations","Recognize various symptoms and patterns related to meth abuse","Discuss the impact of meth abuse on society, health, children, family and the economy"],"courseDescription":"<p>Whether swallowed as a pill, injected intravenously, snorted or smoked, methamphetamines present a significant public health problem worldwide. Second only to cannabis, the magnitude of abuse is disturbing. The mass availability and the low cost have added to the rapid and substantial increase in abuse. This problem has created a significant gap in trained social and health professionals who can understand the disorder and approaches to treatment. This course is a step to help close this void. It enables you to understand the symptoms and psychological, social and physiological aspects of methamphetamine abuse and familiarizes you with modern approaches to its management and treatment.</p><p>We have structured this course for an easy pace of learning. Divided into modules and topics, you will start learning about the origin of meth. Then, from its initial use to today's abuse, you will gain in-depth knowledge on the drug and discover the various symptoms and medical approaches towards therapies, pharmacological treatments and management of drug addicts and addiction. Finally, you will research the psychological, physiological, social, biological and pharmacological aspects of drug abuse and addiction management.</p><p>Meth is a hazardous and addictive substance that can cause addiction in as little as one single use. Unfortunately, today it is one of the largest sources of drug abuse and there is a lack of health and social professionals and workers trained even to recognize the primary symptoms of addicts. This course bridges that gap and raises the capacity of social workers, counselors, nursing assistants, therapists, mental health professionals and other stakeholders with a detailed understanding of abuse and all the symptoms and treatment approaches. This masterclass is also well suited for those who want to pursue addiction rehabilitation careers. Enroll in this course today.</p><a href=\"https://alison.com/resume/courses/4913\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4913\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Methamphetamine Addiction","description":"This module makes you familiar with Methamphetamine, its history, uses, and abuses. You get to learn every aspect related to METH, its addiction, and its symptoms. The lessons will help you understand the social, biological, psychological, and cognitive impacts and effects of METH abuse with the risks and costs to society.","topics":["Introduction to Methamphetamine Addiction – Learning Outcomes","Introduction and Brief History","METH Dependence and Psychosocial Sequelae","Risk Factors and Dysfunction in Abstinent Methamphetamine","Introduction to Methamphetamine Addiction - Lesson Summary"]},{"name":"Module","details":"Treatment and Therapies","description":"In this module, you learn about the various treatment options and therapies that help against methamphetamine abuse. You will get familiar with effective psychosocial and pharmacological interventions against METH addiction, with management and strategies for optimizing treatment outcomes and patient management.","topics":["Treatment and Therapies - Learning Outcomes","Treatment and Therapies of Methamphetamine Dependence","Pharmacotherapy and Management of Symptoms","Optimizing Treatment Outcomes and Prognosis","Treatment and Therapies - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Methamphetamine Addiction Disorder - Course Assessment"]}]}