{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4311","title":"Understanding Emotional Mastery","totalEnrolled":"1,815","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the science of emotions and provides proven techniques for managing emotions.","description":"In this short course, you will learn about emotions and proven techniques to help you manage them. You will study the science of emotions laid out by renowned scholars and methods for identifying the source of negative emotions and dealing with them. You will also learn about dialectic behavioural therapy (DBT) and cognitive behavioural therapy (CBT) techniques that could help you to manage your emotions effectively.","courseOutcomes":["Define ‘emotions’...","Match emotions to their adaptive fun...","Identify some functions of emotions...","Outline the categories of emotion th...","Define ‘emotions’","Match emotions to their adaptive functions","Identify some functions of emotions","Outline the categories of emotion theories","Recall some theories of emotion","Distinguish between the James-Lange and the Cannon-Bard emotion theories","Recall some classifications of emotions","Summarise the messages passed to us by various emotions","Describe the process of identifying stressors","Outline the steps for dealing with unpleasant emotions","Identify some techniques for managing emotions","Describe cognitive behavioural therapy (CBT) and dialectic behavioural therapy (DBT)","Define ‘emotions’...","Match emotions to their adaptive fun...","Identify some functions of emotions...","Outline the categories of emotion th...","Define ‘emotions’","Match emotions to their adaptive functions","Identify some functions of emotions","Outline the categories of emotion theories","Recall some theories of emotion","Distinguish between the James-Lange and the Cannon-Bard emotion theories","Recall some classifications of emotions","Summarise the messages passed to us by various emotions","Describe the process of identifying stressors","Outline the steps for dealing with unpleasant emotions","Identify some techniques for managing emotions","Describe cognitive behavioural therapy (CBT) and dialectic behavioural therapy (DBT)"],"courseDescription":"<p>This course covers emotions in depth and provides some techniques to help with managing them. We begin by defining ‘emotions’, providing some scientific explanations for them and identifying some of their functions. The course then proceeds to explain some existing theories of emotions like the James-Lange, Cannon-Bard and Facial Feedback theories. The first half of the course concludes by introducing some ideas on emotions based on cognition, such as the Schachter-Singer and Cognitive Appraisal Theory.</p><p>The second half of the course covers some emotion classifications and techniques for managing emotions. It begins with categories from Paul Ekman, Robert Plutchik and Gerrod Parrott. This section teaches what emotions tell us, how to identify the source of unpleasant feelings and how to deal with them. Finally, the course concludes by introducing practices like the ‘Accepts’ and ‘Dearman’ techniques, which have proven effective in managing emotions.</p><p>This course will help you improve your understanding of emotions and provide you with essential management techniques. The content would be helpful to anyone from psychology students to therapists or anyone looking to better understand their own emotions or those of others. Start this course now, master your own emotions and learn to manage them in three hours or less.</p><a href=\"https://alison.com/resume/courses/4311\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4311\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Science of Emotions – Foundations & Theories.","description":"In this module, you will be introduced to the science and functions of emotions, as well as important theories on emotions. This includes theories like the James-Lange and Cannon-Bard theories, and cognition-based theories like the Schafter-Singer and Cognitive Appraisal theories.","topics":["The Science of Emotions: Foundation & Theories – Learning Outcomes","Science and Functions of Emotions","Theories of Emotions","The Science of Emotions: Foundation & Theories – Lesson Summary"]},{"name":"Module","details":"Emotional Categories & Regulation Tools","description":"In this module, you will learn about various classifications of emotions, as well as identifying stressors and dealing with negative emotions. You will also learn about proven Cognitive Based Techniques and Dialectic Based Techniques for managing emotions.","topics":["Emotion Categories & Regulation Tools – Learning Outcomes","Categories of Emotions & Dealing with Emotions","Emotional Regulation Tools - CBT and DBT","Emotion Categories & Regulation Tools – Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Emotional Mastery – Course Assessment"]}]}