{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4561","title":"Understanding Epidemiology – Principles and Concepts","totalEnrolled":"2,978","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the principles and concepts of Epidemiology, the study of disease and health patterns.","description":"Since the onset of the global coronavirus pandemic, the importance of studying disease patterns among populations has been on the world stage. This short course will introduce you to Epidemiology, disease science and health outcomes in citizens. Delve into the role of epidemiologists, explore disease types, study design and outbreak investigations. You will also learn about risk factors, disease prevention and more.","courseOutcomes":["Define ‘Epidemiology’...","Outline the uses of Epidemiology...","Recall some classifications of study...","Discuss aspects of epidemiological s...","Define ‘Epidemiology’","Outline the uses of Epidemiology","Recall some classifications of study design","Discuss aspects of epidemiological study design","Identify disease types","Explain the importance of studying disease variations","Define ‘disease clusters’","Outline the steps involved in investigating disease outbreaks","Identify some measures of risk and disease frequency","Discuss some methods for disease prevention","Explain the role of Epidemiology in public health and disease prevention","Summarise the epidemiological concept of population","Define ‘Epidemiology’...","Outline the uses of Epidemiology...","Recall some classifications of study...","Discuss aspects of epidemiological s...","Define ‘Epidemiology’","Outline the uses of Epidemiology","Recall some classifications of study design","Discuss aspects of epidemiological study design","Identify disease types","Explain the importance of studying disease variations","Define ‘disease clusters’","Outline the steps involved in investigating disease outbreaks","Identify some measures of risk and disease frequency","Discuss some methods for disease prevention","Explain the role of Epidemiology in public health and disease prevention","Summarise the epidemiological concept of population"],"courseDescription":"<p>Epidemiology is often described as ‘public health science’ as it examines health and disease patterns among populations. In the wake of various epidemics and a pandemic in the last decade, it is clear that this science is of utmost importance. This course will cover some concepts and principles in Epidemiology and outline the process of carrying out studies in the scientific discipline. It begins with an introduction to Epidemiology, highlighting its importance, regulations and the basics of designing epidemiological studies.</p><p>Next, you will learn about diseases' occurrence, types, and variations by place, time and person. You will discover ‘disease clusters’ and the process involved in investigating outbreaks. We will expose you to the measures of risks, disease frequency and methods for disease prevention. Finally, study the role of Epidemiology in public health and disease prevention and the concepts of population and demography as they relate to the field of Epidemiology.</p><p>The concepts and principles covered in this course would be fundamental to prospective public health professionals looking to understand Epidemiology. Public health experts would also find this helpful as reference material. Anyone looking to understand epidemics, the process of disease spread, disease patterns and disease prevention in a population would find this course useful. Start the course now and in three hours or less, you will gain insight into health, disease patterns and the process of studying them.</p><a href=\"https://alison.com/resume/courses/4561\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4561\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introduction to Epidemiology and Study Design","description":"In this module, you will be introduced to the field of epidemiology and would learn about its importance, principles, and ethics. You will also learn about the process of designing Epidemiological studies, as well as the classification of study types. Finally, you will learn about the occurrence, types, and variations of diseases.","topics":["Introduction to Epidemiology and Study Design – Learning Outcomes","Introduction to Epidemiology","Study Design","Disease Occurrence","Introduction to Epidemiology and Study Design – Lesson Summary"]},{"name":"Module","details":"Epidemics, Outbreaks and Disease Prevention","description":"In this module, you will be introduced to the concept of an epidemic, and related concepts like rare disease clusters. You will also learn the process of investigating outbreaks, and measuring risks and disease frequency. Finally, you will learn the role of Epidemiology in preventing diseases, as well as the Epidemiological concept of population.","topics":["Epidemics, Outbreaks and Disease Prevention – Learning Outcomes","Epidemics and Outbreaks","Risk, Disease Prevention and Frequency","Epidemiology and Public Health","Epidemics, Outbreaks and Disease Prevention – Lesson summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Understanding Epidemiology – Principles and Concepts – Course assessment"]}]}