{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/3031","title":"Vegan Diet - Healthy Lifestyle","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Look and feel better and discover the hidden health benefits of a Vegan Diet with this free online course.","description":"There are many health benefits to a vegan lifestyle and in this free online course on the vegan diet, you will learn how professionals and sportspeople use this diet to get healthy and strong. Explore specific vegan diet workout plans, testimonials of vegan athletes, the dietary outlines and recommendations, tips for transitioning into Veganism and debunk common myths in this free online vegan diet course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you would like to learn the intricacies and health benefits of Veganism and the vegan diet in particular, then this free online vegan diet course is perfect for you. The first part of this vegan training course focuses on the many benefits of the vegan diet. and highlights how athletes and even muscle builders can get all the nutrients and proteins they need from a vegan diet, despite the many myths. This section of the training is designed to debunk those myths and give you accurate information, whether you are an athlete or just want to look and feel great. Top world athletes like Serena Williams and Mike Tyson have used a vegan diet and got great results. Students will discover that the vegan diet has a ton of health benefits and backed up by multiple prominent research studies, it has been proven that a vegan lifestyle can lower the risk of cardiac events, reduce the risk of developing certain cancers and lower an individual’s chance of Type 2 Diabetes. Not only that, but it helps with regulating one’s metabolism, weight and can stave off certain weight-induced phenomena, such as hypertension. A vegan lifestyle has also proven to reduce someone’s risk of stroke.</p><p>In the second part of this vegan course, you will learn how to deal with any deficiencies in a vegan diet due to the loss of meat and dairy. There are plenty of vegan sources that can supplement the loss of the very important macro- and micro-nutrients provided by dairy and animal byproducts and this course covers this in great detail. Students will also be shown many tips and suggestions on how to get their vegan lifestyle started in order to maximize results and to help avoid pitfalls. You will also be provided with a workout regime tailored for the vegan diet including solid research in order to make the transition to the vegan lifestyle easier.</p><p>If you already know you want to go vegan for personal or ethical reasons or if you simply want to add more fruits and vegetables into your diet then this free online Vegan Diet - Healthy Lifestyle course is exactly where you should start.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}