{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/4224","title":"Veganism Lifestyle and Nutrition","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course shows you how to safely transition to a vegan diet without sacrificing your health and comfort.","description":"You might be considering becoming a vegan for health, environmental, moral or any other personal reason. This free online course helps you make the transition. We explore vegan nutrition and explain how to make sure you get all of the vitamins and minerals you need while on a vegan diet. We also delve into the vegan lifestyle and discuss how to get through a pregnancy and raise children as vegans.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>We have always been aware of the connection between meat consumption and diseases such as diabetes and cardiovascular disease, but it seems that the global Covid-19 pandemic enhanced worldwide awareness of this connection - which may explain the 40 percent rise in vegans in the UK alone over the last year. You might be one of the millions who are considering a shift of diet but wonder whether you can make the transition. The truth is that being vegan is easier than you might think: you just need the proper guidance and determination. This course teaches you all about vegan nutrition, making the transition and substituting common ingredients with healthier vegan options. We begin with an overview of various vegan diets, how to live with non-vegans and why your new diet is healthy. We then help you understand how the vegan movement creates conscious awareness of the impact that modern farming practices and the meat industry has on public health and the environment.</p><p>The course then describes the necessary vitamins and minerals you need to include in your diet. Many new vegans find it difficult to satisfy their nutritional needs without taking supplements but this course teaches you what foods to eat to ensure you are getting enough nutrients. Contrary to popular belief, this includes protein and healthy fats, which are possible to obtain on a vegan diet. We go over the types of vegan food that are rich in protein and healthier than meat products. We then show you how to become a ‘food detective’ when you go to the supermarket. Become familiar with the ingredients that can serve as substitutes for meat, eggs and dairy. We demonstrate the importance of planning your meals, explain how to prepare recipes using tofu and identify the ingredients that every vegan should have in their kitchen. We also discuss what ingredients you should avoid and why.</p><p>The course then explores how being vegan is not just about what you choose to eat but a way of life as you learn how to make sure that no animals are abused due to your choices. This involves avoiding using leather products, beauty aids and cosmetics that were animal tested, bee products and down bedding that contains animal parts. We provide gardening methods that work with nature, not against it, and demonstrate how to garden without using harmful pesticides. The course lays out how to create your vegan cleaning products to avoid the use of toxic chemicals. Finally, we address pregnancy and child nutrition. It is entirely healthy and possible to get through pregnancy on a vegan diet as long as you follow the guidelines provided in this course and make sure you talk to your doctor. It is also perfectly healthy for children to be vegan but you should learn how to make vegan foods exciting and tasty for them. If you’ve been considering going vegan, take the first step and sign up for this free online course to make a wonderful life change.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}