{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5202","title":"Water Treatment and Purification","totalEnrolled":"2,761","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how the principles of water chemistry drive its treatment and purification processes in this free online course.","description":"They say that ‘water is life’. It is one the most important compounds on Earth and consists of two chemical elements: hydrogen and oxygen. However, it is important to check and maintain water purity to protect health and the environment. This course explores water’s hygiene and other qualities and compares ‘hard’ and ‘soft’ water. We then conduct a chemical analysis of major and minor ions and explain laboratory hazard management.","courseOutcomes":["Discuss some of the physical propert...","Identify the effects of alkalinity i...","Distinguish between primary and seco...","Outline the causes of ‘hardness’ in ...","Discuss some of the physical properties of water","Identify the effects of alkalinity in water","Distinguish between primary and secondary settlers","Outline the causes of ‘hardness’ in water","List the significant elements in natural water","Discuss the properties of metals and metalloids","Explain how to control water-related hazards in the laboratory","Demonstrate how a chemical hygiene plan protects health and safety in a laboratory","Discuss some of the physical propert...","Identify the effects of alkalinity i...","Distinguish between primary and seco...","Outline the causes of ‘hardness’ in ...","Discuss some of the physical properties of water","Identify the effects of alkalinity in water","Distinguish between primary and secondary settlers","Outline the causes of ‘hardness’ in water","List the significant elements in natural water","Discuss the properties of metals and metalloids","Explain how to control water-related hazards in the laboratory","Demonstrate how a chemical hygiene plan protects health and safety in a laboratory"],"courseDescription":"<p>Water (H2O) is a clear, odourless, tasteless liquid that freezes at 32°F or 0°C and boils at 212°F or 100°C. It is essential for health, food production and environmental management. This course teaches you the chemistry of water and water purification processes. We examine water’s basic properties, such as alkalinity and ‘hardness’, and lay out the fundamental principles used in its treatment.</p><p>The course breaks down each step of water purification, including neutralisation and the flotation and reduction processes. We study water’s inorganic substances and conduct a chemical analysis of major and minor ions. We explain how to control the health impacts of volatile organic compounds and synthetic organic compounds. The course then moves on to metalloids, the effects of heavy metals and the pollution control measures used to mitigate them. Finally, we explain how to implement a chemical hygiene plan and employ effective safety measures in the laboratory.</p><p>The importance of safe drinking water in promoting health cannot be overstated. Chemical contamination has been identified as one of the most significant water pollutants and poses a serious health risk. This course explains water purification processes by exploring the chemistry and treatment principles that drive them. We also identify the conditions that water must meet before it can be safely drunk. Sign up to improve your understanding of the chemistry of water and the treatment and purification process that make it safe for human consumption. These principles are crucial in civil engineering efforts to protect our most precious natural resource.</p><a href=\"https://alison.com/resume/courses/5202\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5202\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Water Chemistry and Treatment","description":"In this module, you will be introduced to the properties of water, you will learn about alkalinity and the treatment of water hardness, and you will also learn the water treatment and purification processes as well as the chemical processes of water treatment.","topics":["Water Chemistry and Treatment - Learning Outcomes","Basic Concepts of Water Chemistry","Alkalinity and Treatment of Hard Water","Water Treatment and Purification Processes","Water Chemistry and Treatment - Lesson Summary"]},{"name":"Module","details":"Safety and Hazard Management","description":"In this module, you will learn about inorganic chemicals and organic compounds, as well as how to reduce your exposure to VOCs and SOCs. discover the effects of heavy metals, and pollution control measures, and learn how to recognize and manage hazards and laboratory safety precautions.","topics":["Safety and Hazard Management - Learning Outcomes","Inorganic Chemicals and Organic Compounds","Metals and Metalloids","Laboratory Safety and Chemical Hygiene Plan","Safety and Hazard Management - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Water Treatment and Purification - Course assessment"]}]}