{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/5354","title":"Weight-loss Strategies","totalEnrolled":"1,144","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online nutrition course explains how a healthy diet can help you to lose weight to look and feel your best.","description":"Today’s technology and lifestyles provide us with comfort but also increase the likelihood of problems like obesity. Increased screen time and consumption of processed foods make it harder to control one’s weight. This course explains how to create a hassle-free weight-loss programme that meets your nutritional needs. Most people give up on their diets so let the experts help you to stick to one that leaves you feeling and looking your best.","courseOutcomes":["Analyse and debunk common myths rela...","Evaluate the ‘weight-loss pyramid’ a...","Compare the benefits of various food...","Identify the essential components of...","Analyse and debunk common myths related to weight-loss programmes","Evaluate the ‘weight-loss pyramid’ and explain how to implement it","Compare the benefits of various foods that help weight reduction","Identify the essential components of an effective weight-loss plan","Discuss how to draw up an eating schedule that helps you to lose weight","Describe the role of carbohydrates, proteins and fats in making up a healthy and balanced diet","Contrast healthy fat types with their unhealthy counterparts","Summarise the role of five effective fat-burning chemicals","Analyse and debunk common myths rela...","Evaluate the ‘weight-loss pyramid’ a...","Compare the benefits of various food...","Identify the essential components of...","Analyse and debunk common myths related to weight-loss programmes","Evaluate the ‘weight-loss pyramid’ and explain how to implement it","Compare the benefits of various foods that help weight reduction","Identify the essential components of an effective weight-loss plan","Discuss how to draw up an eating schedule that helps you to lose weight","Describe the role of carbohydrates, proteins and fats in making up a healthy and balanced diet","Contrast healthy fat types with their unhealthy counterparts","Summarise the role of five effective fat-burning chemicals"],"courseDescription":"<p>Technology has benefited our modern lifestyles but it also has its downsides as we spend more time sitting in front of screens. This has led to a widespread rise in levels of obesity, which is a direct cause of many diseases and ailments like cardiovascular trouble, insulin resistance, hormonal problems and so on. Obesity places an increasing strain on our hospitals and healthcare systems and is a severe public health problem. Nevertheless, people are more likely to reverse obesity and reduce their weight if they are guided, trained and mentored effectively.</p><p>The experts at Element Recipe have designed this course to teach you how to develop an effective strategy to counter this global problem by harnessing cutting-edge scientific research. It suits professional nutritionists or dieticians or anyone looking to reduce their own weight. Our single module is divided into four topics. Each topic explains an essential component of drawing up an effective weight-loss programme. We begin by debunking some common misconceptions surrounding weight before comparing the nutritional importance of carbohydrates, proteins and fats.</p><p>The course then goes over guidelines regarding the consumption of carbohydrates, proteins and fat that have been drawn up by reputable international health organisations. We break down each level of the ‘weight-loss pyramid’ and explain how it can inform a successful weight-loss strategy. We then show you how natural elements can help you to lose weight. This course is ideal for gym trainers, clinicians, dieticians, nutritionists or other professionals who help clients with their bodies. It can also help you or your loved ones to stay healthy while losing weight. Sign up to learn the science behind body mass and to draw up a weight-loss strategy that leaves you looking and feeling great.</p><a href=\"https://alison.com/resume/courses/5354\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/5354\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"The Science of Weight Loss","description":"This module provides several crucial considerations that can help you develop an effective weight-loss program. It will teach you to counter various weight-loss myths with solid scientific backing. It will also help you to create and implement an effective weight reduction plan. Lastly, it also discusses the importance of proteins, fats, and carbs.","topics":["The Science of Weight Loss - Learning Outcomes","Weight Loss Myths and Misconceptions","How to Create an Effective Weight Loss Plan","Carbohydrates, Proteins, and Their Dietary Consumption","Dietary Fat Consumption and Fat Reducing Foods","The Science of Weight Loss - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Weight Loss Strategies - Course Assessment"]}]}