{"subjectName":"Health","subjectDescription":" Alison's range of free online Health courses explores highly important aspects of physical fitness and mental wellbeing, as well as caring for others. Young or old, healthy or sick, our health plays a significant part in our lives. Whether you are looking for free he... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/health.jpg","resumeLink":"https://alison.com/resume/courses/1779","title":"Workstation Ergonomics","totalEnrolled":"4,776","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn to identify the key factors that can affect your workstation ergonomics.","description":"This free online course in Workstation Ergonomics teaches you about the physical and environmental ergonomics factors, proper posture and seating positions, and musculoskeletal disorders that result from bad ergonomics. Ergonomics is the study of people's efficiency in their working environment. With this course, you will learn how it helps improve productivity and performance at work, prevent illnesses, and reduce physical strain/injury.","courseOutcomes":["Define ergonomics...","Identify the key factors that can af...","Recognise the key factors for effect...","Identify the types of equipment that...","Define ergonomics","Identify the key factors that can affect workstation ergonomics","Recognise the key factors for effective VDU use","Identify the types of equipment that can create an ergonomic workstation","Recognise the physical factors that impact on an ergonomic workstation","Identify the environmental factors that affect workstation ergonomics","Apply ergonomic theory to realistic situations in the workplace","Choose appropriate solutions to ergonomic problems in a workplace","Recognise Muscoloskeletal Disorders (MSDs)","Describe methods of preventing MSDs in the workplace","Outline appropriate solutions to prevent MSDs in the workplace","Define ergonomics...","Identify the key factors that can af...","Recognise the key factors for effect...","Identify the types of equipment that...","Define ergonomics","Identify the key factors that can affect workstation ergonomics","Recognise the key factors for effective VDU use","Identify the types of equipment that can create an ergonomic workstation","Recognise the physical factors that impact on an ergonomic workstation","Identify the environmental factors that affect workstation ergonomics","Apply ergonomic theory to realistic situations in the workplace","Choose appropriate solutions to ergonomic problems in a workplace","Recognise Muscoloskeletal Disorders (MSDs)","Describe methods of preventing MSDs in the workplace","Outline appropriate solutions to prevent MSDs in the workplace"],"courseDescription":"<p>It is important for those who spend long periods of time working with computers to know about workstation ergonomics, also known as DSE. This course demonstrates the recommended way to use computer equipment in a safe and healthy way. Given the widespread use of computers at work and beyond, this course is increasingly vital in today's world.</p><p>The course starts of with introducing you to what Ergonomics is and dose, briefly describes its benefits and then discusses the factors affecting workstations ergonomics. After which the course will delve into using visual display units correctly and effectively, and will guide you through equipment that can be used for an ergonomic workstation.</p><p>Next the course begins discussing the physical factors in workstation ergonomics followed by the environmental factors. Lastly the course speaks of musculoskeletal disorders, teaching you about how to recognize them, preventing them and presents a case study on musculoskeletal disorders.</p><p>This course would be of great interest to anyone working in an office environment to improve their posture, health or performance in work.</p><a href=\"https://alison.com/resume/courses/1779\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1779\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Introducing Workstation Ergonomics","description":"In this module, you will be introduced to ergonomics, and to the factors affecting workstation ergonomics. This module will explain what ergonomics is and how it can be used to improve the way you use your computer workstation. By studying this module, you will be able to identify the key factors that affect workstation ergonomics.","topics":["Introducing Workstation Ergonomics - Learning Outcomes","Introduction to Ergonomics","Factors Affecting Workstation Ergonomics","Introducing Workstation Ergonomics - Lesson Summary"]},{"name":"Module","details":"Designing an Ergonomic Workstation","description":"In this module, you will learn about using a visual display unit (VDU) and other equipment. You will be able to recognise the key factors for effective VDU use and you will also learn to identify the types of equipment that can create an ergonomic workstation.","topics":["Designing an Ergonomic Workstation - Learning Outcomes","Using a VDU Effectively","Equipment for an Ergonomic Workstation","Designing an Ergonomic Workstation - Lesson Summary"]},{"name":"Module","details":"Physical and Environmental Ergonomic Factors","description":"In this module, you will learn about the physical and environmental factors affecting workstation ergonomics. You will be able recognise the physical and environmental factors that impact on an ergonomic workstation. This module presents a case study concerning ergonomic workstation design which will help you learn to choose appropriate solutions to ergonomic problems in a workplace.","topics":["Physical and Environmental Ergonomic Factors - Learning Outcomes","Physical Ergonomic Factors","Environmental Ergonomic Factors","Case Study – Ergonomics","Physical and Environmental Ergonomic Factors - Lesson Summary"]},{"name":"Module","details":"Musculoskeletal Disorders (MSDs)","description":"In this module , you will learn about recognizing and preventing MSDs. This module also features a case study concerning the prevention of MSDs in the workplace which will allow you to examine a realistic situation in the workplace. You will learn to choose appropriate solutions to prevent MSDs in the workplace.","topics":["Musculoskeletal Disorders (MSDs) - Learning Outcomes","Recognizing Musculoskeletal Disorders (MSDs)","Preventing Musculoskeletal Disorders (MSDs)","Case Study - Musculoskeletal Disorders (MSDs)","Musculoskeletal Disorders (MSDs) - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Workstation Ergonomics - Course Assessment"]}]}