{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/4698","title":"Basic Concepts and Techniques for Copywriting","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the craft of skillfully writing compelling marketing copy that engages and sells with this free online course.","description":"The written word can be compelling. Phrases have the power to persuade, motivate and move people to action, but only when written skillfully. Through this course, master the art of expertly writing persuasive, professional and winning marketing ideas. This course takes the mystery out of choosing the appropriate words to sell an idea, product or event to bring in business and drive profit for you and your client.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you an aspiring writer looking to make a living in professional marketing or copywriting? If you want to gain or improve your promotional writing skills, this course is for you. It teaches all the fundamental concepts and methods to write compelling and engaging marketing copy that motivates and persuades readers. Copywriting is a distinct skill with time-tested principles that enable you to get decent results knowing just the basics. Of course you might already know the principles but we have categorised all the skills in an innovative format of modules and topics to ease your learning. Marcia Yudkin, an experienced copywriter with a wealth of knowledge, is your tutor. She has mentored dozens of aspiring freelancers and business owners in marketing writing.</p><p>This practical course includes essential concepts such as ‘features versus benefits’, headlines and leads, a ‘dramatisation of differences’, credibility builders, ‘social proof’, offers and tone. The real-world examples and practical exercises are other distinguishing features, giving you three real-life writing assignments and the opportunity to compare what you wrote with others’ efforts. Commentary afterward points out many fine particulars to keep in mind. In just a few hours, you acquire basic knowledge and valuable practice in applying copywriting principles to real situations.</p><p>Learn to sell with words whether you seek a solid credential in marketing and public relations, work on a website, project, blog, catalogue or email to customers or want people to opt into a newsletter or sign an online petition. The course includes everything you need to know to start writing any promotional piece and completing it with all the elements it needs. No prior knowledge of copywriting is necessary for the course. Instead, take advantage of this opportunity to practise and improve your business writing skills. Join the course and become a winning copywriter who can persuade, inspire, charm and motivate readers to take the desired action.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}