{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/5189","title":"Basics of Social Media Marketing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you how to use social media as a branding, marketing and sales promotion tool.","description":"Do you want to turn your social media account into a concrete marketing and sales machine? This digital marketing course explains how to harness social media to build up your personal or business brand. We demonstrate how to generate leads, raise brand awareness, improve customer support and increase sales conversion. The course provides proven business promotion and brand marketing strategies for Facebook, YouTube, Twitter, Pinterest and Quora.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>‘Social media’ is a collective term for websites and applications with a focal point on communication, community-based input, interaction, content-sharing and collaboration. It is a modern global phenomenon that has become a useful tool for building brand equity, customer loyalty and overall business performance. Social media marketing involves the use of social networks to market a company's products and services. This digital marketing course explains how to connect with and engage potential customers through Facebook, YouTube, Twitter, Pinterest and Quora.</p><p>The course begins with an overview of the history of social media. We then discuss vital discoveries from research into social media marketing. Understanding and responding to your customer's requirements is the foundation of a successful sales process. We therefore establish the role of sales psychology in social media marketing and lay out its seven fundamental principles. We describe the characteristics of effective online content that helps you build your personal brand as an expert in your industry.</p><p>We then cover search engine optimisation (SEO) and explain its definition, benefits, on-site and off-site strategies and use of metrics to measure performance. We examine Facebook’s ad formats, effective marketing strategies and the benefits of marketing on the platform. The course shows you how to use YouTube and Twitter marketing to promote your brand before providing nine tips for Pinterest messaging. We also go through the best ways to use Quora for marketing research to create the best branding and marketing strategy. This digital marketing course helps you to promote your personal or business brand and showcase your skills and services with social media marketing. Enrol now to learn how to turn your online content into sales and brand awareness.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}