{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/4237","title":"Branding 101 for Small Businesses","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the art of branding and learn how to make a name for your small business in this free online marketing course.","description":"This free online course explains how to cheaply build up the brand of your small business. We show you how to identify your customers' needs and desires and develop a solution that solves their pain point. We then break down the development of a ‘unique selling proposition’ to create a company identity with a distinctive, bold personality. We also cover the presentation of your brand's visual elements, including a logo and product photography.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online marketing course takes you through the steps involved in building a likable and memorable brand on a limited budget to help your small business make a profit. We can help you become a more strategic entrepreneur and equip you with the tools and knowledge you need to succeed. We cover the core fundamentals of successful marketing and branding for small companies, starting with an explanation of what branding is and what it isn't. This single understanding can set you apart from other businesses as they get misled by tactics that don't matter to the customer. Once we’ve established the basic principles of branding, we go through the steps every new customer goes through to recognize your brand and buy your product. The course takes you through the ‘AIDA’ process that tracks awareness, interests, desires and action and demonstrates how to set up your business for each step.</p><p>We also explain how to research, analyze and define your target customers' wants and needs to develop a ‘unique selling proposition’ (USP) that grabs their attention. We demonstrate how to conduct a ‘SWOT’ analysis that identifies strengths, weaknesses, opportunities and threats. This provides competitive intelligence for winning over your competition's customers while satisfying market demands. The course helps you to develop your brand vision, mission, values and an interesting story that connects with your customers and sells your product emotionally.</p><p>Once you’re confident about laying solid foundations for your brand, we go through examples and case studies of the development of the world's most successful brands, including Nike, Apple and Coca-cola to demonstrate how to build a unique and bold personality around your brand that connects with customers. This can attract a specific group of premium customers and convince them to buy more of your products. We delve into the tactics surrounding the creation of your brand’s visual elements: choosing a logo, picking the right colour palette and taking professional product photographs. This course arms you with proven strategies, tools and tactics to build a small business brand on a minimal budget. We can help you make a name for your company and set it on the path to success.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}