{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/3830","title":"Digital Advertising and Marketing 301","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course delves into digital marketing basics, location targeting, retargeting and real time bidding.","description":"Marketing has always been about connecting with your audience in the right place and at the right time. Today, that means you need to meet them where they spend more time and are easily accessible: the internet. Learn the basics of online advertising, location targeting, beacons, retargeting, RTB (Real Time Bidding) and all the other ins and outs of digital marketing so you can open new markets and springboard your marketing efforts.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Globally the number of internet users increased from only 413 million in the year 2000 to over 4.6 billion at the start of 2021. Digital marketing and advertising helps you reach a larger audience than you could through traditional methods, and target the prospects who are most likely to buy your product or service. Additionally, it's often more cost-effective than traditional advertising and allows you to measure success on a daily basis. Digital marketing enables you to identify and target a specific audience and send that audience high-converting and personalized marketing messages. This free online digital marketing certificate begins by introducing you to location targeting: location-based marketing allows organizations to target consumers at a personal level with online or offline messaging based on their physical location. Using location data, marketing teams are able to reach consumers based on qualifiers like proximity to a store, events happening in their region, or trends. This digital marketing course analyzes the difference between a demand-side platform and a supply-side platform with the aid of real-life examples of how to set up a campaign on these platforms.&nbsp;</p><p><br>Beacon Marketing offers companies unique and interesting ways to engage with customers. With the aid of beacons, brands are growing their presence by creating multiple touchpoints. These touchpoints in turn help them implement proximity marketing and earn customer loyalty by providing personalized services to their customers. Retargeting allows you to keep your brand in front of your potential customers after they have left your website and you will learn all about how this important digital marketing concept works. Next up in this online marketing course, you will cover bid requests and research. The bid request is an essential part of the advertising environment and the exchange of information between publisher and advertiser is possible because of the bid requests. However, it is important for you as a publisher to understand the concept of ad bids thoroughly as nowadays many people use this concept to conduct fraudulent activities. AdBlocking is a software capability for blocking or altering online advertising in a web browser or an application and you will conclude this digital marketing training by learning about the history of AdBlocking, trends, and industry response to AdBlocking. Understanding how people feel about your brand helps you keep your marketing and product development efforts on track. It also allows you to respond right away to positive or negative posts. All this is possible with Social Listening, by the end of this course you should be able to apply social listening in finding out what people are saying about your brand.</p><p>Knowing and understanding digital marketing basics is a critical part of any marketing plan. Given its highly technical nature, this online marketing course will help set you up for success by teaching you methods, techniques and practical applications of online marketing.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}