{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/3833","title":"Digital Advertising and Marketing 101","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Beginners will be taken through all the crucial basics of digital marketing and online advertising in this free course.","description":"This free online course has been developed to introduce you to the world of digital and online advertising. You will first learn the basics of digital media before exploring the influence of online marketing and advertising on businesses. By the end of this course, you will have a solid grasp of the different types of digital ads, advertising partners, buying processes and the process of reporting ads. Enroll today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Digital advertising and marketing is an essential part of any business. In this free online course, you will be introduced to the basics of digital advertising and marketing. Major companies around the world use advertising to sell their products to users. This course explains in detail the strategy and techniques used in bringing your business to life through marketing and advertising. Do you know that there are certain things to put in place when advertising a business using global principles? This course explains the basic principles as well as the other core areas relevant in the ever-changing world of digital advertisement. Have you ever tried getting a job in media and advertisement? This course discusses extensively how to create a digital portfolio and get a job online. A very interesting aspect of digital marketing and advertising is its application. Skills learned in this area can be applied to any aspect of the business to compete globally.</p><p>Next, the material introduces you to the practices and standards of the Interactive Advertising Bureau (IAB) in the United States. Did you know that there are different types of adverts that can be used in business? This course explains various types of ads such as banner ads, video ads, and rich media. It goes into great detail about digital ads such as ‘takeovers’ and ‘skins’. You will learn about the various forms of online advertising such as publisher direct and be familiarized with key advertising exchanges, advertising networks and trade desks. Did you know that publisher direct is good for endemic content, sponsorships of events and homepages? The course describes some of the methods used in ensuring the success of premium content. You will learn about advertising exchanges that are good for high reach and efficient buys across multiple websites. You will also study the industry standards used in developing premium content for advertisement and marketing. The course also describes the concept of real-time bidding (RTB) and how ads are used with target customers. Key examples of RTB covered in this course include OpenX and AppNexus.</p><p>Finally, you look into the buying models and general price ranges of various types of ads. You will be taken through a detailed explanation on how to write request for proposal (RFP) processes and issue insertion orders. Study how to use targeted ads through your marketing and advertising channels. You will learn how to target a user based on a predetermined set of behaviours. You will also cover contextual, demographic and geographic targeting of people using market analytics. The material does a thorough job of explaining the basics of ad servers and their architecture. It also explains how metrics are tracked and the standard benchmarks used for evaluating the success of online advertisements. This course will be valuable for business owners who want to promote their services or products online. The course will also be very useful for website owners who want to improve traffic to their sites. Start this free course today and add digital marketing and online advertising skills to your resume.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}