{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/4695","title":"Foundational Marketing Concepts","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn key marketing concepts, marketing principles and environmental analysis in this free online course.","description":"Some basic knowledge in foundational marketing will set you on the path to success in any business venture since you would have mastered the skills and strategies required to advance in marketing and sales for products and services. This course explores different baseline concepts such as marketing orientation, marketing principles, planning and execution to be effective with any strategy aimed at generating demand.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Marketing is a crucial function in any business organisation. It considers customer perceptions and utilises data to make intelligent and insightful business decisions. Preparing a marketing environmental analysis is important in understanding the local, national or international forces that might affect your small business. Because these factors are outside your control, we will investigate how you can devise a marketing strategy to take advantage of present opportunities while minimising threats. We will explore macro-environmental analysis focusing on ‘Political, Economic, Social, Technological, Legal and Environmental’ (PESTLE) analysis and consumer and stakeholder analysis.</p><p>This course will help you analyse key marketing concepts and principles of marketing. These are required to critically plan for industry and market analysis, enterprise value chain analysis, competitor analysis, ‘Strengths, Weaknesses, Opportunities and Threats’ (Gap SWOT) analysis, TOWS analysis, building conversion strategies and risk analysis. In addition, we will examine how to develop and implement a marketing plan. We will explore segmentation, value proposition, target market, promotion, brand advertising, business development and customer relationship marketing.</p><p>The key to successful planning and execution of marketing plans and objectives lies in building a team of marketing professionals skilled in marketing, the marketplace and the market offering. We will investigate the roles of marketing experts in developing key strategies to attract customers, build brands and run a profitable campaign. Marketing is a collection of skills that transcend the business world and can be applied to any career. Upon completing this course, you will gain more decisive foundational insights into marketing concepts that can help your organisation succeed in the modern world of marketing. In addition, knowledge of the fundamental values that connect people, brands and businesses will significantly boost your marketing skills. Enrol in this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}