{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/3594","title":"Linkedin Marketing","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to increase your connections, awareness and gain quality leads on LinkedIn with this free online course.","description":"This free online course on LinkedIn Marketing teaches you how to leverage the popular LinkedIn platform to promote your business and garner qualified sales leads. This LinkedIn course describes everything from the importance of driving traffic to your LinkedIn profile and how to get access to page visitors, to what the basics of LinkedIn Marketing are and the various strategies to generate income including many practical tips and examples.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you unable to get business leads and sales from LinkedIn? Do you ever feel that you are not attracting the right type of LinkedIn connections? Do you ever wonder why LinkedIn works for others but not for you? Then, this free online LinkedIn course is for you. LinkedIn is the marketplace for business professionals and people go on LinkedIn to search for information, connect with other people, discover business partners, and get recommendations about business ideas. You will be introduced to everything you need to get started and create an outstanding presence on LinkedIn. Whether you are just getting started on LinkedIn or you have been on LinkedIn for several years, you will learn some new strategies to get more business leads from LinkedIn with this social media marketing course. You will be taken through personal experiences on the power of LinkedIn and learn about the importance of optimizing your profile, groups, and business pages so that you are ready to be found, giving your viewers the best experience. LinkedIn has proven over time to be a powerful tool for individuals and businesses. Do you want to discover efficient ways to grow your LinkedIn network strategically? You will learn how to develop a clear strategy to maximize your impact on LinkedIn and the course content also covers how to create targeted LinkedIn adverts and analyze the results.</p><p>Included in this in-depth LinkedIn Marketing tutorial is engagement, relationship, and key group building, using discussions to bring opportunities, understanding your profile and how to source new connections. An important aspect of LinkedIn that is often neglected is your LinkedIn network and you will study current networks and how you can leverage them to connect with second and third-degree connections. Have you ever considered joining relevant groups on LinkedIn and getting involved with discussions? The course discusses in detail how to take your LinkedIn discussions further and how to set up your own LinkedIn group. Your LinkedIn profile is critical to your overall LinkedIn experience and as you go along in the content, you will learn about best practices on summary and description, group settings and profile visibility. You will learn about the \"who's viewed your profile\" feature and why it's very important, along with expert LinkedIn strategies on gaining endorsements and recommendations.</p><p>Whether you are selling a product or service today or are planning strategically for the future, this course comes with enough practical information to ensure that you use LinkedIn to take your organization to greater heights. It describes different strategies and methods that can be used to get connected directly to business decision-makers which could replace things like cold calling and sending random messages. However, these strategies cannot be used in isolation - they need to be complemented by generating leads and these advanced LinkedIn strategies are also covered in the content. Do you know that your online reputation might be the key to securing your next job or your biggest contract? LinkedIn is a powerful reputation management tool in addition to being able to get yourself, your products, and/or your services in front of B2B targeted demographics. To have a great experience, this course will require you to have a complete LinkedIn profile, a Gmail account, a general understanding of Google Chrome extensions and a basic level of proficiency in Microsoft Excel. If you are an aspiring social media and digital marketing professional or an entrepreneur or business owner, then taking this LinkedIn Marketing course will help you get the most out of the LinkedIn platform for business promotion and leads generation.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}