{"subjectName":"Sales & Marketing","subjectDescription":"Transform how you deliver results in either a sales role or as part of a marketing strategy with our free online sales and marketing courses. As a plus, our courses can be completed without the time and cost commitments associated with similar programmes.We offer... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/marketing.jpg","resumeLink":"https://alison.com/resume/courses/4438","title":"Social Media Marketing - Bootstrapping With Fundamentals","totalEnrolled":"14,878","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to build and boost your small business with social media marketing in this free online SMM course.","description":"Social media marketing is becoming a prevalent business practice. We have thus designed this course to provide all the necessary insights into social media marketing fundamentals. This course includes frequently used important terms of social media marketing, its various significant pillars and advertising methods. You will also discover how to create a perfect social media marketing strategy to become a success.","courseOutcomes":["Define various important terms relat...","Describe the five main pillars of so...","Evaluate strategies before publishin...","Recognize the importance of engageme...","Define various important terms related to social media marketing","Describe the five main pillars of social media marketing","Evaluate strategies before publishing the content on social media platforms","Recognize the importance of engagement with the audience","Compute the importance of analytics and metrics in social media marketing","Discuss credentials of various social media platforms in terms of social media marketing","Outline the essential components of a social media marketing agency","Describe the various steps of preparing a successful social media marketing agency","Indicate the importance of each step in the social media marketing agency","Classify the social media automation tools on the basis of their uses","Summarize the process of finding the correct target audience for social media marketing","Evaluate the process of creating value for the target audience via social channels uses","Define various important terms relat...","Describe the five main pillars of so...","Evaluate strategies before publishin...","Recognize the importance of engageme...","Define various important terms related to social media marketing","Describe the five main pillars of social media marketing","Evaluate strategies before publishing the content on social media platforms","Recognize the importance of engagement with the audience","Compute the importance of analytics and metrics in social media marketing","Discuss credentials of various social media platforms in terms of social media marketing","Outline the essential components of a social media marketing agency","Describe the various steps of preparing a successful social media marketing agency","Indicate the importance of each step in the social media marketing agency","Classify the social media automation tools on the basis of their uses","Summarize the process of finding the correct target audience for social media marketing","Evaluate the process of creating value for the target audience via social channels uses"],"courseDescription":"<p>The practices of eCommerce and businesses going digital have greatly revolutionized the world in the past two decades with the numerous developments in this area. Thus, people associated with eCommerce and the digital spaces are now taking more advanced and sophisticated approaches for enhancing their businesses. One of such approaches in this regard is social media marketing. It is evident that social media holds immense importance in today’s world. In its earlier days, people used social media to connect themselves with their relatives and friends. But now, social media is also being used as a marketing platform by almost all online businesses. Social media applications and platforms are a great source of branding, marketing and gathering an audience for these businesses. Thousands of online companies use various social media applications to enhance and improve their business practices. We can therefore say that learning the correct use of social media applications is essential for the growth and prosperity of any online business.</p><p>Keeping the importance of social media in mind, the publishers at Alison collaborated with the experts at Digital Partner, a premium digital marketing agency, to prepare this easy-to-understand social media marketing (SMM) course. It covers all the basics regarding the efficient use of social media platforms for online businesses. We present the details with vivid and captivating images, allowing you to engage at a greater level. We have divided this course into two modules, each containing three topics in terms of content. The first module regards basic concepts related to social media marketing. We discuss important terms in social media marketing, its essential pillars and various advertising methods used on social media platforms. Additionally, we investigate the multiple online platforms that can support a successful social media marketing campaign.</p><p>The second module examines various essential aspects of social media marketing. It explains multiple characteristics of social media marketing, including creating a social media marketing strategy and automated social media marketing practices. Moreover, this compilation of social media knowledge presents the methods of locating the right target audiences for online businesses and provides different data collection and compilation methods. Furthermore, you will learn about the social listening techniques for performing in-depth research on social media. In addition, we will discuss the unethical use of social media. Both modules contain a comprehensive summary that presents all the essential information concisely. Lastly, an assessment is provided at the end of this course to help you examine your progress. You can apply for an Alison certificate once you have completed this course successfully.</p><a href=\"https://alison.com/resume/courses/4438\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4438\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Fundamentals of Social Media Marketing","description":"This module introduces you to the various basic social media marketing concepts by defining several related terms and conditions. Next, you will learn about several essential terms related to social media marketing and its five crucial pillars in detail. Lastly, you will come across the methods of advertising on social media.","topics":["Social Media Marketing Fundamentals - Learning Outcomes","Social Media Marketing: Important Definitions and Pillars","Most Popular Social Media Marketing Platforms","Social Media Marketing Strategy","Social Marketing Fundamentals - Lesson Summary"]},{"name":"Module","details":"Essentials of Social Media Marketing","description":"This module will introduce you to various detailed aspects of social media marketing. First, you will learn about the eight steps of developing a social media marketing strategy. Then, we will discuss automated social media marketing practices. Lastly, we will analyze how to find the right target audience for any online business.","topics":["Social Media Marketing Essentials - Learning Outcomes","Creating a Social Media Marketing Strategy","Automating the Social Media Marketing Practices","Finding and Targeting the Right Audience","Social Media Marketing Essentials - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Social Media Marketing - Bootstrapping With Fundamentals - Course Assessment"]}]}