{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5396","title":"Advanced English 508","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online English course covers prefixes and suffixes and explains how to use indirect speech.","description":"This English course teaches you how to add common English prefixes and suffixes to a wide range of root words to form new ones. We then discuss the grammatical rules surrounding indirect speech. We show you how to use various forms of reporting verbs in the present and past tenses to ask questions. This course suits those with a basic grasp of English who want to improve their language skills and confidence in this global tongue.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course provides grammar skills and helpful vocabulary to enhance your command of the English language. It begins with an overview of different types of prefixes and suffixes and demonstrates how they transform the meaning of single words. We then present you with articles, videos, and audio clips to help you practice your growing English abilities.</p><p>The course then explores indirect speech. We first review the previously covered forms of indirect speech in the present and past tenses and questions. We then explain how to use indirect questions in the perfect continuous form. We illustrate using reporting verbs in indirect speech to form various formulas, passive sentences, and exclamations.</p><p>We have designed this course to help you to improve your English reading, speaking, and writing skills. Adding common English prefixes and suffixes to root words will boost your confidence and communication ability. There are exercises found in our ‘Resources’ section that you can download to try out your newfound knowledge and skills immediately. Language proficiency can open personal and professional doors for you, so sign up for these English lessons to master prefixes, suffixes, and indirect speech.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}