{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4060","title":"English for Thai and Russian Speakers: Alphabets A to E","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches you the name, sound and symbol of the first five letters of the English alphabet.","description":"Forming, naming and using letters represents the first step of your journey to learning to read and write in English. This free online course helps you to master the language from scratch by providing simple and engaging lessons that provide efficient methods and practices. We explore the use of the letters ‘A’, ‘B’, ‘C’, ‘D’ and ‘E’ along with their sounds before we study several new words and phrases that use them.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Have you ever attempted to study the English alphabet? It may appear simple at first glance but has several ways to say each letter, some of which may not exist in your mother tongue. This free online course banishes your confusion and makes studying the English alphabet fun. You will learn by watching videos, hearing letters and words and repeating them. We also introduce new symbols in transcriptions, including the pronunciations of letters that start with 'A' and conclude with 'E'.</p><p>We begin by explaining how to use the letter ‘A’ and demonstrating its diverse phonetics in words like ‘car’, ‘bad’ and ‘label’. We then move on to the letter 'B' and phrases that contain it. Our analysis of 'C' includes the three distinct sounds it makes in words like ‘city’, ‘cat’ and ‘chair’. The course covers 'D' quickly before explaining how to use ‘E’ in greater detail while we show how to pronounce it as part of a group of letters such as ‘e+r’, ‘e+re’ or double 'e'.</p><p>This course covers everything you need to know to learn the alphabet. Several activities can help you to read, write and remember the first five letters, compose new words and phrases and translate English words into your original language. Knowledge of the alphabet is essential in order to develop your reading skills and increase your ability to use English confidently. Sign up for this free online course to master these letters and their sounds.</p><p>The course modules are presented in English with Thai and Russian subtitles to assist speakers of those languages.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}