{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4396","title":"Arabic for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, you will learn how to read, write and communicate effectively in the Arabic language.","description":"Understanding Arabic opens doors globally. In this course, learn how to read, write and express yourself using simple sentences in the Arabic language. Study the modes of greeting and manners, the system of numbers and the different colours in Arabic. In addition, you will examine the ‘moon’ and ‘sun’ letters and basic verb conjugations. By completing this course, you will develop your diction and gain confidence speaking fluently in Arabic.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Arabic is one of the most widely spoken languages worldwide, with over 400 million people speaking it. The Afro-Asian language has its roots among the Bedouin nomads in the Arabian region in the Middle East and North Africa, known as the ‘Arab World’. Arabic diversifies into different dialects with different accents and pronunciations, like most languages. Modern Standard Arabic is the official language of over 20 countries. In 1973, it became one of the official languages of the General Assembly of the United Nations. Hence, we would first welcome you to this course by saying ‘Marħaba’. We will first explore the two genders recognised in the Arabic language and use the 'gender convention' to assign the right words to humans, animals and other objects. Then provide simple greetings like ‘good morning’, ‘good afternoon’, ‘how are you?’ and ‘what is your name?’.</p><p>Next, discover the right words to use to ask for a favour, make an excuse or apologise. We will study the number system, including 'al-arqam' representing the denary numbers. Next, you will learn about 'al-alwan', the collective term used for various colours, the 15 ‘moon letters' and the 8 'sun letters'. We will explain the application of the moon and sun letter systems for word coinage. Investigate words for foods and drinks and how to order them when you are in exotic places. You will also see how you can identify domestic and wild animals by their Arabic names. Discover the common verbs and consider the adverbs and verb conjugations for the important verbs used in the Arabic language.</p><p>Furthermore, the topics on vocabulary practice will clarify the letters, simple words and common expressions to aid your mastery of the spoken and written forms of the language. For example, you will examine the days of the week, the weeks of the months and the months of the 'Sana' (year). In addition, learn the models for telling time and asking questions with practicable examples and exercises. Discover how you can express your emotions in Arabic for 'Usra' (family). This course adopts a unique, easy-to-remember method for teaching Arabic with simple words and expressions to help you quickly master the language. Learning this language will help you gain access to a global, growing market and could be your gateway to economic wealth in the oil-rich regions of the Middle East and the Arab World. Furthermore, your understanding of their mother tongue will promote intercultural understanding and the rich history of Arabian culture. So why wait? Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}