{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4168","title":"Arabic Letters: Thaa2 (ث) and Noon ( ن )","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the Arabic letters ‘Thaa2 (ث)’ and ‘Noon (ن)’, which correspond to 'Th’ and ‘N', in this free online course.","description":"Arabic is one of six languages mandated by the United Nations and is the second-most difficult language for English-speakers to learn. ‘Thaa2 (ث)’ is the fourth letter of the Arabic alphabet and has the same sound as 'Th' in English. ‘Noon (ن)’ is the twenty-fifth letter and sounds similar to the English ‘N’. Continue your journey to fluency in Arabic by investigating and mastering the use of these two important letters.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Did you know that in Arabic, words always begin with a consonant and end with a vowel? In this way, it's very different from most English words that feature two consonants and sometimes silent letters. This free online course teaches you how to use the fourth and twenty-fifth letters of the Arabic alphabet.</p><p>We begin with 'Thaa2 (ث)', the fourth letter, which sounds like the English 'Th'. We examine 'Thaa2 (ث)’ with short and long vowels and explain its use with Tanween Fat7ah, Damah and Kasrah. The course shows you how to write the letter depending on its position in a word.</p><p>We then move on to the twenty-fifth letter in Arabic: ‘Noon (ن)’. Once again, we analyze it with short and long vowels, as well as with Tanween. Arabic letters can have four different forms depending on their position in a word. We explain how the letter links to those before or after it. This course suits anyone who wants to explore the beauties of Arabic by learning the letters ‘Thaa2 (ث)’ and ‘Noon (ن)’.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}