{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/3492","title":"Basics of British Sign Language","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to relate with people in the deaf people community with British Sign Language in this free online course.","description":"This free online course will teach you the important elements of British Sign Language. You will learn the signs for colours, animals, household items, months of the year, days of the week and the verbs vocabulary. Also, you will be shown how to put the vocabulary you have learned together for the purpose of communication. Start this British Sign Language course and hold meaningful conversations with deaf people in everyday situations.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Within Britain the most common form of sign language is called British Sign Language (BSL). In this course, you will get up to speed with the basic understanding of what sign language is and how to use it properly when communicating with deaf people in the community. You will be first introduced to the sign language alphabet and how to combine the alphabet to form a word. Also, you will be shown how to make sentences through fingerspelling quizzes and conversation practices. On top of that, you will be taught how to count, describe numbers and the basic way of introducing yourself in sign language. BSL has its own grammatical structure and syntax and as a language, it is not dependent upon nor strongly related to spoken English. Learners will gain an understanding of how to describe words and how to make sentences with British Sign Language when communicating with deaf people.</p><p>Being able to recognize colours assists with educational skills such as creative writing. Colour is a potent element of visual communication. Similarly, when you are exercising your imagination when creating a story, colour becomes an important part of the descriptive techniques. You will learn the core sign for colours, animals and items in the house. A verb, from the Latin word 'Verbum' meaning word, is a word that conveys an action, an occurrence or a state of being. This course will show you how to properly use the verbs vocabulary such as \"ask, drink, talk, buy, etc.\" in sentences to communicate with people using British Sign Language. Furthermore, you will be taught how you can build your vocabulary with signs for the month of the year, days of the week, how to tell the time, how to price and different kinds of money spent. By studying this course and learning some basic ways of communicating using BSL, you are including deaf people in your community.&nbsp;&nbsp;</p><p>Emotions are psychological states brought on by neurophysiological changes, variously associated with thoughts, feelings, behavioural responses and a degree of pleasure or displeasure. Emotions need to be expressed too. You will be shown how to ask questions and how to show emotion when passing information in sign language. This course will teach you how to put all that you have learned together for easy communication, as it provides you with conversation practices and expression examples. Studying sign language promotes better awareness and sensitivity to the deaf and hard of hearing community. As someone proficient in BSL, you will develop a strong appreciation for deaf culture and you can promote understanding and acceptance of the language among others. It doesn’t matter whether you’re a beginner at BSL, or whether you’ve tried to learn any other variety of sign language before, you can take this course. This course is important for learners who want to master the basics of BSL from the very beginning so that they have a rock-solid foundation and can start communicating with deaf people or those having hearing impairments. So, what are you waiting for? Start this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}