{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1215","title":"Beginner Level English 1 - Foundations","totalEnrolled":"193,298","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online English course will teach you everything you need to get started with your English studies.","description":"This free online English language course will teach you about some of the most simple parts of the English language in clear, and easy to understand language. English is spoken by more than 1.5 billion people in the world, and 360 million of them are second-language speakers. This course will teach you essential English grammar, useful English vocabulary, and lots of tips and tricks to help you get started with English.","courseOutcomes":["Recognise forms of the verb \"To be\"...","Recognise Pronouns...","Discuss and understand A to Z...","Recognise how to say Hello, Good eve...","Recognise forms of the verb \"To be\"","Recognise Pronouns","Discuss and understand A to Z","Recognise how to say Hello, Good evening, etc","Identify how to introduce yourself","Recognise how to start a conversation in English","Identify 15 important words","Recognise singular words","Recognise plural words","Recognise forms of the verb \"To be\"...","Recognise Pronouns...","Discuss and understand A to Z...","Recognise how to say Hello, Good eve...","Recognise forms of the verb \"To be\"","Recognise Pronouns","Discuss and understand A to Z","Recognise how to say Hello, Good evening, etc","Identify how to introduce yourself","Recognise how to start a conversation in English","Identify 15 important words","Recognise singular words","Recognise plural words"],"courseDescription":"<p>In this free English course for beginners, you will first study the English pronouns such as I, You, He, She, and It. You will then learn the English alphabet from A to Z with an audio file that will teach you how to pronounce the letters properly. Next, you will learn how to start a conversation, introduce yourself, and say simple greetings such as 'Hello', \"Good morning\", and 'Good evening'. You will then learn some really important English words to help boost your vocabulary.<br><br>Once you know how to use your new English vocabulary and have learned the correct pronunciation of the alphabet, you will learn to identify singular and plural nouns and how to use them correctly. Next, you will learn to recognise the forms of the important English verb 'to be'. By mastering these simple English words and grammar rules, it will be much easier for you to learn new English words and new rules in the future.<br><br>This basic English learning course is perfect for students who have little or no background in English. With the help of the audio file that comes with the lessons, this course will make it easy to learn the pronunciation of the alphabet and new words the right way. The lessons covered in this English for beginners will help you take some really important steps in no time. So, check out the course now and start learning English today!</p><a href=\"https://alison.com/resume/courses/1215\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1215\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Beginner Level English - Introduction to the English Language","description":"5 units of presentations, video/listening exercises and test questions designed to increase your knowledge of the following topics: ABC Pronunciation; Saying Hello; Pronouns & To Be; Important Words; and Plural and Singular Words.","topics":["Beginner Level English Course - Foundations: Learning Outcomes","The verb 'to be'","ABC...Z","Say Hello","Important words","Plural or Singular words","Beginner Level English Course - Foundations: Course Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Beginner Level English - Foundation Assessment"]}]}