{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4275","title":"Beginner English 105","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn English grammar, pronunciation and vocabulary relating to numbers, time and events with this free online course.","description":"Do you find studying English challenging? This engaging course gives you the confidence to master the basics of telling time and planning events. We cover grammar, pronunciation, and vocabulary relating to these areas, including ‘prepositions of time,’ ‘what,’ or ‘when’ questions relating to time, and basic vocabulary to help you easily discuss events and make plans. Polish your English skills with this course and enroll today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course is a building block that will help you widen your vocabulary and become more self-assured in expressing yourself and conversing in English. We begin this course by examining the pronunciation of words relating to time. This includes learning how to pronounce all the days of the week and the calendar months of a year.</p><p>The course then moves on to learning numbers. We compare ordinal numbers (like ‘first’ and ‘second’) to cardinal numbers (like ‘one’ and ‘two’) and explain when to use them. We then examine grammar relating to time. You will learn how to tell the time and how to read a clock in English. The course then discusses the ‘prepositions of time’ (‘in,’ ‘at,’ and ‘on’) and shows you when to use each correctly.</p><p>Our final section goes through vocabulary relating to events. We demonstrate how to add adjectives to add information and make the event-related word more specific. This course takes you through each section step-by-step, using video and audio clips to enhance your learning experience. Sign up today to help boost your confidence while speaking English.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}