{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4439","title":"Beginner English 111","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online Beginner English 111 course explains modal verbs, gerunds and vocabulary relating to abilities.","description":"This English course delves into modal verbs and gerunds and will help you understand the pronunciation and grammar using these parts of speech. Study the vocabulary relating to dance, play, and speaking abilities and use adverbs to connect these strengths. Learn that an object pronoun is a personal pronoun that receives the action in a sentence. Enrol today and elevate your English language skills to the next level.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The English language is complex. This course will help you improve your speaking, reading, and writing to enhance the basic expressions needed in everyday conversation. We will first introduce you to pronunciation. You will learn to link words correctly using words ending in 'd' or 't' and starting with 'y', which are basic elements of English pronunciation.</p><p>The second topic will look at modal verbs and gerunds in grammar. A 'modal' is a verb that comes before the main verb and gives it extra meaning. The word 'can' is an example of a modal used before a verb such as 'ride,' for example: 'I can ride.' You will study positive, negative, formal, and informal uses of modals and learn to use them in a question. Next, we explore gerunds. Gerunds are verbs that function as the subject or noun in a sentence. You will compare gerunds with the present continuous, where gerunds focus on the activity and the present continuous on the action. You will examine 'adverbs of manner' and learn how to describe how someone does an action. This topic ends by explaining those object pronouns come after a verb and compares them to subject pronouns.</p><p>The final section of the course looks at vocabulary. You will discuss activities such as dancing, hiking, and fishing, to name a few. Once you have mastered these, you can easily converse about pastimes and express ability using the modal verbs 'can' and 'can't.' In addition, you will be able to compare activities to each other and clarify what you can and cannot do. Register for this course and keep working on getting your basic English skills up to scratch.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}