{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4413","title":"Beginner English 110","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explains the present simple and present continuous tense and vocabulary relating to weather.","description":"This English course focuses on teaching basic grammar, vocabulary, and pronunciation. You will start by learning the essential vocabulary needed to discuss the weather and then move on to comparing the present simple and present continuous tenses. This course will enhance your confidence when asking 'wh'-questions related to the weather, and you will discover how to use the present participle, a useful form of any verb that ends in '-ing.'","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>If you want to master English pronunciation, grammar, and vocabulary at a basic level, this course will help you reach your goal. It consists of three topics, pronunciation, grammar, and vocabulary, each representing an essential building block of the English language. The first topic discusses syllables, parts of words that usually include a vowel and one or more consonants. This is followed by explaining how the letter ‘-y’ can be used as either a consonant or a vowel and exploring the sounds made by the /y/ sound when used at the end of words.</p><p>Following this, you will focus on grammar. We discuss action and stative verbs before describing the present simple, a tense that depicts an action happening now. Next, the course focuses on the present participle, the form of a verb ending in ‘-ing.’ Finally, you will learn how the present continuous tense describes an action that is in progress.</p><p>The course’s final section outlines vocabulary related to the weather and seasons. Learn the terms for seasonal clothing and discover how to start conversations by asking questions related to climate. Understand which seasons relate to specific months and how this differs between countries. If you are looking to take your language skills to the next level and expand on your conversational English, this course is for you. Don’t hesitate to enroll today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}