{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4599","title":"Beginner German 104","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course presents a comprehensive study of the dative case, genitive case and prepositions in German.","description":"Are you eager to learn how to make sentences with articles, personal pronouns and possessive pronouns in German? This course aims to help you achieve this goal. We will examine the relationship between cases and articles in the sentence structure and study how to use prepositions in German. By taking this course, you will gain more knowledge of the core concepts of the language and take your speaking and writing skills to the next level.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Selecting the correct character case is one of the most common problems among new learners of German. Nevertheless, understanding the concepts of cases and how to use them will significantly ease your learning, helping you form sentences while you write and converse more eloquently. In this free online course, we will walk you through the four cases used for communication in German (nominativ, akkusativ, dativ and genitiv). You will learn about the functions of cases and the words used to form questions for each. In the same vein, we will highlight the rules that guide the use of cases in the grammatical context. Then we identify the essential verbs that activate the four cases. This course is the last in the first ‘German Language for Beginners’ series by Kevin Grüdel. If you recently only started learning the language, we recommend completing the ‘German Language for 'Beginners’ 101 to 103 courses before taking this course.</p><p>In the following section, we dissect the genitive case. We break it down and keep it simple as it is one of the most challenging subjects in German. We discuss why the dative case rapidly replaces the genitive case in the modern language. Moreover, we will review the subject of präposition (‘preposition’ in English), which is one of the most important aspects of German vocabulary. We outline the three distinct prepositions used in various cases to enhance your written and spoken German. With this, you will be able to make your dreams of becoming an effective German language speaker a reality. Then we will highlight the subject of personal pronouns (Personalpronomen), including how to recognise them and how they modify the sentence cases.</p><p>Next, the course will teach you how to append the ending of verbs and adjectives in the dative and genitive cases of the German language. We'll present a list of all the possible prepositions and see how they are used in their respective cases. Finally, learn how to identify the German language cases that deal with movements and non-movement by exploring the verbs that regulate them. We will also test your knowledge of each topic covered in the course with exercises and assignments to serve as mnemonics that sharpen your memory and aid your mastery. By taking this course, you will have a sound knowledge of the core concepts of German that will make you an articulate speaker of the language. So why wait? Start learning now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}