{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4303","title":"Chinese for Beginners - Greetings and Self-Introduction","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore basic vocabulary and speech for general greetings in this free online course on your journey to Chinese fluency.","description":"Start exploring the Chinese educational culture, work or leisure through its language, the most widely spoken language in the world! This short course will teach you to greet others and introduce yourself, using your name and nationality in Mandarin Chinese. In addition, explore its vocabulary, proper pronunciations and tones so you can sound like a native speaker, impressing yourself and others. The course is free so begin today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Learning a new language is an adventure into a new world. China’s rich culture, cuisine, festivals and industries can attract many people. With technology able to connect people worldwide, more people are willing to explore other cultures, be it for school, business or leisure. While you may have preconceived notions of how hard or simple it may be, you can master Mandarin Chinese quickly when approached with an open, curious mind and start with a very simplified course such as this.</p><p>We will teach you how to greet people in the Chinese language, beginning with new vocabulary and its proper pronunciation and tones. You will also discover the differences in speech when you greet your peers, a group of people or an older person to show respect. Next, we explain how to ask someone their name and say yours. Generally, in Chinese, surnames come before the first name. A Chinese name is most commonly composed of two or three characters and there is no equivalent of a middle name in Chinese. Another interesting fact about surnames is that, culturally, women don't change theirs when they get married.</p><p>Finally, we will discuss how to ask someone about their nationality. You will find that some popular country names, such as ‘America’, ‘Britain and ‘France’, are spelled and pronounced entirely differently from how they are in English. There is a compiled list of all the vocabulary words taught in the course, which you can download and print from the ‘Resources’ section and use for practice. Whatever your motivation for learning Mandarin Chinese, you can get started quickly with this free short course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}