{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4540","title":"Diploma in HSK Level 1 Conversational Chinese","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Hold simple conversations with Chinese people by mastering the basics of Chinese (Mandarin) in this free online course.","description":"How do you have a conversation in Chinese (Mandarin)? If you want to learn this language and would like to have a dialogue with native speakers, this course is for you. Whether it is a polite conversation or describing your life and work, you will have the confidence to express yourself like a local. Our video lessons help facilitate sound practice techniques and prepare you to learn the sentence structures and vocabulary at HSK Level 1.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Non-native Chinese speakers learn this language to make their academic, professional and social lives better. They can take the HSK Level 1 test to ascertain that they correctly know Chinese words and phrases. HSK is an international standardised exam for Chinese language proficiency, consisting of six levels. This course equips you with the grammar and vocabulary for passing the Level 1 test. It begins with teaching you to start a conversation using basic Chinese words such as a greeting and introducing yourself. Mandarin is the most widely used dialect of Chinese and the written form used in this course is simplified Chinese characters. People use these characters in Mainland China and Singapore. The video lessons will teach you to speak Mandarin and recognise the simplified Chinese characters. In addition, you will understand how to ask simple questions and count and identify numbers.</p><p>The next part of the course will build on this foundation by adding new words to your vocabulary. You will discuss activities, days and times in Mandarin. Chinese sentence patterns are relatively straightforward with a standard structure for using the interrogative pronouns or time adverbials, to name a few. How do you rearrange Chinese sentences? What makes Chinese structures so complicated? You will find the answers as you work through the videos and study the grammar rules and vocabulary. All the videos have two sets of conversations, a ‘listen and read’ section where you can focus on mastering the pronunciation and a ‘tone and practice’ section. Your confidence with recognising the Chinese characters will also increase with the regular recaps at the end of each section. The quick references to specific buzzwords will teach you to understand the native dialect easily and ensure you are ready to pass the Level 1 test.</p><p>Finally, the course builds your conversation essentials by broadening your knowledge to include how to ask the time, make a phone call, inquire about health or talk about an illness. You will learn to express yourself using more words and phrases. You will recall all the grammar rules and sentence structures as you work through the recap section of the course. This practical course will help those looking to study or work in China. The HSK certificate never expires so you can continue your learning by taking the higher-level certifications at a later stage. Gaining proficiency in a new language adds value to your resume and may help you explore new avenues. Chinese universities mandate higher level proficiency in the Chinese language for foreign students. Employers too prefer applicants who can speak the local language. Take advantage of this online course and enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}