{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1883","title":"Diploma in French Language Studies","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Explore French in this free online course and master its phonetics, numbers, accents and common social conversations.","description":"This diploma course teaches you how to understand and speak basic French. We cover important phrases used to handle introductions, greetings, shopping and chores. We offer examples of everyday conversations discussing holidays, your studies and occupation, proficiencies and looking for a job. We explore the foundations of spoken French, and use short interviews to demonstrate its pronunciation. Sign up to master this famously beautiful tongue.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This diploma language course is designed for anyone who wants to learn how to speak basic French. We lay down the foundations of spoken foreign language skills by introducing you to the pronunciation of words and phrases through text and audio, reinforced with videos featuring interviews with French speakers.</p><p>The course focuses on topics like introductions, greetings, your studies, the holiday, television or looking for a job. We cover core language skills, such as understanding numbers, time, dates and the weather. We also examine key terms used around the workplace for various occupations. The course supplies the French vocabulary you need to discuss your home, household chores, shopping, how you spend your vacations and what you do in your spare time. We cover the pronunciation of the alphabet, French accents, accentuation, oral comprehension, written comprehension and vowels.</p><p>This diploma course also uses a grammar reference guide to ground your new conversational skills in a formal understanding of the ‘bones’ of the language. We can help anyone who wants to learn to speak French for use in business or social occasions. This might interest those planning a trip to any French-speaking country or region and suits anyone who wants to expand their horizons and communicate in ‘the Language of Love’.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}