{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4620","title":"Diploma in HSK Level 2 Conversational Chinese","totalEnrolled":"1,408","courseIncludes":["6-10 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will help you master HSK Level 2 grammar and basic daily conversations in Chinese Mandarin.","description":"This course will be valuable if you want to add more Chinese words to your vocabulary and master complex sentence structures. The lesson videos offer plenty of examples and explanations to enhance your learning experience. Discover new sentence patterns and grammar points to have diverse conversations with the Chinese locals. This course will prepare you for the HSK level 2 exam and benefit your professional or academic interests in China.","courseOutcomes":["Identify the auxiliary verbs in Chin...","Summarise the use of complements in ...","Arrange the verbs and adjectives in ...","Recognise, read and write large numb...","Identify the auxiliary verbs in Chinese","Summarise the use of complements in Chinese","Arrange the verbs and adjectives in the correct order in a sentence","Recognise, read and write large numbers","State the grammatical uses of 的 (de)","Explain and use the 把 (bǎ) construction","Discuss events in the context of different time periods","Compare experiences, objects and feelings","Identify the functional components of Chinese sentences","Indicate frequencies by using the right complements in sentences","Translate simple Chinese sentences","Recall the grammar points to take the HSK Level 2 exam","Identify the auxiliary verbs in Chin...","Summarise the use of complements in ...","Arrange the verbs and adjectives in ...","Recognise, read and write large numb...","Identify the auxiliary verbs in Chinese","Summarise the use of complements in Chinese","Arrange the verbs and adjectives in the correct order in a sentence","Recognise, read and write large numbers","State the grammatical uses of 的 (de)","Explain and use the 把 (bǎ) construction","Discuss events in the context of different time periods","Compare experiences, objects and feelings","Identify the functional components of Chinese sentences","Indicate frequencies by using the right complements in sentences","Translate simple Chinese sentences","Recall the grammar points to take the HSK Level 2 exam"],"courseDescription":"<p>Non-native Chinese speakers take the international standardised HSK exams to provide proof of their proficiency levels in the Mandarin Chinese language. It consists of six levels. This course will equip you with the grammar and vocabulary for passing the Level 2 examination. You will begin by learning the different usage of verbs and complements in Chinese. We have answers to questions such as: Do the verbs have tenses? What are the helping verbs in Chinese? How do complements give additional meaning to verb phrases? Counting large numbers in Chinese is different from the English language. The first module will teach you how to count. Some functional particles or characters of the Chinese language, such as 的 (de) and 把 (bǎ), play an essential role in sentence constructions. There is plenty of sentence practice to make your learning experience effortless.</p><p>The course then progresses to include expressions, descriptions and making enquiries in Mandarin or simplified Chinese. More complex sentence structures in the second module will help enhance your conversation skills. Think of situations when you will need to describe events in different time periods or when you feel like comparing experiences, objects or feelings. How can I emphasise my feelings? Is it possible to recognise the Chinese characters? You will receive sufficient input to articulate your emotions correctly in Chinese. The lessons have two broad conversations about teaching you the common sentence structures and grammar points. As you listen carefully and practise the pronunciation, the learning will become easier. The point-by-point explanations in the videos will unveil the simplicity behind the complex-appearing Chinese characters. A revision lesson in this module will help you check your progress and correct any misinterpretations.</p><p>The final conversation topics will broaden your ability to include plans, changes and passive voice. Your confidence in the usage of certain words will increase. You will learn to recognise many more common Chinese characters. Mastering a new language entails practice. All the videos in this course offer you the convenience of doing the same. This practical course will help you gain an additional level in the HSK exam for proficiency in Chinese and add value to your interactions with colleagues, classmates or professors. The HSK certification does not have any expiry. So you can continue adding the proficiency levels which will widen your professional prospects and the range of opportunities available to you. Take a step forward, add value to your language ability and enrol in this course today.</p><a href=\"https://alison.com/resume/courses/4620\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">diploma</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">diploma</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">diploma</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">diploma</span>:</strong> a downloadable <span class=\"course-type\">diploma</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">diploma</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">diploma</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">diploma</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4620\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">diploma</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">diploma</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">diploma</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">diploma</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Auxiliaries, Complements and Sentence Construction","description":"Auxiliary verbs are added before verbs to add more meaning to the sentence. This module will teach you about sentence construction with auxiliaries, complements and 把(bǎ). You will also learn to count large numbers, and the specifics of directional, quantity and result complements before understanding the grammatical use of 的(de).","topics":["Learning Outcomes: Auxiliaries, Complements and Sentence Construction","Auxiliary Verbs and Complements in Chinese","Direction Complement","Quantity Complement and Uses of [的 de]","Result Complement and 把(bǎ) Construction","Lesson Summary: Auxiliaries, Complements and Sentence Construction"]},{"name":"Module","details":"Expressing, Describing and Enquiring","description":"A conversation includes some descriptions and comparisons. You can learn how to do this. This module will teach you some advanced sentence structures to express yourself better. Additional grammar points will add to your Chinese language skill as you will learn about some more complements of emphasis, frequency and conjunction.","topics":["Learning Outcomes: Expressing, Describing and Enquiring","Descriptions and Comparisons","Functional Components of Chinese Sentences","Emphasis Complement","Complements of Frequency and Conjunctions","Lesson Summary: Expressing, Describing and Enquiring"]},{"name":"Module","details":"More on Complements and Sentence Constructions","description":"Verb phrases add meaning to any sentence and one must know their correct usage. In this module you will learn about auxiliary verbs, complements and advanced sentence constructions that use verb phrases or verbs. Your conversational skill will improve and you can get more comfortable with the Chinese characters as you progress through the lessons.","topics":["Learning Outcomes: More on Complements and Sentence Constructions","Making Plans and Suggestions","Expressing Changing Circumstances and Progressions","Result Complement and 被(Bèi) Construction","Revision: Conversational Chinese HSK Level 2","Lesson Summary: More on Complements and Sentence Constructions"]},{"name":"Module","details":"Course assessment","description":"","topics":["Course assessment"]}]}