{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4733","title":"Diploma in HSK Level 3 Conversational Chinese","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course helps you master HSK Level 3 grammar and conduct basic daily conversations in Mandarin Chinese.","description":"If you have completed the ‘HSK Level 1 and Level 2 Conversational Chinese’ courses, this course will help you progress further in mastering Mandarin. The short video lessons will teach you new vocabulary and grammar to have more extended conversations in Mandarin. Completing this course will add yet another milestone to your foreign language proficiency, which will help you tap into new opportunities, whether at your studies or work.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>After completing the ‘HSK Level 1 and level 2’ study for the HSK exam (or ‘Chinese Proficiency Test’), this course is your next step and will prepare you for the level 3 exam. The HSK level 3 assesses how well you can apply everyday Chinese. It covers many relevant topics like discussing personal plans, comparing and describing people or things, Chinese culture and general etiquette. Each lesson has practice questions to help you grasp the essentials of grammar and vocabulary as you progress. Learning any new language entails dedicated effort and determination. As you listen and practise with each video lesson, your confidence in your abilities will increase. We will also test your knowledge of the Chinese characters on their own, without the use of pinyin. The exercise may sound challenging but we will guide you through each section.</p><p>The first module focuses on how to compare, emphasise and talk about changes. The Chinese language uses idioms expressed in four characters. How can these idioms enrich your vocabulary? We will explore common idioms and their usage along with new sentence structures. In addition, you will learn to express large and approximate numbers. The second module explains the correct use of conjunctions, classifiers and pronouns. You will become more comfortable using interrogative pronouns, complex complements and telling a story. Can you use more than one verb in a sentence? You can in Mandarin and this course level will teach many more grammar structures. A revision section in the second module of the course will give you some assistance in assimilating what you have learned so far.</p><p>The course's final module deals with complements in detail and you will also learn to express fractions, percentages and multiples. This course covers around 150 sentence patterns, more than 800 new words and grammar related to comparisons between adjectives and the use of adverbs. The ten different topics present a broad vocabulary spectrum from getting to know someone or talking about the environment. The advantages of learning Chinese are many. Knowledge of Mandarin will help you communicate with the locals in China, Taiwan and Singapore. The added proficiency in Mandarin can be of immense help if you are a student in any of these countries. Your business opportunities will grow as you can tap newer markets. It will be easier for you to connect with Chinese colleagues abroad. So take advantage of this course, which is available to you in an easy-to-follow format. Enrol now.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}