{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4847","title":"Easy Korean for Beginners - Grammar","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches how to use general Korean phrases and understand the Korean number system.","description":"Jal-jiness-eoyo? Have you picked up a few Korean words through K-Pop and K-Dramas? Do you want to learn how to converse in Korean? This course is designed to take your Korean skills to the next level. You will gain insight into the Korean grammar structure and understand the underlying logic and how it differs from English. You will then expand your vocabulary, create phrases and master grammar proficiently in Korean.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Do you only know a few Korean words but don’t know how to make phrases? Are you confused about the Korean numbers system? Learning grammar is one of the first steps to understanding any language. For that, we begin with the basic building block of speech - nouns - called 명사 (myeong-sa) in Korean. Once you know them, you are on your way to easily make phrases or simple sentences.</p><p>After the basics, we will dive into the Korean adjectives with which we will build sentences and make daily conversations. First, adjectives will give us a description of the nouns. For example, you will use the Korean adjective + Korean noun form to build a sentence using a noun. Then, comparing adjectives will give you a detailed description of what the speaker is saying. For example: for good, better, best you say 좋아요, 더 좋아요, 제일 좋아요.</p><p>We will then cover the two Korean number systems: the Native Korean numbers and the Sino-Korean numbers. You will gain insight into the specific uses for each system, whether you are counting things, currency or time. This Korean language course is intended for beginners with carefully planned topics to help anyone understand the language. If you want to master the grammar and study how to make conversations, join this course and continue your journey to learn Korean today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}