{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4476","title":"Easy Korean for Beginners","totalEnrolled":"12,695","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of Korean and its Hangul alphabet in this free online beginner Korean language course.","description":"Korean popular culture is becoming a worldwide phenomenon and now is the time to start learning the Korean language. This beginner level course will introduce you to the Korean alphabet (called 한글 ‘Hangul’) and the building block syllables of the language. This course studies the history of Hangul, modern slang and cultural etiquettes and is a great foundation on which to build your Korean language proficiency..","courseOutcomes":["List all the Hangul consonants and v...","Describe how to write Hangul letters...","Recognize the correct structure of K...","Explain the basic structure of Korea...","List all the Hangul consonants and vowels","Describe how to write Hangul letters","Recognize the correct structure of Korean words","Explain the basic structure of Korean sentences","Translate some basic Korean words","Discuss common everyday conversations in Korean","Analyze the Korean culture and language","Recall how to do basic introductions and greetings","Identify some popular Korean slang words","Describe how to pronounce Korean words correctly","List all the Hangul consonants and v...","Describe how to write Hangul letters...","Recognize the correct structure of K...","Explain the basic structure of Korea...","List all the Hangul consonants and vowels","Describe how to write Hangul letters","Recognize the correct structure of Korean words","Explain the basic structure of Korean sentences","Translate some basic Korean words","Discuss common everyday conversations in Korean","Analyze the Korean culture and language","Recall how to do basic introductions and greetings","Identify some popular Korean slang words","Describe how to pronounce Korean words correctly"],"courseDescription":"<p>Are you a fan of K-Pop? Have you ever watched K-Drama? Korean popular culture is taking over the world and is just one of many reasons to start learning the language today. Presented by Uni, a native speaker, this beginner level Korean language course teaches you the basics you need to start your learning journey. Beginning with the historical background of the Hangul alphabet, you will learn about its characteristics and creation. Next, you will get the hang of the basic consonants and vowels, followed by consonant sets and combined vowel sets that collectively make up the building blocks of the language.</p><p>After covering the basic alphabet, you will be taught how to use the letters to structure and write syllables. You will then be introduced to corresponding words as you begin to build your Korean vocabulary. As you progress, the instructor presents the correct pronunciation of words so you may learn to speak fluently as well as read and write. In addition to popular slang and conversation basics, we go over tips and tricks on the rules of cultural etiquette. This gives you a well-rounded and unique perspective on the usage of the language. The course is rounded off with a review section that goes over all the material taught, allowing you to revise the content as you go.</p><p>This course is designed for beginners, presented in-depth and easily understandable. Each topic builds on the previous one to allow you to master the Korean writing system and expand your knowledge of the language. Uni is a lively and engaging instructor who brings fun and authenticity to the lessons, keeping you interested throughout the course. If you want to upgrade your language skills, enrol now and start your journey to learn Korean today!</p><a href=\"https://alison.com/resume/courses/4476\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4476\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Korean for Beginners","description":"In this module, you will get an overview on how Hangul sentence structure is formed and how to write basic Korean words. Beginning with the consonants and vowels in the alphabet, you will continue to learn how to create syllables and simple words as you explore Korean language and vocabulary.","topics":["Korean for Beginners - Learning Outcomes.","Syllables, Consonants and Vowels","Consonant Sets","Combined Vowels and Last Consonants","Korean for Beginners - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Easy Korean for Beginners - Course Assessment"]}]}