{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4709","title":"Elementary English 207","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online English course explains how to use continuous tenses and provides useful vocabulary related to driving.","description":"This English course explains how to discuss driving and motoring in English. Using your newfound vocabulary, we describe the grammatical rules concerning the use of participles in the present and past continuous tense. We then introduce you to the past continuous tense and explain its forms and uses. Finally, we compare the past continuous and past simple tenses to give you the confidence you need to speak English.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Being capable of holding a conversation in English is a valuable skill you can use worldwide. This English course builds on your grammar and vocabulary skills and enhances your comprehension and understanding of this global language. It begins with an overview of vocabulary related to car parts before introducing you to everyday words about driving on the road.</p><p>The course then lays out some grammar rules and uses the new words you have learned to demonstrate how they work. We first review the present participle and its use in the present continuous tense. Present participles are verbs ending with '-ing,' and you use the present continuous tense to describe the events as they unfold. We then compare the past continuous to the past simple tense to discuss events that have already occurred.</p><p>Our final topic improves your reading, speaking, and writing skills. Videos help you refine your accent and pronunciation. We also provide a writing activity to let you practice what you have learned in the course's 'Resource' section. This course is an excellent place to start if you really want to learn English. Sign up to master continuous tenses and enrich your English skills while you use your new vocabulary to start chatting with confidence.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}