{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4758","title":"Elementary English 210","totalEnrolled":"2,840","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about English verbs and acquire vocabulary related to dreams and goals in this free online English course.","description":"This English course discusses life events, goals, and dreams. At first, we present you with some basic verbs, then review gerunds and introduce you to the verb's infinitive form. We use video and audio media to reinforce the vocabulary you encounter in the 'Practice' section. You will learn about describing goals and attempts you can make to accomplish them. Sign up to learn English and become fluent in this international language.","courseOutcomes":["Recall vocabulary used to describe m...","Recognize words to lay out future dr...","Identify infinitives and outline the...","Define a ‘gerund’ and explain when t...","Recall vocabulary used to describe major life events","Recognize words to lay out future dreams or ‘bucket-list’ scenarios","Identify infinitives and outline their form and use","Define a ‘gerund’ and explain when to use it","Compare gerunds and infinitives and know when to use the correct verbs for each in a sentence","Describe your dreams and goals for the future by reading text and speaking aloud","Outline future goals and dreams in a paragraph using correct punctuation and sentence structure","Recall vocabulary used to describe m...","Recognize words to lay out future dr...","Identify infinitives and outline the...","Define a ‘gerund’ and explain when t...","Recall vocabulary used to describe major life events","Recognize words to lay out future dreams or ‘bucket-list’ scenarios","Identify infinitives and outline their form and use","Define a ‘gerund’ and explain when to use it","Compare gerunds and infinitives and know when to use the correct verbs for each in a sentence","Describe your dreams and goals for the future by reading text and speaking aloud","Outline future goals and dreams in a paragraph using correct punctuation and sentence structure"],"courseDescription":"<p>Whether we want to go traveling or obtain a college degree, we all have goals and dreams that we want to reach. Some have to do with our careers or securing success in the workplace. Others are lifetime dreams on our ‘bucket list.’ This English course teaches you all the required vocabulary to discuss significant life events. Learning English is challenging, so Alison has put together English courses to help you achieve this goal.</p><p>After learning all these new words, you will explore important grammar points. We begin with an overview of the two types of verbs: action and stative. For example, you use action verbs for things people do and stative verbs to describe feelings, possessions, and thoughts. You will then learn to identify words with a gerund and verbs with an infinitive.</p><p>We have designed the final section of the course to recap all the vocabulary and grammar skills you have learned throughout the course. You will practice reading, listening, speaking, and writing skills using what you have discovered about gerunds and infinitives. Taking any of Alison’s English courses is ideal if you want to be proficient in this language. Learning English opens professional and personal doors, so start learning with us today.</p><a href=\"https://alison.com/resume/courses/4758\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4758\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Master Elementary English 210","description":"In this Module, learn vocabulary related to significant life events and personal goals, review present tense verbs, understand how to use gerunds, and learn the proper use of infinitive verbs.","topics":["Master Elementary English 210 - Learning Outcomes","Vocabulary: Life events and goals","Grammar: Stative Verbs","Grammar: Verbs with Gerunds and Infinitives","Student Practice: Goals, gerunds, and infinitives","Master Elementary English 210 - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Elementary English 210 - Course Assessment"]}]}