{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1313","title":"English Course - Narratives (Upper-Intermediate Level)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Tell compelling stories in English by learning more about narrative tenses and elements in this free online course.","description":"This upper-intermediate grammar level course teaches you how to construct different tenses and narrative verb forms to effectively tell stories. We examine the past tense form of verbs and compare them to their present and future forms. We study the role of collocations in English narratives and provide a guide that covers storytelling elements to help you construct your own narratives. Sign up to improve your ability to tell a story in English.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>What is a narrative? Narratives are stories that have a beginning, a middle and an end. This grammar course introduces you to useful English storytelling phrases, like ‘All of a sudden…' and ‘After that…'. We study the use of the past simple, past continuous, past perfect simple and past perfect continuous tenses to tell stories about the past while emphasizing key plot points.</p><p>The course then lays out the stages of narrative that can help you tell an effective story. We explain how to use continuous verb forms to emphasize an action that is repeated or has lasted a long time. We also establish how continuous verb forms are useful when talking about temporary situations and actions. The course then delves into the narrative value of collocations and idioms.</p><p>This upper-intermediate level English course provides a narrative guide that you can employ to create a compelling story. It also helps you understand why using the past simple, past perfect, and past continuous form of verbs can be useful in letting your plot unfold. This course improves your English storytelling skills, which is an ancient artform now driven worldwide by modern technology, so sign up to make yourself heard.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}