{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1865","title":"English for Tourism - Tourist Information and Guided Tours","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Enhance your English speaking skills and express yourself more confidently when guiding tours, with this free course.","description":"English is the main language of international communication and is essential for people working in the tourism industry. This course introduces the key English vocabulary needed when speaking to tourists. You will learn the necessary English skills for working in tourist information offices, including how to provide directions, understand guidebooks, and write press releases. You will also learn how to conduct guided tours, and more!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Tourist information offices are centres that provide information about tourist activities in their region. This course will discuss why tourist office employees' role in providing the most accurate information possible to tourists often requires them to be fluent in English. You will then learn how to use the present simple tense to refer to an action or event that takes place habitually or is semi-permanent. This skill with be very helpful when discussing itineraries with tourists.</p><p>Guided tours are generally divided into two categories: city tours and extended tours. City tours take place solely within a city and are one to six hours in length, while extended tours explore cities as well as the surrounding region and can be anywhere from one day to a few days. This course will teach you how to give specific directions and subtle directions when conducting tours. You will also study the superlative form of an English adjective and learn how to form passive sentences in English.</p><p>Guiding tours can be fun and engaging especially if you can communicate in English properly. Upon completion of this course, you will have learned how to deliver tour commentaries and give directions using different forms of English grammar. You will also have learned how to form the superlative of adjectives, speak in the passive voice, use the predictive future tense, and ask indirect questions in English. So, check out the course today and start enhancing your English skills in no time at all!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}