{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1304","title":"English Grammar - Future (Intermediate level)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use the correct English grammar to discuss the future with this free online English grammar course.","description":"This course teaches how to talk about the future in English. We often discuss our plans and it is crucial for English speakers to understand the proper use of the language’s future tense. The course uses examples, exercises and audio clips of native English speakers to help you refine your accent and pronunciation. English is an important global tongue so becoming more fluent can open doors for you in your personal and professional life.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course teaches you how to use the ‘present continuous for future’ tense to discuss events that have yet to unfold. We cover the use of the present simple tense to identify scheduled or fixed events in the future. You will learn how to combine 'going’ and ‘to' while laying out plans. We also teach you how to use ‘will’ when you ask, promise, agree or offer to do something.</p><p>The course then shows you how to use 'shall' instead of 'will' when you are offering a suggestion like, “Shall I make you a cup of coffee?” We explain when to use 'if' instead of 'when' to discuss potential future events (for example: “They may cancel the concert if it's raining.”). You will also learn to avoid 'will' when discussing future arrangements.</p><p>This intermediate-level course makes it much easier to use the correct grammar to talk about future events and plans in English. Learning how to form the correct future tense of verbs will make your speech flow and widen your conversational options. We employ examples, exercises and audio clips to help you polish your English and its accent to make you more confident as you master this global language.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}