{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1307","title":"English Grammar - Pronouns & Determiners (Intermediate level)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use English pronouns and determiners in this free online intermediate level English grammar course.","description":"This English grammar course explores the use of pronouns and determiners. If you are already studying English, you might know that pronouns can take the place of nouns to make sentences easier to read and can do everything that nouns can do. We study such pronouns (including reflexive pronouns) and explain their correct usage before delving into determiners like ‘the’ and ‘that’. This English speaking course helps you master the language.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This English grammar course introduces you to reflexive pronouns 'myself' and 'ourselves'. Sometimes reflexive pronouns are not strictly necessary and we explain how you can sometimes use other more elegant phrases to take their place. We also examine words like 'own' and 'self' to establish how they can be used in different ways but mean the same thing. We study 'there' and 'it' to illustrate how to combine them with modal verbs (like ‘will’ and ‘must’ in order to provide extra information.</p><p>The course then shows you how to use 'some' and 'any' to discuss quantity. We compare the use of 'some' for positives and 'any' for negatives. We then teach you how to properly combine 'without' and 'any' and examine the similarities between 'anybody', 'nobody' and 'anyone'. We wrap up by laying out the proper uses of 'somebody' and 'someone' and breaking down the differences between 'both', 'either' and 'neither'.</p><p>This intermediate level grammar course is designed to be easy to understand and follow. We can boost your confidence when speaking English and our audio recordings can help you refine your English accent, pronunciation and listening skills. Studying the different uses of determiners and pronouns in place of nouns will make your sentences sound more elegant. Sign up today to enhance your English grammar skills as you become more articulate in this global language.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}