{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1325","title":"English Grammar - Verbs (Intermediate level)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn about the different forms of English verbs and their proper use with this intermediate level English course.","description":"This free online English language course will teach you about the four basic parts of English Verbs. In this course you will learn everything you need to know about the use of auxiliary verbs, phrasal verbs, and the rules regarding the use of prepositions and verbs. Take this free online English grammar course today and improve your grasp English verbs with our clear, and easy to understand lessons and examples.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first introduce you to the basic form of an English verb, which is called the infinitive or base form. You will learn that regular verbs in their past simple form have '-ed' at the end, such as 'laugh - laughed', but irregular verbs change form, such as 'say - said'. You will also study how to use 'verbs + ing' as well as its correct verb form when verbs are followed by a preposition.<br><br>You will then study the correct pronunciation of verbs ending in 'ed' as well as the spelling rules for regular verbs. The course will also delve into the present simple, present continuous, past simple, and past continuous forms of the verb. You will also study the verbs that can be regular or irregular. Finally, you will learn how to use verbs correctly when used as questions as well as when used as phrasal verbs.<br><br>English verbs can come in many different forms, and this can often be confusing. This English grammar course will make everything much easier to understand. The easy-to-follow outline for intermediate-level students comes with interactive learning exercises that can be repeated over and over again, and the audio recordings included in every module will also help you to improve your English listening skills. So, check out the course today and start bringing your English to the next level.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}