{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1303","title":"English Grammar - Prepositions (Intermediate level)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to use the right prepositions in English sentences with this free online English grammar course.","description":"This free online English language course teaches about prepositions. Are you ever confused about which preposition to use in a sentence? Using English prepositions can be difficult for new learners. In this course, you will learn how to use prepositions correctly. The interactive learning content and audio recordings by native English speakers will also develop your English skills and get you used to the English accent.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this free online English grammar course, you will first learn how the prepositions 'in', 'at', and 'on' depend on the time you're talking about. You will learn to use 'at' for the time of day, 'on' for days and dates, and 'in' for longer periods of time. The course will also teach you to use 'in' to refer to positions and places, 'at' to refer to being close or beside a particular place, and 'on' to refer to being physically on top of something or doing something.<br><br>Next, you will learn to use 'in' to refer to positions and places and 'into' to indicate moving from one place to another place. You will study the use of the preposition 'by' to say how you do something, how you travel, and to say that something is done by somebody. Finally, you will learn that 'by' can also mean 'beside' or 'next' to something and that it can be used for indicating numerical calculations.<br><br>This Intermediate level English grammar course will make sure that you know your prepositions and eliminate guesswork moving forward. Its easy-to-understand outline, interactive learning content, and audio recordings by native speakers will also ensure that you enjoy the learning process. You will also develop your listening skills and make noticeable advancements in your personal and career goals. So, have a look at the course now and start learning your English prepositions today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}