{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1324","title":"English Grammar - Relative Clauses (Intermediate level)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Quickly improve your understanding of English relative clauses with this free online English course.","description":"This free online English language course will teach you about the relative clauses, which are basically non-essential parts of a sentence. They may add meaning to the sentence, but if removed, the sentence will still function grammatically. In this course, you will learn about the two main types of English relative clauses and how they help to better define nouns, as well as study several examples relative clauses in use.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course will first introduce you to relative clauses and how they are used to better define the noun that precedes them. You will learn that they start with relative pronouns such as 'who', 'whose', 'that', 'which', 'where', and 'when'. You will also learn that personal pronouns such as 'I', 'he', 'she', and 'it' are not used in relative clauses. The course will also teach you that prepositions in sentences and in relative clauses are attached to the verbs.<br><br>You will then look into the relative pronouns 'that' and 'what'. You will learn that both refer to things and that you use 'that' to refer to what is known, which is basically the noun, and 'what' to refer to what is not known. You will study how to use 'where', 'whom', 'that', and 'why' correctly. The course will also teach you that you should use 'whose' in relative clauses to provide information about what belongs to or relates to other people.<br><br>Relative clauses can help you express yourself more accurately, which is really important for personal and career advancement. If you can express exactly what you want to say, you can avoid confusion, make your conversations easier, and sound a lot more like a native English speaker. These are great rewards, so why wait? Check out this free online English course and start learning about relative clauses today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}