{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/3335","title":"German for Customer Service and Sales Positions","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to provide customer service and sales assistance in German in this free online language course.","description":"This free online course teaches you how to use German in the context of customer service and sales. We focus on vocabulary for use in real-life customer interactions to provide ecommerce customer service. By following the video lessons, you will master everything to do with sales in the German language - from product descriptions and online orders to customer delivery and the returns process.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Want to brush up on your German language skills and use them in the workplace? This free online course helps you to improve your speaking and comprehension skills in the fields of customer service and ecommerce sales. This course is perfect for those with a basic knowledge of German and presents easy-to-learn vocabulary and simple sentences at an intermediate level. Acquire new phrases and practice pronunciation for use in professional sales settings with this video-led course that gives insight into each stage of the sales process and offers a chance to take lessons in any order.</p><p>This course suits anyone beginning a sales assistant position that requires German and can help those who have transitioned to ecommerce. The course discusses four essential themes: the sales process, ordering online, the product and the delivery. What are the main steps of a sale? How do you tell a customer that their refund has been processed? Learn the answer to these questions and more in the German language. Watch the easy-to-follow videos accompanied by additional text and audio pronunciation guides to improve your skills.</p><p>We cover specialised vocabulary for the field of customer service and so this course benefits customer service advisors beginning a new job, sales assistants adapting to an ecommerce environment or even those wishing to improve their German as customers. Sign up today to improve your professional skills and become more comfortable with this rich, global language.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}