{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4338","title":"German for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches how to read and understand German within a few hours and covers vocabulary and grammar.","description":"German, one of the world's most influential languages, has millions of native speakers and learning this West Germanic language is not as tricky as you might think. This free online course will simplify the learning process to aid your understanding. We begin with the German alphabet and then move on to greeting expressions, manners and basic vocabulary such as colours, numbers, family members and so on. Sign up for this fun and engaging course.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The German language is a West Germanic language and the official language of six European countries that include economic, industrial and political powerhouses. Speaking this Germanic language is not as difficult as it may seem. This free online course aims to make it as easy as possible for you to be able to read, understand and write the language. To help you achieve this, we will begin with the German alphabet. You will learn how to pronounce each letter and be introduced to some forms of the letters, such as the umlaut vowels, es-tset (ß), sch, sp etc0, which makes the language special. Since greetings are the first thing you do when you meet someone, you will study how to greet people and introduce yourself. As you learn this vocabulary, you will know how to express yourself in a respectful and well-mannered fashion. Exercises in this section will help you practise as you go along.</p><p>Next, you will learn about numbers and why you must read the numbers from right to left, starting from thirteen. In German, you will also study colours and everyday objects, such as the table, chair, bag and so on, to help you form sentences using objects and colours. Next, discover the pronunciation of the most common drinks, food and animals so you can form sentences using these words. Then we will explain how to conjugate irregular and irregular verbs with pronouns. After that, we will teach you the days of the week and months in a year and express the date using sentences.</p><p>Furthermore, you will learn how to say the time in German. You will first study how to ask the time when you meet someone and then the ways to answer when someone asks for the time. Acquire knowledge on how to use common questions and pronouns like ‘who’, ‘what’, ‘when’ and so on. Learn about a family tree in German, practising how to list and form sentences using your family members from grandparents and relatives to great-grandchildren. You will also explore adjectives used to describe human emotions and feelings. How to conjugate these expressive vocabulary words will be highlighted. Lastly, you will cover the essential parts of the human body in German and discuss the plural and singular forms. Throughout this course, numerous exercises will help you understand and practise what you have learned so get started now and make German one of your spoken languages.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}