{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5038","title":"Intermediate English 309","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the passive voice, coordinating conjunctions and subordinating conjunctions in this free online English course.","description":"This course introduces you to vocabulary that will help you with conversations relating to mailing and deliveries. Discover how to use the passive voice when forming sentences. Learn to distinguish between the active voice and the passive voice. Understand when it is important to use 'by-phrases' in passive voice and when not to use them. Recall the use of coordinating conjunctions and discover how to use subordinating conjunctions. Enroll today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Today, more people are purchasing things online than ever before. We all like the convenience of having our items delivered to our homes, so we often use delivery services for various goods, from groceries to electronic gadgets. Consequently, we have designed this course to teach you the basic vocabulary to understand and discuss mailing and deliveries. We begin by exploring the vocabulary words relating to the postal service and the options available when you use a delivery service. You will also learn how to send packages to your friends and family.</p><p>After learning these new words, you will study two grammar sections. The first lesson will focus on the passive voice. Distinguish the difference between active and passive voices and understand how and why you use the passive voice. Discover how to form the passive voice's negative and interrogative forms and the simple present and simple past tenses for the passive voice. Understand why 'by-phrases' are important in passive voice sentences and when you can omit them. The second section will focus on conjunctions. Comprehend the use of coordinating conjunctions and their purpose. Discover the use of subordinating conjunctions in unifying dependent and independent clauses to express reason, condition, and contrast.</p><p>We have designed the final section to help you integrate and practice your new grammar and vocabulary skills. You will practice reading, listening, speaking, and writing skills using what you have discovered about mailing, deliveries, the passive voice, and coordinating and subordinating conjunctions. Let this course help you discuss topics relating to shipping and deliveries. Continue to master your written and spoken English by adding the passive voice to your skill set. Start this course today and further your English proficiency with this Alison's English course.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}