{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4965","title":"Intermediate English 306","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master phrasal verbs, the perfect present continuous tense and vocabulary related to dating in this free online course.","description":"This course introduces you to vocabulary related to dating, used to discuss your relationships. In the grammar section, master how to form phrasal verbs correctly and discover how to use the present perfect continuous tense. We will explore how to use reflexive and reciprocal pronouns and teach you the difference between the present perfect and present perfect continuous tense when talking about continuous actions. Enroll today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Forming relationships with other people is a part of our very nature as human beings. While every culture has its customs, rules, and traditions when it comes to forming relationships, we all have the ability to connect with other people. Thus, we designed this course to teach you the basic vocabulary to understand and discuss relationships and dating. You will start by learning different verbs to help you converse about dating and pursuing romantic relationships. You will then learn how to identify different types of relationships to explain the kinds of relationships you are in. <br><br>After learning these new words, you will study two grammar sections. The first section will focus on forming phrasal verbs in the present, past, and future tenses. You will then understand the difference between transitive and intransitive phrasal verbs and identify the difference between separable and inseparable phrasal verbs. In addition, you will learn how to form questions with phrasal verbs using a variety of tenses. We will introduce you to reflective and reciprocal pronouns, and you will learn how to differentiate between them. The second grammar section will focus on the present perfect continuous tense. You will explore how continuous and recent actions have results in the present, and then learn to identify the difference between the present perfect and the present perfect continuous tenses to indicate continuous actions. <br><br>This course's final section has been designed to help you integrate and develop your new grammar and vocabulary skills. You will practice reading, listening, speaking, and writing using what you have discovered about dating, relationships, phrasal verbs, and the present perfect continuous tense. Start this course today to further your English proficiency, help you discuss your dating and relationship experiences, and communicate your views with others!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}