{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4898","title":"Intermediate English 303","totalEnrolled":"6,609","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Acquire vocabulary relating to holidays and learn past simple and past continuous tenses in this free online course.","description":"This English course introduces you to vocabulary relating to holidays and celebrations. Learn to talk about your vacation traditions. Discover how to form questions in the simple past and past continuous tenses and how to answer these questions correctly. When forming questions, understand when to use 'which' or 'what.' Know the difference between the words 'who's' and 'whose' and use them correctly. Enrol and start learning today!","courseOutcomes":["List vocabulary relating to holidays...","Describe different holidays celebrat...","Distinguish between past simple tens...","Recall wh- questions and when to use...","List vocabulary relating to holidays and celebrations around the world","Describe different holidays celebrated in different cultures","Distinguish between past simple tense and past continuous tense","Recall wh- questions and when to use them","Indicate how and when to use 'which' and 'whose' in a conversation","Explain the difference between 'whose' and 'who’s'","Identify when a sentence is in the past continuous tense","Recognize when to use the past simple with past continuous tenses for interrupting actions","List vocabulary relating to holidays...","Describe different holidays celebrat...","Distinguish between past simple tens...","Recall wh- questions and when to use...","List vocabulary relating to holidays and celebrations around the world","Describe different holidays celebrated in different cultures","Distinguish between past simple tense and past continuous tense","Recall wh- questions and when to use them","Indicate how and when to use 'which' and 'whose' in a conversation","Explain the difference between 'whose' and 'who’s'","Identify when a sentence is in the past continuous tense","Recognize when to use the past simple with past continuous tenses for interrupting actions"],"courseDescription":"<p>Every country and culture worldwide has unique holidays and celebrations that are special and significant to them. It is, therefore, important to understand the basic vocabulary associated with each culture's holidays so people can communicate and connect globally. In this course, you will learn about some of the most common holidays people celebrate around the world. Master essential vocabulary related to celebrations in general, talk about your traditions and holidays and learn how to explain to others how you celebrate holiday breaks with your family.</p><p>After learning about holidays and celebrations, you will encounter two grammar sections. The first will focus on the past simple tense and forming questions in the past simple tense. Understand when to use the auxiliary verb 'did' and when to use the verbs 'was' or 'were' when forming questions. Master wh-words to create questions about the past and understand the difference between the words 'what,' 'which,' 'who's,' and 'whose.' The second grammar lesson will focus on the past continuous tense. Master using the past continuous to form sentences for actions that occur at a specific time, during a period of time, for repeated actions, for interrupted actions, or two continuous actions happening simultaneously.</p><p>The course's final section is designed to help you integrate the new grammar skills you have learned. You will practice your reading, listening, speaking and writing skills using what you have discovered about holidays, celebrations, and past simple and past continuous tenses. Let this course help you talk about your traditions and how you have celebrated holidays with your family and friends. Explain to others what your favorite holiday traditions are, ask questions about other people's traditions and connect with people of different cultures. Start this course and continue your path to English proficiency with Alison's courses.</p><a href=\"https://alison.com/resume/courses/4898\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4898\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Mastering Intermediate English 303","description":"This module will teach you about holidays worldwide and how people celebrate these holidays. You will learn the essential vocabulary surrounding this topic, and then we will guide you on applying this new vocabulary to the past simple and past continuous tenses.","topics":["Master Intermediate English 303 - Learning Outcomes","Vocabulary: Holidays Around the World","Grammar 1: Past Simple","Grammar 2: Past Continuous","Student Practice: Past Simple and Past Continuous","Master Intermediate English 303 - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Intermediate English 303 - Course Assessment"]}]}