{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4613","title":"Intermediate German 202","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Study the gender of nouns and the basic structure of German sentences in this intermediate-level free online course.","description":"Language learning experts propose that mastering the sentence structure is a brilliant way to attain fluency in any language, including German. This free online course will dissect the anatomy of the main sentence, side sentence, prefixes, and noun genders used in German. You will also learn to ask meaningful questions and clearly explain situations. By taking this course, you will become a more confident speaker of German. Enrol now.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>A sentence structure describes how the essential elements of a particular sentence are put together in a grammatical context. In this course, you will explore the main sentence structure of German. We will teach you how to identify the side sentence structure and form a regular sentence by considering the components and arrangements used in the German lexicon. We examine how to emphasize a piece of information, the methods for creating a question sentence and the options for saying “no” in German. We will show you situations for placing a comma, including the enumeration of numbers, explanatory addition, literal speech, and the use of German conjunctions. This course is an intermediate-level course. If you recently only started learning German, we recommend you check out our Beginner German series before taking this one.</p><p>This course will outline why you should adopt the KISS (Keep It Simple and Short) concept in your approach to learning German to help you naturally master the language like a native speaker. Did you know that there is a notion called sweetening of words in German? The Oxford dictionary defines sweeten as “make more agreeable or acceptable.” Following this definition, we describe sweetening as the concept of making words and expressions more pleasing to the ear by using diminutives. In this vein, we will throw more light on the German diminutive. With this, you will be able to develop your vocabulary beyond that of a beginner. You will also learn about Partizip I and how to enunciate expressions that adopt this sentence structure.</p><p>Finally, we will explore the most significant homonyms of the German language, including the four categories of homonyms, with practicable examples. We explain word capitalization, and we present the art of word combination, such as the two methods for achieving the linking of words. Then, discover the five most critical uses of the term “noch” and how it changes the meaning of a German expression. Finally, we highlight why you must always think from the perspective of the second speaker in communicating. What is the sentence structure of Partizip I? Is there a universal rule to determine the noun genders in German? By completing this course, you will discover the answers to all these questions and develop your cognitive reasoning capacity to improve your mastery of this language. Signup today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}