{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4612","title":"Intermediate German 201","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to express your feelings, wishes and desires fluently in this intermediate-level free online German course.","description":"Learning German words is easy. Making compound sentences and holding conversations where you freely express your feelings is more demanding. This intermediate-level German course aims to help you express yourself more confidently. You will learn German expressions of non-reality and potential reality and study their pronunciations. You will also study the intricate features of German sentence structure and verb hierarchy. Enrol today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Would you like to increase your knowledge of the German language so that you can make complex sentences and have lengthy conversations to express your feelings and motives? If your answer is ‘yes’, join us on this German mastery voyage. We will teach you about the Konjunktiv, also known as the ‘if-clauses’ of potential reality in German. We will study the classification systems of the Konjunktiv, including the subclasses and the most common form of the verbs. In addition, we examine the Verbstamm and how it can be adopted for verb formation in the German language. We highlight the difference between Konjunktiv I and Konjunktiv II in sentence structure. Discern how to make a reported speech with other people’s information claims. This course is an intermediate-level course. If you only started learning German recently, check out our ‘German Language for Beginners’ courses before taking this one.</p><p>The course will show you how to express your fantasies, dreams and wishes in German. We will consider the ‘Alle Zeiten’, also known as ‘All Times’ in English and the ‘reguläre Verben’ and ‘irreguläre Verben’ that describe them. We outline the verbs used exclusively in the past I form (Präteritum) and the verbs used in the past II form (Partizip II). Similarly, you will examine the Plusquamperfekt and its relationship with the Präteritum and Perfekt forms of German verbs. We discuss the future tense, including the relationship between the two subtypes of the Futur and time limit (Zeit limit) used in the language. We then reveal the four dimensions of time and the priority lists of the verbs used in the sentence structure. You will consider the definite and indefinite articles that specify the gender of nouns and explore the German ‘Personalpronomen’, known as ‘personal pronouns’ in English.</p><p>One of the best ways to overcome failure in learning a new language is to think of your responses in the language you are learning. Research in psychology from the University of Chicago has proven that thinking in a target language will help you improve your skills in that language and learn it faster. If you wish to communicate fluently in German, you must begin to think in it. After mastering this reliable learning strategy, you will see significant increases in your speed of acquisition. Another practical approach to language learning is active speaking and listening in realistic everyday situations. Improving your listening abilities will thus have a significant impact on your capacity to learn this language. Create lasting connections, enhance your travel experiences and give yourself a competitive advantage in the employment market by learning German. Do not delay; start this course today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}