{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4851","title":"Intermediate English 302","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master computer vocabulary and comparative and superlative adjectives and adverbs in this free online English course.","description":"This English course introduces you to basic computer vocabulary to help you identify different parts and functions so you sound proficient. You will also learn how to form 'adverbs of manner' from adjectives and understand what makes an adverb different from an adjective. You will review comparative and superlative adjectives and understand how to form comparative and superlative adverbs. Start this course and begin learning today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Computers form a key part of our everyday lives. We use computers for work, entertainment, personal projects, and learning. You are probably on a computer right now thinking about taking this course. This course is designed to teach you the English words needed to name computer parts and functions you encounter daily. We understand that learning English is important to you, so Alison has put together a set of courses to help you achieve your language goals.</p><p>After learning about computer parts and standard computer functions, you will encounter two grammar topics. The first section will focus on 'adverbs of manner.' These adverbs modify verbs or describe the 'how' of a verb. Understand how these adverbs are formed and where to place them in a sentence. For example, did you know that words such as 'fast' and 'late' can be adjectives and adverbs? Learn how to identify when these words are adjectives and when they are adverbs. The second grammar lesson will focus on comparatives and superlatives. You will review adjectives, learn to make comparisons between objects that are alike, and then master forming comparative and superlative adverbs.</p><p>The course's final section helps you practice your new grammar skills. There are exercises in reading, listening, speaking, and writing to improve your skills using what you have discovered about computer parts, computer functions, 'adverbs of manner,' comparative and superlative adjectives, and comparative and superlative adverbs. Let Alison's courses help you become fluent in everyday conversations about computers and technology. Know how to identify computer parts when talking to a computer technician about your technical problems and how to discuss basic computer functions. Let our English courses help you become a proficient English speaker.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}