{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/1881","title":"Introduction to Conversational English","totalEnrolled":"68,712","courseIncludes":["1.5-3 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to have an English conversation and gain confidence in speaking English with this free online course.","description":"This free online conversational English introduction course teaches you what to say when you meet people for the first time, and vocabulary required to make friends. Having conversations is a vital part of the process of learning English. Especially if you are in new country, or learning new language, the conversation is the way to improve day-to-day routine. This course will give you the confidence you need the next time you want to say hello.","courseOutcomes":["Recognise the basics of conversation...","Examine the English alphabet...","Learn the correct ways to greet peop...","Identify the context in which certai...","Recognise the basics of conversational English","Examine the English alphabet","Learn the correct ways to greet people in English","Identify the context in which certain verbs are used","Recognise the basics of conversation...","Examine the English alphabet...","Learn the correct ways to greet peop...","Identify the context in which certai...","Recognise the basics of conversational English","Examine the English alphabet","Learn the correct ways to greet people in English","Identify the context in which certain verbs are used"],"courseDescription":"<p>Through conversation, you can make friends, improve your English language skills, and learn about your new home. But this can be difficult sometimes. Saying hello in a different language is a little scary. Especially if you are new in a country, just talking to somebody is not very easy. This free course is designed to give you confidence the next time you want to say hello and have a conversation in English.</p><p>This course guides you through the basics of conversational English speakers. It teaches you what to say when you meet people for the first time and vocabulary for making new friends. You will practice simple conversational techniques that will give you confidence when meeting and greeting people in English. You will then learn basic verbs and adjectives. Finally, you will be introduced to open questions, which are a valuable part of any English conversation.</p><p>Sometimes language can be difficult, and being in a new country can be scary. This is completely normal. Once you learn the basics of the language, everything becomes much easier. The conversation is a wonderful thing, and this course will make sure that you have more of it. So why wait? Start using this free course today, and in two hours you will be so much closer to having your next English conversation.</p><a href=\"https://alison.com/resume/courses/1881\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/1881\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Meeting People","description":"Learn in this module about how to properly pronounce the letters of the English alphabet, greet people , use pronouns and \"To be\"","topics":["Meeting People - Learning Outcomes","A To Z","Greetings","Meeting People","Pronouns And 'To Be'","People Profiles","Meeting People - Lesson Summary"]},{"name":"Module","details":"Verbs And Questions","description":"","topics":["Verbs And Questions - Learning Outcomes","Basic Verbs","I'm Adjective","Open Questions","Present Simple Questions","Verbs And Questions - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Introduction to Conversational English - Course Assessment"]}]}